{
  "@type": "NewsArticle",
  "identifier": "2022--07--18--en--myfeed--HackerNews--NewsArticle--32138437",
  "url": "https://news.ycombinator.com/item?id=32138437",
  "headline": "Banned from Google AdSense – 70k gone, no explanation",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm working on a start-up that lets people create and talk to chat-bots (https://chai.ml/). It's pretty expensive to host so we decided to run ads using Google AdMob starting in early June to cover some of our costs.<p>On the 7th of July, we got an email saying &quot;detected invalid traffic or activity on your account.&quot; That same day we submitted an appeal and worked transitioning to a new ad partner.<p>We spoke to our contact at Google Ads who told us 'Trust &amp; Safety is bound not to give any specifics out as far as policy infringement, but I'm hoping to get some sort of feedback. All I have read is &quot;account abuse.&quot;' they have since stopped replying to us.<p>On the 13th of July we got an email stating &quot;after taking into consideration the information that you have provided, we have confirmed that we are unable to reinstate your publisher account. Please note that your account will not receive further payments.&quot;<p>We've been limited in the past but it's always been resolved in under a week with no feedback on how we should fix any issues.<p>We were serving ads to our users for over a month and relying on that $70,000 that we expected to get paid (~50k for June and ~20k for July)\nFor that to be taken away from us with no transparency is extremely frustrating (the only thing Google have told us is that we had &quot;invalid traffic&quot;).<p>Does anyone know if there's anything else we can do to solve this issue?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "naturalauction",
    "url": "https://news.ycombinator.com/user?id=naturalauction"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32138437",
  "sameAs": "https://news.ycombinator.com/item?id=32138437",
  "dateCreated": "2022-07-18T14:31:44.145Z",
  "datePublished": "2022-07-18T13:59:55.000Z",
  "dateModified": "2022-07-18T14:31:44.145Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ]
}