{
  "@type": "NewsArticle",
  "identifier": "2022--03--25--en--showhn--HackerNews--NewsArticle--30801825",
  "url": "https://news.ycombinator.com/item?id=30801825",
  "headline": "Show HN: A multiplayer game to discover NFT artists, built with WebAssembly",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi everyone!<p>I'm one of the developers behind this project. I wrote it with my two brothers, Daniel and Ricardo.<p>For years the three of us have been curious about how multiplayer games work, which is why we decided to work on this project.<p>Our goal was to gain a deep understanding of how different players can share the same 3D space, which is why we wrote our own tiny game engine instead of using something like Unity.<p>We wrote the engine using C++ and OpenGL, and we then compiled it to WebAssembly using Emscripten so that it would run effortlessly on web browsers. We are really excited about the possibilities that are opening up thanks to WebAssembly.<p>Throughout this project we faced some massive technical challenges, like for example:<p>- We had to implement a collision detection and response algorithm so that players could collide with objects in the world.<p>- We had to implement an animation system that's capable of loading animated characters from glTF files, and that can play animations and fade between them.<p>- We had to implement a system that downloads images in worker threads, and that uploads them to the GPU in small chunks so that the game runs smoothly while paintings are being loaded.<p>- We had to implement techniques like client side prediction, server reconciliation and entity interpolation so that players look smooth when they are moving in the 3D space.<p>It was a great learning experience. If you have any technical questions, the three of us would be happy to answer them.<p>On the product side, our hope is that this project can make the experience of discovering NFT artists more fun and social. We think that scrolling through endless pages of NFTs is mindless and boring. We hope that in the museum people will look at digital art for more than a glance, and that they will discuss it with others.<p>We are constantly improving the museum to make it more fun, and we are also building some awesome tools for artists and collectors to showcase their work in new ways. If you would like to keep up with our progress, you can leave your email here: <a href=\"https://www.getrevue.co/profile/moonlightmuseum\" rel=\"nofollow\">https://www.getrevue.co/profile/moonlightmuseum</a><p>Thanks for your time!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "diegomacario",
    "url": "https://news.ycombinator.com/user?id=diegomacario"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30801825",
  "sameAs": "https://play.moonlightmuseum.io",
  "dateCreated": "2022-03-25T13:24:37.660Z",
  "datePublished": "2022-03-25T13:22:54.000Z",
  "dateModified": "2022-03-25T13:24:37.660Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 一个发现NFT艺术家的多人游戏，用WebAssembly构建",
  "headline_zh-Hant": "Show HN: 一個發現NFT藝術家的多人遊戲，用WebAssembly構建",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好！<p>我是这个项目背后的开发者之一。<p>我们三个人多年来一直对多人游戏的工作方式感到好奇，这也是我们决定参与这个项目的原因。<p>我们的目标是深入了解不同的玩家如何共享同一个3D空间，这就是为什么我们编写了自己的小型游戏引擎，而不是使用像Unity这样的东西。<p>我们使用C++和OpenGL编写引擎，然后使用Emscripten将其编译为WebAssembly，这样就可以毫不费力地在网页浏览器上运行。<p>在整个项目中，我们面临着一些巨大的技术挑战，例如：<p>- 我们必须实现一个碰撞检测和响应算法，以便玩家能够与世界上的物体发生碰撞。<p>- 我们必须实现一个动画系统，能够从glTF文件中加载动画人物，并且能够播放动画并在它们之间淡出。 <p>- 我们必须实现一个系统，在工人线程中下载图像，并将其分块上传到GPU，以便游戏在加载绘画时能够顺利运行。<p>- 我们必须实现客户端预测、服务器调节和实体插值等技术，以便玩家在3D空间中移动时看起来很流畅。如果你有任何技术问题，我们三个人很乐意回答。<p>在产品方面，我们希望这个项目可以使发现NFT艺术家的经验更加有趣和社交。我们认为，滚动浏览无尽的NFT页面是无意识的和无聊的。我们希望在博物馆里，人们看数字艺术的时候不会只看一眼，他们会和其他人讨论。<p>我们正在不断改进博物馆，使其更加有趣，我们也在为艺术家和收藏家建立一些很棒的工具，以新的方式展示他们的作品。如果你想了解我们的进展，你可以在这里留下你的电子邮件。<a href=\"https://www.getrevue.co/profile/moonlightmuseum\" rel=\"nofollow\">https://www.getrevue.co/profile/moonlightmuseum</a><p>感谢您的时间!",
  "description_zh-Hant": "大家好！<p>我是這個項目背後的開發者之一。<p>我們三個人多年來一直對多人遊戲的工作方式感到好奇，這也是我們決定參與這個項目的原因。<p>我們的目標是深入瞭解不同的玩家如何共享同一個3D空間，這就是為什麼我們編寫了自己的小型遊戲引擎，而不是使用像Unity這樣的東西。<p>我們使用C++和OpenGL編寫引擎，然後使用Emscripten將其編譯為WebAssembly，這樣就可以毫不費力地在網頁瀏覽器上運行。<p>在整個項目中，我們面臨著一些巨大的技術挑戰，例如：<p>- 我們必須實現一個碰撞檢測和響應算法，以便玩家能夠與世界上的物體發生碰撞。<p>- 我們必須實現一個動畫系統，能夠從glTF文件中加載動畫人物，並且能夠播放動畫並在它們之間淡出。 <p>- 我們必須實現一個系統，在工人線程中下載圖像，並將其分塊上傳到GPU，以便遊戲在加載繪畫時能夠順利運行。<p>- 我們必須實現客戶端預測、服務器調節和實體插值等技術，以便玩家在3D空間中移動時看起來很流暢。如果你有任何技術問題，我們三個人很樂意回答。<p>在產品方面，我們希望這個項目可以使發現NFT藝術家的經驗更加有趣和社交。我們認為，滾動瀏覽無盡的NFT頁面是無意識的和無聊的。我們希望在博物館裡，人們看數字藝術的時候不會只看一眼，他們會和其他人討論。<p>我們正在不斷改進博物館，使其更加有趣，我們也在為藝術家和收藏家建立一些很棒的工具，以新的方式展示他們的作品。如果你想了解我們的進展，你可以在這裡留下你的電子郵件。<a href=\"https://www.getrevue.co/profile/moonlightmuseum\" rel=\"nofollow\">https://www.getrevue.co/profile/moonlightmuseum</a><p>感謝您的時間!"
}