{
  "@type": "NewsArticle",
  "identifier": "2022--04--10--en--showhn--HackerNews--NewsArticle--30981995",
  "url": "https://news.ycombinator.com/item?id=30981995",
  "headline": "Show HN: Caloree for iOS First Beta",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi all ,<p>around a year ago after becoming frustrated with existing calorie counter/diet tracking apps mostly due to the fact that you have to pay a monthly subscription fee. It seems like these days everything is subscription-based. Another annoyance was that some apps didn't respect my privacy and/or forced me into becoming a part of their own social network.<p>Hence, today I am happy to announce that I am releasing a first, early beta version of Caloree.<p>What is Caloree?<p>Caloree is a simple calorie tracker that respects your privacy and does not try to sell you a subscription. Instead, once we launch Caloree, we will offer 2 tiers of one-time in-app purchases:<p>* Pro: you will get access to hundreds of thousands of products, be able to scan the barcodes of these products\n* Ultra: you gain the ability to plan several days in advance and in the future you will get nifty features, such as image recognition, Apple Watch support, Widgets, etc.<p>What to expect of the beta?<p>As mentioned, this is an early build, so there will be rough spots here and there. I am also working on additional features as I am writing this. The product catalog is still quite raw, currently lacking basic foods such as eggs and milk, which will follow in later beta versions. The weight screen still needs some love and also data entry could be better.<p>Participating<p>If you would like to try out Caloree on your iPhone or know some friends who would like to try it out, feel free to install it: https://testflight.apple.com/join/65dEEqFM.<p>I'll be scanning this post for any comments or feedback that you might give. If you would like to participate more actively you can also join my Discord server (https://discord.gg/h4XCmkPq) where I'll try to be available at least once a day to discuss feature requests, learn about any issues that you found or anything else that could be useful regarding Caloree.<p>I hope you like this early release of Caloree. Happy testing! \nRudy",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "mactunes",
    "url": "https://news.ycombinator.com/user?id=mactunes"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30981995",
  "sameAs": "https://news.ycombinator.com/item?id=30981995",
  "dateCreated": "2022-04-10T21:50:14.050Z",
  "datePublished": "2022-04-10T21:40:45.000Z",
  "dateModified": "2022-04-10T21:50:14.050Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: iOS版Caloree首次测试",
  "headline_zh-Hant": "Show HN: iOS版Caloree首次測試",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>大约一年前，在对现有的卡路里计数器/饮食追踪应用程序感到沮丧之后，主要是因为你必须支付每月的订阅费用。似乎这些天所有的东西都是基于订阅的。另一个烦恼是，一些应用程序不尊重我的隐私和/或强迫我成为他们自己的社交网络的一部分。<p>因此，今天我很高兴地宣布，我将发布Caloree的第一个早期测试版本。<p>什么是Caloree？<p>Caloree是一个简单的卡路里跟踪器，尊重你的隐私，不会试图向你推销订阅。相反，一旦我们推出Caloree，我们将提供2个层次的一次性应用内购买：<p>*专业版：您将获得数十万种产品的访问权，能够扫描这些产品的条形码。\n* 超级：你将获得提前数天计划的能力，未来你将获得一些有趣的功能，如图像识别、Apple Watch支持、Widgets等。<p>对测试版有何期待？<p>如前所述，这是一个早期构建，所以这里和那里会有粗糙的地方。在我写这篇文章时，我也正在开发其他功能。产品目录仍然相当原始，目前缺少鸡蛋和牛奶等基本食品，这将在以后的测试版中出现。体重屏幕仍然需要一些爱，而且数据输入也可以做得更好。<p>参与<p>如果你想在你的iPhone上试用Caloree，或者认识一些想试用它的朋友，请随时安装：https://testflight.apple.com/join/65dEEqFM。<p>我将扫描这个帖子，了解你可能提出的任何意见或反馈。如果你想更积极地参与，你也可以加入我的Discord服务器（https://discord.gg/h4XCmkPq），在那里我将尝试每天至少一次讨论功能请求，了解你发现的任何问题或任何其他关于Caloree的有用信息。<p>我希望你喜欢这个Caloree的早期版本。测试愉快! \n鲁迪",
  "description_zh-Hant": "大家好，<p>大約一年前，在對現有的卡路里計數器/飲食追蹤應用程序感到沮喪之後，主要是因為你必須支付每月的訂閱費用。似乎這些天所有的東西都是基於訂閱的。另一個煩惱是，一些應用程序不尊重我的隱私和/或強迫我成為他們自己的社交網絡的一部分。<p>因此，今天我很高興地宣佈，我將發佈Caloree的第一個早期測試版本。<p>什麼是Caloree？<p>Caloree是一個簡單的卡路里跟蹤器，尊重你的隱私，不會試圖向你推銷訂閱。相反，一旦我們推出Caloree，我們將提供2個層次的一次性應用內購買：<p>*專業版：您將獲得數十萬種產品的訪問權，能夠掃描這些產品的條形碼。\n* 超級：你將獲得提前數天計劃的能力，未來你將獲得一些有趣的功能，如圖像識別、Apple Watch支持、Widgets等。<p>對測試版有何期待？<p>如前所述，這是一個早期構建，所以這裡和那裡會有粗糙的地方。在我寫這篇文章時，我也正在開發其他功能。產品目錄仍然相當原始，目前缺少雞蛋和牛奶等基本食品，這將在以後的測試版中出現。體重屏幕仍然需要一些愛，而且數據輸入也可以做得更好。<p>參與<p>如果你想在你的iPhone上試用Caloree，或者認識一些想試用它的朋友，請隨時安裝：https://testflight.apple.com/join/65dEEqFM。<p>我將掃描這個帖子，瞭解你可能提出的任何意見或反饋。如果你想更積極地參與，你也可以加入我的Discord服務器（https://discord.gg/h4XCmkPq），在那裡我將嘗試每天至少一次討論功能請求，瞭解你發現的任何問題或任何其他關於Caloree的有用信息。<p>我希望你喜歡這個Caloree的早期版本。測試愉快! \n魯迪"
}