{
  "@type": "NewsArticle",
  "identifier": "2022--03--10--en--showhn--HackerNews--NewsArticle--30614646",
  "url": "https://news.ycombinator.com/item?id=30614646",
  "headline": "TimeCheck compares availability to find times when everyone is free",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Finding a time to get together can turn into a flood of texts back and forth as people throw out times and shoot them down over and over again.<p>Frustrated by this, I started TimeCheck as a side project with the goal of making it easier to find a time to gather for drinks, a meeting, or to play games/sports/music.<p>TimeCheck takes a snapshot of each person's availability for the selected dates, compares them, then presents the date/times when all are free.<p>Everyone in the group can vote on a preferred time from the results and the person that created the TimeCheck confirms the final time.<p>Then you one-tap add the confirmed time to your iCal.<p>All via one app bubble inside an iMessage chat.<p>In the future I'd like to expand the scope so that TimeCheck works for iOS and Android users in the same chat, and make a WhatsApp version. The app already supports timezones but it only works for iCal right now.<p>TimeCheck is available for beta testing via Testflight.<p>If you would like to try it out please visit: https://timecheck.us<p>Feedback from early adopters will shape the next iteration so if this could possibly be useful to you please give it a try and let me know what I can do to make it better for your use case!<p>If you have comments on the merits of the idea, your pain points when scheduling, the landing page, experience with other scheduling apps... please share them here. Thank you!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "alicewinthrop",
    "url": "https://news.ycombinator.com/user?id=alicewinthrop"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30614646",
  "sameAs": "https://news.ycombinator.com/item?id=30614646",
  "dateCreated": "2022-03-10T09:09:35.107Z",
  "datePublished": "2022-03-09T14:21:21.000Z",
  "dateModified": "2022-03-10T09:09:35.107Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en"
    }
  ]
}