{
  "@type": "NewsArticle",
  "identifier": "2022--03--03--en--showhn--HackerNews--NewsArticle--30542364",
  "url": "https://news.ycombinator.com/item?id=30542364",
  "headline": "Show HN: NeuralRad Multi BrainMets SRS Platform",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "With improvement of 5-year survival rate with cancer patients, we have seen more and more patients with developed multiple Brain Metastasis (BMs). In the past, for patients with more than 3 or 5 BMs, the limited treatment methods such as surgery/Chemotherapy could only improve treatment outcome to a certain degree and a huge portion of the patients cannot take these operations. The whole brain radiotherapy is a once-in-a-lifetime treatment due to the accumulated radiation dose on health issue. In recent years, Stereotactic Radiosurgery (SRS) becomes a popular alternative to other treatment options for these patient population. However the huge amount of multiple BMs (we have seen patients w/ more than 100 BMs in certain cases) requires time-consuming tasks for physicians to manual delineation and labeling of these brain mets, manual treatment session splitting and manual image follow-up and dose tracking after radiation treatment. So we have built a platform to automate and streamline the whole workflow. And this platform has already been undergoing NIH clinical trial phase I/II with our collaborating clinics.<p>Our company (NeuralRad LLC, NIH/NCI SBIR awardee) has been chosen by the NIH to attend the I-Corp Business Development program. During this process, we are required to perform market research by talking to potential customers (e.g. medical physicists, radiologists and oncology doctors) and decision makers (e.g. division director, administrators) to establish requirements and get feedback on our product (Multiple BrainMets SRS Management Platform). This program will start on March 1st.<p>Would you mind using our meeting invitation link:<p>https://calendly.com/hao-jiang-1/nih-i-corp-customer-discovery-interview?month=2022-03<p>to schedule a time slot at your convenience? I'm looking forward to talking with you. Also if interested, we could arrange a separate product demo to give your team a more detailed introduction on our NeuralRad multiple BrainMets platform.<p>Hao Jiang<p>CEO<p>NeuralRad LLC",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "coolwulf",
    "url": "https://news.ycombinator.com/user?id=coolwulf"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30542364",
  "sameAs": "https://news.ycombinator.com/item?id=30542364",
  "dateCreated": "2022-03-03T15:45:40.594Z",
  "datePublished": "2022-03-03T15:39:26.000Z",
  "dateModified": "2022-03-03T15:45:40.594Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: NeuralRad Multi BrainMets SRS平台",
  "headline_zh-Hant": "Show HN: NeuralRad Multi BrainMets SRS平臺",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "随着癌症患者5年生存率的提高，我们看到越来越多的患者出现多发性脑转移（BMs）。过去，对于超过3或5个脑转移瘤的患者，有限的治疗方法，如手术/化疗，只能在一定程度上改善治疗效果，有很大一部分患者无法接受这些手术。由于全脑放疗对健康的影响，全脑放疗是一生一次的治疗。近年来，立体定向放射外科（SRS）成为这些患者群体的一种流行的替代治疗方案。然而，大量的多发性骨髓瘤（在某些情况下，我们见过超过100个骨髓瘤的患者）需要医生手动划定和标记这些脑转移瘤，手动分割治疗疗程，手动图像跟踪和放射治疗后的剂量跟踪。因此，我们已经建立了一个平台来自动化和简化整个工作流程。我们的公司（NeuralRad LLC, NIH/NCI SBIR获奖者）已被NIH选中，参加I-Corp商业发展项目。在这个过程中，我们需要通过与潜在客户（如医学物理学家、放射科医生和肿瘤科医生）和决策者（如部门主任、行政人员）交谈进行市场调查，以确定要求并获得对我们产品（Multiple BrainMets SRS管理平台）的反馈。这项计划将于3月1日开始。<p>您是否介意使用我们的会议邀请链接：<p>https://calendly.com/hao-jiang-1/nih-i-corp-customer-discovery-interview?month=2022-03<p>在您方便的时候安排一个时间段？我期待着与您交谈。另外，如果有兴趣，我们可以安排一个单独的产品演示，让您的团队更详细地了解我们的NeuralRad多重脑图平台。<p>蒋浩<p>CEO<p>NeuralRad LLC",
  "description_zh-Hant": "隨著癌症患者5年生存率的提高，我們看到越來越多的患者出現多發性腦轉移（BMs）。過去，對於超過3或5個腦轉移瘤的患者，有限的治療方法，如手術/化療，只能在一定程度上改善治療效果，有很大一部分患者無法接受這些手術。由於全腦放療對健康的影響，全腦放療是一生一次的治療。近年來，立體定向放射外科（SRS）成為這些患者群體的一種流行的替代治療方案。然而，大量的多發性骨髓瘤（在某些情況下，我們見過超過100個骨髓瘤的患者）需要醫生手動劃定和標記這些腦轉移瘤，手動分割治療療程，手動圖像跟蹤和放射治療後的劑量跟蹤。因此，我們已經建立了一個平臺來自動化和簡化整個工作流程。我們的公司（NeuralRad LLC, NIH/NCI SBIR獲獎者）已被NIH選中，參加I-Corp商業發展項目。在這個過程中，我們需要通過與潛在客戶（如醫學物理學家、放射科醫生和腫瘤科醫生）和決策者（如部門主任、行政人員）交談進行市場調查，以確定要求並獲得對我們產品（Multiple BrainMets SRS管理平臺）的反饋。這項計劃將於3月1日開始。<p>您是否介意使用我們的會議邀請鏈接：<p>https://calendly.com/hao-jiang-1/nih-i-corp-customer-discovery-interview?month=2022-03<p>在您方便的時候安排一個時間段？我期待著與您交談。另外，如果有興趣，我們可以安排一個單獨的產品演示，讓您的團隊更詳細地瞭解我們的NeuralRad多重腦圖平臺。<p>蔣浩<p>CEO<p>NeuralRad LLC"
}