{
  "@type": "NewsArticle",
  "identifier": "2022--02--21--en--showhn--HackerNews--NewsArticle--30421370",
  "url": "https://news.ycombinator.com/item?id=30421370",
  "headline": "Show HN: How to avoid World Wars!",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Everywhere I travel, people everywhere have the same concerns: earn enough money, raise a family, enjoy life. They don’t want these conflicts. So why does it happen?<p>The Russian security council has just unanimously voted to recognize the Russian-speaking breakaway regions of Ukraine as independent. While it’s tempting for many to explain it all as “Putin is behind every decision in Russia and eveyone is a puppet”, this is a more serious situation. What was Putin suppossed to do, ignore them? When the US congress pushed Obama to intervene in Syria, or pushed Trump slap sanctions on Russia, they resisted for a while. But the problem is actually far deeper and more systemic. Almost always, is the combination of two things that lead to escalating conflicts in the world:<p>1) A discrete (usually binary) choice between status A and B for people on the ground<p>2) An absurd concentration of power in a state, federation, corporate industry, etc.<p>Together, they use mass media to pit regular people against each other on one or another side of an issue, keeping them divided rather than working together to fix the system upstream.<p>I have written about it in many areas of life, and once you see it, you can’t unsee it (links in the comments below)<p><pre><code>  Factory Farming [1]\n  Plastic [1]\n  Fossil Fuels [1]\n  Vaccines [1]\n  Party Poliics [2]\n  Presidential Elections [2]\n  Net Neutrality [3]\n  Women in Tech [4]\n  Israeli-Palestinian Conflict [5]\n</code></pre>\nI could go on… but let me just suggest an obvious solution. Make a UN treaty (like nuclear non-proliferation) committing to gradual transitioning to a system where each region could vote for its membership in neighboring states, and the results would be continuous, eg 30% membership in A, 60% in B, and 10% in a nascent independent state C. This would be reflected in regional arrangements. Separatists among Tamil Tigers, PKK, PLO, Hamas, Catalonians, Kurds, would have had less to fight about.<p>As it is, systems resist change and people are pushed by mass media and culture to ostracize those who push for the system to change, as “traitors” who ”side with the enemy”. Meanwhile, by insisting on 1) consensus on discrete outcomes and 2) concentrations of power on both sides, they just paint themselves into a corner, and could lead to nuclear armaggedon. All for what? The inability to improve the current international system.<p>(1 and 2 is also, incidentally, why blockchains don’t scale as well as almost all other Internet protocols).",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "EGreg",
    "url": "https://news.ycombinator.com/user?id=EGreg"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30421370",
  "sameAs": "https://news.ycombinator.com/item?id=30421370",
  "dateCreated": "2022-02-21T22:29:41.076Z",
  "datePublished": "2022-02-21T22:15:31.000Z",
  "dateModified": "2022-02-21T22:29:41.076Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Show HN: 如何避免世界大战!",
  "headline_zh-Hant": "Show HN: 如何避免世界大戰!",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在我旅行的每一个地方，各地的人们都有同样的担忧：赚够钱，养家糊口，享受生活。他们不希望发生这些冲突。那么，为什么会发生这种情况呢？<p>俄罗斯安全委员会刚刚一致投票，承认乌克兰讲俄语的分离地区为独立地区。虽然很多人很想把这一切解释为 \"普京在俄罗斯的每一个决定背后，每个人都是一个傀儡\"，但这是一个更严重的情况。普京应该怎么做，不理会他们吗？当美国国会推动奥巴马干预叙利亚，或推动特朗普对俄罗斯进行制裁时，他们抵制了一段时间。但问题实际上要深得多，也更有系统性。Almost always, is the combination of two things that lead to escalating conflicts in the world:<p>1) A discrete (usually binary) choice between status A and B for people on the ground<p>2) An absurd concentration of power in a state, federation, corporate industry, etc. <p>Together, they use mass media to pit regular people against each other on one or another side of an issue, keeping them divided rather than working together to fix the system upstream.<p>I have written about it in many areas of life, and once you see it, you can’t unsee it (links in the comments below)<p><pre><code> Factory Farming [1]\n  Plastic [1]\n  Fossil Fuels [1]\n  Vaccines [1]\n  Party Poliics [2]\n  Presidential Elections [2]\n  Net Neutrality [3]\n  Women in Tech [4]\n  Israeli-Palestinian Conflict [5]\n</code></pre>\nI could go on… but let me just suggest an obvious solution. 制定一个联合国条约（如核不扩散），承诺逐步过渡到一个系统，每个地区可以为其在邻国的成员资格投票，其结果将是连续的，例如，30%的成员资格在A，60%在B，10%在一个新生的独立国家C，这将反映在区域安排中。泰米尔猛虎组织、库尔德工人党、巴解组织、哈马斯、加泰罗尼亚人、库尔德人中的分离主义者，会有更少的争斗。<p>就像现在这样，制度抵制变革，人们被大众媒体和文化所推动，排斥那些推动制度变革的人，认为他们是 \"与敌人为伍 \"的 \"叛徒\"。同时，通过坚持1）对离散结果的共识和2）双方权力的集中，他们只是把自己陷入了一个角落，并可能导致核武库的崩溃。一切都是为了什么？无法改善当前的国际体系。<p>（顺便说一下，1和2也是区块链不能像几乎所有其他互联网协议那样扩展的原因）。",
  "description_zh-Hant": "在我旅行的每一個地方，各地的人們都有同樣的擔憂：賺夠錢，養家餬口，享受生活。他們不希望發生這些衝突。那麼，為什麼會發生這種情況呢？<p>俄羅斯安全委員會剛剛一致投票，承認烏克蘭講俄語的分離地區為獨立地區。雖然很多人很想把這一切解釋為 \"普京在俄羅斯的每一個決定背後，每個人都是一個傀儡\"，但這是一個更嚴重的情況。普京應該怎麼做，不理會他們嗎？當美國國會推動奧巴馬乾預敘利亞，或推動特朗普對俄羅斯進行制裁時，他們抵制了一段時間。但問題實際上要深得多，也更有系統性。Almost always, is the combination of two things that lead to escalating conflicts in the world:<p>1) A discrete (usually binary) choice between status A and B for people on the ground<p>2) An absurd concentration of power in a state, federation, corporate industry, etc. <p>Together, they use mass media to pit regular people against each other on one or another side of an issue, keeping them divided rather than working together to fix the system upstream.<p>I have written about it in many areas of life, and once you see it, you can’t unsee it (links in the comments below)<p><pre><code> Factory Farming [1]\n  Plastic [1]\n  Fossil Fuels [1]\n  Vaccines [1]\n  Party Poliics [2]\n  Presidential Elections [2]\n  Net Neutrality [3]\n  Women in Tech [4]\n  Israeli-Palestinian Conflict [5]\n</code></pre>\nI could go on… but let me just suggest an obvious solution. 制定一個聯合國條約（如核不擴散），承諾逐步過渡到一個系統，每個地區可以為其在鄰國的成員資格投票，其結果將是連續的，例如，30%的成員資格在A，60%在B，10%在一個新生的獨立國家C，這將反映在區域安排中。泰米爾猛虎組織、庫爾德工人黨、巴解組織、哈馬斯、加泰羅尼亞人、庫爾德人中的分離主義者，會有更少的爭鬥。<p>就像現在這樣，制度抵制變革，人們被大眾媒體和文化所推動，排斥那些推動制度變革的人，認為他們是 \"與敵人為伍 \"的 \"叛徒\"。同時，通過堅持1）對離散結果的共識和2）雙方權力的集中，他們只是把自己陷入了一個角落，並可能導致核武庫的崩潰。一切都是為了什麼？無法改善當前的國際體系。<p>（順便說一下，1和2也是區塊鏈不能像幾乎所有其他互聯網協議那樣擴展的原因）。"
}