{
  "@type": "NewsArticle",
  "identifier": "2022--03--01--en--showhn--HackerNews--NewsArticle--30515696",
  "url": "https://news.ycombinator.com/item?id=30515696",
  "headline": "Show HN: Dotling – Highly flexible, easy to use site builder for everyone",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey everyone. I'v been working on this for a long time and want to finally show it to the public. I know this is a very crowded market but I think there is room for value to be added. I was looking at all of the popular site builders out there and came to the following conclusion:<p>1. The flexible/powerful builders are intimidating and has a steep learning curve. Also they are slow on older computers and does not work on mobile.<p>2. The easy to use builders tends to be limiting in how you can design your site  and/or how many pages that can be made per site.<p>3. All the popular builders are ~$150 a year. It's just too expensive for someone who just want an online presence.<p>----------------------------------------<p>So I think there is room to give value in this market if I can achieve these 3 requirements:<p>1. Flexibility. I wanted designers to be able to create what they came up with in their heads. No inflexible blocks and elements. All elements have access to all of the major used css styles.<p>2. Accessibility. I don't want people to spend ~$150 a year on one website with no ads. A lot of people can't drop that much money at once. Likewise, not everyone has powerful machines; the product needs to be buttery smooth on old, slower devices. Lastly, the product needs to be  fully functional on mobile so users can edit on the go.<p>3. Easy to use. I want the product to have a low learning curve. Users only need to understand how a container works to make every layout possible. Pre-made sections and templates are available for building quickly and easily. Copy and pasting between sites is also possible.<p>Do you guys think I came relatively close or just wasted my time? Any feedback would be appreciated (no registration is required to use the platform).",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "dot_michael",
    "url": "https://news.ycombinator.com/user?id=dot_michael"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30515696",
  "sameAs": "https://dotling.com",
  "dateCreated": "2022-03-01T16:17:50.739Z",
  "datePublished": "2022-03-01T15:58:35.000Z",
  "dateModified": "2022-03-01T16:17:50.739Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Dotling - 高度灵活、易于使用的网站建设者，适合每个人。",
  "headline_zh-Hant": "Show HN: Dotling - 高度靈活、易於使用的網站建設者，適合每個人。",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好。我已经在这上面工作了很长时间，想最终向公众展示它。我知道这是一个非常拥挤的市场，但我认为还有增值的空间。我看了所有流行的网站建设者，得出了以下结论：<p>1. 灵活/强大的建站程序让人望而生畏，学习曲线很陡峭。<p>2.容易使用的建站程序往往限制了你如何设计你的网站和/或每个网站可以做多少页。<p>3.所有流行的建站程序都是每年150美元。对于那些只想在网上展示的人来说，这实在是太贵了。<p>----------------------------------------<p>所以我认为，如果我能够实现这3个要求，就有可能在这个市场上提供价值：<p>1. 灵活性。我希望设计师能够创造他们头脑中的想法。没有不灵活的块和元素。所有元素都可以使用所有主要的css样式。<p>2.可访问性。我不希望人们每年在一个没有广告的网站上花费~150美元。很多人不可能一下子放下那么多钱。同样，不是每个人都有强大的机器；产品需要在旧的、较慢的设备上非常流畅。最后，该产品需要在移动设备上有充分的功能，以便用户可以在旅途中编辑。我希望该产品具有较低的学习曲线。用户只需要了解容器的工作原理，就可以实现每一个布局。预制的部分和模板可用于快速、轻松地构建。网站之间的复制和粘贴也是可能的。<p>你们认为我相对接近还是只是浪费了我的时间？请提供任何反馈意见（使用该平台不需要注册）。",
  "description_zh-Hant": "大家好。我已經在這上面工作了很長時間，想最終向公眾展示它。我知道這是一個非常擁擠的市場，但我認為還有增值的空間。我看了所有流行的網站建設者，得出了以下結論：<p>1. 靈活/強大的建站程序讓人望而生畏，學習曲線很陡峭。<p>2.容易使用的建站程序往往限制了你如何設計你的網站和/或每個網站可以做多少頁。<p>3.所有流行的建站程序都是每年150美元。對於那些只想在網上展示的人來說，這實在是太貴了。<p>----------------------------------------<p>所以我認為，如果我能夠實現這3個要求，就有可能在這個市場上提供價值：<p>1. 靈活性。我希望設計師能夠創造他們頭腦中的想法。沒有不靈活的塊和元素。所有元素都可以使用所有主要的css樣式。<p>2.可訪問性。我不希望人們每年在一個沒有廣告的網站上花費~150美元。很多人不可能一下子放下那麼多錢。同樣，不是每個人都有強大的機器；產品需要在舊的、較慢的設備上非常流暢。最後，該產品需要在移動設備上有充分的功能，以便用戶可以在旅途中編輯。我希望該產品具有較低的學習曲線。用戶只需要瞭解容器的工作原理，就可以實現每一個佈局。預製的部分和模板可用於快速、輕鬆地構建。網站之間的複製和粘貼也是可能的。<p>你們認為我相對接近還是隻是浪費了我的時間？請提供任何反饋意見（使用該平臺不需要註冊）。"
}