{
  "@type": "NewsArticle",
  "identifier": "2022--02--24--en--showhn--HackerNews--NewsArticle--30457925",
  "url": "https://news.ycombinator.com/item?id=30457925",
  "headline": "Show HN: Tired of Anki? I built a modern app for learning words with examples",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Tl;dr: I built an alternative iOS/macOS app to Anki/Quizlet for learning vocabulary. You can write, collect and review example sentences with which you learn words more effectively than by just reviewing their definitions.<p>A few years ago I wanted to improve my writing. As part of the learning process, I also wanted to expand my vocabulary. I’d highlight unknown words as I was reading books, and I’d saved them to flashcard apps. I’d reviewed them daily and for a long time I thought I was making good progress: during reviews, I’d usually guess correctly the meaning of words. My excitement was short-lived though. I noticed that after a while, even though those apps used spaced-repetition, I’d forget definitions for some of the words. I realized I didn’t understand many of them, I just knew their translation. I didn’t really feel what they meant, and because of that, I couldn’t use them in my writing.<p>I read the book called “make it stick” by Peter Brown to learn more about the science of learning since I didn’t want to spend countless hours reviewing words I would forget anyway. In the book, the author argues, quite convincingly, that the best way to learn new knowledge is through context. That is, to hook it up to something we already know. In the case of learning new vocabulary, if we want the learning to be durable, it’s not enough to just review a word’s definition/translation. You need to read and write use-cases of those words to understand how they are used in sentences (you can also speak or listen to them, but we're talking about what can be done in a flashcard app). Only by hooking up a word to real situations, objects, and feelings, is the learning more permanent.<p>The existing apps on the market didn’t allow me to study words with context so I decided to build an app that would be designed from the ground up to learn words with examples. My aim was for the app to be also simpler, integrated with the OS, and faster.<p>It took me almost 1.5 years to build. Most of this time was spent on finding the product market fit. I recruited a few users manually who helped me get on track. I was also dogfooding the app throughout the development process as I was learning Spanish from zero to fluency in a year. Side note: I don’t believe in learning a language to fluency based on a single app. The app is just a tool that can just help you with some aspect of learning. I spent about 2h a day reading various content, reviewing words, watching movies and speaking — but I always used Obstino to learn my vocabulary. The experience of actually using the app for so long, influenced its design and functionality.<p>A few interesting bits which most other applications don’t have:<p>- Integration with the OS: easily saving words via the Share Extension.\n- Native and simple. One-click to add a word.\n- Multiple definitions/translations for each word.\n- Safari extension looks for your words in the content of the websites you visit and extracts sentences that contain those words to Obstino so you have personalized and therefore more memorable use-cases to review.\n- The app understands inflections. Highlights different inflections in sentences. Can covert word back to its root word. Safari detects different inflections on the websites you visit.<p>Though the app has been on the App Store for a while (in fact, I submitted an Alpha version here to YC almost a year ago without any traction), I feel only now, after much testing and redesigning that the product is ready for marketing.<p>Landing page: [https://www.obstino.com](https://www.obstino.com/)<p>App Store: [https://apps.apple.com/app/apple-store/id1519609590?pt=433404&amp;ct=obstino.com%20website&amp;mt=8](https://apps.apple.com/app/apple-store/id1519609590?pt=433404&amp;ct=obstino.com%20website&amp;mt=8)<p>What do you think? Does it have potential or is it a dud? I’m really curious to know how you see the product.<p>The app currently works only with Spanish and English words.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "dkaleta",
    "url": "https://news.ycombinator.com/user?id=dkaleta"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30457925",
  "sameAs": "https://news.ycombinator.com/item?id=30457925",
  "dateCreated": "2022-02-24T18:12:09.010Z",
  "datePublished": "2022-02-24T17:56:32.000Z",
  "dateModified": "2022-02-24T18:12:09.010Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 厌倦了Anki？我建立了一个现代的应用程序，用例子来学习单词",
  "headline_zh-Hant": "Show HN: 厭倦了Anki？我建立了一個現代的應用程序，用例子來學習單詞",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Tl;dr: 我建立了一个替代Anki/Quizlet的iOS/MacOS应用程序来学习词汇。你可以写、收集和复习例句，用它来学习单词比只复习其定义更有效。<p>几年前，我想改善我的写作。作为学习过程的一部分，我也想扩大我的词汇量。我在阅读书籍时突出了未知的单词，并将它们保存在闪卡应用程序中。我每天复习这些单词，在很长一段时间里，我认为我取得了良好的进展：在复习过程中，我通常能正确猜出单词的意思。但我的兴奋是短暂的。我注意到，过了一段时间，尽管这些应用程序使用了间隔重复，但我还是会忘记一些单词的定义。我意识到我并不理解其中的许多内容，我只是知道它们的翻译。<p>我读了彼得-布朗写的《让它坚持下去》一书，以了解更多关于学习的科学知识，因为我不想花无数时间复习我反正会忘记的单词。在这本书中，作者相当有说服力地认为，学习新知识的最佳方式是通过上下文。也就是说，要把它与我们已经知道的东西联系起来。在学习新词汇的情况下，如果我们希望学习能够持久，仅仅复习一个单词的定义/翻译是不够的。你需要读和写这些词的用例，以了解它们在句子中的使用情况（你也可以说或听，但我们谈论的是在闪存卡应用程序中可以做到的）。<p>市场上现有的应用程序不允许我用上下文来学习单词，所以我决定建立一个应用程序，从头开始设计，用实例来学习单词。我的目标是让这个应用程序更加简单，与操作系统集成，并且速度更快。<p>我花了将近1.5年的时间来建立。其中大部分时间都花在寻找产品的市场定位上。我手动招募了一些用户，他们帮助我走上了正轨。在整个开发过程中，我还对该应用进行了狗粮式的培训，因为我在一年内将西班牙语从零学到了流利的程度。题外话：我不相信在一个单一的应用程序的基础上学习一种语言到流利。这个应用程序只是一个工具，只是可以帮助你在某些方面的学习。我每天花大约2小时阅读各种内容，复习单词，看电影和说话--但我总是用Obstino来学习词汇。实际使用该应用程序这么长时间的经验，影响了它的设计和功能。<p>几个有趣的位子，是其他大多数应用程序所没有的：<p>- 与操作系统的整合：通过共享扩展轻松地保存单词。\n- 原生且简单。一键添加一个单词。\n- 每个词有多个定义/翻译。\n- Safari扩展在你访问的网站内容中寻找你的单词，并提取包含这些单词的句子，以Obstino，这样你就有了个性化的、因此更令人难忘的用例来回顾。\n- 该应用程序了解语气词。突出句子中的不同转折。可将单词转回其词根。<p>虽然这款应用在App Store上已经有一段时间了（事实上，我在一年前就向YC提交了Alpha版本，但没有任何牵引力），但在经过大量测试和重新设计后，我觉得该产品现在才准备好进行营销。[https://www.obstino.com](https://www.obstino.com/)<p>应用程序商店。[https://apps.apple.com/app/apple-store/id1519609590?pt=433404&amp;ct=obstino.com%20website&amp;mt=8](https://apps.apple.com/app/apple-store/id1519609590?pt=433404&amp;ct=obstino.com%20website&amp;mt=8)<p>你觉得怎么样？它是有潜力还是个哑巴？我真的很想知道你是如何看待这个产品的。<p>这个应用程序目前只适用于西班牙语和英语单词。",
  "description_zh-Hant": "Tl;dr: 我建立了一個替代Anki/Quizlet的iOS/MacOS應用程序來學習詞彙。你可以寫、收集和複習例句，用它來學習單詞比只複習其定義更有效。<p>幾年前，我想改善我的寫作。作為學習過程的一部分，我也想擴大我的詞彙量。我在閱讀書籍時突出了未知的單詞，並將它們保存在閃卡應用程序中。我每天覆習這些單詞，在很長一段時間裡，我認為我取得了良好的進展：在複習過程中，我通常能正確猜出單詞的意思。但我的興奮是短暫的。我注意到，過了一段時間，儘管這些應用程序使用了間隔重複，但我還是會忘記一些單詞的定義。我意識到我並不理解其中的許多內容，我只是知道它們的翻譯。<p>我讀了彼得-布朗寫的《讓它堅持下去》一書，以瞭解更多關於學習的科學知識，因為我不想花無數時間複習我反正會忘記的單詞。在這本書中，作者相當有說服力地認為，學習新知識的最佳方式是通過上下文。也就是說，要把它與我們已經知道的東西聯繫起來。在學習新詞彙的情況下，如果我們希望學習能夠持久，僅僅複習一個單詞的定義/翻譯是不夠的。你需要讀和寫這些詞的用例，以瞭解它們在句子中的使用情況（你也可以說或聽，但我們談論的是在閃存卡應用程序中可以做到的）。<p>市場上現有的應用程序不允許我用上下文來學習單詞，所以我決定建立一個應用程序，從頭開始設計，用實例來學習單詞。我的目標是讓這個應用程序更加簡單，與操作系統集成，並且速度更快。<p>我花了將近1.5年的時間來建立。其中大部分時間都花在尋找產品的市場定位上。我手動招募了一些用戶，他們幫助我走上了正軌。在整個開發過程中，我還對該應用進行了狗糧式的培訓，因為我在一年內將西班牙語從零學到了流利的程度。題外話：我不相信在一個單一的應用程序的基礎上學習一種語言到流利。這個應用程序只是一個工具，只是可以幫助你在某些方面的學習。我每天花大約2小時閱讀各種內容，複習單詞，看電影和說話--但我總是用Obstino來學習詞彙。實際使用該應用程序這麼長時間的經驗，影響了它的設計和功能。<p>幾個有趣的位子，是其他大多數應用程序所沒有的：<p>- 與操作系統的整合：通過共享擴展輕鬆地保存單詞。\n- 原生且簡單。一鍵添加一個單詞。\n- 每個詞有多個定義/翻譯。\n- Safari擴展在你訪問的網站內容中尋找你的單詞，並提取包含這些單詞的句子，以Obstino，這樣你就有了個性化的、因此更令人難忘的用例來回顧。\n- 該應用程序瞭解語氣詞。突出句子中的不同轉折。可將單詞轉回其詞根。<p>雖然這款應用在App Store上已經有一段時間了（事實上，我在一年前就向YC提交了Alpha版本，但沒有任何牽引力），但在經過大量測試和重新設計後，我覺得該產品現在才準備好進行營銷。[https://www.obstino.com](https://www.obstino.com/)<p>應用程序商店。[https://apps.apple.com/app/apple-store/id1519609590?pt=433404&amp;ct=obstino.com%20website&amp;mt=8](https://apps.apple.com/app/apple-store/id1519609590?pt=433404&amp;ct=obstino.com%20website&amp;mt=8)<p>你覺得怎麼樣？它是有潛力還是個啞巴？我真的很想知道你是如何看待這個產品的。<p>這個應用程序目前只適用於西班牙語和英語單詞。"
}