{
  "@type": "NewsArticle",
  "identifier": "2022--04--08--en--showhn--HackerNews--NewsArticle--30960897",
  "url": "https://news.ycombinator.com/item?id=30960897",
  "headline": "Show HN: Relevanto (beta) – I curate the relevant web",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi! This is Alex Dragusin and lately I've been working on Relevanto where I look for and save the best of the web. I literally search through search engines for the best of everything (yes, lots of site:reddit.com in there and so on), check it out if it's legit (I search for reputational data like reviews etc) save it, categorize it and list it on Relevanto. I have a knack for curation and organization so I am putting my skills to, hopefully good use. This, at this point is intended for a global audience, stuff that make sense for most people.<p>I got fed up with Google and other search engines results being filled with too many results that are not really useful and I hope Relevanto will eventually be a gateway for most of the stuffs I do on the web, leaving the search engines for more specific stuffs - to use them as an option rather than primary way.<p>Love speed and privacy. I am big on privacy thus no tracking and the usual nonsense. The site is static and managed by a backend I created through which I manage the sites in the database. The static exporter is written in PHP. Nothing too fancy.<p>I am constantly adding, adjusting and since it's beta, many more categories are coming up.<p>In the works:<p>*apart from the highlighter, a similar function that will filter all the sites by [keyword], that is, show only what contain [keyword], hide everything else. \n*dedicated pages, for example Music, on this page there will be all about music from links to websites for consumption to tools of creation to news and so on.<p>Monetization:<p>Will monetize in 2 ways, one by having a Marketplace page (the only place for ads, no ads on other parts of the site as long as I am at the helm), where one can advertise their service/product/company for a consistent fee (aka high barrier of entry) while abiding by strict guidelines (Money is good but not at the expense of my visitors!) and second by patronages taken through Patreon or other provider. That's it, the goal is not endless growth at the expense of the users but to provide value, real value! This is the future of the web, the relevant web!<p>Thank you and hope to have you along for the ride.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "AlexDragusin",
    "url": "https://news.ycombinator.com/user?id=AlexDragusin"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30960897",
  "sameAs": "https://www.relevanto.com",
  "dateCreated": "2022-04-08T18:55:19.055Z",
  "datePublished": "2022-04-08T18:39:37.000Z",
  "dateModified": "2022-04-08T18:55:19.055Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Relevanto（测试版）--我策划的相关网络",
  "headline_zh-Hant": "Show HN: Relevanto（測試版）--我策劃的相關網絡",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好！我是Alex Dragusin，最近我一直在为Relevanto工作，在那里我寻找并保存网络上最好的东西。我通过搜索引擎搜索一切最好的东西（是的，其中有很多site:reddit.com等），检查它是否合法（我搜索信誉数据，如评论等），保存它，将它分类并列在Relevanto上。我有策划和组织的诀窍，所以我正在把我的技能用于，希望能有好的用途。我希望Relevanto最终能成为我在网络上做的大多数事情的入口，把搜索引擎留给更具体的事情--把它们作为一种选择而不是主要方式。我很注重隐私，因此没有跟踪和通常的废话。该网站是静态的，由我创建的一个后台管理，我通过该后台管理数据库中的网站。静态输出器是用PHP写的。<p>我正在不断地添加、调整，由于它是测试版，还有更多的类别正在出现。<p>正在进行的工作：<p>*除了突出显示，还有一个类似的功能，将通过[关键词]过滤所有的网站，也就是说，只显示包含[关键词]的内容，隐藏其他的内容。\n*专门的页面，例如音乐，在这个页面上将有所有关于音乐的链接，从消费的网站到创作的工具到新闻等等。 <p>货币化：<p>将以两种方式货币化，一是通过市场页面（唯一的广告场所，只要我在掌舵，网站的其他部分就没有广告），人们可以在这里为他们的服务/产品/公司做广告，并收取一定的费用（又称高门槛），同时遵守严格的准则（钱是好东西，但不能以牺牲我的访客为代价！）；二是通过Patreon或其他供应商的资助。就是这样，目标不是以牺牲用户为代价的无止境增长，而是提供价值，真正的价值！这就是未来。这就是网络的未来，相关的网络！<p>谢谢你，希望你也能参与其中。",
  "description_zh-Hant": "你好！我是Alex Dragusin，最近我一直在為Relevanto工作，在那裡我尋找並保存網絡上最好的東西。我通過搜索引擎搜索一切最好的東西（是的，其中有很多site:reddit.com等），檢查它是否合法（我搜索信譽數據，如評論等），保存它，將它分類並列在Relevanto上。我有策劃和組織的訣竅，所以我正在把我的技能用於，希望能有好的用途。我希望Relevanto最終能成為我在網絡上做的大多數事情的入口，把搜索引擎留給更具體的事情--把它們作為一種選擇而不是主要方式。我很注重隱私，因此沒有跟蹤和通常的廢話。該網站是靜態的，由我創建的一個後臺管理，我通過該後臺管理數據庫中的網站。靜態輸出器是用PHP寫的。<p>我正在不斷地添加、調整，由於它是測試版，還有更多的類別正在出現。<p>正在進行的工作：<p>*除了突出顯示，還有一個類似的功能，將通過[關鍵詞]過濾所有的網站，也就是說，只顯示包含[關鍵詞]的內容，隱藏其他的內容。\n*專門的頁面，例如音樂，在這個頁面上將有所有關於音樂的鏈接，從消費的網站到創作的工具到新聞等等。 <p>貨幣化：<p>將以兩種方式貨幣化，一是通過市場頁面（唯一的廣告場所，只要我在掌舵，網站的其他部分就沒有廣告），人們可以在這裡為他們的服務/產品/公司做廣告，並收取一定的費用（又稱高門檻），同時遵守嚴格的準則（錢是好東西，但不能以犧牲我的訪客為代價！）；二是通過Patreon或其他供應商的資助。就是這樣，目標不是以犧牲用戶為代價的無止境增長，而是提供價值，真正的價值！這就是未來。這就是網絡的未來，相關的網絡！<p>謝謝你，希望你也能參與其中。"
}