{
  "@type": "NewsArticle",
  "identifier": "2022--03--14--en--showhn--HackerNews--NewsArticle--30677886",
  "url": "https://news.ycombinator.com/item?id=30677886",
  "headline": "Show HN: Grryno.com – A pay-per-use game server hosting service",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN!<p>I made a pay-per-use, game server hosting service a while back: https://grryno.com/. There are lots of subscription based game server hosts, but as far as I can tell this is one of the first on-demand services.<p>The initial reason I created it was so that I didn't have to waste time every few months searching up how to get a server running for an old, obscure or open source game (Quake2, Teeworlds, Unreal Tournament, Bitfighter, etc). And because I don't play games as much as I used to I didn't want to pay a monthly subscription anywhere. Hence the on-demand service.<p>It's a bit more expensive per-month compared to other subscription-based services, but it's not meant to be used 24/7.<p>The game servers are run using Docker on a handful of AWS services, and the web front-end is running on a Linode instance.<p>The servers have an auto-shutdown feature which stops the server if it detects no players connected for 10 minutes. This is handy because I regularly forget to shut down the server manually and it prevents running up a huge bill.<p>It also automatically backs up game save files to S3 each time the server is shut down, features a web-based server console, has an easy config file and plugin editing system and let's you change the cpu/ram profile on a game server at any time.<p>It basically launches a server through AWS like this:\n  - The 'Launch Server' button is pressed on the website:\n    - Space on an EFS drive is created for game save files\n    - Config files and plugins for the game are saved to the EFS drive\n    - A DNS entry for the custom domain (eg. myserver.grryno.com) is created through Route53\n    - An EC2 instance is launched, linked to the EFS drive\n    - An ECS task (Docker image) is created on the EC2 instance.<p>This all finishes in about 2 minutes, usually.<p>So far I only have a very small handful of paying users, but last week I was host to a major Twitch Minecraft charity event with some big-name streamers. It was exhilarating to watch these guys, who had about 100,000 combined viewers, play on my servers. Terrifying too! I could barely watch the stream because I was afraid that my stuff was going to come crashing down at any second and ruin the whole bloody thing. It all ran flawlessly though! I had teamed up with a company called Warp World to do some Twitch-specific customization on a Minecraft server and it was because of them that this Twitch event happened. Many thanks to them for supporting me.<p>I'm a developer through and through but I'm trying to learn some marketing so I can hopefully quit my day job and run this thing full time soon.<p>I would love for anyone to try it out and let me know what you think. If you go to https://grryno.com/ and use this promo code: THEBEESAREHAPPY, you'll get a couple of bucks added to your account, which should be about 10 hours of game time for most games with the default server type. I'm open to any and all constructive feedback or suggestions. There are only a handful of games on there right now but I'll add games on request as well.<p>I'd love to answer any questions on the tech stack or infrastructure too.<p>Thanks for reading!<p>Ryan",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "rejacobson",
    "url": "https://news.ycombinator.com/user?id=rejacobson"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30677886",
  "sameAs": "https://news.ycombinator.com/item?id=30677886",
  "dateCreated": "2022-03-14T20:41:22.519Z",
  "datePublished": "2022-03-14T20:34:13.000Z",
  "dateModified": "2022-03-14T20:41:22.519Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Grryno.com - 一个按使用量付费的游戏服务器托管服务",
  "headline_zh-Hant": "Show HN: Grryno.com - 一個按使用量付費的遊戲服務器託管服務",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，HN！<p>我在不久前做了一个按使用量付费的游戏服务器托管服务：https://grryno.com/。有很多基于订阅的游戏服务器主机，但就我所知，这是最早的按需服务之一。<p>我创建它的最初原因是，我不必每隔几个月就浪费时间去搜索如何为一个老的、不知名的或开源的游戏（Quake2、Teeworlds、Unreal Tournament、Bitfighter等）获得一个服务器运行。而且，由于我不像以前那样经常玩游戏，我不想在任何地方支付月费。<p>与其他基于订阅的服务相比，每个月的费用要高一些，但它并不是要全天候使用。<p>游戏服务器使用Docker在少数AWS服务上运行，而网页前端则在Linode实例上运行。这很方便，因为我经常忘记手动关闭服务器，它可以防止产生巨额账单。<p>每次关闭服务器时，它还会自动将游戏保存文件备份到S3，具有一个基于Web的服务器控制台，有一个简单的配置文件和插件编辑系统，让你在任何时候改变游戏服务器的CPU/RAM配置文件。\n  - 在网站上按下 \"启动服务器 \"按钮。\n    - 在一个EFS驱动器上为游戏保存文件创建空间\n    - 游戏的配置文件和插件被保存到EFS驱动器上\n    - 通过Route53为自定义域名（例如：myserver.grryno.com）创建一个DNS条目。\n    - 启动一个EC2实例，链接到EFS驱动器上\n    - <p>这一切都在大约2分钟内完成，通常。<p>到目前为止，我只有很少的付费用户，但上周我主持了一个主要的Twitch Minecraft慈善活动，有一些大名鼎鼎的流作家。这是令人振奋的，看这些家伙，谁拥有约100,000合并观众，在我的服务器上播放。也很吓人! 我几乎无法观看流媒体，因为我担心我的东西会在任何时候崩溃，并破坏了整个血腥的事情。不过，这一切都运行得完美无缺 我曾与一家名为Warp World的公司合作，在Minecraft服务器上做一些Twitch专用的定制，正是因为他们，这个Twitch事件才得以发生。非常感谢他们对我的支持。<p>我是一个开发人员，但我正在努力学习一些营销，这样我就可以希望辞去我的日常工作，并很快全职运行这个东西。<p>我很想让任何人尝试一下，让我知道你的想法。如果你去https://grryno.com/，并使用这个促销代码。TheBEESAREHAPPY，你会得到几块钱加到你的账户上，这应该是大多数游戏的默认服务器类型的10小时的游戏时间。我愿意接受任何和所有建设性的反馈或建议。现在上面只有少数几个游戏，但我也会应要求增加游戏。<p>我也很愿意回答任何关于技术栈或基础设施的问题。<p>谢谢阅读！<p>Ryan",
  "description_zh-Hant": "嘿，HN！<p>我在不久前做了一個按使用量付費的遊戲服務器託管服務：https://grryno.com/。有很多基於訂閱的遊戲服務器主機，但就我所知，這是最早的按需服務之一。<p>我創建它的最初原因是，我不必每隔幾個月就浪費時間去搜索如何為一個老的、不知名的或開源的遊戲（Quake2、Teeworlds、Unreal Tournament、Bitfighter等）獲得一個服務器運行。而且，由於我不像以前那樣經常玩遊戲，我不想在任何地方支付月費。<p>與其他基於訂閱的服務相比，每個月的費用要高一些，但它並不是要全天候使用。<p>遊戲服務器使用Docker在少數AWS服務上運行，而網頁前端則在Linode實例上運行。這很方便，因為我經常忘記手動關閉服務器，它可以防止產生鉅額賬單。<p>每次關閉服務器時，它還會自動將遊戲保存文件備份到S3，具有一個基於Web的服務器控制檯，有一個簡單的配置文件和插件編輯系統，讓你在任何時候改變遊戲服務器的CPU/RAM配置文件。\n  - 在網站上按下 \"啟動服務器 \"按鈕。\n    - 在一個EFS驅動器上為遊戲保存文件創建空間\n    - 遊戲的配置文件和插件被保存到EFS驅動器上\n    - 通過Route53為自定義域名（例如：myserver.grryno.com）創建一個DNS條目。\n    - 啟動一個EC2實例，鏈接到EFS驅動器上\n    - <p>這一切都在大約2分鐘內完成，通常。<p>到目前為止，我只有很少的付費用戶，但上週我主持了一個主要的Twitch Minecraft慈善活動，有一些大名鼎鼎的流作家。這是令人振奮的，看這些傢伙，誰擁有約100,000合併觀眾，在我的服務器上播放。也很嚇人! 我幾乎無法觀看流媒體，因為我擔心我的東西會在任何時候崩潰，並破壞了整個血腥的事情。不過，這一切都運行得完美無缺 我曾與一家名為Warp World的公司合作，在Minecraft服務器上做一些Twitch專用的定製，正是因為他們，這個Twitch事件才得以發生。非常感謝他們對我的支持。<p>我是一個開發人員，但我正在努力學習一些營銷，這樣我就可以希望辭去我的日常工作，並很快全職運行這個東西。<p>我很想讓任何人嘗試一下，讓我知道你的想法。如果你去https://grryno.com/，並使用這個促銷代碼。TheBEESAREHAPPY，你會得到幾塊錢加到你的賬戶上，這應該是大多數遊戲的默認服務器類型的10小時的遊戲時間。我願意接受任何和所有建設性的反饋或建議。現在上面只有少數幾個遊戲，但我也會應要求增加遊戲。<p>我也很願意回答任何關於技術棧或基礎設施的問題。<p>謝謝閱讀！<p>Ryan"
}