{
  "@type": "NewsArticle",
  "identifier": "2022--03--22--en--showhn--HackerNews--NewsArticle--30770110",
  "url": "https://news.ycombinator.com/item?id=30770110",
  "headline": "Show HN: Someone asked recently why GCP more popular as a cloud provider",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Take a look at the linked document.\nIAM is the cornerstone of good access control. This document is utterly useless for actually doing anything (and it is massive!) Ask yourself any question, any question at all about setting up or configuring IAM. This document will fail to help. It might help if you've already got most of the way there and need the specific role name, but it cannot get you from task to solution.\nThis is a prime example of how GCP is not customer-centric. Customers have tasks they're trying to get done. (&quot;As a customer I'm trying to do X&quot;). Failure to create task oriented documentation (or interfaces) means your customers can't (easily) solve their problems which means customers will end up gravitating to cloud providers who DO take their perspective seriously.\nI think this is an example of failing to follow one of Dale Carnegi's fundamental principles of getting along with people (and who better to get along with than your customers!) &quot;Talk in terms of the other person's interest.&quot;<p>If anyone at Google is looking to improve GCP marketshare or turn it's fortunes around I highly recommend reorienting the product around customer needs. It baffles me that I'd need to say this but here we are.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "more_corn",
    "url": "https://news.ycombinator.com/user?id=more_corn"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30770110",
  "sameAs": "https://cloud.google.com/iam/docs/understanding-roles",
  "dateCreated": "2022-03-22T19:08:56.029Z",
  "datePublished": "2022-03-22T19:05:20.000Z",
  "dateModified": "2022-03-22T19:08:56.029Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 最近有人问，为什么GCP作为一个云计算供应商更受欢迎？",
  "headline_zh-Hant": "Show HN: 最近有人問，為什麼GCP作為一個雲計算供應商更受歡迎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "请看一下链接的文件。\nIAM是良好访问控制的基石。这份文件对于实际操作来说完全没有用处（而且它很庞大！），你可以问自己任何问题，关于设置或配置IAM的任何问题。这份文件将无法提供帮助。如果你已经掌握了大部分的方法，需要特定的角色名称，它可能会有帮助，但它不能让你从任务到解决方案。\n这就是GCP不以客户为中心的一个典型例子。客户有他们想要完成的任务。(&quot;作为一个客户，我想做X&quot;)。如果不能创建以任务为导向的文档（或界面），就意味着你的客户不能（轻松）解决他们的问题，这意味着客户最终会倾向于那些认真对待他们的观点的云供应商。\n我认为这是一个未能遵循戴尔-卡内基与人相处的基本原则之一的例子（还有谁比你的客户更适合相处呢！）&quot;从对方的利益角度来谈。<p>如果谷歌的任何人想提高GCP的市场份额或扭转它的命运，我强烈建议围绕客户需求重新定位产品。我不明白为什么我需要这样说，但我们现在就是这样。",
  "description_zh-Hant": "請看一下鏈接的文件。\nIAM是良好訪問控制的基石。這份文件對於實際操作來說完全沒有用處（而且它很龐大！），你可以問自己任何問題，關於設置或配置IAM的任何問題。這份文件將無法提供幫助。如果你已經掌握了大部分的方法，需要特定的角色名稱，它可能會有幫助，但它不能讓你從任務到解決方案。\n這就是GCP不以客戶為中心的一個典型例子。客戶有他們想要完成的任務。(&quot;作為一個客戶，我想做X&quot;)。如果不能創建以任務為導向的文檔（或界面），就意味著你的客戶不能（輕鬆）解決他們的問題，這意味著客戶最終會傾向於那些認真對待他們的觀點的雲供應商。\n我認為這是一個未能遵循戴爾-卡內基與人相處的基本原則之一的例子（還有誰比你的客戶更適合相處呢！）&quot;從對方的利益角度來談。<p>如果谷歌的任何人想提高GCP的市場份額或扭轉它的命運，我強烈建議圍繞客戶需求重新定位產品。我不明白為什麼我需要這樣說，但我們現在就是這樣。"
}