{
  "@type": "NewsArticle",
  "identifier": "2022--04--02--en--showhn--HackerNews--NewsArticle--30889828",
  "url": "https://news.ycombinator.com/item?id=30889828",
  "headline": "Show HN: A tiny solar-powered server only awake during the day",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Solar Witch is a little webpage and server which receives and displays messages, so I suppose it's a tiny message board. It's coded in very dubious Arduino C.<p>It's not a 24/7 website. Depending on the state of the battery, the server itself might run all night, but all the messages it receives during the day are deleted at sunset, and the messaging function itself is only active between sunrise and sunset. This is for two reasons:<p>1. Less usage of Solar Witch during the night conserves battery power.<p>2. I like the idea of websites which _aren't_ constantly available. Websites which have to sleep too. Websites living on servers which aren't somewhere in the cloud, but which are bound to a particular location, giving you a sense of where in the world they actually live.<p>Solar Witch is very much inspired by the solar-powered version of Low Tech Magazine (<a href=\"https://solar.lowtechmagazine.com/\" rel=\"nofollow\">https://solar.lowtechmagazine.com/</a>), but at a far, far smaller scale.<p>PSA: Solar Witch is a teensy hand-written C server running on a teensy microcontroller attached to a teensy solar panel which can only handle one HTTP request at a time and may have buffer overrun issues due to my ineptitude with C. If it's gone down, please don't be surprised, and rest assured I'll hit the reset button soon! Solar Witch encourages patience.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "lowercasename",
    "url": "https://news.ycombinator.com/user?id=lowercasename"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30889828",
  "sameAs": "https://witch.solar",
  "dateCreated": "2022-04-02T17:16:55.509Z",
  "datePublished": "2022-04-02T17:10:38.000Z",
  "dateModified": "2022-04-02T17:16:55.509Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 一个微小的太阳能服务器只在白天醒着",
  "headline_zh-Hant": "Show HN: 一個微小的太陽能服務器只在白天醒著",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "太阳女巫是一个接收和显示信息的小网页和服务器，所以我想它是一个小小的留言板。它是用非常可疑的Arduino C编码的。<p>它不是一个24/7的网站。根据电池的状态，服务器本身可能整夜运行，但它在白天收到的所有信息在日落时被删除，而消息功能本身只在日出和日落之间活动。这有两个原因：<p>1. 在夜间少用Solar Witch，可以节省电池电量。<p>2.我喜欢那些不是一直可用的网站的想法。这些网站也需要睡觉。Websites living on servers which aren't somewhere in the cloud, but which are bound to a particular location, giving you a sense of where in the world they actually live.<p>Solar Witch is very much inspired by the solar-powered version of Low Tech Magazine (<a href=\"https://solar.lowtechmagazine.com/\" rel=\"nofollow\">https://solar.lowtechmagazine. com/</a>), but at a far, far smaller scale.<p>PSA: Solar Witch is a teensy hand-written C server running on a teensy microcontroller attached to a teensy solar panel which can only handle one HTTP request at a time and may have buffer overrun issues due to my ineptitude with C. If it's gone down, please don't be surprised, and rest assured I'll hit the reset button soon! 太阳女巫鼓励大家保持耐心。",
  "description_zh-Hant": "太陽女巫是一個接收和顯示信息的小網頁和服務器，所以我想它是一個小小的留言板。它是用非常可疑的Arduino C編碼的。<p>它不是一個24/7的網站。根據電池的狀態，服務器本身可能整夜運行，但它在白天收到的所有信息在日落時被刪除，而消息功能本身只在日出和日落之間活動。這有兩個原因：<p>1. 在夜間少用Solar Witch，可以節省電池電量。<p>2.我喜歡那些不是一直可用的網站的想法。這些網站也需要睡覺。Websites living on servers which aren't somewhere in the cloud, but which are bound to a particular location, giving you a sense of where in the world they actually live.<p>Solar Witch is very much inspired by the solar-powered version of Low Tech Magazine (<a href=\"https://solar.lowtechmagazine.com/\" rel=\"nofollow\">https://solar.lowtechmagazine. com/</a>), but at a far, far smaller scale.<p>PSA: Solar Witch is a teensy hand-written C server running on a teensy microcontroller attached to a teensy solar panel which can only handle one HTTP request at a time and may have buffer overrun issues due to my ineptitude with C. If it's gone down, please don't be surprised, and rest assured I'll hit the reset button soon! 太陽女巫鼓勵大家保持耐心。"
}