{
  "@type": "NewsArticle",
  "identifier": "2022--03--17--en--showhn--HackerNews--NewsArticle--30709570",
  "url": "https://news.ycombinator.com/item?id=30709570",
  "headline": "Show HN: High-Quality NSFW Video App",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi Hacker News!<p>It's safe to say that we all enjoy some quality apps on our phones. But guess what, there's a certain industry that's still clinging to the usability and security standards from the desktop era of the 2010s. Poorly designed UIs, bombardments of ads, random popups, scams, etc. This industry operates in such a shady way that we as users rather keep their products in incognito mode.<p>We say no more and offer you the following solution:<p>USER EXPERIENCE<p>- Mobile first and native-like UI design.\n- Beautiful dark mode that's easy on your eyes.\n- Instant navigations, smooth scrolling, touch gestures.\n- Can be added to the home screen for fullscreen and quick access (PWA).\n- No annoying ads and popups.<p>PRIVACY PROTECTION<p>- All data is stored locally in browser storage. No personal information is sent to servers.\n- All functionality is available without sign up or other personal identification.\n- No Google Analytics. Instead, we use the privacy-focused Fathom Analytics (usefathom.com).\n- No URL paths that expose information in the browsing history. Forward/back navigation still works perfectly.<p>INCLUSIVITY<p>- Only personal (and verified) accounts allowed. No studios or brands. This means that all available content has been approved by their actors and was created consensually. - We welcome all types of sexual orientation and try to provide the best possible service to all of our users.<p>Please note that this product is only intended for persons over the age of 18.<p>Happy swiping!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "ShelbyKU",
    "url": "https://news.ycombinator.com/user?id=ShelbyKU"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30709570",
  "sameAs": "https://fapnite.com",
  "dateCreated": "2022-03-17T10:36:03.180Z",
  "datePublished": "2022-03-17T10:33:31.000Z",
  "dateModified": "2022-03-17T10:36:03.180Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 高质量的NSFW视频应用",
  "headline_zh-Hant": "Show HN: 高質量的NSFW視頻應用",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，Hacker News！<p>可以说，我们都喜欢手机上的一些高质量的应用程序。但你猜怎么着，有某个行业还在坚持2010年代桌面时代的可用性和安全标准。设计不良的UI，广告轰炸，随机弹出的窗口，诈骗，等等。这个行业以如此不光彩的方式运作，以至于我们作为用户宁愿将他们的产品保持在隐身模式下。<p>我们不再说什么，并为您提供以下解决方案：<p>用户体验<p>- 移动优先和类似原生的用户界面设计。\n- 美丽的黑暗模式，对你的眼睛很容易。\n- 即时导航，平滑滚动，触摸手势。\n- 可以添加到主屏幕上，以便全屏和快速访问（PWA）。\n- 没有恼人的广告和弹出窗口。<p>隐私保护<p>- 所有数据都存储在浏览器的本地存储中。没有个人信息被发送到服务器。\n- 所有的功能都可以使用，无需注册或其他个人识别。\n- 没有谷歌分析。相反，我们使用注重隐私的Fathom Analytics（usefathom.com）。\n- 没有暴露浏览历史信息的URL路径。前进/后退导航仍然完美地工作。<p>中立性<p>--只允许个人（和验证的）账户。没有工作室或品牌。这意味着所有可用的内容都已得到其演员的批准，并且是在双方同意的情况下创建的。- 我们欢迎所有类型的性取向，并试图为我们所有的用户提供最好的服务。<p>请注意，本产品只适用于18岁以上的人。<p>祝您刷卡愉快!",
  "description_zh-Hant": "嗨，Hacker News！<p>可以說，我們都喜歡手機上的一些高質量的應用程序。但你猜怎麼著，有某個行業還在堅持2010年代桌面時代的可用性和安全標準。設計不良的UI，廣告轟炸，隨機彈出的窗口，詐騙，等等。這個行業以如此不光彩的方式運作，以至於我們作為用戶寧願將他們的產品保持在隱身模式下。<p>我們不再說什麼，併為您提供以下解決方案：<p>用戶體驗<p>- 移動優先和類似原生的用戶界面設計。\n- 美麗的黑暗模式，對你的眼睛很容易。\n- 即時導航，平滑滾動，觸摸手勢。\n- 可以添加到主屏幕上，以便全屏和快速訪問（PWA）。\n- 沒有惱人的廣告和彈出窗口。<p>隱私保護<p>- 所有數據都存儲在瀏覽器的本地存儲中。沒有個人信息被髮送到服務器。\n- 所有的功能都可以使用，無需註冊或其他個人識別。\n- 沒有谷歌分析。相反，我們使用注重隱私的Fathom Analytics（usefathom.com）。\n- 沒有暴露瀏覽歷史信息的URL路徑。前進/後退導航仍然完美地工作。<p>中立性<p>--只允許個人（和驗證的）賬戶。沒有工作室或品牌。這意味著所有可用的內容都已得到其演員的批准，並且是在雙方同意的情況下創建的。- 我們歡迎所有類型的性取向，並試圖為我們所有的用戶提供最好的服務。<p>請注意，本產品只適用於18歲以上的人。<p>祝您刷卡愉快!"
}