{
  "@type": "NewsArticle",
  "identifier": "2022--02--26--en--showhn--HackerNews--NewsArticle--30483022",
  "url": "https://news.ycombinator.com/item?id=30483022",
  "headline": "Show HN: A Brand Guidelines Online builder for owners and managers",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN !<p>My name is Satyam, i am a french startup founder (currently building a pos for restaurant), localized in The Caribbean and was struggling centralizing all brand and design assets to communicate with contractors, PR execs, collaborators and partners.<p>In fact, In the same day, my Sales guys ask me for an email template for prospecting, marketing agencies i was putting in competition asked me a ton of details on my branding that i HAVE but takes couple of hours to search, format and send, i have noticed also that my dev made subtle colors variations of red through our app on the different buttons,...  I have searched for a dead simple tool for centralizing, in an effective way and sharing brand assets and i finish by building it myself. think about the &quot;Design / Brand guidelines&quot; section of big internet brands websites,  i was searching for an online creator for that kind of pages.<p>Every tool i have found was big BAM (Brand Assets Management) tools for big corps, or arty tools by and for designers. Not the startup founder / CEO / CMO / PM dedicated tool i was searching for.<p>So after 2 weeks of coding here is bwandy. I will be very pleased to have some descent feedback to know if i was the only one to have the problem. You can sign up free without credit cart (find the corresponding link in the start trial page). Thanks you a lot guys !!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "satyamdorville",
    "url": "https://news.ycombinator.com/user?id=satyamdorville"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30483022",
  "sameAs": "https://www.bwandy.com",
  "dateCreated": "2022-02-26T23:30:35.724Z",
  "datePublished": "2022-02-26T23:14:55.000Z",
  "dateModified": "2022-02-26T23:30:35.724Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 为业主和经理人提供的品牌指南在线构建器",
  "headline_zh-Hant": "Show HN: 為業主和經理人提供的品牌指南在線構建器",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN！<p>我的名字叫Satyam，我是一个法国创业公司的创始人（目前正在为餐厅建立一个pos机），在加勒比海地区，我正在努力集中所有的品牌和设计资产来与承包商、公关主管、合作者和合作伙伴沟通。 <p>事实上，在同一天里，我的销售人员向我要了一个电子邮件模板，我在竞争中的营销机构向我要了一大堆关于我的品牌的细节，我已经有了，但需要几个小时来搜索、格式化和发送，我还注意到我的开发人员在我们的应用程序的不同按钮上做了微妙的红色变化。 我一直在寻找一个简单的工具来集中、有效地分享品牌资产，我通过自己建立它来完成。想想大型互联网品牌网站的&quot;设计/品牌指南&quot;部分，我一直在寻找一个在线创建者来创建这种页面。而不是我正在寻找的创业公司创始人/CEO/CMO/PM专用工具。<p>因此，经过2个星期的编码，这就是bwandy。我很高兴得到一些后裔的反馈，以了解我是否是唯一有这个问题的人。你可以免费注册，不需要信用卡（在开始试用页面找到相应链接）。非常感谢你们！!",
  "description_zh-Hant": "你好，HN！<p>我的名字叫Satyam，我是一個法國創業公司的創始人（目前正在為餐廳建立一個pos機），在加勒比海地區，我正在努力集中所有的品牌和設計資產來與承包商、公關主管、合作者和合作夥伴溝通。 <p>事實上，在同一天裡，我的銷售人員向我要了一個電子郵件模板，我在競爭中的營銷機構向我要了一大堆關於我的品牌的細節，我已經有了，但需要幾個小時來搜索、格式化和發送，我還注意到我的開發人員在我們的應用程序的不同按鈕上做了微妙的紅色變化。 我一直在尋找一個簡單的工具來集中、有效地分享品牌資產，我通過自己建立它來完成。想想大型互聯網品牌網站的&quot;設計/品牌指南&quot;部分，我一直在尋找一個在線創建者來創建這種頁面。而不是我正在尋找的創業公司創始人/CEO/CMO/PM專用工具。<p>因此，經過2個星期的編碼，這就是bwandy。我很高興得到一些後裔的反饋，以瞭解我是否是唯一有這個問題的人。你可以免費註冊，不需要信用卡（在開始試用頁面找到相應鏈接）。非常感謝你們！!"
}