{
  "@type": "NewsArticle",
  "identifier": "2022--03--31--en--showhn--HackerNews--NewsArticle--30865627",
  "url": "https://news.ycombinator.com/item?id=30865627",
  "headline": "Show HN: No-communication-boilerplate Stateful Serverless",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": " Hi HN! We're Sebas and Elias, and we are building Telekinesis: a serverless platform aimed to make it easy to deploy complex applications.<p>We love serverless because it abstracts away the infrastructure but we think we can take it a step further: abstract away the communication. Effectively, a place where you just code any function or class, we run it in the cloud, and then let you connect securely to it. To be truly easy, it has to support:<p>- stateful objects: you can instantiate classes and manipulate them through our secured websockets connection<p>- any pip/npm package dependencies: we'll keep a container with your dependencies ready to run your code when your service is invoked<p>Since now these services would be pure logic, we can efficiently compose them, just like with open source (pip or npm) packages. However, there would be one key difference, here you can put a price on your code. In this setup, developers could opt in to have their code become open source automatically after a certain amount of time or if it hits an income threshold.<p>We're a long way from the &quot;function marketplace&quot; idea, but we have an early version of the serverless platform you can try at https://www.telekinesis.cloud.<p>We are looking for our first users to try our product. We're especially interested in working closely with anyone that's building a prototype. If you are interested you can register for early access or email us at contact@telekinesis.cloud<p>Lastly, if you share any feedback below it would have an enormous value for us. Thanks everyone!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "eneuman",
    "url": "https://news.ycombinator.com/user?id=eneuman"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30865627",
  "sameAs": "https://news.ycombinator.com/item?id=30865627",
  "dateCreated": "2022-03-31T10:35:08.318Z",
  "datePublished": "2022-03-31T10:26:01.000Z",
  "dateModified": "2022-03-31T10:35:08.318Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 无通信的锅炉模板 有状态的无服务器",
  "headline_zh-Hant": "Show HN: 無通信的鍋爐模板 有狀態的無服務器",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": " 嗨，HN! 我们是Sebas和Elias，我们正在建立Telekinesis：一个无服务器平台，旨在使复杂的应用程序的部署变得简单。<p>我们喜欢无服务器，因为它抽象出了基础设施，但我们认为我们可以更进一步：抽象出通信。实际上，在这个地方，你只需编码任何函数或类，我们在云中运行它，然后让你安全地连接到它。要做到真正的简单，它必须支持：<p>- 有状态的对象：你可以实例化类，并通过我们安全的websockets连接来操作它们<p>- 任何pip/npm包的依赖性：我们将保持一个容器，当你的服务被调用时，你的依赖性准备好运行你的代码<p>因为现在这些服务将是纯逻辑的，我们可以有效地组成它们，就像使用开源（pip或npm）包。然而，有一个关键的区别，在这里你可以给你的代码定价。在这种设置中，开发者可以选择在一定时间后或达到收入门槛时让他们的代码自动成为开源。<p>我们离&quot;功能市场&quot;的想法还有一段距离，但我们有一个早期版本的无服务器平台，你可以在https://www.telekinesis.cloud。<p>我们正在寻找第一批用户来尝试我们的产品。我们特别希望与正在构建原型的任何人密切合作。如果你有兴趣，你可以注册早期访问，或者给我们发邮件：contact@telekinesis.cloud<p>最后，如果你在下面分享任何反馈，这对我们将有巨大的价值。谢谢大家!",
  "description_zh-Hant": " 嗨，HN! 我們是Sebas和Elias，我們正在建立Telekinesis：一個無服務器平臺，旨在使複雜的應用程序的部署變得簡單。<p>我們喜歡無服務器，因為它抽象出了基礎設施，但我們認為我們可以更進一步：抽象出通信。實際上，在這個地方，你只需編碼任何函數或類，我們在雲中運行它，然後讓你安全地連接到它。要做到真正的簡單，它必須支持：<p>- 有狀態的對象：你可以實例化類，並通過我們安全的websockets連接來操作它們<p>- 任何pip/npm包的依賴性：我們將保持一個容器，當你的服務被調用時，你的依賴性準備好運行你的代碼<p>因為現在這些服務將是純邏輯的，我們可以有效地組成它們，就像使用開源（pip或npm）包。然而，有一個關鍵的區別，在這裡你可以給你的代碼定價。在這種設置中，開發者可以選擇在一定時間後或達到收入門檻時讓他們的代碼自動成為開源。<p>我們離&quot;功能市場&quot;的想法還有一段距離，但我們有一個早期版本的無服務器平臺，你可以在https://www.telekinesis.cloud。<p>我們正在尋找第一批用戶來嘗試我們的產品。我們特別希望與正在構建原型的任何人密切合作。如果你有興趣，你可以註冊早期訪問，或者給我們發郵件：contact@telekinesis.cloud<p>最後，如果你在下面分享任何反饋，這對我們將有巨大的價值。謝謝大家!"
}