{
  "@type": "NewsArticle",
  "identifier": "2022--03--17--en--showhn--HackerNews--NewsArticle--30706193",
  "url": "https://news.ycombinator.com/item?id=30706193",
  "headline": "Show HN: Build predictive models with no prior ML experience",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "TLDR: Product developers need tools designed for them to build ML models. We’d love for you to try a demo of Mage without needing to sign up: https://www.mage.ai/onboarding<p>My name is Tommy DANGerous (or Tommy Dang) and I’m the CEO and co-founder at Mage. I worked at Airbnb for over 5 years as a product developer building features for guests.<p>Mage is a web-based tool for building, training, and deploying ML models that make predictions based off your data.<p>Training and using ML models in production typically requires working knowledge of building data pipelines, algorithms, infrastructure for deployment and inference, and more. Because of this highly specialized skillset, mostly data scientists and ML engineers are the only ones able to build and use ML models. Existing ML tools cater to this audience.<p>Over my 5+ years at Airbnb, I helped build and launch the Airbnb Experiences product, created ML models before and after we had in-house tooling, and built a devtool platform called Omni. I worked with 100s of product developers across the company and saw that they knew how ML is being used and had ideas on how they would apply ML to their specific feature. However, they relied on data science resource to help them implement their ideas even though we had ML tools built in-house for data scientists.<p>Mage is a low-code tool that you can access via your web browser. You can build ML models through our user interface. How it works:<p>1. First, you add data by uploading a file or connecting to data source like Amplitude, AWS Redshift, S3, Snowflake, GCP BigQuery, etc. Once you add your data, we store it on AWS S3 for fast retrieval and transformations. \n2. Next step is you are given suggestions on how to enhance your dataset. You can perform functions like filtering, aggregating, adding columns, etc. We provide a GUI for you to perform these transformations. Behind the scenes, we’re translating your input into code using the Pandas API.\n3. Once you’re done preparing and cleaning your data, we’ll train your model by launching a few data pipelines in Airflow, use Spark to build your training data, and then run our proprietary ML pipeline to train your model.\n4. Finally, when you’re ready to use the model, we’ll deploy your model to an online API endpoint that is running on AWS ECS. You can get your model’s predictions via a POST request.<p>Existing ML tools are designed and built for data scientists and ML engineers. Mage is designed and built for product developers by product developers. This means we designed our tool to be usable by someone with no ML experience and we provide guided suggestions throughout the process to help educate users and help them become an ML expert.<p>We’d love for you to try a demo of Mage without needing to sign up: https://www.mage.ai/onboarding. If you love it and want to use the entire set of features, you can sign up and use it for free (the best developers tools are free!). Thank you so much, your support is ultra appreciated!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "TommyDANGerous",
    "url": "https://news.ycombinator.com/user?id=TommyDANGerous"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30706193",
  "sameAs": "https://news.ycombinator.com/item?id=30706193",
  "dateCreated": "2022-03-17T02:06:18.310Z",
  "datePublished": "2022-03-17T00:54:23.000Z",
  "dateModified": "2022-03-17T02:06:18.310Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 27
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "Show HN: 在没有ML经验的情况下建立预测模型",
  "headline_zh-Hant": "Show HN: 在沒有ML經驗的情況下建立預測模型",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "TLDR：产品开发人员需要为他们设计的工具来建立ML模型。我们很乐意让你尝试一下Mage的演示，而不需要注册：https://www.mage.ai/onboarding<p>我的名字是Tommy DANGerous（或Tommy Dang），我是Mage的CEO和联合创始人。<p>Mage是一个基于网络的工具，用于构建、训练和部署ML模型，根据你的数据进行预测。<p>在生产中训练和使用ML模型通常需要具备构建数据管道、算法、部署和推理的基础设施等方面的工作知识。由于这种高度专业化的技能组合，大多数数据科学家和ML工程师是唯一能够构建和使用ML模型的人。<p>在Airbnb工作的5年多时间里，我帮助建立并推出了Airbnb体验产品，在我们拥有内部工具之前和之后创建了ML模型，并建立了一个名为Omni的开发工具平台。我与整个公司的100多名产品开发人员合作，看到他们知道如何使用ML，并对如何将ML应用到他们的具体功能有想法。然而，他们依赖数据科学资源来帮助他们实现他们的想法，尽管我们有为数据科学家构建的内部ML工具。<p>Mage是一个低代码工具，你可以通过你的网络浏览器访问。你可以通过我们的用户界面建立ML模型。它是如何工作的：<p>1. 首先，你通过上传文件或连接到Amplitude、AWS Redshift、S3、Snowflake、GCP BigQuery等数据源添加数据。一旦你添加了你的数据，我们将其存储在AWS S3上，以便快速检索和转换。\n2. 下一步是给你提供关于如何增强你的数据集的建议。你可以执行过滤、聚合、添加列等功能。我们为你提供一个GUI来执行这些转换。在幕后，我们使用Pandas API将你的输入翻译成代码。\n3. 一旦你完成了数据的准备和清理，我们将通过在Airflow中启动一些数据管道来训练你的模型，使用Spark来建立你的训练数据，然后运行我们专有的ML管道来训练你的模型。\n4. 最后，当你准备好使用该模型时，我们将把你的模型部署到运行在AWS ECS上的在线API端点。你可以通过POST请求获得你的模型的预测结果。<p>现有的ML工具是为数据科学家和ML工程师设计和建造的。Mage是由产品开发人员为产品开发人员设计和建造的。这意味着我们设计的工具可供没有ML经验的人使用，并且我们在整个过程中提供指导性建议，以帮助教育用户并帮助他们成为ML专家。<p>我们很希望你能尝试Mage的演示，而不需要注册：https://www.mage.ai/onboarding。如果你喜欢它并想使用整套功能，你可以注册并免费使用它（最好的开发者工具是免费的！）。非常感谢你，你的支持是非常值得赞赏的!",
  "description_zh-Hant": "TLDR：產品開發人員需要為他們設計的工具來建立ML模型。我們很樂意讓你嘗試一下Mage的演示，而不需要註冊：https://www.mage.ai/onboarding<p>我的名字是Tommy DANGerous（或Tommy Dang），我是Mage的CEO和聯合創始人。<p>Mage是一個基於網絡的工具，用於構建、訓練和部署ML模型，根據你的數據進行預測。<p>在生產中訓練和使用ML模型通常需要具備構建數據管道、算法、部署和推理的基礎設施等方面的工作知識。由於這種高度專業化的技能組合，大多數數據科學家和ML工程師是唯一能夠構建和使用ML模型的人。<p>在Airbnb工作的5年多時間裡，我幫助建立並推出了Airbnb體驗產品，在我們擁有內部工具之前和之後創建了ML模型，並建立了一個名為Omni的開發工具平臺。我與整個公司的100多名產品開發人員合作，看到他們知道如何使用ML，並對如何將ML應用到他們的具體功能有想法。然而，他們依賴數據科學資源來幫助他們實現他們的想法，儘管我們有為數據科學家構建的內部ML工具。<p>Mage是一個低代碼工具，你可以通過你的網絡瀏覽器訪問。你可以通過我們的用戶界面建立ML模型。它是如何工作的：<p>1. 首先，你通過上傳文件或連接到Amplitude、AWS Redshift、S3、Snowflake、GCP BigQuery等數據源添加數據。一旦你添加了你的數據，我們將其存儲在AWS S3上，以便快速檢索和轉換。\n2. 下一步是給你提供關於如何增強你的數據集的建議。你可以執行過濾、聚合、添加列等功能。我們為你提供一個GUI來執行這些轉換。在幕後，我們使用Pandas API將你的輸入翻譯成代碼。\n3. 一旦你完成了數據的準備和清理，我們將通過在Airflow中啟動一些數據管道來訓練你的模型，使用Spark來建立你的訓練數據，然後運行我們專有的ML管道來訓練你的模型。\n4. 最後，當你準備好使用該模型時，我們將把你的模型部署到運行在AWS ECS上的在線API端點。你可以通過POST請求獲得你的模型的預測結果。<p>現有的ML工具是為數據科學家和ML工程師設計和建造的。Mage是由產品開發人員為產品開發人員設計和建造的。這意味著我們設計的工具可供沒有ML經驗的人使用，並且我們在整個過程中提供指導性建議，以幫助教育用戶並幫助他們成為ML專家。<p>我們很希望你能嘗試Mage的演示，而不需要註冊：https://www.mage.ai/onboarding。如果你喜歡它並想使用整套功能，你可以註冊並免費使用它（最好的開發者工具是免費的！）。非常感謝你，你的支持是非常值得讚賞的!"
}