{
  "@type": "NewsArticle",
  "identifier": "2022--03--18--en--showhn--HackerNews--NewsArticle--30724127",
  "url": "https://news.ycombinator.com/item?id=30724127",
  "headline": "Show HN: Find and Research the Right Electric Car Based on Your Specific Needs",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN! We are looking for feedback on the Electric Driver, a site that helps car shoppers easily more objectively find the right electric car that more closely matches their unique needs.<p>Having gone through the process of researching and buying an electric vehicle and helping others we learned that car research sites do not meet the needs of electric vehicle consumers.<p>Specifically, we developed a new process for researching electric vehicles that more closely aligns with how consumers evaluate and make purchase decisions.<p>Needs-Based Search: The auto industry today uses a year, make and model or search by body style to search for vehicles. The problem with this method of search is if a person does not know what specific vehicle, they want they are forced to wade through most vehicles looking for the ones that meet their criteria. We developed a new method of search that asks the shopper what criteria (Eg. I want a safe, reliable, fuel-efficient 5-seater under $35K that can go 200 miles on a single charge) is important to them to electric vehicles that best meet their needs.<p>Comparison Based Shopping: We developed a new method of comparison shop based on the three strongest candidates based on your needs. Based on what criteria you told us was important to you we compare and show the trade-offs between each electric vehicle and highlight the vehicle that most closely matches your needs. We believe people by natural use comparisons.<p>Personalized Electric Vehicle Information: based on your location and other criteria we show you what it costs to drive a mile in a specific electric vehicle versus gas in your area. We show the consumer expected maintenance and insurance costs look like versus gas and we also show you want compatible chargers are available in your area. We also explain the environmental impact of switching from gas to electricity. Based on your location your electricity may be generated from Coal, natural gas, nuclear, hydro, or renewables. We show what your state power mix looks like can calculate the estimated carbon emission from buying from the utility.<p>Our goal is to educate and help car shoppers find the right electric vehicle that fits their needs.\nThis project has been bootstrapped.<p>We are looking for feedback beyond our friends and family and the limited group of people we have been testing with. As you go through the site was questions you have did we not address, what could we do better, and anything else you want to share.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "electricdriver",
    "url": "https://news.ycombinator.com/user?id=electricdriver"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30724127",
  "sameAs": "https://electricdriver.co",
  "dateCreated": "2022-03-18T16:45:40.877Z",
  "datePublished": "2022-03-18T16:18:09.000Z",
  "dateModified": "2022-03-18T16:45:40.877Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 根据你的具体需求寻找和研究合适的电动汽车",
  "headline_zh-Hant": "Show HN: 根據你的具體需求尋找和研究合適的電動汽車",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! 我们正在寻找关于 \"电动车司机 \"的反馈意见，这个网站可以帮助购车者轻松地、更客观地找到更符合他们独特需求的合适的电动车。<p>在经历了研究和购买电动车以及帮助他人的过程后，我们了解到，汽车研究网站并不能满足电动车消费者的需求。<p>具体而言，我们开发了一个研究电动车的新流程，它与消费者评估和做出购买决定的方式更加一致。今天的汽车行业使用年份、品牌和型号或按车身样式搜索来搜索车辆。这种搜索方法的问题是，如果一个人不知道他们想要什么具体的车辆，他们就不得不在大多数车辆中穿行，寻找符合他们标准的车辆。我们开发了一种新的搜索方法，询问购物者什么标准（例如，我想要一个安全、可靠、燃油效率高的5座车，价格在3.5万美元以下，一次充电可以走200英里）对他们来说很重要，以使电动汽车最能满足他们的需求。我们开发了一种新的比较购物方法，根据你的需求，在三个最强的候选人基础上进行比较。基于你告诉我们什么标准对你很重要，我们比较并显示每辆电动车之间的权衡，并突出显示最符合你需求的车辆。我们相信人们通过自然的使用比较。<p>个性化的电动车信息：基于你的位置和其他标准，我们向你展示在你的地区驾驶特定的电动车与汽油相比，一英里的成本是多少。我们显示消费者预期的维护和保险费用与汽油相比的情况，我们还显示你所在地区有哪些兼容的充电器。我们还解释了从天然气到电力的环境影响。根据你的位置，你的电力可能来自煤炭、天然气、核能、水力或可再生能源。我们显示了你所在州的电力组合情况，可以计算出从公用事业部门购买的估计碳排放量。<p>我们的目标是教育和帮助购车者找到适合他们需求的电动汽车。\n这个项目是自筹资金的。<p>我们正在寻找朋友和家人以及我们一直在测试的有限人群以外的反馈。当你浏览网站时，你有什么问题是我们没有解决的，我们可以做得更好，以及你想分享的其他东西。",
  "description_zh-Hant": "嗨，HN! 我們正在尋找關於 \"電動車司機 \"的反饋意見，這個網站可以幫助購車者輕鬆地、更客觀地找到更符合他們獨特需求的合適的電動車。<p>在經歷了研究和購買電動車以及幫助他人的過程後，我們瞭解到，汽車研究網站並不能滿足電動車消費者的需求。<p>具體而言，我們開發了一個研究電動車的新流程，它與消費者評估和做出購買決定的方式更加一致。今天的汽車行業使用年份、品牌和型號或按車身樣式搜索來搜索車輛。這種搜索方法的問題是，如果一個人不知道他們想要什麼具體的車輛，他們就不得不在大多數車輛中穿行，尋找符合他們標準的車輛。我們開發了一種新的搜索方法，詢問購物者什麼標準（例如，我想要一個安全、可靠、燃油效率高的5座車，價格在3.5萬美元以下，一次充電可以走200英里）對他們來說很重要，以使電動汽車最能滿足他們的需求。我們開發了一種新的比較購物方法，根據你的需求，在三個最強的候選人基礎上進行比較。基於你告訴我們什麼標準對你很重要，我們比較並顯示每輛電動車之間的權衡，並突出顯示最符合你需求的車輛。我們相信人們通過自然的使用比較。<p>個性化的電動車信息：基於你的位置和其他標準，我們向你展示在你的地區駕駛特定的電動車與汽油相比，一英里的成本是多少。我們顯示消費者預期的維護和保險費用與汽油相比的情況，我們還顯示你所在地區有哪些兼容的充電器。我們還解釋了從天然氣到電力的環境影響。根據你的位置，你的電力可能來自煤炭、天然氣、核能、水力或可再生能源。我們顯示了你所在州的電力組合情況，可以計算出從公用事業部門購買的估計碳排放量。<p>我們的目標是教育和幫助購車者找到適合他們需求的電動汽車。\n這個項目是自籌資金的。<p>我們正在尋找朋友和家人以及我們一直在測試的有限人群以外的反饋。當你瀏覽網站時，你有什麼問題是我們沒有解決的，我們可以做得更好，以及你想分享的其他東西。"
}