{
  "@type": "NewsArticle",
  "identifier": "2022--04--12--en--showhn--HackerNews--NewsArticle--31006716",
  "url": "https://news.ycombinator.com/item?id=31006716",
  "headline": "Show HN: Razer x Lambda Tensorbook",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi all, long time lurker, first time poster.<p>I want to share with you all something we've been working on for a while at Lambda: the Razer x Lambda Tensorbook: https://www.youtube.com/watch?v=wMh6Dhq7P_Q<p>But before I tell you about it, I want to make this all about me, because I built this for me.<p>See, while I'm genuinely interested in hearing from the community what you think as this is the culmination of a lot of effort from a lot of people across so many different fields (seriously, the number of folks across manufacturing, engineering, design, logistics, and marketing who have had to work together to launch this is nuts), I really just want to tie Tensorbook's motivations back to a larger personal narrative to explain why I'm so proud.<p>So, flashback to 2018, and I'm a hardware engineer focusing on the compute system at Lyft's autonomous vehicle (AV) program, Level5 (L5). Here was a project that that would save lives, that would improve the human condition, that was all ready to go. I saw my role as coming in to product-ize, to take what was close to the finish line and get it over it. The disappointment was pretty brutal when I realized just how wrong I was.<p>It's one thing to nod along when reading Knuth write &quot;premature optimization is the root of all evil&quot;; it's another to experience it firsthand.<p>At Lyft L5 I thought I would be applying specialized inference accelerators (Habana, Groq, Graphcore, etc.) into the vehicle compute system. Instead, the only requirement that mattered org-wide was: &quot;Don't do anything that slows down the perception team&quot;. Forget testing silicon with the potential to reduce power requirements by 10x, I was lucky to get a willing ear to hear my case for changing a flag in the TensorFlow runtime to perform inference at FP16 instead of FP32.<p>Don't get me wrong, there were a multitude of other difficult technical challenges to solve outside of the deep learning ones that were gating, but I had underestimated just how not-ready the CNNs for object detection and classification were. Something I thought was a solved problem was very much not, and ultimately resulted in my team and others building a 5,000 watt monster of server (+ power distribution, + thermals, + chassis, etc etc) that took up an entire rear row of seating. I'm happy to talk about that experience in the comments because I have a lot of fond memories from my time there.<p>Anyway, the takeaway I have from Lyft, and my first motivation here is that there is no such thing as over-provisioning or too much compute in a deep learning engineer's mind. Anything less than the most possible is a detriment to their workflow. I still truly believe AVs will save lives; so by extension, enabling deep learning engineers enables AVs enables improvement to the human condition. Transitive property, :thumbsup:<p>So moving on, my next experience is characterized by working closely with the least technical people I have ever had the opportunity to work with in my life. And I mean opportunity genuinely, because doing so gave me so much perspective on the things that you and I here probably take for granted. (How do we know that Ctrl+Alt+T will open a terminal? Why does `touch` make a file? How do I quit vim?)<p>So, the takeaway from my previous role, and motivation #2 for me is that computers can be so unaccessible in surprising ways. I have a deep respect and appreciation for Linux, and I want others to see things the same way, so anything I can do to make that process easier and help them &quot;self-serve&quot; or &quot;bootstrap&quot; to my level of understanding, is something worth doing to me.<p>So, with those two personal motivations outlined, I present to you, for your consideration, the Razer x Lambda Tensorbook. A laptop with a no-compromise approach to speeds-and-feeds and shipping with OEM support for Ubuntu.<p>sincerely,\nVinay. Product Marketing @ Lambda",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "vimeh",
    "url": "https://news.ycombinator.com/user?id=vimeh"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31006716",
  "sameAs": "https://news.ycombinator.com/item?id=31006716",
  "dateCreated": "2022-04-12T18:54:53.398Z",
  "datePublished": "2022-04-12T18:42:18.000Z",
  "dateModified": "2022-04-12T18:54:53.398Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Razer x Lambda Tensorbook",
  "headline_zh-Hant": "Show HN: Razer x Lambda Tensorbook",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>我想与大家分享我们在Lambda已经工作了一段时间的东西：Razer x Lambda Tensorbook：https://www.youtube.com/watch?v=wMh6Dhq7P_Q<p>但在我告诉你们之前，我想让这一切都与我有关，因为这是我为自己建造的。 <p>虽然我真的很想听听社区的意见，因为这是许多人在许多不同领域的努力的结晶（说真的，制造、工程、设计、物流和营销等领域的人必须一起工作才能推出这个产品，这真是太疯狂了），但我真的只是想把Tensorbook的动机与更大的个人叙事联系起来，解释我为什么如此自豪。 <p>因此，回到2018年，我是一名硬件工程师，专注于Lyft的自动驾驶车辆（AV）项目Level5（L5）的计算系统。这是一个将拯救生命、改善人类状况的项目，一切准备就绪。我认为我的角色是将其产品化，将接近终点的东西拿过来，让它过关。<p>当读到Knuth写的 \"过早优化是万恶之源 \"时，点头是一回事，亲身体验又是另一回事。<p>在Lyft L5，我以为我会将专门的推理加速器（Habana、Groq、Graphcore等）应用于车辆计算系统。相反，在整个组织范围内，唯一重要的要求是：&quot;不要做任何会拖累感知团队的事情&quot;。忘了测试有可能将功率要求降低10倍的芯片吧，我很幸运地得到了一个愿意倾听我关于改变TensorFlow运行时的标志以在FP16而不是FP32执行推理的案例。<p>不要误解我，在深度学习之外还有许多其他困难的技术挑战需要解决，但我低估了CNN对于物体检测和分类的准备程度。一些我认为已经解决的问题在很大程度上没有解决，最终导致我的团队和其他人建立了一个5000瓦的服务器怪物（+配电，+热能，+机箱，等等等等），占据了整个后排的座位。我很乐意在评论中谈论那段经历，因为我在那里有很多美好的回忆。<p>无论如何，我从Lyft那里得到的收获，以及我在这里的第一个动机是，在深度学习工程师的头脑中，没有过度配置或太多的计算量这回事。任何低于最多可能的东西都是对他们工作流程的损害。我仍然真正相信AV会拯救生命；所以推而广之，使深度学习工程师能够使AV能够改善人类状况。转移属性，：大拇指：<p>所以继续，我的下一个经历的特点是与我一生中最没有机会合作的技术人员紧密合作。我指的是真正的机会，因为这样做让我对那些你和我在这里可能认为理所当然的事情有了很多看法。(我们怎么知道Ctrl+Alt+T会打开一个终端？为什么 \"touch \"会生成一个文件？如何退出vim？）<p>因此，我从以前的角色中得到的收获，以及对我来说的第二个动机是，计算机可以在令人惊讶的方面变得如此难以接近。我对Linux有着深深的敬意和欣赏，我希望其他人也能以同样的方式看待问题，所以任何我可以做的事情，使这个过程更容易，并帮助他们&quot;自我服务&quot;或&quot;引导&quot;到我的理解水平，对我来说是值得做的事情。<p>因此，在概述了这两个个人动机之后，我向你介绍，供你考虑，Razer x Lambda Tensorbook。一台对速度和饲料不作任何妥协的笔记本电脑，并为Ubuntu提供OEM支持。\nVinay. 产品营销 @ Lambda",
  "description_zh-Hant": "<p>我想與大家分享我們在Lambda已經工作了一段時間的東西：Razer x Lambda Tensorbook：https://www.youtube.com/watch?v=wMh6Dhq7P_Q<p>但在我告訴你們之前，我想讓這一切都與我有關，因為這是我為自己建造的。 <p>雖然我真的很想聽聽社區的意見，因為這是許多人在許多不同領域的努力的結晶（說真的，製造、工程、設計、物流和營銷等領域的人必須一起工作才能推出這個產品，這真是太瘋狂了），但我真的只是想把Tensorbook的動機與更大的個人敘事聯繫起來，解釋我為什麼如此自豪。 <p>因此，回到2018年，我是一名硬件工程師，專注於Lyft的自動駕駛車輛（AV）項目Level5（L5）的計算系統。這是一個將拯救生命、改善人類狀況的項目，一切準備就緒。我認為我的角色是將其產品化，將接近終點的東西拿過來，讓它過關。<p>當讀到Knuth寫的 \"過早優化是萬惡之源 \"時，點頭是一回事，親身體驗又是另一回事。<p>在Lyft L5，我以為我會將專門的推理加速器（Habana、Groq、Graphcore等）應用於車輛計算系統。相反，在整個組織範圍內，唯一重要的要求是：&quot;不要做任何會拖累感知團隊的事情&quot;。忘了測試有可能將功率要求降低10倍的芯片吧，我很幸運地得到了一個願意傾聽我關於改變TensorFlow運行時的標誌以在FP16而不是FP32執行推理的案例。<p>不要誤解我，在深度學習之外還有許多其他困難的技術挑戰需要解決，但我低估了CNN對於物體檢測和分類的準備程度。一些我認為已經解決的問題在很大程度上沒有解決，最終導致我的團隊和其他人建立了一個5000瓦的服務器怪物（+配電，+熱能，+機箱，等等等等），佔據了整個後排的座位。我很樂意在評論中談論那段經歷，因為我在那裡有很多美好的回憶。<p>無論如何，我從Lyft那裡得到的收穫，以及我在這裡的第一個動機是，在深度學習工程師的頭腦中，沒有過度配置或太多的計算量這回事。任何低於最多可能的東西都是對他們工作流程的損害。我仍然真正相信AV會拯救生命；所以推而廣之，使深度學習工程師能夠使AV能夠改善人類狀況。轉移屬性，：大拇指：<p>所以繼續，我的下一個經歷的特點是與我一生中最沒有機會合作的技術人員緊密合作。我指的是真正的機會，因為這樣做讓我對那些你和我在這裡可能認為理所當然的事情有了很多看法。(我們怎麼知道Ctrl+Alt+T會打開一個終端？為什麼 \"touch \"會生成一個文件？如何退出vim？）<p>因此，我從以前的角色中得到的收穫，以及對我來說的第二個動機是，計算機可以在令人驚訝的方面變得如此難以接近。我對Linux有著深深的敬意和欣賞，我希望其他人也能以同樣的方式看待問題，所以任何我可以做的事情，使這個過程更容易，並幫助他們&quot;自我服務&quot;或&quot;引導&quot;到我的理解水平，對我來說是值得做的事情。<p>因此，在概述了這兩個個人動機之後，我向你介紹，供你考慮，Razer x Lambda Tensorbook。一臺對速度和飼料不作任何妥協的筆記本電腦，併為Ubuntu提供OEM支持。\nVinay. 產品營銷 @ Lambda"
}