{
  "@type": "NewsArticle",
  "identifier": "2022--03--27--en--showhn--HackerNews--NewsArticle--30821488",
  "url": "https://news.ycombinator.com/item?id=30821488",
  "headline": "Show HN: 3by3 – discover fresh podcasts by answering three simple questions",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "3by3 is a fun side project, I built over a weekend during one of the Pandemic's lockdowns. For some reason, it remained just that - a side project. I like it, maybe others will do too.<p>Built using Svelte on the frontend, Go on the backend, and PostgreSQL for storage. Hosted on Netlify.<p>Below is the official About of the project:<p>3by3 is a fun way of discovering podcasts by answering three simple questions. It grew out of my desire to introduce the magic of podcasting to more people. The podcasting space exploded over the last few years. There is now more content for every taste than ever before. And yet, finding one's way in the ocean of audio remained just as difficult.<p>Rather than going for popular choices, I built 3by3 with the idea of getting to know you, the listener, better. Answering three simple questions is enough to give 3by3 an idea of what you would love to listen to. Not a perfect match? Start over, and you will get a new set in a few seconds. Come back as often as you would like. We are constantly adding more questions and podcasts to our database. We are sure that your matches will become better and better over time.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "p5v",
    "url": "https://news.ycombinator.com/user?id=p5v"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30821488",
  "sameAs": "https://3by3.app/",
  "dateCreated": "2022-03-27T16:43:46.105Z",
  "datePublished": "2022-03-27T16:21:31.000Z",
  "dateModified": "2022-03-27T16:43:46.105Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 3by3 - 通过回答三个简单的问题发现新鲜的播客节目",
  "headline_zh-Hant": "Show HN: 3by3 - 通過回答三個簡單的問題發現新鮮的播客節目",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "3by3是一个有趣的副业，是我在Pandemic的一次封锁期间用一个周末完成的。由于某些原因，它仍然只是一个副业。我喜欢它，也许其他人也会喜欢。<p>前台使用Svelte，后台使用Go，存储使用PostgreSQL。下面是这个项目的官方介绍：<p>3by3是一种通过回答三个简单问题来发现播客的有趣方式。它源于我想把播客的魔力介绍给更多人的愿望。在过去的几年里，播客空间爆炸性增长。现在有比以往任何时候都更多的内容来满足各种口味。然而，在音频的海洋中找到自己的方式仍然同样困难。<p>我建立3by3的目的是为了更好地了解你--听众，而不是去寻找流行的选择。回答三个简单的问题，就足以让3by3了解你喜欢听什么。不是一个完美的匹配？重新开始，你将在几秒钟内得到一个新的节目。只要你愿意，可以经常回来。我们正在不断向我们的数据库添加更多的问题和播客。我们确信，随着时间的推移，你的匹配会越来越好。",
  "description_zh-Hant": "3by3是一個有趣的副業，是我在Pandemic的一次封鎖期間用一個週末完成的。由於某些原因，它仍然只是一個副業。我喜歡它，也許其他人也會喜歡。<p>前臺使用Svelte，後臺使用Go，存儲使用PostgreSQL。下面是這個項目的官方介紹：<p>3by3是一種通過回答三個簡單問題來發現播客的有趣方式。它源於我想把播客的魔力介紹給更多人的願望。在過去的幾年裡，播客空間爆炸性增長。現在有比以往任何時候都更多的內容來滿足各種口味。然而，在音頻的海洋中找到自己的方式仍然同樣困難。<p>我建立3by3的目的是為了更好地瞭解你--聽眾，而不是去尋找流行的選擇。回答三個簡單的問題，就足以讓3by3瞭解你喜歡聽什麼。不是一個完美的匹配？重新開始，你將在幾秒鐘內得到一個新的節目。只要你願意，可以經常回來。我們正在不斷向我們的數據庫添加更多的問題和播客。我們確信，隨著時間的推移，你的匹配會越來越好。"
}