{
  "@type": "NewsArticle",
  "identifier": "2022--03--16--en--showhn--HackerNews--NewsArticle--30701762",
  "url": "https://news.ycombinator.com/item?id=30701762",
  "headline": "Show HN: Manage Your Investments with Ease",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN! Would anyone be up to try a portfolio tracker that @pranshum and I are working on? (https://fynsmart.com/).<p>Fynsmart gives you professional quality analytics on your personal portfolio. The product is built to help you minimize cap gains taxes, run rebalancing calculations, and to benchmark your performance across all your accounts.<p>We have a few unique ways of connecting with brokerage accounts to fetch raw data. So the insights we provide are deep and actionable: tax loss harvesting opportunities, IRR that accounts for cashflows in/out of the account and your post-tax net worth. We are able to do this because our data is better than what you might get from aggregators like Yodlee or Plaid! We use read-only financial adviser access today.<p>We don't use aggregators like Yodlee or Plaid for a few reasons: a) they don't give us the lot level data that we need for our analyses, and b) they frequently get blocked by brokerages, which means we won't be able to deliver a great experience to our users. We know this because we tried using them.<p>Additionally, users never share their brokerage auth credentials with us, and your data doesn't get pushed to any of our servers. Everything stays on your device!<p>@pranshum and I have been bootstrapping since last year and Fynsmart has been extremely useful as we pull money out of the markets to fund our lives. Some of our early users use Fynsmart to optimize their portfolio, verify their &quot;money manager's&quot; work and also learn general best practices.<p>We are opening up a few more early access spots for a limited amount of time. If you're interested in checking it out, request early access at https://fynsmart.com/ or reach out to either pranshu@fynsmart.com or perry@fynsmart.com.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "perryogwuche",
    "url": "https://news.ycombinator.com/user?id=perryogwuche"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30701762",
  "sameAs": "https://news.ycombinator.com/item?id=30701762",
  "dateCreated": "2022-03-16T18:35:56.662Z",
  "datePublished": "2022-03-16T17:42:45.000Z",
  "dateModified": "2022-03-16T18:35:56.662Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 轻松地管理你的投资",
  "headline_zh-Hant": "Show HN: 輕鬆地管理你的投資",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! 有人愿意尝试@pranshum和我正在开发的投资组合跟踪器吗？(https://fynsmart.com/).<p>Fynsmart为您提供关于您个人投资组合的专业质量分析。该产品的建立是为了帮助你最大限度地减少资本利得税，运行再平衡计算，并对你所有账户的表现进行基准评估。<p>我们有一些独特的方式与经纪账户连接，以获取原始数据。因此，我们提供的见解是深入和可操作的：税收损失收获的机会，考虑到账户现金流进/出的内部收益率以及你的税后净资产。我们能够做到这一点，是因为我们的数据比你从Yodlee或Plaid这样的聚合器得到的数据更好 我们今天使用只读的财务顾问访问。<p>我们不使用Yodlee或Plaid这样的聚合器，有几个原因：a）他们没有提供我们分析所需的地段级数据，b）他们经常被经纪公司封锁，这意味着我们将无法向用户提供良好的体验。我们知道这一点，因为我们尝试过使用它们。<p>此外，用户永远不会与我们分享他们的经纪公司认证凭证，而且你的数据不会被推送到我们的任何服务器。一切都留在你的设备上！<p>@pranshum和我从去年开始启动，Fynsmart在我们从市场中抽出资金资助我们的生活时非常有用。我们的一些早期用户使用Fynsmart来优化他们的投资组合，验证他们的&quot;货币经理&quot;的工作，也学习一般的最佳做法。<p>我们正在开放更多的早期访问位置，时间有限。如果你有兴趣查看，请在 https://fynsmart.com/ 申请提前访问，或联系 pranshu@fynsmart.com 或 perry@fynsmart.com。",
  "description_zh-Hant": "嗨，HN! 有人願意嘗試@pranshum和我正在開發的投資組合跟蹤器嗎？(https://fynsmart.com/).<p>Fynsmart為您提供關於您個人投資組合的專業質量分析。該產品的建立是為了幫助你最大限度地減少資本利得稅，運行再平衡計算，並對你所有賬戶的表現進行基準評估。<p>我們有一些獨特的方式與經紀賬戶連接，以獲取原始數據。因此，我們提供的見解是深入和可操作的：稅收損失收穫的機會，考慮到賬戶現金流進/出的內部收益率以及你的稅後淨資產。我們能夠做到這一點，是因為我們的數據比你從Yodlee或Plaid這樣的聚合器得到的數據更好 我們今天使用只讀的財務顧問訪問。<p>我們不使用Yodlee或Plaid這樣的聚合器，有幾個原因：a）他們沒有提供我們分析所需的地段級數據，b）他們經常被經紀公司封鎖，這意味著我們將無法向用戶提供良好的體驗。我們知道這一點，因為我們嘗試過使用它們。<p>此外，用戶永遠不會與我們分享他們的經紀公司認證憑證，而且你的數據不會被推送到我們的任何服務器。一切都留在你的設備上！<p>@pranshum和我從去年開始啟動，Fynsmart在我們從市場中抽出資金資助我們的生活時非常有用。我們的一些早期用戶使用Fynsmart來優化他們的投資組合，驗證他們的&quot;貨幣經理&quot;的工作，也學習一般的最佳做法。<p>我們正在開放更多的早期訪問位置，時間有限。如果你有興趣查看，請在 https://fynsmart.com/ 申請提前訪問，或聯繫 pranshu@fynsmart.com 或 perry@fynsmart.com。"
}