{
  "@type": "NewsArticle",
  "identifier": "2022--04--05--en--showhn--HackerNews--NewsArticle--30923285",
  "url": "https://news.ycombinator.com/item?id=30923285",
  "headline": "Show HN: I built a service to help companies reduce AWS spend by 50%+",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN: Kaveh here, the founder of https://www.usage.ai/<p>Thanks to the support of the HN community, we've made massive improvements to our savings product from the last post. Since our last post, we've helped companies like imgur.com save 50% on their EC2 bill.<p>We help companies drive down AWS EC2 spend. Why? Because the way it's done now is a pain. DevOps and Software Engineers end up spending time managing costs rather than focusing on business problems.<p>Previous to founding Usage, I worked on high-performance computing research at JP Morgan Chase and as a software engineer at a number of smaller startups.<p>Here's how it works: We are typically brought in by a DevOps manager to cut AWS EC2 costs. The app is entirely self-service and the savings are generated automatically, typically we do this live on a call. On average, we reduce AWS EC2 spend by 50% for 5 minutes of work.<p>To reduce by 50%+, we don't touch the instances, require any code change, or change the performance of your instances. We buy Reserved Instances on your behalf (a billing layer change only) and bundle them with guaranteed buyback. So you get the steep 57% savings of 3-year no-upfront RIs with none of the commitment (you can sell them back to us anytime after 30 days).<p>We make money off of a 20% Savings Fee. Happy to chat directly kaveh@usage.ai<p>Have you experienced any issues with managing your company or organization's AWS expenses? We'd love to hear your feedback and ideas!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "kavehkhorram",
    "url": "https://news.ycombinator.com/user?id=kavehkhorram"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30923285",
  "sameAs": "https://news.ycombinator.com/item?id=30923285",
  "dateCreated": "2022-04-05T18:56:08.971Z",
  "datePublished": "2022-04-05T18:53:41.000Z",
  "dateModified": "2022-04-05T18:56:08.971Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 我建立了一项服务，帮助企业减少50%以上的AWS支出",
  "headline_zh-Hant": "Show HN: 我建立了一項服務，幫助企業減少50%以上的AWS支出",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hey HN: Kaveh here, the founder of https://www.usage.ai/<p>感谢HN社区的支持，从上一篇文章开始，我们已经对我们的储蓄产品进行了大规模的改进。自上一篇文章以来，我们已经帮助imgur.com等公司节省了50%的EC2账单。<p>我们帮助公司降低了AWS EC2的支出。为什么？因为现在的方式是一种痛苦。DevOps和软件工程师最终将时间花在管理成本上，而不是关注业务问题。<p>在创立Usage之前，我曾在摩根大通从事高性能计算研究，并在一些小型创业公司担任软件工程师。我们通常被一个开发经理请来削减AWS EC2成本。该应用程序完全是自助式的，节省的费用是自动产生的，通常我们在电话中进行现场操作。平均而言，我们为5分钟的工作减少了50%的AWS EC2开支。<p>为了减少50%以上的开支，我们不接触实例，不要求改变任何代码，也不改变你的实例的性能。我们代表您购买保留实例（仅是计费层的改变），并将它们与保证回购捆绑在一起。因此，您可以获得3年无预付费用的保留实例的57%的节省，而且没有任何承诺（您可以在30天后随时将它们卖回给我们）。乐于直接聊天 kaveh@usage.ai<p>你在管理公司或组织的AWS费用方面是否遇到过任何问题？我们很乐意听到您的反馈和想法!",
  "description_zh-Hant": "Hey HN: Kaveh here, the founder of https://www.usage.ai/<p>感謝HN社區的支持，從上一篇文章開始，我們已經對我們的儲蓄產品進行了大規模的改進。自上一篇文章以來，我們已經幫助imgur.com等公司節省了50%的EC2賬單。<p>我們幫助公司降低了AWS EC2的支出。為什麼？因為現在的方式是一種痛苦。DevOps和軟件工程師最終將時間花在管理成本上，而不是關注業務問題。<p>在創立Usage之前，我曾在摩根大通從事高性能計算研究，並在一些小型創業公司擔任軟件工程師。我們通常被一個開發經理請來削減AWS EC2成本。該應用程序完全是自助式的，節省的費用是自動產生的，通常我們在電話中進行現場操作。平均而言，我們為5分鐘的工作減少了50%的AWS EC2開支。<p>為了減少50%以上的開支，我們不接觸實例，不要求改變任何代碼，也不改變你的實例的性能。我們代表您購買保留實例（僅是計費層的改變），並將它們與保證回購捆綁在一起。因此，您可以獲得3年無預付費用的保留實例的57%的節省，而且沒有任何承諾（您可以在30天后隨時將它們賣回給我們）。樂於直接聊天 kaveh@usage.ai<p>你在管理公司或組織的AWS費用方面是否遇到過任何問題？我們很樂意聽到您的反饋和想法!"
}