{
  "@type": "NewsArticle",
  "identifier": "2022--03--28--en--showhn--HackerNews--NewsArticle--30832602",
  "url": "https://news.ycombinator.com/item?id=30832602",
  "headline": "Show HN: Neverinstall 2.0 - The browser is the new operating system",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN community!<p>We’re excited to announce that today, we are coming out of Beta with the launch of neverinstall 2.0.<p>Over the past year we’ve been testing and developing the platform, adding new features and functionalities and listening to what you said.<p>What is neverinstall?<p>neverinstall is a cloud platform that allows you to run any application from the browser without installing it on your device. It is an alternative to traditional desktop application usage and enables people to stream applications over the web.<p>Here’s what’s new at neverinstall:<p>No time restrictions<p>We’ve updated our platform and removed time restrictions on usage. We now offer subscription plans with a flat monthly fee based on the desired resource requirement of the user.<p>Subscriptions<p>We’re delighted to announce that we’ve now launched our subscription plans. Users can subscribe to a Standard or a Premium plan to access higher compute, memory and faster build times. However, the free tier remains unchanged with unlimited usage and unrestricted access to all apps.<p>A brand new UI<p>We’ve optimised the platform and changed the UI for improved access, better visibility of the workspaces and higher performance. Data Saver Mode The platform now offers a data saver mode to allow users with lower internet speeds or limited usage quotas to reduce their data consumption by up to 50%. Mobile Portrait Mode We now support both landscape as well as portrait mode for mobile usage of neverinstall, adding more flexibility to the platform. Support for new apps We’ve added more apps on our platform, including new design tools such as Figma, as well as leading communication applications including Slack and Telegram with more to follow.<p>New servers in Europe<p>Earlier this year, our new servers in the United Kingdom went live. These would enable European users to get improved performance and smoother access to the platform. So far we’ve been able to go from roughly 100 registered users to more than 3000 daily active users today, with a total registered user base of 200,000 in less than a year.<p>At neverinstall, we are developing a next-generation cloud platform to bring any GUI (Graphical User Interface) application regardless of the operating system, device, and system requirements to the browser.<p>Our goal is to bring a fundamental shift in the way we use applications eliminating the limitations of hardware and making them truly accessible from anywhere.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "igniteram",
    "url": "https://news.ycombinator.com/user?id=igniteram"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30832602",
  "sameAs": "https://neverinstall.com/spaces",
  "dateCreated": "2022-03-28T17:04:16.600Z",
  "datePublished": "2022-03-28T16:53:41.000Z",
  "dateModified": "2022-03-28T17:04:16.600Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Neverinstall 2.0 - 浏览器是新的操作系统",
  "headline_zh-Hant": "Show HN: Neverinstall 2.0 - 瀏覽器是新的操作系統",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN社区！<p>我们很高兴地宣布，今天，我们将推出neverinstall 2.0的测试版。<p>在过去的一年里，我们一直在测试和开发这个平台，增加新的特性和功能，并听取你的意见。<p>什么是neverinstall？<p>neverinstall是一个云平台，允许你从浏览器中运行任何应用程序，而无需在设备上安装。它是传统桌面应用程序使用的替代方案，使人们能够通过网络串流应用程序。<p>以下是neverinstall的新内容：<p>没有时间限制<p>我们已经更新了我们的平台，取消了使用时间限制。我们现在提供订阅计划，根据用户所需的资源要求收取统一的月费。<p>订阅<p>我们很高兴地宣布，我们现在已经推出订阅计划。用户可以订阅标准或高级计划，以获得更高的计算能力、内存和更快的构建时间。然而，免费层级保持不变，不受限制地使用所有应用程序。<p>全新的UI<p>我们已经优化了平台，并改变了UI，以改善访问，提高工作空间的可见性和更高的性能。数据节省模式 该平台现在提供数据节省模式，使网速较低或使用配额有限的用户能够减少高达50%的数据消耗。移动纵向模式 我们现在支持移动使用neverinstall的横向和纵向模式，为平台增加了更多的灵活性。支持新的应用程序 我们在平台上增加了更多的应用程序，包括新的设计工具，如Figma，以及领先的通信应用程序，包括Slack和Telegram，还有更多的应用程序将陆续推出。这些将使欧洲用户能够获得更好的性能和更顺畅的平台访问。到目前为止，我们已经能够从大约100个注册用户到今天超过3000个日活跃用户，在不到一年的时间里，总注册用户数达到20万。<p>在neverinstall，我们正在开发一个下一代云平台，将任何GUI（图形用户界面）应用程序，无论操作系统、设备和系统要求如何，都带到浏览器上。<p>我们的目标是为我们使用应用程序的方式带来根本转变，消除硬件的限制，使它们真正可以从任何地方访问。",
  "description_zh-Hant": "你好，HN社區！<p>我們很高興地宣佈，今天，我們將推出neverinstall 2.0的測試版。<p>在過去的一年裡，我們一直在測試和開發這個平臺，增加新的特性和功能，並聽取你的意見。<p>什麼是neverinstall？<p>neverinstall是一個雲平臺，允許你從瀏覽器中運行任何應用程序，而無需在設備上安裝。它是傳統桌面應用程序使用的替代方案，使人們能夠通過網絡串流應用程序。<p>以下是neverinstall的新內容：<p>沒有時間限制<p>我們已經更新了我們的平臺，取消了使用時間限制。我們現在提供訂閱計劃，根據用戶所需的資源要求收取統一的月費。<p>訂閱<p>我們很高興地宣佈，我們現在已經推出訂閱計劃。用戶可以訂閱標準或高級計劃，以獲得更高的計算能力、內存和更快的構建時間。然而，免費層級保持不變，不受限制地使用所有應用程序。<p>全新的UI<p>我們已經優化了平臺，並改變了UI，以改善訪問，提高工作空間的可見性和更高的性能。數據節省模式 該平臺現在提供數據節省模式，使網速較低或使用配額有限的用戶能夠減少高達50%的數據消耗。移動縱向模式 我們現在支持移動使用neverinstall的橫向和縱向模式，為平臺增加了更多的靈活性。支持新的應用程序 我們在平臺上增加了更多的應用程序，包括新的設計工具，如Figma，以及領先的通信應用程序，包括Slack和Telegram，還有更多的應用程序將陸續推出。這些將使歐洲用戶能夠獲得更好的性能和更順暢的平臺訪問。到目前為止，我們已經能夠從大約100個註冊用戶到今天超過3000個日活躍用戶，在不到一年的時間裡，總註冊用戶數達到20萬。<p>在neverinstall，我們正在開發一個下一代雲平臺，將任何GUI（圖形用戶界面）應用程序，無論操作系統、設備和系統要求如何，都帶到瀏覽器上。<p>我們的目標是為我們使用應用程序的方式帶來根本轉變，消除硬件的限制，使它們真正可以從任何地方訪問。"
}