{
  "@type": "NewsArticle",
  "identifier": "2022--03--28--en--showhn--HackerNews--NewsArticle--30831396",
  "url": "https://news.ycombinator.com/item?id=30831396",
  "headline": "Show HN: Narratives Project – A news product for peace",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN!<p>I started a non-profit that's spent the last year building a type of short news content that can supplement a normal, partisan news diet. It began as a tweet (https://twitter.com/shaunjcammack/status/1298722815349149699?), which turned into a Substack, and now we have a small staff of researchers and writers working on the project. The goal is to help news consumers understand themselves and those they disagree with.<p>There's usually a lot of (well deserved) suspicion out there about &quot;better news&quot; type initiatives, and so I want to be clear up front that (although we like to pop bubbles) we're not trying to change anyone's politics, we just want to lower the temperature.<p>As far as I can tell, our current news-media system is pretty bad. On the ground reporting has been replaced by armchair journalism, our viewpoint silos are occasionally penetrated by the worst of the other side, and the entire system seems to be in an escalating panic about <i>Those Bad People Over There.</i><p>This is obvious, but people of different political persuasions will look at the same event and immediately come to different conclusions, and often become agitated with folks on the other side of the issue. And when asked why others disagree on that issue, people usually give one of four answers: <i>They</i> think <i>that</i> because they're either stupid, ignorant, brainwashed, or evil.<p>It's probably not helpful to think that half the country is stupid, and it's a recipe for really bad things to think that half the country is evil. So we're trying to work on the better answer, which is that people with different priors and experiences can reasonably come to different conclusions. Maybe that also sounds obvious, but that's a difficult thing to remember in the moment when we're confronted with someone on the other side of a morally animating topic.<p>So what we're building is a short, substantive piece of analysis that presents and examines the perspectives on either side of a given issue, and illustrate the underlying reasons for how people come to those conclusions. We aggregate the narratives from twitter (via our social media listening tool), and identify what either side is focusing on, how they're interpreting new information, and how they're reasoning. We write the summaries of either side <i>as though we believed it,</i> and discuss the differences.<p>We like to imagine a person on their lunch break, who only has a few minutes to investigate the news event that everyone is talking about. He scrolls through twitter, reads the opinions of people he tends to agree with, and then opens up our content to get a quick overview of the whole discourse. He goes back to work entrenched in his opinions, perhaps, but also with an understanding of why people disagree with him (and it's not that they're evil).<p>Here's another example. There's a mainstream conservative Aunt who watches Fox News. She has a progressive niece who watches left-leaning twitch streamers. They have a lot of difficulty discussing news, not just because they disagree, but because they don't have any way of talking between their worldviews. They just end up messaging each other links to partisan articles (which is not a great way to have a conversation). So instead of this, the niece sends her aunt our content about the topic, which helps them both feel acknowledged and prompted to talk about productive parts of the disagreement (values, experiences, priors, etc.). They still disagree, but they don't think each other are crazy or stupid.<p>We think this minimal understanding helps to alleviate the distress of the reader, helps them understand their own position and be acknowledged, and helps them humanize their opponent.<p>Here's two examples of recent posts:<p>https://www.narrativesproject.com/news/why-cant-we-agree-on-the-nonexistence-of-biolabs-in-ukraine/<p>https://www.narrativesproject.com/news/views-on-the-us-banning-russian-energy-imports/<p>And here's a recent Instagram version:<p>https://www.instagram.com/p/Cbh6kxhArKa/<p>We're also trying to experiment with formats that approach the problem totally differently, like comparisons of partisan headlines, deep dives into evergreen divisions, and extended thought experiments.<p>---<p>There's other organizations and products out there that share our concern, such as AllSides, The Flip Side, Braver Angels, Ground News, etc. Here's two reasons why we're different.<p>First, the news aggregators operate on the idea that people should consume news from both the right and the left to understand a topic and see where other people are coming from. But this is pretty impractical for the average person. There's just too many divisive stories and too few hours in the day. Also, I'm not sure that watching oppositional news wouldn't just confirm your belief that the other side is awful.<p>Most other organizations and products construct their understanding of the discourse by looking at partisan news and opinion articles. This is grounded in assumption that narratives are the product of top-down influence. We're grounded in the field of cultural evolution, and so we think narrative emerges from the interactions of individual agents sharing information, which is then picked up by the media and propagated. So we construct our understanding of the discourse by looking at conversations on Twitter through a social media listening tool (Meltwater), which gives us access to the full firehose.<p>---<p>We've learned a lot this year, but one of the biggest things we've figured out (through user testing) is that our design is not intuitive. Once users get what we're doing, they see a lot value in it and want to share it, but there's a gap that we need to bridge.<p>So at the moment, two of our biggest questions are: How can we design our product to be eminently accessible, obvious, and useful to the average media consumer? And how can we best compete within the incentives of our unhealthy media ecosystem?<p>And that's why I'm showing this to you. What do you think? Does it make sense? Are there considerations I'm missing? Is there a different format that we should experiment with?",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "ShaunCammack",
    "url": "https://news.ycombinator.com/user?id=ShaunCammack"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30831396",
  "sameAs": "https://news.ycombinator.com/item?id=30831396",
  "dateCreated": "2022-03-28T15:33:31.470Z",
  "datePublished": "2022-03-28T15:18:26.000Z",
  "dateModified": "2022-03-28T15:33:31.470Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 叙事项目--促进和平的新闻产品",
  "headline_zh-Hant": "Show HN: 敘事項目--促進和平的新聞產品",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN！<p>我创办了一个非营利组织，在过去一年里建立了一种短新闻内容，可以补充正常的、有党派的新闻饮食。它开始于一条推特（https://twitter.com/shaunjcammack/status/1298722815349149699？），后来变成了一个Substack，现在我们有一个由研究人员和作家组成的小团队在为这个项目工作。我们的目标是帮助新闻消费者了解他们自己和那些他们不同意的人。<p>通常有很多（当之无愧的）关于&quot;更好的新闻&quot;类型的举措的怀疑，因此我想事先明确，（虽然我们喜欢吹泡泡）我们并不是要改变任何人的政治，我们只是想降低温度。<p>就我所知，我们目前的新闻媒体系统是相当糟糕的。On the ground reporting has been replaced by armchair journalism, our viewpoint silos are occasionally penetrated by the worst of the other side, and the entire system seems to be in an escalating panic about <i>Those Bad People Over There.</i><p>This is obvious, but people of different political persuasions will look at the same event and immediately come to different conclusions, and often become agitated with folks on the other side of the issue. And when asked why others disagree on that issue, people usually give one of four answers: <i>They</i> think <i>that</i> because they're either stupid, ignorant, brainwashed, or evil.<p>It's probably not helpful to think that half the country is stupid, and it's a recipe for really bad things to think that half the country is evil. 因此，我们正在努力寻找更好的答案，那就是具有不同先验和经验的人可以合理地得出不同的结论。也许这听起来也很明显，但当我们面对一个道德上有活力的话题的另一方时，这是一个很难记住的事情。<p>因此，我们正在建立的是一个简短的、实质性的分析文章，介绍和研究一个特定问题的任何一方的观点，并说明人们如何得出这些结论的根本原因。We aggregate the narratives from twitter (via our social media listening tool), and identify what either side is focusing on, how they're interpreting new information, and how they're reasoning. We write the summaries of either side <i>as though we believed it,</i> and discuss the differences.<p>We like to imagine a person on their lunch break, who only has a few minutes to investigate the news event that everyone is talking about. 他滚动浏览微博，阅读他倾向于同意的人的意见，然后打开我们的内容，快速了解整个论述。他回去工作时，也许会固守自己的观点，但也会理解为什么人们不同意他的观点（这并不是说他们是邪恶的）。有一个看福克斯新闻的主流保守派阿姨。她有一个进步的侄女，看左倾的twitch流媒体。他们在讨论新闻时有很多困难，不只是因为他们意见不一致，而是因为他们在世界观之间没有任何交流方式。他们最终只是给对方发送党派文章的链接（这不是一个很好的对话方式）。因此，侄女不这样做，而是给她的姑姑发送我们关于这个话题的内容，这有助于他们都感到被认可，并促使他们谈论分歧的有效部分（价值观、经验、先例等）。他们仍然有分歧，但他们不认为对方是疯子或傻瓜。<p>我们认为这种最低限度的理解有助于减轻读者的痛苦，帮助他们了解自己的立场并得到认可，并帮助他们将对手人性化。<p>以下是最近的两个帖子的例子：<p>https://www.narrativesproject.com/news/why-cant-we-agree-on-the-nonexistence-of-biolabs-in-ukraine/<p>https://www.narrativesproject. com/news/views-on-the-us-banning-russian-energy-imports/<p>而这里是最近的Instagram版本：<p>https://www.instagram.com/p/Cbh6kxhArKa/<p>我们也在尝试用完全不同的形式来处理这个问题，比如对党派头条的比较，对常青的划分的深度挖掘，以及扩展的思想实验。<p>--<p>还有其他组织和产品与我们有同样的关注，比如AllSides, The Flip Side, Braver Angels, Ground News，等等。以下是我们与众不同的两个原因。<p>第一，新闻聚合机构的运作方式",
  "description_zh-Hant": "嗨，HN！<p>我創辦了一個非營利組織，在過去一年裡建立了一種短新聞內容，可以補充正常的、有黨派的新聞飲食。它開始於一條推特（https://twitter.com/shaunjcammack/status/1298722815349149699？），後來變成了一個Substack，現在我們有一個由研究人員和作家組成的小團隊在為這個項目工作。我們的目標是幫助新聞消費者瞭解他們自己和那些他們不同意的人。<p>通常有很多（當之無愧的）關於&quot;更好的新聞&quot;類型的舉措的懷疑，因此我想事先明確，（雖然我們喜歡吹泡泡）我們並不是要改變任何人的政治，我們只是想降低溫度。<p>就我所知，我們目前的新聞媒體系統是相當糟糕的。On the ground reporting has been replaced by armchair journalism, our viewpoint silos are occasionally penetrated by the worst of the other side, and the entire system seems to be in an escalating panic about <i>Those Bad People Over There.</i><p>This is obvious, but people of different political persuasions will look at the same event and immediately come to different conclusions, and often become agitated with folks on the other side of the issue. And when asked why others disagree on that issue, people usually give one of four answers: <i>They</i> think <i>that</i> because they're either stupid, ignorant, brainwashed, or evil.<p>It's probably not helpful to think that half the country is stupid, and it's a recipe for really bad things to think that half the country is evil. 因此，我們正在努力尋找更好的答案，那就是具有不同先驗和經驗的人可以合理地得出不同的結論。也許這聽起來也很明顯，但當我們面對一個道德上有活力的話題的另一方時，這是一個很難記住的事情。<p>因此，我們正在建立的是一個簡短的、實質性的分析文章，介紹和研究一個特定問題的任何一方的觀點，並說明人們如何得出這些結論的根本原因。We aggregate the narratives from twitter (via our social media listening tool), and identify what either side is focusing on, how they're interpreting new information, and how they're reasoning. We write the summaries of either side <i>as though we believed it,</i> and discuss the differences.<p>We like to imagine a person on their lunch break, who only has a few minutes to investigate the news event that everyone is talking about. 他滾動瀏覽微博，閱讀他傾向於同意的人的意見，然後打開我們的內容，快速瞭解整個論述。他回去工作時，也許會固守自己的觀點，但也會理解為什麼人們不同意他的觀點（這並不是說他們是邪惡的）。有一個看福克斯新聞的主流保守派阿姨。她有一個進步的侄女，看左傾的twitch流媒體。他們在討論新聞時有很多困難，不只是因為他們意見不一致，而是因為他們在世界觀之間沒有任何交流方式。他們最終只是給對方發送黨派文章的鏈接（這不是一個很好的對話方式）。因此，侄女不這樣做，而是給她的姑姑發送我們關於這個話題的內容，這有助於他們都感到被認可，並促使他們談論分歧的有效部分（價值觀、經驗、先例等）。他們仍然有分歧，但他們不認為對方是瘋子或傻瓜。<p>我們認為這種最低限度的理解有助於減輕讀者的痛苦，幫助他們瞭解自己的立場並得到認可，並幫助他們將對手人性化。<p>以下是最近的兩個帖子的例子：<p>https://www.narrativesproject.com/news/why-cant-we-agree-on-the-nonexistence-of-biolabs-in-ukraine/<p>https://www.narrativesproject. com/news/views-on-the-us-banning-russian-energy-imports/<p>而這裡是最近的Instagram版本：<p>https://www.instagram.com/p/Cbh6kxhArKa/<p>我們也在嘗試用完全不同的形式來處理這個問題，比如對黨派頭條的比較，對常青的劃分的深度挖掘，以及擴展的思想實驗。<p>--<p>還有其他組織和產品與我們有同樣的關注，比如AllSides, The Flip Side, Braver Angels, Ground News，等等。以下是我們與眾不同的兩個原因。<p>第一，新聞聚合機構的運作方式"
}