{
  "@type": "NewsArticle",
  "identifier": "2022--08--03--en--showhn--HackerNews--NewsArticle--32329655",
  "url": "https://news.ycombinator.com/item?id=32329655",
  "headline": "Show HN: An Amazon Donating All Profits to Charities",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi I'm Vin, the founder of BOAS. Currently selling sustainable baby/kids products but when successful we'll slowly roll out other categories. Sustainable buying currently sucks because it's fragmented and expensive. Consolidating sustainable products on one marketplace and enabling price competition on the marketplace will make it less sucky, just like Amazon did. We're doing this because we discovered that there's a big chunk of sustainable buyers and brands who don't want to buy from or work with them because they don't trust them with ethics and sustainability. That's where we come in.<p>We're donating all of our profits (over the lifetime, after scaling so we don't hinder our growth, our investors are philanthropists) because it's the right thing to do, and fortunately it actually seems like that's a USP that brands and consumers care for and helps us establish trust, which is critical to succeed in sustainability.<p>Please have a look through the website, try to buy something (if you want to pay even better ;)) and let us know what sucks or what you don't understand about what we do. We're currently on Shopify and have a technical integration with most ecom platforms. Ultimately we would want to own the whole infrastructure ourselves.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "VincentoVici",
    "url": "https://news.ycombinator.com/user?id=VincentoVici"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32329655",
  "sameAs": "https://boas.co/",
  "dateCreated": "2022-08-03T10:00:07.614Z",
  "datePublished": "2022-08-03T09:53:09.000Z",
  "dateModified": "2022-08-03T10:00:07.614Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 一个将所有利润捐给慈善机构的亚马逊\n",
  "headline_zh-Hant": "Show HN: 一個將所有利潤捐給慈善機構的亞馬遜\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，我是BOAS的创始人Vin。目前销售可持续发展的婴儿/儿童产品，但当成功后，我们将慢慢推出其他类别。目前的可持续购买很糟糕，因为它是分散的和昂贵的。将可持续产品整合到一个市场上，并在市场上实现价格竞争，将使其不那么糟糕，就像亚马逊所做的那样。我们这样做是因为我们发现有很大一部分可持续买家和品牌不想从他们那里购买或与他们合作，因为他们不信任他们的道德和可持续性。<p>我们捐出所有的利润（在整个生命周期内，在扩大规模之后，所以我们不会阻碍我们的增长，我们的投资者是慈善家），因为这是正确的事情，幸运的是，实际上看起来这是品牌和消费者关心的USP，并帮助我们建立信任，这对可持续发展的成功至关重要。 <p>请浏览一下我们的网站，试着买点东西（如果你想付钱就更好了；），并让我们知道我们做的事情有什么不好或不明白的地方。我们目前在Shopify上，与大多数电子商务平台进行了技术整合。最终，我们希望自己拥有整个基础设施。\n",
  "description_zh-Hant": "大家好，我是BOAS的創始人Vin。目前銷售可持續發展的嬰兒/兒童產品，但當成功後，我們將慢慢推出其他類別。目前的可持續購買很糟糕，因為它是分散的和昂貴的。將可持續產品整合到一個市場上，並在市場上實現價格競爭，將使其不那麼糟糕，就像亞馬遜所做的那樣。我們這樣做是因為我們發現有很大一部分可持續買家和品牌不想從他們那裡購買或與他們合作，因為他們不信任他們的道德和可持續性。<p>我們捐出所有的利潤（在整個生命週期內，在擴大規模之後，所以我們不會阻礙我們的增長，我們的投資者是慈善家），因為這是正確的事情，幸運的是，實際上看起來這是品牌和消費者關心的USP，並幫助我們建立信任，這對可持續發展的成功至關重要。 <p>請瀏覽一下我們的網站，試著買點東西（如果你想付錢就更好了；），並讓我們知道我們做的事情有什麼不好或不明白的地方。我們目前在Shopify上，與大多數電子商務平臺進行了技術整合。最終，我們希望自己擁有整個基礎設施。\n"
}