{
  "@type": "NewsArticle",
  "identifier": "2022--06--21--en--showhn--HackerNews--NewsArticle--31822713",
  "url": "https://news.ycombinator.com/item?id=31822713",
  "headline": "Show HN: Free Datasets for Spatial Engineers and Location Analysts",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "location data providers are often in the press with negative headlines. Those services aggregate movement data from apps and aggregate the data to derive movement patterns which might be helpful for marketers. In fact, I had two moments in my life where I evaluated a PoC with those location data brokers.<p>They were all shady about where the data comes from which is important to understand the Bias of the data. I never got a good answer.<p>The data often just represented &lt; 0.4% of the population (at least in Europe - different game in the USA). For a big city they might have 20K unique users while in the city were more than 3M users living.<p>They dismiss any professional data analytics principle. The data comes in CSV (if a lot of data they give you like 10 separate files). Data was not always plausible in itself<p>Those experiences brought me to build certain parts of those data brokers but only with open-source data:<p>If it is about location data you should know OpenStreetMap. It's the biggest Database with meta info on location. It's not perfect but big companies like Mapbox, Apple, and Microsoft rely on it. Since the API is kind of messy, you can load with this repository whole cities information smoothly into a PostGres \n--&gt; https://github.com/kuwala-io/kuwala/blob/master/kuwala/pipelines/osm-poi/README.md<p>Googe Popular Times: Movement data can be also found on Google. When you search a location it is often shown how frequently a place was visited on an hourly-daily basis (on an index of 0-100). With this libary you can access all the Popular Times data for location and entire cities \n--&gt; https://github.com/kuwala-io/kuwala/blob/master/kuwala/pipelines/google-poi/README.md<p>Global Admin Boundaries: A huge problem that often people feel when working with location data is aggregating the data into different geo-based slices (country level, admin level, or even smaller into sub-districts). Here is a repo that cleaned the data out of Open Street Map for geo boundaries worldwide from very broad to a very small granularity \n--&gt; https://github.com/kuwala-io/kuwala/blob/master/kuwala/pipelines/admin-boundaries/README.md<p>I think with those Open Source Tools and some data science magic you can generate similar outcomes as those location data providers but totally anonymized and free. Would be awesome if anybody is interested in building a case around it :-)",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "floriankuwala",
    "url": "https://news.ycombinator.com/user?id=floriankuwala"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31822713",
  "sameAs": "https://news.ycombinator.com/item?id=31822713",
  "dateCreated": "2022-06-21T12:05:10.814Z",
  "datePublished": "2022-06-21T11:35:11.000Z",
  "dateModified": "2022-06-21T12:05:10.814Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 为空间工程师和位置分析师提供的免费数据集\n",
  "headline_zh-Hant": "Show HN: 為空間工程師和位置分析師提供的免費數據集\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "位置数据供应商经常出现在媒体的负面标题中。这些服务从应用程序中收集运动数据，并汇总数据以得出运动模式，这可能对营销人员有帮助。事实上，在我的生活中，我曾有过两次与这些位置数据经纪商一起评估PoC的经历。<p>他们对数据的来源都很遮遮掩掩，这对了解数据的偏见很重要。我从来没有得到过一个好的答案。<p>这些数据往往只代表了0.4%的人口（至少在欧洲是这样，在美国则不同）。对于一个大城市来说，他们可能有2万个独立用户，而在这个城市里有超过3万个用户。<p>他们拒绝任何专业数据分析原则。数据是以CSV形式出现的（如果数据量很大，他们会给你10个单独的文件）。数据本身并不总是可信的<p>这些经验使我建立了这些数据经纪人的某些部分，但只使用开源数据：<p>如果是关于位置数据，你应该知道OpenStreetMap。它是最大的带有位置元信息的数据库。它并不完美，但像Mapbox、苹果和微软这样的大公司都依赖它。由于API有点混乱，你可以用这个资源库将整个城市的信息顺利地加载到PostGres中。\n--&gt; https://github.com/kuwala-io/kuwala/blob/master/kuwala/pipelines/osm-poi/README.md<p>Googe流行时报。运动数据也可以在谷歌上找到。当你搜索一个地方时，通常会显示一个地方每小时-每天被访问的频率（以0-100的指数为基础）。有了这个资料库，你可以访问所有地点和整个城市的《流行时报》数据。\n--&gt; https://github.com/kuwala-io/kuwala/blob/master/kuwala/pipelines/google-poi/README.md<p>全球管理边界。人们在处理位置数据时经常感到的一个巨大问题是将数据汇总到不同的基于地理的片区（国家层面、行政层面，甚至更小的分区）。这里有一个 repo，它从Open Street Map中清理了全球范围内从非常广泛到非常小的地理边界的数据。\n--&gt; https://github.com/kuwala-io/kuwala/blob/master/kuwala/pipelines/admin-boundaries/README.md<p>我认为利用这些开源工具和一些数据科学的魔法，你可以产生与这些位置数据供应商类似的结果，但完全是匿名的和免费的。如果有谁有兴趣围绕它建立一个案例，那将是非常棒的：-)\n",
  "description_zh-Hant": "位置數據供應商經常出現在媒體的負面標題中。這些服務從應用程序中收集運動數據，並彙總數據以得出運動模式，這可能對營銷人員有幫助。事實上，在我的生活中，我曾有過兩次與這些位置數據經紀商一起評估PoC的經歷。<p>他們對數據的來源都很遮遮掩掩，這對了解數據的偏見很重要。我從來沒有得到過一個好的答案。<p>這些數據往往只代表了0.4%的人口（至少在歐洲是這樣，在美國則不同）。對於一個大城市來說，他們可能有2萬個獨立用戶，而在這個城市裡有超過3萬個用戶。<p>他們拒絕任何專業數據分析原則。數據是以CSV形式出現的（如果數據量很大，他們會給你10個單獨的文件）。數據本身並不總是可信的<p>這些經驗使我建立了這些數據經紀人的某些部分，但只使用開源數據：<p>如果是關於位置數據，你應該知道OpenStreetMap。它是最大的帶有位置元信息的數據庫。它並不完美，但像Mapbox、蘋果和微軟這樣的大公司都依賴它。由於API有點混亂，你可以用這個資源庫將整個城市的信息順利地加載到PostGres中。\n--&gt; https://github.com/kuwala-io/kuwala/blob/master/kuwala/pipelines/osm-poi/README.md<p>Googe流行時報。運動數據也可以在谷歌上找到。當你搜索一個地方時，通常會顯示一個地方每小時-每天被訪問的頻率（以0-100的指數為基礎）。有了這個資料庫，你可以訪問所有地點和整個城市的《流行時報》數據。\n--&gt; https://github.com/kuwala-io/kuwala/blob/master/kuwala/pipelines/google-poi/README.md<p>全球管理邊界。人們在處理位置數據時經常感到的一個巨大問題是將數據彙總到不同的基於地理的片區（國家層面、行政層面，甚至更小的分區）。這裡有一個 repo，它從Open Street Map中清理了全球範圍內從非常廣泛到非常小的地理邊界的數據。\n--&gt; https://github.com/kuwala-io/kuwala/blob/master/kuwala/pipelines/admin-boundaries/README.md<p>我認為利用這些開源工具和一些數據科學的魔法，你可以產生與這些位置數據供應商類似的結果，但完全是匿名的和免費的。如果有誰有興趣圍繞它建立一個案例，那將是非常棒的：-)\n"
}