{
  "@type": "NewsArticle",
  "identifier": "2022--07--08--en--showhn--HackerNews--NewsArticle--32022312",
  "url": "https://news.ycombinator.com/item?id=32022312",
  "headline": "Show HN: I made an app to help insomniacs learn how to sleep again",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN! I suffered from chronic insomnia for over a year and tried everything from cutting coffee, blocking blue light, to taking melatonin and antihistamine, but couldn’t find anything that worked. I even bought a $500 research-grade EEG device to track my sleep, which was honestly kind of depressing because it showed that I was sleeping less than 4 hours per night for weeks straight.<p>In the day, it took an immense amount of energy for me to perform even the most mundane of tasks, such as doing my laundry or ordering groceries. At night, I felt an overwhelming sense of loneliness and resentment as I lay in bed wide-awake, reading and re-reading Sleep by Murakami or mindlessly scrolling through reddit/ HN. My performance at work suffered, my personal relationships suffered, and my happiness suffered.<p>When I finally decided to see a sleep specialist, I was put on a 3-month long waiting list. Eventually, I was able to get my insomnia treated, but I realized that there is no reason why anyone should wait 3 months to get treatment when the same therapy that I received can be delivered online. My co-founder and I both have experience in digital health, so we decided to partner with sleep experts to create a mobile app to help people with insomnia get better sleep using psychology.<p>We launched in February this year, and have already helped over 500 patients improve their sleep permanently. Our data shows that our program is just as effective as group, in-person sleep therapy, and we’re doing a clinical study with Brigham and Women’s hospital and Harvard Medical School to prove the efficacy of our product. On average, our users sleep 74 minutes longer than before and spend 52% less time awake in the middle of the night.<p>If you have trouble with sleep, try our app and let us know what you think!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "dredev",
    "url": "https://news.ycombinator.com/user?id=dredev"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32022312",
  "sameAs": "https://slumber.one",
  "dateCreated": "2022-07-08T02:30:13.541Z",
  "datePublished": "2022-07-08T02:23:07.000Z",
  "dateModified": "2022-07-08T02:30:13.541Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 我做了一个应用程序，帮助失眠症患者学习如何重新入睡\n",
  "headline_zh-Hant": "Show HN: 我做了一個應用程序，幫助失眠症患者學習如何重新入睡\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! 我被慢性失眠折磨了一年多，从减少咖啡、阻断蓝光，到服用褪黑激素和抗组胺，我尝试了各种方法，但找不到任何有效的方法。我甚至买了一个价值500美元的研究级EEG设备来跟踪我的睡眠，说实话，这有点令人沮丧，因为它显示我连续几周每晚睡不到4个小时。<p>在白天，我需要花费巨大的精力来完成甚至是最平凡的任务，如洗衣服或订购杂货。到了晚上，当我躺在床上醒着，阅读和重读村上的《睡眠》，或无意识地滚动浏览reddit/HN时，我感到一种压倒性的孤独感和怨恨感。我的工作表现受到影响，我的个人关系受到影响，我的幸福感也受到影响。<p>当我最终决定去看睡眠专家时，我被列入了一个长达3个月的等待名单。最终，我的失眠症得到了治疗，但我意识到，当我接受的同样的治疗可以在网上进行时，没有理由让任何人等待3个月才得到治疗。我的联合创始人和我都有数字健康方面的经验，所以我们决定与睡眠专家合作，创建一个移动应用程序，利用心理学帮助失眠症患者获得更好的睡眠。<p>我们在今年2月推出，已经帮助500多名患者永久性地改善了睡眠。我们的数据显示，我们的程序与团体、面对面的睡眠治疗一样有效，我们正在与布莱根妇女医院和哈佛医学院进行临床研究，以证明我们产品的功效。平均而言，我们的用户比以前多睡了74分钟，半夜清醒的时间减少了52%。<p>如果你有睡眠问题，请尝试我们的应用程序，并让我们知道你的想法!\n",
  "description_zh-Hant": "嗨，HN! 我被慢性失眠折磨了一年多，從減少咖啡、阻斷藍光，到服用褪黑激素和抗組胺，我嘗試了各種方法，但找不到任何有效的方法。我甚至買了一個價值500美元的研究級EEG設備來跟蹤我的睡眠，說實話，這有點令人沮喪，因為它顯示我連續幾周每晚睡不到4個小時。<p>在白天，我需要花費巨大的精力來完成甚至是最平凡的任務，如洗衣服或訂購雜貨。到了晚上，當我躺在床上醒著，閱讀和重讀村上的《睡眠》，或無意識地滾動瀏覽reddit/HN時，我感到一種壓倒性的孤獨感和怨恨感。我的工作表現受到影響，我的個人關係受到影響，我的幸福感也受到影響。<p>當我最終決定去看睡眠專家時，我被列入了一個長達3個月的等待名單。最終，我的失眠症得到了治療，但我意識到，當我接受的同樣的治療可以在網上進行時，沒有理由讓任何人等待3個月才得到治療。我的聯合創始人和我都有數字健康方面的經驗，所以我們決定與睡眠專家合作，創建一個移動應用程序，利用心理學幫助失眠症患者獲得更好的睡眠。<p>我們在今年2月推出，已經幫助500多名患者永久性地改善了睡眠。我們的數據顯示，我們的程序與團體、面對面的睡眠治療一樣有效，我們正在與布萊根婦女醫院和哈佛醫學院進行臨床研究，以證明我們產品的功效。平均而言，我們的用戶比以前多睡了74分鐘，半夜清醒的時間減少了52%。<p>如果你有睡眠問題，請嘗試我們的應用程序，並讓我們知道你的想法!\n"
}