{
  "@type": "NewsArticle",
  "identifier": "2022--07--09--en--showhn--HackerNews--NewsArticle--32038181",
  "url": "https://news.ycombinator.com/item?id=32038181",
  "headline": "Show HN: Train your own Object Detection AI in 1 day without any prior knowledge",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey everyone!<p>I created a startup with a friend to make it easier for anyone to create AIs without any prior experience or knowledge in the field. We started with computer vision, specifically object detection, but we plan to add all subfields of AI eventually, like natural language processing, speech and all the cool generative stuff.<p>You can do everything inside the platform: create datasets, train artificial neural networks and use them to give intelligence to your web apps, mobile apps, machines, security cameras, robots, drones, cars and everything else.<p>It is free to use forever without any credit card required. You can connect google colab notebooks to our platform and use their free GPUs for training. Forget about all the different labeling file formats and running complex code yourself, just connect colab to Theos, click the Start Training button and the metrics will stream directly to your browser, and we will automatically upload weights checkpoints every epoch so you don't have to worry about colab shutting down and losing all your AI training progress. Also, we have an autolabeler feature to let your current AI's version help you make a better version of itself 100 times faster than labeling manually. Finally, you can deploy your AI as a rest API and use it in your software with simple http requests.<p>Here's the getting started guide for object detection:<p>https://docs.theos.ai/get-started/object-detection<p>Please let me know if you find it helpful and what subfield of AI you think we should tackle next.<p>(the landing page is not finished yet, soon we will release a way better version, but for now you can sign up and use the app for free)<p>Thanks!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "ramacastro",
    "url": "https://news.ycombinator.com/user?id=ramacastro"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32038181",
  "sameAs": "https://news.ycombinator.com/item?id=32038181",
  "dateCreated": "2022-07-09T19:21:17.672Z",
  "datePublished": "2022-07-09T18:56:03.000Z",
  "dateModified": "2022-07-09T19:21:17.672Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 在1天内训练你自己的物体检测AI，而不需要任何预先的知识\n",
  "headline_zh-Hant": "Show HN: 在1天內訓練你自己的物體檢測AI，而不需要任何預先的知識\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好！<p>我和一个朋友创建了一家初创公司，使任何人都能更容易地创建人工智能，而无需任何先前的经验或领域知识。我们从计算机视觉开始，特别是物体检测，但我们计划最终增加人工智能的所有子领域，如自然语言处理、语音和所有很酷的生成性东西。<p>你可以在平台内做一切事情：创建数据集，训练人工神经网络，并使用它们为你的网络应用、移动应用、机器、安全摄像头、机器人、无人机、汽车和其他一切东西提供智能。你可以将谷歌colab笔记本连接到我们的平台，并使用他们的免费GPU进行训练。忘记所有不同的标签文件格式和自己运行复杂的代码，只需将colab连接到Theos，点击开始训练按钮，指标将直接流向你的浏览器，我们将自动上传每个epoch的权重检查点，所以你不必担心colab关闭和丢失所有的AI训练进度。另外，我们还有一个自动标注功能，让你当前的人工智能的版本帮助你制作一个更好的版本，比手动标注快100倍。最后，你可以将你的人工智能部署为休息API，并通过简单的http请求在你的软件中使用它。<p>这里是物体检测的入门指南：<p>https://docs.theos.ai/get-started/object-detection<p>请让我知道你是否觉得它有帮助，以及你认为我们接下来应该处理人工智能的哪个子领域。<p>（登陆页面还没有完成，很快我们将发布一个更好的版本，但现在你可以注册并免费使用该应用程序）<p>谢谢！\n",
  "description_zh-Hant": "大家好！<p>我和一個朋友創建了一家初創公司，使任何人都能更容易地創建人工智能，而無需任何先前的經驗或領域知識。我們從計算機視覺開始，特別是物體檢測，但我們計劃最終增加人工智能的所有子領域，如自然語言處理、語音和所有很酷的生成性東西。<p>你可以在平臺內做一切事情：創建數據集，訓練人工神經網絡，並使用它們為你的網絡應用、移動應用、機器、安全攝像頭、機器人、無人機、汽車和其他一切東西提供智能。你可以將谷歌colab筆記本連接到我們的平臺，並使用他們的免費GPU進行訓練。忘記所有不同的標籤文件格式和自己運行復雜的代碼，只需將colab連接到Theos，點擊開始訓練按鈕，指標將直接流向你的瀏覽器，我們將自動上傳每個epoch的權重檢查點，所以你不必擔心colab關閉和丟失所有的AI訓練進度。另外，我們還有一個自動標註功能，讓你當前的人工智能的版本幫助你製作一個更好的版本，比手動標註快100倍。最後，你可以將你的人工智能部署為休息API，並通過簡單的http請求在你的軟件中使用它。<p>這裡是物體檢測的入門指南：<p>https://docs.theos.ai/get-started/object-detection<p>請讓我知道你是否覺得它有幫助，以及你認為我們接下來應該處理人工智能的哪個子領域。<p>（登陸頁面還沒有完成，很快我們將發佈一個更好的版本，但現在你可以註冊並免費使用該應用程序）<p>謝謝！\n"
}