{
  "@type": "NewsArticle",
  "identifier": "2022--08--06--en--showhn--HackerNews--NewsArticle--32366642",
  "url": "https://news.ycombinator.com/item?id=32366642",
  "headline": "Show HN: I Created a personal radio platform that delivers news, podcasts, music",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "If you want to keep up with the latest news, podcasts, plus listen to Spotify music delivered in a new way, you should try out AudioOne FYI.<p>AudioOne FYI delivers a personalized radio experience of everything that matters to you, no one else.  Just create an account and tell AudioOne what you like, it will deliver everything as an audio first experience.<p>Get up to 3 personal audio newsletters a day, with   The latest news, subscribed and preferred podcasts and short topical audio clips.<p>Search for the latest news and podcast episodes powered by Google and other sources and listen, not read the results.  You can also follow your search topics and they will be delivered in your own personal radio station.  AudioDrops are going to change how you follow content that matters forever.<p>Soon you will be able to build your own custom radio stations and share them with others.  Create a curated experience of music, news and podcasts that you and your audience can enjoy, always up to date. You will also be able to go live and host guests on your own dedicated radio station or broadcast in syndication.<p>Try it. Want the personal experience, create a free account.<p>More features to come.  Will keep you up to date, here on Hacker News.<p>Thanks,<p>Tony",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "AntonioBray",
    "url": "https://news.ycombinator.com/user?id=AntonioBray"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32366642",
  "sameAs": "https://www.audioone.fyi",
  "dateCreated": "2022-08-06T14:23:38.303Z",
  "datePublished": "2022-08-06T10:03:17.000Z",
  "dateModified": "2022-08-06T14:23:38.303Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 我创建了一个个人广播平台，提供新闻、播客、音乐等服务。\n",
  "headline_zh-Hant": "Show HN: 我創建了一個個人廣播平臺，提供新聞、播客、音樂等服務。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "如果你想了解最新的新闻，播客，再加上听Spotify的音乐，你应该试试AudioOne FYI.<p>AudioOne FYI提供了一个个性化的广播体验，一切都与你有关，没有其他人。 只需创建一个帐户并告诉AudioOne你喜欢什么，它将以音频的方式提供一切。<p>每天获得多达3个个人音频通讯，包括最新的新闻、订阅和首选的播客以及简短的主题音频剪辑。<p>搜索由谷歌和其他来源提供的最新新闻和播客剧集，并听取而不是阅读结果。 你还可以关注你的搜索主题，它们将在你自己的个人电台中传递。 AudioDrops将永远改变你关注重要内容的方式。<p>很快，你将能够建立你自己的定制广播电台，并与他人分享它们。 创建你和你的听众可以享受的音乐、新闻和播客的精心策划的体验，始终是最新的。你还将能够在你自己的专用电台上进行直播和主持嘉宾，或在联合广播中进行广播。<p>试试吧。想获得个人体验，请创建一个免费账户。<p>更多的功能即将推出。 我们将在Hacker News上为您提供最新信息。<p>谢谢，<p>Tony\n",
  "description_zh-Hant": "如果你想了解最新的新聞，播客，再加上聽Spotify的音樂，你應該試試AudioOne FYI.<p>AudioOne FYI提供了一個個性化的廣播體驗，一切都與你有關，沒有其他人。 只需創建一個帳戶並告訴AudioOne你喜歡什麼，它將以音頻的方式提供一切。<p>每天獲得多達3個個人音頻通訊，包括最新的新聞、訂閱和首選的播客以及簡短的主題音頻剪輯。<p>搜索由谷歌和其他來源提供的最新新聞和播客劇集，並聽取而不是閱讀結果。 你還可以關注你的搜索主題，它們將在你自己的個人電臺中傳遞。 AudioDrops將永遠改變你關注重要內容的方式。<p>很快，你將能夠建立你自己的定製廣播電臺，並與他人分享它們。 創建你和你的聽眾可以享受的音樂、新聞和播客的精心策劃的體驗，始終是最新的。你還將能夠在你自己的專用電臺上進行直播和主持嘉賓，或在聯合廣播中進行廣播。<p>試試吧。想獲得個人體驗，請創建一個免費賬戶。<p>更多的功能即將推出。 我們將在Hacker News上為您提供最新信息。<p>謝謝，<p>Tony\n"
}