{
  "@type": "NewsArticle",
  "identifier": "2022--06--04--en--showhn--HackerNews--NewsArticle--31621689",
  "url": "https://news.ycombinator.com/item?id=31621689",
  "headline": "Show HN: Lorblets, a Little Puzzle Game",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Lorblets is a little puzzle game I made: https://www.lorblets.com/<p>Lorblets is a variation on Lights Out. The goal of Lorblets is to turn ON all the lights. Unlike Lights Out (typically a grid of black and white squares), Lorblets puzzles have complex shapes (and bright colors!). The puzzles in Lorblets are generated at random from a seed, and they grow in size as you progress.<p>The code quality is...not great? The design leaves something to be desired. And the game itself is a bit derivative. So why am I sharing this? Because I want to celebrate having shipped a complete game - modest though it may be.<p>I'm a 39yo who has long dreamt of one day making a game. And yet I've tended to put my software engineering skills to work doing everything except that. I've devised complicated game mechanics on paper. I've written multiple overly complicated game &quot;engines&quot; in JavaScript. I've daydreamed for countless hours about my magnum opus: a 3D simulated open world with a natural language interface, narrative generation, character customization, scene building tools, a modding system... Long story short, that magnum opus has been fun to tinker on, but has not amounted to much beyond the spinning of wheels and the occupation of my free time.<p>So over the Memorial Day holiday I decided to force myself to complete one game before the weekend was over. I would conceive the simplest possible game mechanic and UI. I would not worry if it was unoriginal. I would resist the urge to add complexity. I would not get bogged down standing up a framework. I would not build an &quot;engine.&quot; I would not worry about clean code, or maintainability, or even performance. I would use the tech stack that I could work fastest in: web tech. And I would not worry that the astral projection of Jonathan Blow would visit me at night and chide me for having made a badly performing web browser game.<p>So, Lorblets is the result. Whatever one might say about it, it IS a game, and that's something. Feedback is welcome of course - but I mostly just wanted to share my story with y'all.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "matthewtoast",
    "url": "https://news.ycombinator.com/user?id=matthewtoast"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31621689",
  "sameAs": "https://news.ycombinator.com/item?id=31621689",
  "dateCreated": "2022-06-04T15:58:27.359Z",
  "datePublished": "2022-06-04T15:43:45.000Z",
  "dateModified": "2022-06-04T15:58:27.359Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 小游戏Lorblets，一个小小的益智游戏\n",
  "headline_zh-Hant": "Show HN: 小遊戲Lorblets，一個小小的益智遊戲\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Lorblets是我做的一个小益智游戏：https://www.lorblets.com/<p>Lorblets是Lights Out的一个变种。Lorblets的目标是打开所有的灯。与 \"熄灯 \"不同（通常是黑白方格），Lorblets谜题有复杂的形状（和明亮的颜色！）。Lorblets中的谜题是由一个种子随机生成的，并且随着你的进展，它们的大小也在不断增加。设计上还有待改进。而游戏本身也有点衍生性。那么我为什么要分享这个？因为我想庆祝一下我完成了一个完整的游戏--尽管它可能是不大的。<p>我是一个39岁的人，一直梦想着有一天能做一个游戏。然而，我一直倾向于将我的软件工程技能用于除此以外的一切工作。我曾在纸上设计过复杂的游戏机制。我用JavaScript编写过多个过于复杂的游戏引擎。我曾无数次幻想我的大作：一个具有自然语言界面的3D模拟开放世界，叙事生成，角色定制，场景构建工具，修改系统...... 长话短说，这个大作在修补上很有趣，但除了转动轮子和占用我的空闲时间外，并没有达到什么效果。<p>所以在纪念日假期，我决定强迫自己在周末结束前完成一个游戏。我将构思出最简单的游戏机制和用户界面。我不会担心它是否不具原创性。我将抵制增加复杂性的冲动。我不会为建立一个框架而感到困扰。我不会建立一个&quot;引擎。&quot;我不会担心干净的代码，或可维护性，甚至是性能。我将使用我可以最快工作的技术栈：网络技术。我也不会担心Jonathan Blow的星际投影会在晚上拜访我，责备我做了一个性能很差的网络浏览器游戏。不管人们对它怎么说，它是一个游戏，这很重要。当然，我们欢迎反馈 - 但我主要是想与你们分享我的故事。\n",
  "description_zh-Hant": "Lorblets是我做的一個小益智遊戲：https://www.lorblets.com/<p>Lorblets是Lights Out的一個變種。Lorblets的目標是打開所有的燈。與 \"熄燈 \"不同（通常是黑白方格），Lorblets謎題有複雜的形狀（和明亮的顏色！）。Lorblets中的謎題是由一個種子隨機生成的，並且隨著你的進展，它們的大小也在不斷增加。設計上還有待改進。而遊戲本身也有點衍生性。那麼我為什麼要分享這個？因為我想慶祝一下我完成了一個完整的遊戲--儘管它可能是不大的。<p>我是一個39歲的人，一直夢想著有一天能做一個遊戲。然而，我一直傾向於將我的軟件工程技能用於除此以外的一切工作。我曾在紙上設計過複雜的遊戲機制。我用JavaScript編寫過多個過於複雜的遊戲引擎。我曾無數次幻想我的大作：一個具有自然語言界面的3D模擬開放世界，敘事生成，角色定製，場景構建工具，修改系統...... 長話短說，這個大作在修補上很有趣，但除了轉動輪子和佔用我的空閒時間外，並沒有達到什麼效果。<p>所以在紀念日假期，我決定強迫自己在週末結束前完成一個遊戲。我將構思出最簡單的遊戲機制和用戶界面。我不會擔心它是否不具原創性。我將抵制增加複雜性的衝動。我不會為建立一個框架而感到困擾。我不會建立一個&quot;引擎。&quot;我不會擔心乾淨的代碼，或可維護性，甚至是性能。我將使用我可以最快工作的技術棧：網絡技術。我也不會擔心Jonathan Blow的星際投影會在晚上拜訪我，責備我做了一個性能很差的網絡瀏覽器遊戲。不管人們對它怎麼說，它是一個遊戲，這很重要。當然，我們歡迎反饋 - 但我主要是想與你們分享我的故事。\n"
}