{
  "@type": "NewsArticle",
  "identifier": "2022--07--15--en--showhn--HackerNews--NewsArticle--32111109",
  "url": "https://news.ycombinator.com/item?id=32111109",
  "headline": "Show HN: I built a tool for writing notes that can be read after your death",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN!<p>During my spare time and with own my resources I created WeExpire (<a href=\"https://weexpire.org\" rel=\"nofollow\">https://weexpire.org</a>): an opensource tool that allows users to create emergency notes which can be read in case of the user’s incapacitating injury or death.<p>First of all, I should tell you that technically I am not a programmer but a product designer - so forgive me if the code doesn’t comply with all best practices or satisfy all standards. Plus, this is my very first opensource project.<p>Like most people, death wasn’t on my mind very much when I was young. Now that I'm in my thirties, however, I can’t deny mulling over my own mortality every once in a while. These days, I’m far more aware of how fragile we all are and how quickly life can change—or end. Death is a much more frequent occurrence than we want to admit and when it happens, the emptiness that friends and loved ones feel is huge and profound. That’s why I decided to develop this tool.<p>Now sure, if a person wants to leave a simple, private message for loved ones to read in the event of that person’s death, a notary or online will and testament service would work fine. But those options can be expensive and/or time-consuming. Even worse, online services store this sensitive information in a database that could possibly be breached.<p>Of course, there are even “easier” alternatives: a simple piece of paper (but anyone could read that before death occurs) or storing the message  in a password manager (but there are still quite a few people who don’t use password managers).<p>I just wanted something easy that could generate one or more messages on the fly, without too much fuss and by always respecting the user privacy.<p>WeExpire creates a unique and encrypted URL that contains the message and all its settings. To ensure manageability for the average user, the URL is converted into a QR code that can be printed and left for the trusted recipient. The message can be read only if the message creator (after receiving an email alert that message access is being attempted) doesn’t perform a prevention action to maintain locked status.<p>From a security standpoint, the sensitive data contained in the URL can’t be acquired any other way or from any other location. It is retrievable only via the physical QR code and its access code is randomly generated.<p>A couple of important points: there is a message length restriction due to the URL’s limit of around 2000 characters in most browsers. Also, once the URL has been generated, the message cannot be edited - but I mitigated this by adding an optional expiration date, so the user can generate a new emergency note once the previous one has expired.<p>Obviously some of you are thinking: why risk generating my last living message(s) on a platform run by only one person? What if the service gets shut down? What if that person dies before I do?<p>I built WeExpire with endurance in mind. If (or more accurately, when) I die, the platform will “stay alive” for another five years. A message on the website will inform users about my demise and give those users more than enough time to take care of the situation however they see fit.<p>I would really like to hear your opinion, any feedback is welcome.<p>Thank you!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "ciccionamente",
    "url": "https://news.ycombinator.com/user?id=ciccionamente"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32111109",
  "sameAs": "https://weexpire.org",
  "dateCreated": "2022-07-15T18:32:52.478Z",
  "datePublished": "2022-07-15T18:08:49.000Z",
  "dateModified": "2022-07-15T18:32:52.478Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Show HN: 我建立了一个写笔记的工具，可以在你死后阅读。\n",
  "headline_zh-Hant": "Show HN: 我建立了一個寫筆記的工具，可以在你死後閱讀。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，HN！<p>在我的业余时间和我自己的资源中，我创建了WeExpire（<a href=\"https://weexpire.org\" rel=\"nofollow\">https://weexpire.org</a>）：一个开源工具，允许用户创建紧急笔记，在用户失去能力的伤害或死亡时可以阅读。<p>首先，我应该告诉你，在技术上我不是一个程序员，而是一个产品设计师 - 所以如果代码不符合所有最佳实践或满足所有标准请原谅我。另外，这是我的第一个开源项目。<p>和大多数人一样，我年轻的时候并不怎么考虑死亡。然而，现在我已经三十多岁了，我不能否认我偶尔会思考自己的死亡问题。这些天来，我更清楚地意识到我们所有人是多么脆弱，生命可以迅速改变或结束。死亡的发生比我们想承认的要频繁得多，当它发生时，朋友和亲人感到的空虚是巨大而深刻的。这就是为什么我决定开发这个工具。<p>当然，如果一个人想留下一个简单的私人信息，供亲人在他去世时阅读，公证或在线遗嘱服务会很有效。但这些选择可能是昂贵和/或耗时的。<p>当然，还有更 \"简单 \"的选择：一张简单的纸（但任何人都可以在死亡发生之前阅读）或将信息存储在密码管理器中（但仍有相当多的人不使用密码管理器）。 <p>我只是想要一些简单的东西，能够在飞行中生成一条或多条信息，而不需要太多麻烦，并始终尊重用户的隐私。<p>WeExpire创建了一个独特的加密URL，其中包含信息及其所有设置。为了确保普通用户的可管理性，该URL被转换为一个QR码，可以打印出来并留给信任的收件人。只有当信息创建者（在收到试图访问信息的电子邮件提醒后）不执行预防措施以保持锁定状态时，信息才能被读取。<p>从安全角度来看，URL中包含的敏感数据不能以任何其他方式或从任何其他地点获得。它只能通过物理QR码检索，其访问代码是随机生成的。<p>几个重要的问题：由于URL在大多数浏览器中限制在2000个字符左右，因此有一个信息长度限制。此外，一旦生成了URL，信息就不能被编辑--但我通过添加一个可选的有效期来缓解这一问题，因此用户可以在之前的信息过期后生成一个新的紧急通知。<p>显然，你们中的一些人在想：为什么要冒险在一个只有一个人运行的平台上生成我最后的生活信息？如果该服务被关闭了怎么办？如果那个人比我先死怎么办？<p>我在建立WeExpire时考虑到了持久性。如果（或者更准确地说，当）我死了，这个平台将再 \"存活 \"五年。网站上的信息将告知用户我的死亡，并给这些用户足够的时间来处理他们认为合适的情况。<p>我真的想听听你的意见，欢迎任何反馈。\n",
  "description_zh-Hant": "嘿，HN！<p>在我的業餘時間和我自己的資源中，我創建了WeExpire（<a href=\"https://weexpire.org\" rel=\"nofollow\">https://weexpire.org</a>）：一個開源工具，允許用戶創建緊急筆記，在用戶失去能力的傷害或死亡時可以閱讀。<p>首先，我應該告訴你，在技術上我不是一個程序員，而是一個產品設計師 - 所以如果代碼不符合所有最佳實踐或滿足所有標準請原諒我。另外，這是我的第一個開源項目。<p>和大多數人一樣，我年輕的時候並不怎麼考慮死亡。然而，現在我已經三十多歲了，我不能否認我偶爾會思考自己的死亡問題。這些天來，我更清楚地意識到我們所有人是多麼脆弱，生命可以迅速改變或結束。死亡的發生比我們想承認的要頻繁得多，當它發生時，朋友和親人感到的空虛是巨大而深刻的。這就是為什麼我決定開發這個工具。<p>當然，如果一個人想留下一個簡單的私人信息，供親人在他去世時閱讀，公證或在線遺囑服務會很有效。但這些選擇可能是昂貴和/或耗時的。<p>當然，還有更 \"簡單 \"的選擇：一張簡單的紙（但任何人都可以在死亡發生之前閱讀）或將信息存儲在密碼管理器中（但仍有相當多的人不使用密碼管理器）。 <p>我只是想要一些簡單的東西，能夠在飛行中生成一條或多條信息，而不需要太多麻煩，並始終尊重用戶的隱私。<p>WeExpire創建了一個獨特的加密URL，其中包含信息及其所有設置。為了確保普通用戶的可管理性，該URL被轉換為一個QR碼，可以打印出來並留給信任的收件人。只有當信息創建者（在收到試圖訪問信息的電子郵件提醒後）不執行預防措施以保持鎖定狀態時，信息才能被讀取。<p>從安全角度來看，URL中包含的敏感數據不能以任何其他方式或從任何其他地點獲得。它只能通過物理QR碼檢索，其訪問代碼是隨機生成的。<p>幾個重要的問題：由於URL在大多數瀏覽器中限制在2000個字符左右，因此有一個信息長度限制。此外，一旦生成了URL，信息就不能被編輯--但我通過添加一個可選的有效期來緩解這一問題，因此用戶可以在之前的信息過期後生成一個新的緊急通知。<p>顯然，你們中的一些人在想：為什麼要冒險在一個只有一個人運行的平臺上生成我最後的生活信息？如果該服務被關閉了怎麼辦？如果那個人比我先死怎麼辦？<p>我在建立WeExpire時考慮到了持久性。如果（或者更準確地說，當）我死了，這個平臺將再 \"存活 \"五年。網站上的信息將告知用戶我的死亡，並給這些用戶足夠的時間來處理他們認為合適的情況。<p>我真的想聽聽你的意見，歡迎任何反饋。\n"
}