{
  "@type": "NewsArticle",
  "identifier": "2022--07--05--en--showhn--HackerNews--NewsArticle--31987430",
  "url": "https://news.ycombinator.com/item?id=31987430",
  "headline": "Show HN: Get paid to get ephemeral environments for every PR (Livecycle.io)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We've build a front-end dev tools platform called Livecycle - https://livecycle.io/.<p>Livecycle lets dev teams review code faster by enabling them to collaborating on top of ephemeral environments.<p>Livecycle creates a live preview environment &quot;playground&quot; for every PR. Collaborators (both technical and non-technical) can join the playground, review and leave comments on top of the preview environment itself. Comments are also synced to Git, making the code reviews faster and feedback clearer. And since all reviews (even the less-technical ones) are done instantly and asynchronously, developers have fewer distractions and context switches to contend with.<p>Our platform is self-serve and free to use.<p>We're excited about how much we can help developers do their best work, and so we're determined to reach even more relevant folks.<p>We're even willing to pay you to try it (for a limited time).<p>Our offer is pretty simple - to the next 20 relevant developers who think this is something that can benefit you and your team, we'll send you a $25 Amazon gift card if you do the following:\n- Sign up to Livecycle (free)\n- Connect your Git and run a build\n- Post a screenshot of your Livecycle preview env/dashboard on Twitter and tag us @get_livecycle (to let us know that you're up and running successfully)<p>And if you give us more detailed feedback and/or invite others to collaborate on your Livecycle playground, we'll even throw in some free swag - https://store.livecycle.io/.<p>Any questions - please let us know!<p>We know this might sound spammy, but it's not. It's legit. We're being totally up front about this. We're just excited about our product and so we're offering a limited-time incentive to our next round of users.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "zevir",
    "url": "https://news.ycombinator.com/user?id=zevir"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31987430",
  "sameAs": "https://news.ycombinator.com/item?id=31987430",
  "dateCreated": "2022-07-05T12:52:57.873Z",
  "datePublished": "2022-07-05T12:32:56.000Z",
  "dateModified": "2022-07-05T12:52:57.873Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Show HN: 获得报酬，为每一次公关获得短暂的环境（Livecycle.io）。\n",
  "headline_zh-Hant": "Show HN: 獲得報酬，為每一次公關獲得短暫的環境（Livecycle.io）。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们建立了一个名为Livecycle的前端开发工具平台--https://livecycle.io/。<p>Livecycle让开发团队能够在短暂的环境之上进行协作，从而更快地审查代码。<p>Livecycle为每个PR创建了一个实时预览环境&quot;playground&quot; 。合作者（包括技术和非技术的）可以加入这个游戏场，在预览环境本身的基础上审查和留下评论。评论也会被同步到Git上，使代码审查更快，反馈更清晰。由于所有审查（即使是技术性不强的审查）都是即时和异步完成的，因此开发人员需要应对的干扰和上下文切换较少。<p>我们的平台是自助式的，可以免费使用。<p>我们对能够帮助开发人员完成其最佳工作感到兴奋，因此我们决心接触更多相关人员。 <p>我们甚至愿意为你的尝试付费（在有限的时间内）。<p>我们的提议非常简单--对于接下来的20位认为这对你和你的团队有益的相关开发者，如果你做了以下事情，我们将向你发送一张25美元的亚马逊礼品卡。\n- 注册Livecycle（免费）\n- 连接你的Git并运行一个构建\n- 在Twitter上发布你的Livecycle预览环境/仪表盘的截图，并标记我们@get_livecycle（让我们知道你已经成功启动并运行）<p>如果你给我们更详细的反馈和/或邀请其他人在你的Livecycle平台上合作，我们甚至会扔一些免费的礼品 - https://store.livecycle.io/。<p>任何问题 - 请让我们知道！<p>我们知道这可能听起来很垃圾，但这不是。它是合法的。我们在这方面是完全公开的。我们只是对我们的产品感到兴奋，所以我们为我们的下一轮用户提供了一个限时的激励措施。\n",
  "description_zh-Hant": "我們建立了一個名為Livecycle的前端開發工具平臺--https://livecycle.io/。<p>Livecycle讓開發團隊能夠在短暫的環境之上進行協作，從而更快地審查代碼。<p>Livecycle為每個PR創建了一個實時預覽環境&quot;playground&quot; 。合作者（包括技術和非技術的）可以加入這個遊戲場，在預覽環境本身的基礎上審查和留下評論。評論也會被同步到Git上，使代碼審查更快，反饋更清晰。由於所有審查（即使是技術性不強的審查）都是即時和異步完成的，因此開發人員需要應對的干擾和上下文切換較少。<p>我們的平臺是自助式的，可以免費使用。<p>我們對能夠幫助開發人員完成其最佳工作感到興奮，因此我們決心接觸更多相關人員。 <p>我們甚至願意為你的嘗試付費（在有限的時間內）。<p>我們的提議非常簡單--對於接下來的20位認為這對你和你的團隊有益的相關開發者，如果你做了以下事情，我們將向你發送一張25美元的亞馬遜禮品卡。\n- 註冊Livecycle（免費）\n- 連接你的Git並運行一個構建\n- 在Twitter上發佈你的Livecycle預覽環境/儀表盤的截圖，並標記我們@get_livecycle（讓我們知道你已經成功啟動並運行）<p>如果你給我們更詳細的反饋和/或邀請其他人在你的Livecycle平臺上合作，我們甚至會扔一些免費的禮品 - https://store.livecycle.io/。<p>任何問題 - 請讓我們知道！<p>我們知道這可能聽起來很垃圾，但這不是。它是合法的。我們在這方面是完全公開的。我們只是對我們的產品感到興奮，所以我們為我們的下一輪用戶提供了一個限時的激勵措施。\n"
}