{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--showhn--HackerNews--NewsArticle--32297005",
  "url": "https://news.ycombinator.com/item?id=32297005",
  "headline": "Show HN: Isla – Calendly for Task Management",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "In today's workplace, we use countless communication tools. They provide lots of value but quickly become uncontrollably full of noise. Plus, it's so easy to use these tools that people don't stop even for a second to think about what they ask (impact, context, etc.) and the consequences of interrupting people, forcing them to switch contexts continuously. This is detrimental to deep work.<p>Sick of this, I decided to talk with some 40 people at companies small to big (Uber, Spotify, Stripe, etc.) and dig deeper to understand if and how they solve this problem.<p>It turns out that in many companies with more than 300-400 people, the amount of tools and noise created becomes uncontrollable. Plus, it's strenuous to enforce communication policies in the workplace.<p>I then decided to build a tool that you can think of as Calendly for task management. Instead of allowing people to bombard you from everywhere in an uncontrollable and unstructured way (WhatsApp, Slack, Emails, etc.), you give them a link, and they fill requests with the information you previously defined as required/optional.<p>Plus, you can plug in Trello and Asana (more to come) so that you don’t have to copy and paste requests that come your way into your personal or team board.<p>Plus, requesters automatically update on changes without accessing your board or having an account.<p>Please let me know if this is total bs or provides any value to you.<p>Note: I developed this in 1 month so expect things to break potentially.<p>I sincerely thank any feedback either here below, at romeo@getisla.com, or in the site's chat.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "rbellon",
    "url": "https://news.ycombinator.com/user?id=rbellon"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32297005",
  "sameAs": "https://getisla.com",
  "dateCreated": "2022-07-31T17:36:09.543Z",
  "datePublished": "2022-07-31T17:15:09.000Z",
  "dateModified": "2022-07-31T17:36:09.543Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Isla - 任务管理的Calendly\n",
  "headline_zh-Hant": "Show HN: Isla - 任務管理的Calendly\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在今天的工作场所，我们使用无数的沟通工具。它们提供了很多价值，但很快就变得无法控制地充满了噪音。此外，使用这些工具是如此容易，以至于人们甚至不会停下来思考他们所问的问题（影响、背景等），以及打断别人的后果，迫使他们不断切换背景。<p>对此，我决定与大大小小的公司（Uber、Spotify、Stripe等）的大约40人进行交谈，深入了解他们是否以及如何解决这个问题。<p>事实证明，在许多拥有300-400人以上的公司，所创造的工具和噪音数量变得无法控制。此外，在工作场所执行沟通政策也很吃力。<p>然后我决定建立一个工具，你可以把它看作是任务管理的Calendly。你给他们一个链接，他们就会用你之前定义的必要/可选信息来填写请求，而不是让人们以不可控制和无序的方式（WhatsApp、Slack、电子邮件等）从各处轰炸你。<p>此外，你可以插入Trello和Asana（未来会有更多），这样你就不必复制和粘贴你的请求到个人或团队董事会。 <p>此外，请求者无需访问你的董事会或拥有一个账户就能自动更新变化。<p>如果这完全是胡说八道或为你提供任何价值，请让我知道。<p>注意：我在1个月内开发了这个软件，所以预计有可能出现问题。<p>我真诚地感谢任何反馈，无论是在这里，在romeo@getisla.com，还是在网站的聊天室。\n",
  "description_zh-Hant": "在今天的工作場所，我們使用無數的溝通工具。它們提供了很多價值，但很快就變得無法控制地充滿了噪音。此外，使用這些工具是如此容易，以至於人們甚至不會停下來思考他們所問的問題（影響、背景等），以及打斷別人的後果，迫使他們不斷切換背景。<p>對此，我決定與大大小小的公司（Uber、Spotify、Stripe等）的大約40人進行交談，深入瞭解他們是否以及如何解決這個問題。<p>事實證明，在許多擁有300-400人以上的公司，所創造的工具和噪音數量變得無法控制。此外，在工作場所執行溝通政策也很吃力。<p>然後我決定建立一個工具，你可以把它看作是任務管理的Calendly。你給他們一個鏈接，他們就會用你之前定義的必要/可選信息來填寫請求，而不是讓人們以不可控制和無序的方式（WhatsApp、Slack、電子郵件等）從各處轟炸你。<p>此外，你可以插入Trello和Asana（未來會有更多），這樣你就不必複製和粘貼你的請求到個人或團隊董事會。 <p>此外，請求者無需訪問你的董事會或擁有一個賬戶就能自動更新變化。<p>如果這完全是胡說八道或為你提供任何價值，請讓我知道。<p>注意：我在1個月內開發了這個軟件，所以預計有可能出現問題。<p>我真誠地感謝任何反饋，無論是在這裡，在romeo@getisla.com，還是在網站的聊天室。\n"
}