{
  "@type": "NewsArticle",
  "identifier": "2022--08--02--en--showhn--HackerNews--NewsArticle--32315986",
  "url": "https://news.ycombinator.com/item?id=32315986",
  "headline": "Show HN: Learning Loop – a personalized discovery platform for learning",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Problem\nLearning a new skill online has become impossible for most people:\n● There is no universal starting point - There are 400 to 4000 online courses for the topics majority of internet users are searching to learn online, and over 10,000 videos and blog posts. \n● Too much content, no effective filters - Too many unsuccessful search attempts for finding the right learning resources make users feel stupid and quit their learning journey.\n● People learn in silos and their learning insights aren’t transparent- Millions of people have been learning the same things every day, for years, yet there is no easy-to-discover information on the best ways to learn something<p>Anyone can be great at anything, given the right guidance, but finding guidance has become too hard. Most people live a lifetime and die without learning what they can love and be great at.<p>That aside, learning is generally hard. When you learn something new, you feel temporarily incompetent. The world’s learning interfaces aren’t designed with that in mind, and therefore fail most users in their learning journey.<p>Solution\nLearning is acquiring the right knowledge related to your learning goal, in a timely manner.<p>A plethora of factors including your competence level, weekly schedule, headspace and your geographic location and wealth can change the complexion of learning, but learning has an overarching workflow. Learning Loop embeds the best practices from great learners in every field into a product that streamlines the learning process and increases a user’s exposure to hyper local learning insights and steps so that the user can learn like the top 1% of learners.<p>We are building towards: a software product that helps anyone learn anything they want and be great at it.<p>Our starting point: a platform that helps startup founders find hyper local startup lessons documented by seasoned founders, neatly organized in categories such as fundraising, sales, product, growth, hiring, fully searchable with hyper local filters such as funding stage, region, industry and investor.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "miletus",
    "url": "https://news.ycombinator.com/user?id=miletus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32315986",
  "sameAs": "https://app.learningloop.org/loop/founders",
  "dateCreated": "2022-08-02T07:27:23.632Z",
  "datePublished": "2022-08-02T07:19:37.000Z",
  "dateModified": "2022-08-02T07:27:23.632Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Show HN: 学习环 - 一个个性化的学习发现平台\n",
  "headline_zh-Hant": "Show HN: 學習環 - 一個個性化的學習發現平臺\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "问题\n对大多数人来说，在网上学习一项新技能已经变得不可能。\n没有一个通用的起点--对于大多数网民在网上搜索的主题，有400到4000个在线课程，还有超过10000个视频和博客文章。\n内容太多，没有有效的过滤器--为寻找正确的学习资源而进行的太多不成功的搜索使用户感到愚蠢并放弃了他们的学习之旅。\n● 人们在孤岛上学习，他们的学习见解不透明--数百万人每天都在学习同样的东西，多年来都是如此，但却没有关于学习某样东西的最佳方法的易于发现的信息<p>只要有正确的指导，任何人都可以在任何方面成为伟大的人，但寻找指导已经变得太难。大多数人活了一辈子，却没有学到他们可以热爱和擅长的东西而死去。<p>撇开这一点不谈，学习一般来说是很难的。当你学习新东西时，你会感到暂时的无能。世界上的学习界面在设计时并没有考虑到这一点，因此，大多数用户在学习过程中都会失败。\n学习是及时获得与你的学习目标相关的正确知识。<p>大量的因素，包括你的能力水平、每周的时间表、头脑空间以及你的地理位置和财富，都可以改变学习的复杂性，但学习有一个总体的工作流程。Learning Loop将各个领域的优秀学习者的最佳实践嵌入到一个产品中，以简化学习过程，增加用户对超本地学习见解和步骤的接触，从而使用户能够像前1%的学习者那样学习。<p>我们正在建立：一个软件产品，帮助任何人学习他们想要的任何东西，并在这方面表现出色。 <p>我们的起点：一个帮助创业公司创始人找到由经验丰富的创始人记录的超本地创业课程的平台，这些课程按筹资、销售、产品、增长、招聘等类别整齐地组织起来，可通过超本地过滤器（如筹资阶段、地区、行业和投资者）进行全面搜索。\n",
  "description_zh-Hant": "問題\n對大多數人來說，在網上學習一項新技能已經變得不可能。\n沒有一個通用的起點--對於大多數網民在網上搜索的主題，有400到4000個在線課程，還有超過10000個視頻和博客文章。\n內容太多，沒有有效的過濾器--為尋找正確的學習資源而進行的太多不成功的搜索使用戶感到愚蠢並放棄了他們的學習之旅。\n● 人們在孤島上學習，他們的學習見解不透明--數百萬人每天都在學習同樣的東西，多年來都是如此，但卻沒有關於學習某樣東西的最佳方法的易於發現的信息<p>只要有正確的指導，任何人都可以在任何方面成為偉大的人，但尋找指導已經變得太難。大多數人活了一輩子，卻沒有學到他們可以熱愛和擅長的東西而死去。<p>撇開這一點不談，學習一般來說是很難的。當你學習新東西時，你會感到暫時的無能。世界上的學習界面在設計時並沒有考慮到這一點，因此，大多數用戶在學習過程中都會失敗。\n學習是及時獲得與你的學習目標相關的正確知識。<p>大量的因素，包括你的能力水平、每週的時間表、頭腦空間以及你的地理位置和財富，都可以改變學習的複雜性，但學習有一個總體的工作流程。Learning Loop將各個領域的優秀學習者的最佳實踐嵌入到一個產品中，以簡化學習過程，增加用戶對超本地學習見解和步驟的接觸，從而使用戶能夠像前1%的學習者那樣學習。<p>我們正在建立：一個軟件產品，幫助任何人學習他們想要的任何東西，並在這方面表現出色。 <p>我們的起點：一個幫助創業公司創始人找到由經驗豐富的創始人記錄的超本地創業課程的平臺，這些課程按籌資、銷售、產品、增長、招聘等類別整齊地組織起來，可通過超本地過濾器（如籌資階段、地區、行業和投資者）進行全面搜索。\n"
}