{
  "@type": "NewsArticle",
  "identifier": "2022--06--17--en--showhn--HackerNews--NewsArticle--31780076",
  "url": "https://news.ycombinator.com/item?id=31780076",
  "headline": "Show HN: Root Cause as a Service – Never dig through logs again",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey Folks – Larry, Ajay and Rod here!<p>We address the age old painful problem of digging through logs to find the root cause when a problem occurs. No-one likes searching through logs, and so we spent a few years analyzing 100’s of real world incidents to understand how humans troubleshoot in logs. And then we built a solution that automatically finds the same root cause indicators a human would have had to manually search for. We call it Root Cause as a Service. RCaaS works with any app and does not require manual training or rules. Our foundational thoughts and more details can be found here: https://www.zebrium.com/blog/its-time-to-automate-the-observer.<p>Obviously, everyone is skeptical when they hear about RCaaS. We encourage you try it yourself, but we also have a really strong validation point. One of our customers performed a study using 192 actual customer incidents from 4 different products and found that Zebrium correctly identified the root cause indicators in the logs in over 95% of the incidents – see https://www.zebrium.com/cisco-validation.<p>For those that are interested, this is actually our second SHOW HN post, our first was last June - https://news.ycombinator.com/item?id=23490609. The link in that post points to our current home page but our initial comment was, &quot;We're excited to share Zebrium's autonomous incident detection software&quot;. At the time, our focus was on a tool that used unsupervised ML to automatically detect any kind of new or unknown software incident. We had done a lot of customer testing and were achieving &gt; 90% detection accuracy in catching almost any kind of problem. But what we underestimated is just how high the bar is for incident detection. If someone is going to hook you up to a pager, then even an occasional false positive is enough for a user to start cursing your product! And users quickly forget about the times when your product saved their bacon by catching problems that they would otherwise have missed.<p>But late last year we had a huge aha moment! Most customers already have monitoring tools in place that are really good at detecting problems, but what they don't have is an automated way to find the root cause. So, we built some really elegant integrations for Datadog, New Relic, Elastic, Grafana, Dynatrace, AppDynamics and ScienceLogic (and more to come via our open APIs) so that when there's a problem, you see details of the root cause directly on your monitoring dashboard. Here's a 2 minute demo of what it looks like: https://youtu.be/t83Egs5l8ok.<p>You're welcome to sign-up for a free trial at https://www.zebrium.com and we'd love to hear your questions and feedback.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "stochastimus",
    "url": "https://news.ycombinator.com/user?id=stochastimus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31780076",
  "sameAs": "https://news.ycombinator.com/item?id=31780076",
  "dateCreated": "2022-06-17T16:41:59.484Z",
  "datePublished": "2022-06-17T15:55:21.000Z",
  "dateModified": "2022-06-17T16:41:59.484Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 根源即服务--不再翻阅日志\n",
  "headline_zh-Hant": "Show HN: 根源即服務--不再翻閱日誌\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，伙计们--我是Larry、Ajay和Rod！<p>我们解决了一个古老的痛苦问题，即当一个问题发生时，要通过挖掘日志来找到根本原因。没有人喜欢搜索日志，因此我们花了几年时间分析了100多个真实世界的事件，以了解人类如何在日志中排除故障。然后，我们建立了一个解决方案，自动找到人类不得不手动搜索的相同的根本原因指标。我们称之为 \"根源即服务\"。RCaaS适用于任何应用程序，不需要人工培训或规则。我们的基础思想和更多细节可以在这里找到：https://www.zebrium.com/blog/its-time-to-automate-the-observer。<p>显然，每个人在听到RCaaS的时候都会持怀疑态度。我们鼓励你亲自尝试，但我们也有一个非常有力的验证点。我们的一个客户使用4种不同产品的192个实际客户事件进行了一项研究，发现Zebrium在超过95%的事件中正确识别了日志中的根本原因指标--见https://www.zebrium.com/cisco-validation。<p>对于那些感兴趣的人来说，这实际上是我们的第二篇SHOW HN帖子，我们的第一篇是在去年六月--https://news.ycombinator.com/item?id=23490609。那篇文章中的链接指向我们目前的主页，但我们最初的评论是：&quot;我们很高兴能分享Zebrium的自主事件检测软件&quot;。当时，我们的重点是一个使用无监督的ML来自动检测任何一种新的或未知的软件事件的工具。我们已经做了大量的客户测试，并在捕捉几乎任何类型的问题方面实现了&gt;90%的检测准确率。但我们低估了事件检测的标准有多高。如果有人要给你挂上传呼机，那么即使是偶尔出现的假阳性，也足以让用户开始骂你的产品了! 而且用户很快就会忘记你的产品通过捕捉他们本来会错过的问题而拯救了他们。<p>但在去年年底，我们有一个巨大的哈哈时刻! 大多数客户已经有了监控工具，这些工具在检测问题方面非常出色，但他们没有一个自动化的方法来找到根本原因。因此，我们为Datadog、New Relic、Elastic、Grafana、Dynatrace、AppDynamics和ScienceLogic建立了一些非常优雅的集成，这样，当出现问题时，你可以直接在监控仪表盘上看到根本原因的细节。下面是一个2分钟的演示：https://youtu.be/t83Egs5l8ok。<p>欢迎你在https://www.zebrium.com 注册免费试用，我们很愿意听到你的问题和反馈。\n",
  "description_zh-Hant": "嘿，夥計們--我是Larry、Ajay和Rod！<p>我們解決了一個古老的痛苦問題，即當一個問題發生時，要通過挖掘日誌來找到根本原因。沒有人喜歡搜索日誌，因此我們花了幾年時間分析了100多個真實世界的事件，以瞭解人類如何在日誌中排除故障。然後，我們建立了一個解決方案，自動找到人類不得不手動搜索的相同的根本原因指標。我們稱之為 \"根源即服務\"。RCaaS適用於任何應用程序，不需要人工培訓或規則。我們的基礎思想和更多細節可以在這裡找到：https://www.zebrium.com/blog/its-time-to-automate-the-observer。<p>顯然，每個人在聽到RCaaS的時候都會持懷疑態度。我們鼓勵你親自嘗試，但我們也有一個非常有力的驗證點。我們的一個客戶使用4種不同產品的192個實際客戶事件進行了一項研究，發現Zebrium在超過95%的事件中正確識別了日誌中的根本原因指標--見https://www.zebrium.com/cisco-validation。<p>對於那些感興趣的人來說，這實際上是我們的第二篇SHOW HN帖子，我們的第一篇是在去年六月--https://news.ycombinator.com/item?id=23490609。那篇文章中的鏈接指向我們目前的主頁，但我們最初的評論是：&quot;我們很高興能分享Zebrium的自主事件檢測軟件&quot;。當時，我們的重點是一個使用無監督的ML來自動檢測任何一種新的或未知的軟件事件的工具。我們已經做了大量的客戶測試，並在捕捉幾乎任何類型的問題方面實現了&gt;90%的檢測準確率。但我們低估了事件檢測的標準有多高。如果有人要給你掛上傳呼機，那麼即使是偶爾出現的假陽性，也足以讓用戶開始罵你的產品了! 而且用戶很快就會忘記你的產品通過捕捉他們本來會錯過的問題而拯救了他們。<p>但在去年年底，我們有一個巨大的哈哈時刻! 大多數客戶已經有了監控工具，這些工具在檢測問題方面非常出色，但他們沒有一個自動化的方法來找到根本原因。因此，我們為Datadog、New Relic、Elastic、Grafana、Dynatrace、AppDynamics和ScienceLogic建立了一些非常優雅的集成，這樣，當出現問題時，你可以直接在監控儀表盤上看到根本原因的細節。下面是一個2分鐘的演示：https://youtu.be/t83Egs5l8ok。<p>歡迎你在https://www.zebrium.com 註冊免費試用，我們很願意聽到你的問題和反饋。\n"
}