{
  "@type": "NewsArticle",
  "identifier": "2022--07--28--en--showhn--HackerNews--NewsArticle--32264480",
  "url": "https://news.ycombinator.com/item?id=32264480",
  "headline": "Show HN: I Made Computer Science Themed Collectible Cards",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi all, I made a Computer Science themed Collectible Cards deck. There are 36 cards in it ranging from simple data structures such as linked list and stack to more advanced ones such as bloom filter and merkle tree.<p>I'm a software engineer with a knack for drawing. A few years back I thought about making playing cards based on Computer Science concepts but I did not make it very far. When I revisited this idea again I decided to start with an MVP: Data Structure Collectible Cards. Each card would depict a data structure, state its space/running time complexities, and provide a brief description of said data structure (so in a way it's like Pokemon collectible/playing cards :))<p>I have a long roadmap that covers many Computer Science/Software Engineering concepts for both collectibles and playing cards. My hope is these decks could be something that spurs people's interest in Computer Science, or something that academics/engineers will feel proud displaying on their shelves (long shot, I know).<p>I'm in the process of figuring out fulfillment and kickstarter campaign. Once I have a gauge of people's interest from email sign-ups, I will put in a bulk order.<p>Feel free to navigate around my site; I've put in all my heart into designing it and I hope you will like it :)",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "tjchear",
    "url": "https://news.ycombinator.com/user?id=tjchear"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32264480",
  "sameAs": "https://www.cs.cards/",
  "dateCreated": "2022-07-28T14:28:36.491Z",
  "datePublished": "2022-07-28T14:07:32.000Z",
  "dateModified": "2022-07-28T14:28:36.491Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 我制作了以计算机科学为主题的收藏卡\n",
  "headline_zh-Hant": "Show HN: 我製作了以計算機科學為主題的收藏卡\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，我做了一套以计算机科学为主题的收藏卡牌。里面有36张牌，从简单的数据结构，如链表和堆栈，到更高级的数据结构，如Bloom filter和Merkle tree。几年前，我曾想过以计算机科学的概念为基础制作扑克牌，但我没有做到很好。当我再次重温这个想法时，我决定从一个MVP开始。数据结构可收集卡片。每张卡片将描述一个数据结构，说明其空间/运行时间的复杂性，并提供上述数据结构的简要描述（所以在某种程度上，它就像口袋妖怪的收藏/游戏卡片：）<p>我有一个很长的路线图，涵盖了许多计算机科学/软件工程概念的收藏品和游戏卡片。我希望这些牌可以成为激发人们对计算机科学的兴趣的东西，或者成为学者/工程师们在他们的书架上感到自豪的东西（我知道，机会渺茫）。一旦我从电子邮件注册中了解到人们的兴趣，我就会进行批量订购。<p>请自由浏览我的网站；我全心全意地设计它，我希望你会喜欢它：)\n",
  "description_zh-Hant": "大家好，我做了一套以計算機科學為主題的收藏卡牌。裡面有36張牌，從簡單的數據結構，如鏈表和堆棧，到更高級的數據結構，如Bloom filter和Merkle tree。幾年前，我曾想過以計算機科學的概念為基礎製作撲克牌，但我沒有做到很好。當我再次重溫這個想法時，我決定從一個MVP開始。數據結構可收集卡片。每張卡片將描述一個數據結構，說明其空間/運行時間的複雜性，並提供上述數據結構的簡要描述（所以在某種程度上，它就像口袋妖怪的收藏/遊戲卡片：）<p>我有一個很長的路線圖，涵蓋了許多計算機科學/軟件工程概念的收藏品和遊戲卡片。我希望這些牌可以成為激發人們對計算機科學的興趣的東西，或者成為學者/工程師們在他們的書架上感到自豪的東西（我知道，機會渺茫）。一旦我從電子郵件註冊中瞭解到人們的興趣，我就會進行批量訂購。<p>請自由瀏覽我的網站；我全心全意地設計它，我希望你會喜歡它：)\n"
}