{
  "@type": "NewsArticle",
  "identifier": "2022--07--26--en--showhn--HackerNews--NewsArticle--32233926",
  "url": "https://news.ycombinator.com/item?id=32233926",
  "headline": "Show HN: We made a way to earn subscriptions by having your computer turned on",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "With the recent explosion of streaming services, paying for the variety of monthly subscriptions is becoming a costly burden. Because of this, we made a desktop app that passively earns users money towards digital subscriptions based on how much data they serve on our peer-to-peer video content delivery network.<p>We created this because we realized large corporations are taking user data to run targeted ads without compensating them. With our project, we hope that users will be able to pay for internet content using their extra computer processing power instead of their personal data.<p>Note that this is a pre-alpha version of our product but please check it out and let us know what you think! Also note, that in future versions we will provide a power user feature with more data on the amount of CPU and bandwidth our application is using in order to provide even more transparency and control to the user.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "tannerg",
    "url": "https://news.ycombinator.com/user?id=tannerg"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32233926",
  "sameAs": "https://www.apiara.net",
  "dateCreated": "2022-07-26T04:22:00.979Z",
  "datePublished": "2022-07-26T03:30:23.000Z",
  "dateModified": "2022-07-26T04:22:00.979Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Show HN: 我们做了一种方法，通过打开你的电脑来赚取订阅费用\n",
  "headline_zh-Hant": "Show HN: 我們做了一種方法，通過打開你的電腦來賺取訂閱費用\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "随着最近流媒体服务的爆炸性增长，为各种月度订阅付费正成为一种昂贵的负担。正因为如此，我们做了一个桌面应用程序，根据用户在我们的点对点视频内容传输网络上提供的数据量，被动地为用户赚取数字订阅费用。<p>我们之所以创建这个项目，是因为我们意识到大公司正在拿用户数据来运行目标广告而不对他们进行补偿。通过我们的项目，我们希望用户能够利用他们额外的计算机处理能力，而不是他们的个人数据，为互联网内容付费。<p>请注意，这是我们产品的前alpha版本，但请检查它，并让我们知道你的想法 还请注意，在未来的版本中，我们将提供一个强大的用户功能，提供更多关于我们的应用程序正在使用的CPU和带宽的数据，以便向用户提供更多的透明度和控制。\n",
  "description_zh-Hant": "隨著最近流媒體服務的爆炸性增長，為各種月度訂閱付費正成為一種昂貴的負擔。正因為如此，我們做了一個桌面應用程序，根據用戶在我們的點對點視頻內容傳輸網絡上提供的數據量，被動地為用戶賺取數字訂閱費用。<p>我們之所以創建這個項目，是因為我們意識到大公司正在拿用戶數據來運行目標廣告而不對他們進行補償。通過我們的項目，我們希望用戶能夠利用他們額外的計算機處理能力，而不是他們的個人數據，為互聯網內容付費。<p>請注意，這是我們產品的前alpha版本，但請檢查它，並讓我們知道你的想法 還請注意，在未來的版本中，我們將提供一個強大的用戶功能，提供更多關於我們的應用程序正在使用的CPU和帶寬的數據，以便向用戶提供更多的透明度和控制。\n"
}