{
  "@type": "NewsArticle",
  "identifier": "2022--06--28--en--showhn--HackerNews--NewsArticle--31912370",
  "url": "https://news.ycombinator.com/item?id=31912370",
  "headline": "Show HN: Flookup – Data cleaning by fuzzy matching",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN!<p>It has been about three years since I launched this current iteration of my Google Sheets add-on called Flookup.<p>I'm a solo developer and, currently, I handle absolutely everything to do with Flookup from writing code, designing the user interface, replying support emails and even marketing.\nIt is quite a lot of work but very satisfying when I see how helpful it has been to my userbase.<p>Before Flookup, there was only one prominent Google Sheets add-on that could be used for data cleaning (to a certain degree) but, luckily for men, it had left a gap in its functionality that I was very glad to fill.<p>To develop Flookup, I had to write a new algorithm from the ground up in order to make it more useful to my userbase. Originally, this userbase comprised me and a small team at an organisation I was working for but, today, that number has grown to at least 10,000 Daily Active Users all over the world (except Antarctica).<p>What is Flookup? It is an add-on that uses fuzzy matching algorithms to power its data cleaning functions. Flookup's functions allow you to match or merge tables without worrying about how uniform your data is. You can also highlight and remove duplicates even if the text contains typos, punctuations marks or spelling differences.<p>So, today, I'm inviting you to try it out and let me know what you think... here is the link:<p>&gt; https://www.getflookup.com<p>Your free trial is free and unlimited.<p>Thank you; I hope you like it!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "chiscript",
    "url": "https://news.ycombinator.com/user?id=chiscript"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31912370",
  "sameAs": "https://news.ycombinator.com/item?id=31912370",
  "dateCreated": "2022-06-28T20:29:03.283Z",
  "datePublished": "2022-06-28T20:07:00.000Z",
  "dateModified": "2022-06-28T20:29:03.283Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Flookup - 通过模糊匹配清理数据\n",
  "headline_zh-Hant": "Show HN: Flookup - 通過模糊匹配清理數據\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN！<p>自从我推出目前这个名为Flookup的Google Sheets插件迭代以来，已经有三年时间了。<p>我是一个单独的开发者，目前，我负责处理与Flookup有关的所有事情，包括编写代码、设计用户界面、回复支持邮件，甚至市场营销。\n<p>在Flookup之前，只有一个著名的Google Sheets插件可用于数据清理（在一定程度上），但幸运的是，它在功能上留下了一个空白，我很高兴能填补这个空白。<p>为了开发Flookup，我不得不从头开始编写一个新的算法，以便使它对我的用户群更加有用。最初，这个用户群包括我和我工作的一个组织的一个小团队，但今天，这个数字已经增长到至少10,000个每日活跃用户，遍布世界各地（南极洲除外）。<p>什么是Flookup？它是一个使用模糊匹配算法的插件，为其数据清理功能提供动力。Flookup的功能允许你匹配或合并表格，而不必担心你的数据是否统一。你还可以突出显示和删除重复的内容，即使文本中含有错别字、标点符号或拼写差异。<p>所以，今天，我邀请你尝试一下，让我知道你的想法......这里是链接：<p>&gt; https://www.getflookup.com<p>你的免费试用是免费和无限制的。<p>谢谢你；我希望你喜欢它!\n",
  "description_zh-Hant": "你好，HN！<p>自從我推出目前這個名為Flookup的Google Sheets插件迭代以來，已經有三年時間了。<p>我是一個單獨的開發者，目前，我負責處理與Flookup有關的所有事情，包括編寫代碼、設計用戶界面、回覆支持郵件，甚至市場營銷。\n<p>在Flookup之前，只有一個著名的Google Sheets插件可用於數據清理（在一定程度上），但幸運的是，它在功能上留下了一個空白，我很高興能填補這個空白。<p>為了開發Flookup，我不得不從頭開始編寫一個新的算法，以便使它對我的用戶群更加有用。最初，這個用戶群包括我和我工作的一個組織的一個小團隊，但今天，這個數字已經增長到至少10,000個每日活躍用戶，遍佈世界各地（南極洲除外）。<p>什麼是Flookup？它是一個使用模糊匹配算法的插件，為其數據清理功能提供動力。Flookup的功能允許你匹配或合併表格，而不必擔心你的數據是否統一。你還可以突出顯示和刪除重複的內容，即使文本中含有錯別字、標點符號或拼寫差異。<p>所以，今天，我邀請你嘗試一下，讓我知道你的想法......這裡是鏈接：<p>&gt; https://www.getflookup.com<p>你的免費試用是免費和無限制的。<p>謝謝你；我希望你喜歡它!\n"
}