{
  "@type": "NewsArticle",
  "identifier": "2022--06--29--en--showhn--HackerNews--NewsArticle--31921191",
  "url": "https://news.ycombinator.com/item?id=31921191",
  "headline": "Show HN: Ploomber Cloud (YC W22) – run notebooks at scale without infrastructure",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi, we’re Ido &amp; Eduardo, the founders of Ploomber. We’re launching Ploomber Cloud today, a service that allows data scientists to scale their work from their laptops to the cloud.<p>Our open-source users (https://github.com/ploomber/ploomber) usually start their work on their laptops; however, often, their local environment falls short, and they need more resources. Typical use cases run out of memory or optimize models to squeeze out the best performance. Ploomber Cloud eases this transition by allowing users to quickly move their existing projects into the cloud without extra configurations. Furthermore, users can request custom resources for specific tasks (vCPUs, GPUs, RAM).<p>Both of us experienced this challenge firsthand. Analysis usually starts in a local notebook or script, and whenever we wanted to run our code on a larger infrastructure we had to refactor the code (i.e. rewrite our notebooks using Kubeflow’s SDK) and add a bunch of cloud configurations. Ploomber Cloud is a lot simpler, if your notebook or script runs locally, you can run it in the cloud with no code changes and no extra configuration. Furthermore, you can go back and forth between your local/interactive environment and the cloud.<p>We built Ploomber Cloud on top of AWS. Users only need to declare their dependencies via a requirements.txt file, and Ploomber Cloud will take care of making the Docker image and storing it on ECR. Part of this implementation is open-source and available at: https://github.com/ploomber/soopervisor<p>Once the Docker image is ready, we spin up EC2 instances to run the user’s pipeline distributively (for example, to run hundreds of ML experiments in parallel) and store the results in S3. Users can monitor execution through the logs and download artifacts. If source code hasn’t changed for a given pipeline task, we use cached artifacts and skip redundant computations, severely cutting each run's cost, especially for pipelines that require GPUs.<p>Users can sign up to Ploomber Cloud for free and get started quickly. We made a significant effort to simplify the experience (https://docs.ploomber.io/en/latest/cloud/index.html). There are three plans (https://ploomber.io/pricing/): the first is the Community plan, which is free with limited computing. The Teams plan has a flat $50 monthly and usage-based billing, and the Enterprise plan includes SLAs and custom pricing.<p>We’re thrilled to share Ploomber Cloud with you! So if you’re a data scientist who has experienced these endless cycles of getting a machine and going through an ops team, an ML engineer who helps data scientists scale their work, or you have any feedback, please share your thoughts! We love discussing these problems since exchanging ideas sparks exciting discussions and brings our attention to issues we haven’t considered before!<p>You may also reach out to me at ido@ploomber.io.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "idomi",
    "url": "https://news.ycombinator.com/user?id=idomi"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31921191",
  "sameAs": "https://news.ycombinator.com/item?id=31921191",
  "dateCreated": "2022-06-29T16:00:48.108Z",
  "datePublished": "2022-06-29T15:04:47.000Z",
  "dateModified": "2022-06-29T16:00:48.108Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 16
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Show HN: Ploomber云（YC W22）--无需基础设施即可大规模运行笔记本\n",
  "headline_zh-Hant": "Show HN: Ploomber雲（YC W22）--無需基礎設施即可大規模運行筆記本\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，我们是Ido &amp; Eduardo，Ploomber的创始人。我们今天推出了Ploomber Cloud，这项服务允许数据科学家将他们的工作从笔记本电脑扩展到云端。<p>我们的开源用户（https://github.com/ploomber/ploomber）通常在笔记本电脑上开始工作；然而，他们的本地环境往往不够用，他们需要更多资源。典型的用例是耗尽内存或优化模型以挤出最佳性能。Ploomber云通过允许用户快速将他们现有的项目转移到云中而不需要额外的配置来缓解这种过渡。此外，用户可以为特定的任务请求定制资源（vCPU、GPU、RAM）。<p>我们两个人都亲身经历过这种挑战。分析通常从本地笔记本或脚本开始，每当我们想在更大的基础设施上运行我们的代码时，我们必须重构代码（即使用Kubeflow的SDK重写我们的笔记本）并添加一堆云配置。Ploomber云计算要简单得多，如果你的笔记本或脚本在本地运行，你可以在云端运行，不需要修改代码，也不需要额外的配置。此外，你可以在你的本地/交互式环境和云端之间来回走动。<p>我们在AWS之上建立了Ploomber Cloud。用户只需要通过requirements.txt文件声明他们的依赖关系，Ploomber Cloud就会负责制作Docker镜像并将其存储在ECR上。这个实现的一部分是开源的，可以在以下网站上找到：https://github.com/ploomber/soopervisor<p>一旦Docker镜像准备好了，我们就会旋转EC2实例，分布式地运行用户的管道（例如，平行运行数百个ML实验），并将结果存储在S3中。用户可以通过日志监控执行情况并下载工件。如果某个管道任务的源代码没有改变，我们就会使用缓存的工件，并跳过多余的计算，严重削减每次运行的成本，特别是对于需要GPU的管道。<p>用户可以免费注册Ploomber云，并迅速开始使用。我们为简化体验做了很大努力（https://docs.ploomber.io/en/latest/cloud/index.html）。有三个计划（https://ploomber.io/pricing/）：第一个是社区计划，它是免费的，但计算量有限。团队计划每月统一收费50美元，并按使用量计费，企业计划包括SLA和自定义定价。<p>我们很高兴与你分享Ploomber云! 因此，如果你是一个经历过这些无休止的周期的数据科学家，获得一台机器并通过一个运营团队，一个帮助数据科学家扩展他们的工作的ML工程师，或者你有任何反馈，请分享你的想法！我们喜欢讨论这些问题，因为交换意见。我们喜欢讨论这些问题，因为交流思想会引发令人兴奋的讨论，并使我们注意到我们以前没有考虑过的问题！<p>你也可以通过 ido@ploomber.io 与我联系。\n",
  "description_zh-Hant": "嗨，我們是Ido &amp; Eduardo，Ploomber的創始人。我們今天推出了Ploomber Cloud，這項服務允許數據科學家將他們的工作從筆記本電腦擴展到雲端。<p>我們的開源用戶（https://github.com/ploomber/ploomber）通常在筆記本電腦上開始工作；然而，他們的本地環境往往不夠用，他們需要更多資源。典型的用例是耗盡內存或優化模型以擠出最佳性能。Ploomber雲通過允許用戶快速將他們現有的項目轉移到雲中而不需要額外的配置來緩解這種過渡。此外，用戶可以為特定的任務請求定製資源（vCPU、GPU、RAM）。<p>我們兩個人都親身經歷過這種挑戰。分析通常從本地筆記本或腳本開始，每當我們想在更大的基礎設施上運行我們的代碼時，我們必須重構代碼（即使用Kubeflow的SDK重寫我們的筆記本）並添加一堆雲配置。Ploomber雲計算要簡單得多，如果你的筆記本或腳本在本地運行，你可以在雲端運行，不需要修改代碼，也不需要額外的配置。此外，你可以在你的本地/交互式環境和雲端之間來回走動。<p>我們在AWS之上建立了Ploomber Cloud。用戶只需要通過requirements.txt文件聲明他們的依賴關係，Ploomber Cloud就會負責製作Docker鏡像並將其存儲在ECR上。這個實現的一部分是開源的，可以在以下網站上找到：https://github.com/ploomber/soopervisor<p>一旦Docker鏡像準備好了，我們就會旋轉EC2實例，分佈式地運行用戶的管道（例如，平行運行數百個ML實驗），並將結果存儲在S3中。用戶可以通過日誌監控執行情況並下載工件。如果某個管道任務的源代碼沒有改變，我們就會使用緩存的工件，並跳過多餘的計算，嚴重削減每次運行的成本，特別是對於需要GPU的管道。<p>用戶可以免費註冊Ploomber雲，並迅速開始使用。我們為簡化體驗做了很大努力（https://docs.ploomber.io/en/latest/cloud/index.html）。有三個計劃（https://ploomber.io/pricing/）：第一個是社區計劃，它是免費的，但計算量有限。團隊計劃每月統一收費50美元，並按使用量計費，企業計劃包括SLA和自定義定價。<p>我們很高興與你分享Ploomber雲! 因此，如果你是一個經歷過這些無休止的週期的數據科學家，獲得一臺機器並通過一個運營團隊，一個幫助數據科學家擴展他們的工作的ML工程師，或者你有任何反饋，請分享你的想法！我們喜歡討論這些問題，因為交換意見。我們喜歡討論這些問題，因為交流思想會引發令人興奮的討論，並使我們注意到我們以前沒有考慮過的問題！<p>你也可以通過 ido@ploomber.io 與我聯繫。\n"
}