{
  "@type": "NewsArticle",
  "identifier": "2022--08--10--en--showhn--HackerNews--NewsArticle--32415852",
  "url": "https://news.ycombinator.com/item?id=32415852",
  "headline": "Show HN: Insquad. Hire startup-ready senior remote developers",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey. We are pleased to tell you about our startup.  Insquad is a Startup-only focused platform to help hire vetted remote developers super-fast and at half the price of a US developer.<p>Our team is launching Insquad for two reasons:<p>First - we are startup founders ourselves - we know how it hurts when your best Python Data Scientist quits with a rich offer from corporate. We've been in these shoes before and want to help the startup community succeed.<p>Second - we've found many incredible software talents that are spread all over the world. Quite often, they can't find a job that matches their level and gives them the opportunity for further growth.<p>Fortunately, remote reality opens a lot of opportunities to unlock their potential.<p>As of today<p>Our product can vet candidates for seniority in 25 major technologies and frameworks and 15 domains of expertise<p>Soft skills evaluation: startup culture fit, communication, and leadership skills assessment<p>Hundreds of vetted developers on the platform - all motivated to start working with a US startup<p>We are developing the product further - adding AI vetting in our process, more skills, enhanced user experience, and some nifty things only startups would appreciate.<p>https://www.insquad.com/",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "insquadguys",
    "url": "https://news.ycombinator.com/user?id=insquadguys"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32415852",
  "sameAs": "https://news.ycombinator.com/item?id=32415852",
  "dateCreated": "2022-08-10T17:56:11.821Z",
  "datePublished": "2022-08-10T17:46:45.000Z",
  "dateModified": "2022-08-10T17:56:11.821Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Insquad. 雇用适合创业公司的高级远程开发人员\n",
  "headline_zh-Hant": "Show HN: Insquad. 僱用適合創業公司的高級遠程開發人員\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，我们很高兴向你介绍我们的创业公司。 Insquad是一个专注于初创企业的平台，可以帮助以超快的速度雇用经过审查的远程开发人员，而且价格只有美国开发人员的一半。<p>我们的团队推出Insquad有两个原因：<p>首先，我们自己也是初创企业的创始人，我们知道当你最好的Python数据科学家因为企业的丰厚报价而辞职时是多么的痛苦。我们曾经经历过这种情况，并希望帮助初创企业社区取得成功。<p>第二，我们发现许多令人难以置信的软件人才分布在世界各地。很多时候，他们找不到与自己水平相匹配的工作，也没有机会进一步发展。<p>幸运的是，远程现实为释放他们的潜力提供了很多机会。 <p>截至目前<p>我们的产品可以在25种主要技术和框架以及15个专业领域对候选人进行资历审查<p>软技能评估：创业公司文化适应性、沟通和领导技能评估<p>平台上有数百名经过审查的开发人员--他们都有动力开始与美国创业公司合作<p>我们正在进一步开发产品--在我们的流程中增加人工智能审查、更多技能、增强用户体验，以及一些只有创业公司会欣赏的古怪东西。<p> https://www.insquad.com/\n",
  "description_zh-Hant": "嘿，我們很高興向你介紹我們的創業公司。 Insquad是一個專注於初創企業的平臺，可以幫助以超快的速度僱用經過審查的遠程開發人員，而且價格只有美國開發人員的一半。<p>我們的團隊推出Insquad有兩個原因：<p>首先，我們自己也是初創企業的創始人，我們知道當你最好的Python數據科學家因為企業的豐厚報價而辭職時是多麼的痛苦。我們曾經經歷過這種情況，並希望幫助初創企業社區取得成功。<p>第二，我們發現許多令人難以置信的軟件人才分佈在世界各地。很多時候，他們找不到與自己水平相匹配的工作，也沒有機會進一步發展。<p>幸運的是，遠程現實為釋放他們的潛力提供了很多機會。 <p>截至目前<p>我們的產品可以在25種主要技術和框架以及15個專業領域對候選人進行資歷審查<p>軟技能評估：創業公司文化適應性、溝通和領導技能評估<p>平臺上有數百名經過審查的開發人員--他們都有動力開始與美國創業公司合作<p>我們正在進一步開發產品--在我們的流程中增加人工智能審查、更多技能、增強用戶體驗，以及一些只有創業公司會欣賞的古怪東西。<p> https://www.insquad.com/\n"
}