{
  "@type": "NewsArticle",
  "identifier": "2022--08--17--en--showhn--HackerNews--NewsArticle--32496848",
  "url": "https://news.ycombinator.com/item?id=32496848",
  "headline": "Show HN: We made a search engine for finding the best of anything",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Bestlist is a search engine that is focused solely on helping users discover the best of anything.<p>All of our results are non-biased, non-paid, and are dynamically generated via our search algorithm. It’s not perfect, but we’re working extremely hard and are determined to make it ubiquitous in the lives of the everyday internet user.<p>Other Features<p>Voting\nIf you’re feeling strongly about a search results, you can up or downvote the listing to voice your opinion. When you vote, you’ll be asked to state why you voted. This gives other users better insights into the listing.<p>Collections\nWith collections you can easily save and keep track of all of your favorite listings. Collections can be public or made private, and they’re easily edited, reordered, and shared.<p>Submissions\nIf you find that we’re missing a result for a particular query, you can easily submit it as a suggestion. We’ll review it, and publish it if it makes the cut.<p>Current Limitations\n•It’s currently English only.\n•We don’t handle searches that start with “Best way..” or “Best settings ..” or “Best route..” very well.\n•Also, searches for professionals (doctors, etc,) and recipes have issues.<p>I’m sure there are a lot more we’re missing.<p>I'd love for you to try and it and let us know what you think.<p>Thank you,\nTyler",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "switchstance",
    "url": "https://news.ycombinator.com/user?id=switchstance"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32496848",
  "sameAs": "https://www.bestlist.com/",
  "dateCreated": "2022-08-17T14:30:33.955Z",
  "datePublished": "2022-08-17T14:25:33.000Z",
  "dateModified": "2022-08-17T14:30:33.955Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 我们做了一个搜索引擎来寻找任何东西的精华\n",
  "headline_zh-Hant": "Show HN: 我們做了一個搜索引擎來尋找任何東西的精華\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Bestlist是一个搜索引擎，只专注于帮助用户发现最好的东西。<p>我们所有的结果都是无偏见、无报酬的，并且是通过我们的搜索算法动态生成。它并不完美，但我们正在非常努力地工作，并决心使它在日常互联网用户的生活中无处不在。 <p>其他功能<p>投票\n如果你对某个搜索结果有强烈的感觉，你可以对该列表投上或投下一票，以表达你的意见。当你投票时，你会被要求说明你投票的原因。这可以让其他用户更好地了解该列表。<p>收藏品\n通过收藏，您可以轻松地保存和跟踪您喜欢的所有房源。收藏可以是公开的，也可以是私人的，而且很容易编辑、重新排序和分享。<p>提交\n如果您发现我们缺少某个特定查询的结果，您可以轻松地将其作为建议提交。我们将对它进行审查，如果它被选中，我们将发布它。<p>目前的限制\n-目前只有英文。\n-我们不能很好地处理以 \"最佳方式 \"或 \"最佳设置 \"或 \"最佳路线 \"开头的搜索。\n<p>我肯定还有很多我们遗漏的东西。<p>我希望你能尝试一下，并让我们知道你的想法。\n泰勒\n",
  "description_zh-Hant": "Bestlist是一個搜索引擎，只專注於幫助用戶發現最好的東西。<p>我們所有的結果都是無偏見、無報酬的，並且是通過我們的搜索算法動態生成。它並不完美，但我們正在非常努力地工作，並決心使它在日常互聯網用戶的生活中無處不在。 <p>其他功能<p>投票\n如果你對某個搜索結果有強烈的感覺，你可以對該列表投上或投下一票，以表達你的意見。當你投票時，你會被要求說明你投票的原因。這可以讓其他用戶更好地瞭解該列表。<p>收藏品\n通過收藏，您可以輕鬆地保存和跟蹤您喜歡的所有房源。收藏可以是公開的，也可以是私人的，而且很容易編輯、重新排序和分享。<p>提交\n如果您發現我們缺少某個特定查詢的結果，您可以輕鬆地將其作為建議提交。我們將對它進行審查，如果它被選中，我們將發佈它。<p>目前的限制\n-目前只有英文。\n-我們不能很好地處理以 \"最佳方式 \"或 \"最佳設置 \"或 \"最佳路線 \"開頭的搜索。\n<p>我肯定還有很多我們遺漏的東西。<p>我希望你能嘗試一下，並讓我們知道你的想法。\n泰勒\n"
}