{
  "@type": "NewsArticle",
  "identifier": "2022--08--24--en--showhn--HackerNews--NewsArticle--32579904",
  "url": "https://news.ycombinator.com/item?id=32579904",
  "headline": "Show HN: LetsPY – A Minimal Python Coding Playground",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HNers!<p>Im so exited to release my second product(side project) on HN after one year development and content authoring in my spare time. I hope this project will help young fiends(mostly kids) to get started with coding journey with fun and ease.<p>This is an interactive coding(using Python language) teach tool which is explaining couple of programming concept using gamification approach. Once learners successfully completed one project through coding practice he would get a reward badge. with these badges accumulation, he would get higher level reward such as coding cheatsheet and game authoring disclosure docs.<p>Learning how to code is a big challenge for kids, even for smart kids those concept are always abstract and hard to understand. So, I made this tool to help young beginner to lower the doorsill through all possible approaches including game, video, text..and so on. I have great interesting in interactive online learning tools like this. I hope you would like to give a try on this product and find it helpful to your kids.<p>All feedback and suggestions are welcome!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "lwz7512",
    "url": "https://news.ycombinator.com/user?id=lwz7512"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32579904",
  "sameAs": "https://letspy.today/",
  "dateCreated": "2022-08-24T14:45:06.133Z",
  "datePublished": "2022-08-24T14:27:49.000Z",
  "dateModified": "2022-08-24T14:45:06.133Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: LetsPY - 一个最小的Python编码游乐场\n",
  "headline_zh-Hant": "Show HN: LetsPY - 一個最小的Python編碼遊樂場\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HNers！<p>在我利用业余时间进行了一年的开发和内容编写之后，我非常兴奋地在HN上发布我的第二个产品（副业）。我希望这个项目能帮助年轻的朋友（主要是孩子）开始有趣和轻松的编码之旅。<p>这是一个互动的编码（使用Python语言）教学工具，使用游戏化的方法解释一些编程概念。一旦学习者通过编码练习成功完成一个项目，他将获得一个奖励徽章。随着这些徽章的积累，他将获得更高级别的奖励，如编码作弊表和游戏创作披露文档。<p>学习如何编码对孩子来说是一个很大的挑战，即使对聪明的孩子来说，这些概念总是抽象和难以理解。所以，我做了这个工具，通过所有可能的方法，包括游戏、视频、文字等等，帮助年轻的初学者降低门槛。我对这样的互动式在线学习工具非常感兴趣。我希望你愿意尝试一下这个产品，并发现它对你的孩子有帮助。<p>我们欢迎所有的反馈和建议\n",
  "description_zh-Hant": "嗨，HNers！<p>在我利用業餘時間進行了一年的開發和內容編寫之後，我非常興奮地在HN上發佈我的第二個產品（副業）。我希望這個項目能幫助年輕的朋友（主要是孩子）開始有趣和輕鬆的編碼之旅。<p>這是一個互動的編碼（使用Python語言）教學工具，使用遊戲化的方法解釋一些編程概念。一旦學習者通過編碼練習成功完成一個項目，他將獲得一個獎勵徽章。隨著這些徽章的積累，他將獲得更高級別的獎勵，如編碼作弊表和遊戲創作披露文檔。<p>學習如何編碼對孩子來說是一個很大的挑戰，即使對聰明的孩子來說，這些概念總是抽象和難以理解。所以，我做了這個工具，通過所有可能的方法，包括遊戲、視頻、文字等等，幫助年輕的初學者降低門檻。我對這樣的互動式在線學習工具非常感興趣。我希望你願意嘗試一下這個產品，並發現它對你的孩子有幫助。<p>我們歡迎所有的反饋和建議\n"
}