{
  "@type": "NewsArticle",
  "identifier": "2022--08--19--en--showhn--HackerNews--NewsArticle--32519719",
  "url": "https://news.ycombinator.com/item?id=32519719",
  "headline": "Show HN: Sell your stuff, Say bye to individual ads",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "How would you clear a house and sell its content in a short period of time if you had to?<p>I was faced with this challenge last year when I lost my mother and had to let go her house.\nWith no time and energy to post individual ads on traditional platforms like Facebook Marketplace, I couldn’t find an easy solution so I decided to create one.<p>Quickly after starting, I realised that it could also benefit sellers from flea markets, yard and car boot sales or even street vendors selling arts and other craft works and that this space was not digitalized.<p>The idea, therefore, became to be able to set up virtual market stalls to sell a bunch of stuff without the need to post individual ads. A sort of shopify for street vendors, self promoted using QR codes in real life.<p>What about item categorisation for buyers? How would they browse?\nBy location, by keywords, by category, etc. The fields are all optionals for sellers so I add keywords using image recognition algorithms when they upload pictures.<p>I hope this solution will help others too.<p>Looking forward to your feedbacks!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "kvndevils",
    "url": "https://news.ycombinator.com/user?id=kvndevils"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32519719",
  "sameAs": "https://www.shopmystuff.com/",
  "dateCreated": "2022-08-19T11:44:07.522Z",
  "datePublished": "2022-08-19T11:28:51.000Z",
  "dateModified": "2022-08-19T11:44:07.522Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 卖掉你的东西，对个别广告说再见\n",
  "headline_zh-Hant": "Show HN: 賣掉你的東西，對個別廣告說再見\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "如果你不得不这样做，你会如何在短时间内清理房子并出售其内容呢？<p>去年我面临着这个挑战，因为我失去了我的母亲，不得不让出她的房子。\n由于没有时间和精力在Facebook Marketplace等传统平台上发布个人广告，我找不到一个简单的解决方案，所以我决定创建一个。<p>开始后，我很快意识到，它也可以让跳蚤市场、庭院和汽车靴销售的卖家，甚至是销售艺术品和其他工艺品的街头小贩受益，而且这个空间没有被数字化。<p>因此，这个想法成为能够建立虚拟市场摊位，销售一堆东西，而无需发布个人广告。一种街头小贩的shopify，在现实生活中使用二维码进行自我宣传。<p>对于买家来说，物品的分类如何？他们会如何浏览？\n按地点，按关键词，按类别，等等。对于卖家来说，这些字段都是可选项，所以当他们上传图片时，我使用图像识别算法添加关键词。<p>我希望这个解决方案也能帮助其他人。<p>期待您的反馈\n",
  "description_zh-Hant": "如果你不得不這樣做，你會如何在短時間內清理房子並出售其內容呢？<p>去年我面臨著這個挑戰，因為我失去了我的母親，不得不讓出她的房子。\n由於沒有時間和精力在Facebook Marketplace等傳統平臺上發佈個人廣告，我找不到一個簡單的解決方案，所以我決定創建一個。<p>開始後，我很快意識到，它也可以讓跳蚤市場、庭院和汽車靴銷售的賣家，甚至是銷售藝術品和其他工藝品的街頭小販受益，而且這個空間沒有被數字化。<p>因此，這個想法成為能夠建立虛擬市場攤位，銷售一堆東西，而無需發佈個人廣告。一種街頭小販的shopify，在現實生活中使用二維碼進行自我宣傳。<p>對於買家來說，物品的分類如何？他們會如何瀏覽？\n按地點，按關鍵詞，按類別，等等。對於賣家來說，這些字段都是可選項，所以當他們上傳圖片時，我使用圖像識別算法添加關鍵詞。<p>我希望這個解決方案也能幫助其他人。<p>期待您的反饋\n"
}