{
  "@type": "NewsArticle",
  "identifier": "2022--08--12--en--showhn--HackerNews--NewsArticle--32440171",
  "url": "https://news.ycombinator.com/item?id=32440171",
  "headline": "Show HN: Agency quality design and development for a very un-agency like price",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Howdy HN! Been working on a side project of mine for about a year called Gloutir. It's essentially an 'agency of one' design and development service using a subscription or retainer model for billing (Stripe + Memberstack).<p>I primarily focus on WordPress and Webflow design and development as I realized long ago that there's a huge demand for these services  in the design / marketing agency space.<p>I've had a lot of success the past year with this work, and surprisingly (or unsurprisingly) every single client of mine has been a larger agency needing additional help. That kind of makes sense because an agency can immediately see the value in what I offer without really having to be convinced.<p>Recently I've introduced a weekly option for clients looking to launch fast and spend less ($1,000 a week, maybe not sustainable but we’ll see). I'd love to get more involved with startups needing landing page work / design services.<p>There are a number of people doing stuff like this, but I do want to clarify that this is never going to be an &quot;unlimited design&quot; style subscription service. I've intentionally set a hard cap on the number of clients because it's simply impossible to accommodate more than a certain number of clients while keeping the quality of work where it needs to be.<p>Anywho, curious what you all think and if you have any suggestions on how to improve.<p>https://gloutir.com/<p>About me: full time designer and developer at an agency. Can see more of my work at https://zchry.org.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "oldstrangers",
    "url": "https://news.ycombinator.com/user?id=oldstrangers"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32440171",
  "sameAs": "https://news.ycombinator.com/item?id=32440171",
  "dateCreated": "2022-08-12T15:52:15.947Z",
  "datePublished": "2022-08-12T15:39:17.000Z",
  "dateModified": "2022-08-12T15:52:15.947Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 以非常不像机构的价格提供机构质量的设计和开发\n",
  "headline_zh-Hant": "Show HN: 以非常不像機構的價格提供機構質量的設計和開發\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN! 我在一个名为Gloutir的副业上工作了大约一年。<p>我主要专注于WordPress和Webflow的设计和开发，因为我很早就意识到，在设计/营销机构领域对这些服务有着巨大的需求。这很有意义，因为机构可以立即看到我所提供的价值，而不需要真正被说服。<p>最近，我为希望快速启动和花费较少的客户推出了每周一次的选择（每周1000美元，也许不能持续，但我们会看到）。我很想更多地参与到需要着陆页工作/设计服务的初创企业中去。<p>有很多人在做这样的事情，但我想澄清的是，这绝不会是一个&quot;无限设计&quot;式的订阅服务。我有意为客户数量设置了一个硬性上限，因为在保持工作质量的前提下，根本不可能容纳超过一定数量的客户。<p>不管怎样，我很好奇你们的想法，如果你们对如何改进有任何建议。<p>https://gloutir.com/<p>关于我：在一家机构担任全职设计师和开发人员。可以在https://zchry.org，看到更多我的作品。\n",
  "description_zh-Hant": "你好，HN! 我在一個名為Gloutir的副業上工作了大約一年。<p>我主要專注於WordPress和Webflow的設計和開發，因為我很早就意識到，在設計/營銷機構領域對這些服務有著巨大的需求。這很有意義，因為機構可以立即看到我所提供的價值，而不需要真正被說服。<p>最近，我為希望快速啟動和花費較少的客戶推出了每週一次的選擇（每週1000美元，也許不能持續，但我們會看到）。我很想更多地參與到需要著陸頁工作/設計服務的初創企業中去。<p>有很多人在做這樣的事情，但我想澄清的是，這絕不會是一個&quot;無限設計&quot;式的訂閱服務。我有意為客戶數量設置了一個硬性上限，因為在保持工作質量的前提下，根本不可能容納超過一定數量的客戶。<p>不管怎樣，我很好奇你們的想法，如果你們對如何改進有任何建議。<p>https://gloutir.com/<p>關於我：在一家機構擔任全職設計師和開發人員。可以在https://zchry.org，看到更多我的作品。\n"
}