{
  "@type": "NewsArticle",
  "identifier": "2022--08--10--en--showhn--HackerNews--NewsArticle--32409980",
  "url": "https://news.ycombinator.com/item?id=32409980",
  "headline": "Show HN: Genti Audio – Stories and podcasts in African languages",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi all, \nEke here, co-founder of Genti Audio. Genti Audio is a mobile app for streaming and downloading Africa-focused audiobooks, stories, and podcasts in regional and local African languages.<p>In September 2021, my sister and I sat down to work on an audio show exploring Nigeria’s cultural and linguistic diversity. As we began to put the show together, we realized that our target audience- Nigerians and Africans in both urban and rural areas, were not heavily present on any of the major audio platforms for this type of content. Recognizing this, we decided to first fix this distribution gap, and so the idea for Genti was born.<p>From just an idea, we began pooling resources and soon started developing our beta app. And after months of hard work building, scouring for content, and raising funds from supportive friends and family, we are very excited to announce the launch of our mobile app. We will continue to improve the app and roll out more features over the next 4 months. Download the App now on Google Play or the Apple App Store and start listening!<p>At Genti, our mission is to amplify African stories and voices to entertain, educate, and enrich lives. In line with our mission, we’ll spend the next 3 - 6 months getting the best entertaining and educative African audio content out there and curating for our users. We also believe that for every African story told there are hundreds waiting to be told, and that’s why we’ve begun working on developing engaging original content available exclusively on our platform. Genti is committed to playing a vital role in developing and deepening audio storytelling on the continent.<p>To download the app, visit the Genti website, or download directly from Google Play and the Apple App store and start listening!<p>If you’ve got a podcast, audiobook, or story you’d like to upload on Genti, please send an email to ojiugo@gentimedia.com and we’ll be in touch. We’d also love to get feedback from you on your experience with the Genti App.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "eke_uche",
    "url": "https://news.ycombinator.com/user?id=eke_uche"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32409980",
  "sameAs": "https://gentimedia.com/",
  "dateCreated": "2022-08-10T17:13:34.285Z",
  "datePublished": "2022-08-10T10:47:50.000Z",
  "dateModified": "2022-08-10T17:13:34.285Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Genti Audio - 非洲语言的故事和播客\n",
  "headline_zh-Hant": "Show HN: Genti Audio - 非洲語言的故事和播客\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好。\n我是Eke，Genti Audio的联合创始人。Genti Audio是一个移动应用程序，用于流式传输和下载以非洲为重点的有声读物、故事和播客，并使用非洲地区和当地语言。当我们开始制作节目时，我们意识到我们的目标受众--城市和农村地区的尼日利亚人和非洲人，在任何主要的音频平台上都没有这类内容的大量存在。认识到这一点，我们决定首先解决这一传播差距，因此，Genti的想法诞生了。<p>从一个想法开始，我们开始汇集资源，并很快开始开发我们的测试版应用程序。经过几个月的努力建设，搜寻内容，并从支持我们的朋友和家人那里筹集资金，我们非常兴奋地宣布推出我们的移动应用程序。我们将继续改进该应用程序，并在未来4个月内推出更多功能。现在就在Google Play或苹果应用商店下载应用程序，开始收听！<p>在Genti，我们的使命是放大非洲的故事和声音，以娱乐、教育和丰富生活。根据我们的使命，我们将在未来3-6个月内获得最好的娱乐性和教育性非洲音频内容，并为我们的用户进行策划。我们还相信，每讲一个非洲故事，就有几百个故事等着我们去讲，这就是为什么我们已经开始努力开发吸引人的原创内容，并在我们的平台上独家提供。Genti致力于在发展和深化非洲大陆的音频故事方面发挥重要作用。<p>要下载该应用程序，请访问Genti网站，或直接从Google Play和苹果应用商店下载并开始收听！<p>如果你有播客、有声读物或故事想上传到Genti，请发送电子邮件至 ojiugo@gentimedia.com，我们将与你联系。我们也希望得到您对Genti应用程序的反馈。\n",
  "description_zh-Hant": "大家好。\n我是Eke，Genti Audio的聯合創始人。Genti Audio是一個移動應用程序，用於流式傳輸和下載以非洲為重點的有聲讀物、故事和播客，並使用非洲地區和當地語言。當我們開始製作節目時，我們意識到我們的目標受眾--城市和農村地區的尼日利亞人和非洲人，在任何主要的音頻平臺上都沒有這類內容的大量存在。認識到這一點，我們決定首先解決這一傳播差距，因此，Genti的想法誕生了。<p>從一個想法開始，我們開始彙集資源，並很快開始開發我們的測試版應用程序。經過幾個月的努力建設，搜尋內容，並從支持我們的朋友和家人那裡籌集資金，我們非常興奮地宣佈推出我們的移動應用程序。我們將繼續改進該應用程序，並在未來4個月內推出更多功能。現在就在Google Play或蘋果應用商店下載應用程序，開始收聽！<p>在Genti，我們的使命是放大非洲的故事和聲音，以娛樂、教育和豐富生活。根據我們的使命，我們將在未來3-6個月內獲得最好的娛樂性和教育性非洲音頻內容，併為我們的用戶進行策劃。我們還相信，每講一個非洲故事，就有幾百個故事等著我們去講，這就是為什麼我們已經開始努力開發吸引人的原創內容，並在我們的平臺上獨家提供。Genti致力於在發展和深化非洲大陸的音頻故事方面發揮重要作用。<p>要下載該應用程序，請訪問Genti網站，或直接從Google Play和蘋果應用商店下載並開始收聽！<p>如果你有播客、有聲讀物或故事想上傳到Genti，請發送電子郵件至 ojiugo@gentimedia.com，我們將與你聯繫。我們也希望得到您對Genti應用程序的反饋。\n"
}