{
  "@type": "NewsArticle",
  "identifier": "2022--08--16--en--showhn--HackerNews--NewsArticle--32483026",
  "url": "https://news.ycombinator.com/item?id=32483026",
  "headline": "Show HN: Emotion Driven Development, rethinking project management",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello everyone. I have created a project management service to help improve work environments by focusing on how employees feel about their work. All employees are very used to being viewed simply as a commodity and the current state of project management tooling reflects that. Traditionally the primary metric management is interested in is velocity. Velocity alone does not get to the heart of how productive a project is or how sustainable that productivity is. Onomojo seeks to change that by making employee sentiment the primary focus in project management. Day after day, if you are grinding on work that you aren't happy with you will eventually burn out and switch jobs. By focusing on how employees feel about their work, we can better prioritize stories so people are working on things they're actually interested in. We put employee sentiment first.<p>I've been working on this for about 10 months and I'm pretty happy with how it's progressing. The site is built with a Ruby on Rails API and a Nuxt frontend running on Heroku.<p>I'd love to hear your feedback on how I can improve the user experience, messaging, or any other ideas you might have. Thanks",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "onomojo",
    "url": "https://news.ycombinator.com/user?id=onomojo"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32483026",
  "sameAs": "https://www.onomojo.com",
  "dateCreated": "2022-08-16T21:57:49.014Z",
  "datePublished": "2022-08-16T14:15:05.000Z",
  "dateModified": "2022-08-16T21:57:49.014Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 情感驱动发展，重新思考项目管理\n",
  "headline_zh-Hant": "Show HN: 情感驅動發展，重新思考項目管理\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好。我创建了一个项目管理服务，通过关注员工对其工作的感受来帮助改善工作环境。所有的员工都非常习惯于被简单地视为一种商品，项目管理工具的现状也反映了这一点。传统上，管理层关注的主要指标是速度。仅仅是速度并不能说明一个项目的生产力如何，也不能说明这种生产力的可持续性如何。Onomojo试图通过使员工的情绪成为项目管理的主要焦点来改变这种状况。日复一日，如果你在你不满意的工作上磨磨蹭蹭，你最终会精疲力尽并换工作。通过关注员工对其工作的感受，我们可以更好地确定故事的优先次序，这样人们就可以从事他们真正感兴趣的工作。我们把员工的感受放在第一位。<p>我在这方面已经工作了大约10个月，我对它的进展情况相当满意。该网站由Ruby on Rails API和运行在Heroku上的Nuxt前端构建。<p>我很想听到你的反馈，告诉我如何改善用户体验、信息传递，或者你可能有的任何其他想法。谢谢\n",
  "description_zh-Hant": "大家好。我創建了一個項目管理服務，通過關注員工對其工作的感受來幫助改善工作環境。所有的員工都非常習慣於被簡單地視為一種商品，項目管理工具的現狀也反映了這一點。傳統上，管理層關注的主要指標是速度。僅僅是速度並不能說明一個項目的生產力如何，也不能說明這種生產力的可持續性如何。Onomojo試圖通過使員工的情緒成為項目管理的主要焦點來改變這種狀況。日復一日，如果你在你不滿意的工作上磨磨蹭蹭，你最終會精疲力盡並換工作。通過關注員工對其工作的感受，我們可以更好地確定故事的優先次序，這樣人們就可以從事他們真正感興趣的工作。我們把員工的感受放在第一位。<p>我在這方面已經工作了大約10個月，我對它的進展情況相當滿意。該網站由Ruby on Rails API和運行在Heroku上的Nuxt前端構建。<p>我很想聽到你的反饋，告訴我如何改善用戶體驗、信息傳遞，或者你可能有的任何其他想法。謝謝\n"
}