{
  "@type": "NewsArticle",
  "identifier": "2022--07--18--en--askhn--HackerNews--NewsArticle--32141539",
  "url": "https://news.ycombinator.com/item?id=32141539",
  "headline": "Is there other software similar to Vim and Emacs?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm looking for software that is powerful, understandable, hackable, extensible, reliable, future-proof (few breaking updates) and feature-rich.<p>The two tools I've found so far that come close to this are TiddlyWiki (notetaking) and Vim/Emacs (same text editor niche). TiddlyWiki loses some points on hackability because it's web technology and fairly sandboxed. Vim/Emacs are only for text, obviously. I think what these tools have in common is that they all have a strong core idea (Vim: modal, TiddlyWiki: a quine of tiddlers, Emacs: elisp) that provides insane feature breadth at relatively low cost to learnability.<p>Other software is usually on a spectrum of low feature count (most tools in the UNIX philosophy) to low understandability (IDEs, most other text editors, all OSes). Then a few rare ones are extremely powerful, but so old and poorly designed that I don't think they make the cut (e.g. Bash in my opinion).<p>Are there other tools similar to Vim, that maybe even cover other application areas? Doesn't have to be terminal-based. I'd love to hear your opinions!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "GrollingGrakbor",
    "url": "https://news.ycombinator.com/user?id=GrollingGrakbor"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32141539",
  "sameAs": "https://news.ycombinator.com/item?id=32141539",
  "dateCreated": "2022-07-18T18:53:27.247Z",
  "datePublished": "2022-07-18T18:20:06.000Z",
  "dateModified": "2022-07-18T18:53:27.247Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ]
}