{
  "@type": "NewsArticle",
  "identifier": "2022--08--27--en--showhn--HackerNews--NewsArticle--32617649",
  "url": "https://news.ycombinator.com/item?id=32617649",
  "headline": "We’re building a search tool for finding Twitter threads",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "TweetStack is an AI powered search engine for Twitter Threads.  We built this tool to help people find great twitter threads. Today I’m excited to share that we are accepting sign ups for our Beta! You can sign up here: <a href=\"https://searchtweetstack.carrd.co\" rel=\"nofollow\">https://searchtweetstack.carrd.co</a><p>Background<p>Two weeks ago, I had a conversation with my dad about his job (and how I think he should leave it). I remembered a compelling twitter thread from <a href=\"https://twitter.com/dvassallo\" rel=\"nofollow\">https://twitter.com/dvassallo</a> where Daniel shared his own experience leaving his tech job to work on a series of ‘small bets’ to earn an income. I thought his story would interest my dad, so I tried to find it. I scrolled through Daniel’s Twitter profile, searching frantically for that one tweet, but after 10 minutes I couldn’t find it and I gave up. Worse? By the time I did give up, the conversation (and my Dad’s attention) had already moved on without me.<p>I felt pretty frustrated—what could I have done differently that would have made access to that tweet not only possible, but less clumsy?   Even though I use twitter a lot, I haven’t utilized many of it’s features (like lists or bookmarks) until recently. Maybe if I had only bookmarked the tweet, I could have found it much quicker.<p>A few days later, I found myself using Twitter to search for tweets I hadn’t seen before (ironically, during another separate conversation with my parents). It was easy to find tweets using keywords from my query, but the results were filtered by what was posted most recently. “Duh”, I thought. Twitter is all about discovering new events and information. Much to my disappointment, I looked closer at the results and realized that most of them weren’t very helpful after all. They either 1) used a keyword differently than I had intended, or 2) presented information that wasn’t clearly credible.<p>A few more days passed, and these two experiences kept surfacing in my mind—why wasn’t possible to filter tweets by “best tweet” or search for tweets that are older than a few days or weeks?   I became further obsessed. What about educational threads? Wasn’t that what I was trying to find in the first place? That tweet I hoped would grab my dad’s attention wasn’t a quick hit of the news or a stupid meme. Nor was it a stream of cringeworthy advice or a cheap marketing hook. It wasn’t the black hole of Twitter that makes you feel dead inside. What I had come across felt like pure gold—it was a super concise, entertaining summary of a topic I knew he’d care about. In it, someone with real credibility chose to share their knowledge with me, for free online. But when I needed it most, I couldn’t find it.<p>Where else can I go to find this style of content online? I haven’t been able to think of another place. That’s when I decided I wanted to build something. I’d start by building a simple tool to help me solve both of my initial problems: 1) quickly sort a user’s tweets by number of likes, retweets, etc. and 2) search for the best tweets on a specific topic.<p>To find some early customers, I started a twitter account to engage with people who write threads and share my idea. A week went by, and I started gaining some followers and making progress on my prototype.   Slowly, the ideas merged into one: “Find great threads to help you find your answers”.  A way to help me find the concise and credible answers online, from the best sources.<p>It’s still very early, but I want to take the opportunity to share my progress so far and ask for your feedback. I’m also seeking twitter users who are interested in trying the beta. We’ll be launching pretty soon, so if you’re interested, please sign up on our landing page!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "tennisfan118",
    "url": "https://news.ycombinator.com/user?id=tennisfan118"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32617649",
  "sameAs": "https://searchtweetstack.carrd.co",
  "dateCreated": "2022-08-27T10:47:20.994Z",
  "datePublished": "2022-08-27T10:46:33.000Z",
  "dateModified": "2022-08-27T10:47:20.994Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}