{
  "@type": "NewsArticle",
  "identifier": "2022--03--10--en--hackernews--HackerNews--NewsArticle--30631991",
  "url": "https://news.ycombinator.com/item?id=30631991",
  "headline": "Launch HN: Prepform – AI and spaced-repetition to optimize learning",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi, I'm Eric and I'm the founder and lead developer of Prepform.<p>A high-quality education helped me pursue my interests and achieve my goals. I started Prepform so students of all backgrounds have access to the same kind of education.<p>I grew up in Southern California, surrounded by dozens of SAT prep programs, and I swear I must have gone to all of them. Different programs followed different styles and techniques, but the strategy they shared was to create a study plan and review mistakes.<p>A study plan is\ntaking a diagnostic test,<p>setting a target score,<p>creating a study schedule,<p>identifying mistakes, and finally<p>reviewing those mistakes.<p>I wanted to take this structure and optimize it with machine learning, while accounting for elements of human learning and memory.\nI'm a big fan of SuperMemo, a memorization technique developed by Piotr Wozniak, where you review material just as you're about to forget it. Cognitive psychology tells us human forgetting follows a pattern, but Piotr quantified this behavior to identify the precise moment forgetting happens.<p>The goal was to build on his research with AI and tailor it to not only test prep but to the individual student, and make it the engine of the study plan.<p>The result is Blended Prep, which guides students to internalize knowledge rather than memorize material, and gives them the best chance to ace their next exam.<p>I'm so excited to share this with the HN community, and would love to know what you think. You can try it out at https://prepform.com. Thanks for reading.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "techmowgli",
    "url": "https://news.ycombinator.com/user?id=techmowgli"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30631991",
  "sameAs": "https://news.ycombinator.com/item?id=30631991",
  "dateCreated": "2022-03-10T20:50:34.447Z",
  "datePublished": "2022-03-10T20:27:51.000Z",
  "dateModified": "2022-03-10T20:50:34.447Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}