{
  "@type": "NewsArticle",
  "identifier": "2022--07--03--en--myfeed--HackerNews--NewsArticle--31963710",
  "url": "https://news.ycombinator.com/item?id=31963710",
  "headline": "Would you buy a home fully online? Or if you already did, how was it?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Well, we all buy all kinds of things online nowadays, but a Home is probably the most expensive purchase most people will make.<p>I'd be more inclined to do this if it was a brand new home, which anyway you can't visit and you make the decision based on the renders and reputation of the builder but I read that many people are also now purchasing existing (old) homes without even visiting them... especially in hot markets like Austin, where a lot of people out of state are making the transition and purchase a property as part of this.<p>Has anyone purchased a home online before seeing it? How was the experience?<p>Or if you are thinking of purchasing a home, have you given this option some thought?<p>What would be the most important things to verify/check before making an online purchase of a home? I am guessing this is not something you can return just like at Walmart if you end up not being satisfied...or is there some kind of policy in this direction?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "alexvomwald",
    "url": "https://news.ycombinator.com/user?id=alexvomwald"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31963710",
  "sameAs": "https://news.ycombinator.com/item?id=31963710",
  "dateCreated": "2022-07-03T02:27:17.441Z",
  "datePublished": "2022-07-03T00:06:04.000Z",
  "dateModified": "2022-07-03T02:27:17.441Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}