{
  "@type": "NewsArticle",
  "identifier": "2022--06--14--en--askhn--HackerNews--NewsArticle--31742811",
  "url": "https://news.ycombinator.com/item?id=31742811",
  "headline": "Personal and Work development on the same laptop / organization?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Context:  I'm a web dev.   I've worked for a small company (all of 4 developers and a handful of other folks) for a number of years now.   I've grown tired of carrying / not carrying a personal laptop and work laptop.   I've proposed using a new personal laptop for work going forward and my employer is on board.<p>Note: If this was a big mega corp I wouldn't do this / mix work and personal stuff on the same device, but I don't have any concerns with these guys.<p>I'm thinking of picking up a new Macbook Air (switching from windows) and I'm wondering about organizing it all on the same device, personal github login vs company login, vscode profiles ... chrome browser users ... and all that on the same device without going crazy switching things up each time I change what I'm doing?<p>Does anyone have a good system they have found for managing work vs personal stuff on the same laptop / switching quickly without a lot of fuss?<p>Is the most reasonable way just to use different login profiles on MacOS?   I'm not opposed to that / don't want this to be a long painful &quot;switch 8 things each time I need to switch from work to personal&quot; process.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "duxup",
    "url": "https://news.ycombinator.com/user?id=duxup"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31742811",
  "sameAs": "https://news.ycombinator.com/item?id=31742811",
  "dateCreated": "2022-06-14T17:38:43.532Z",
  "datePublished": "2022-06-14T17:24:16.000Z",
  "dateModified": "2022-06-14T17:38:43.532Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}