{
  "@type": "NewsArticle",
  "identifier": "2022--07--20--en--myfeed--HackerNews--NewsArticle--32172741",
  "url": "https://news.ycombinator.com/item?id=32172741",
  "headline": "Tell HN: Discord is permanently locking out users with multiple accounts",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I used Discord's new account switcher feature and, shortly after, I was locked out of both accounts for phone number verification.<p>Specifically, each account requires a separate phone number, and I am not banned for a ToS violation.<p>After trying several different methods (including <i>buying a second cell phone plan</i>) I have been unable to access my accounts. Over a few weeks with support, I've spent money and several hours on my end, to no avail.<p>From our conversation, I understand this triggered a false positive on their &quot;suspicious activity detection system&quot;. They couldn't tell me what triggered it, and I have not broken the ToS (no unofficial client), and they cannot remove the hold, and paying for Discord Nitro does not let you keep access.<p>This is especially painful because it's cut me off from friends and certain developer communities. From what I see from posts on other social media, this is not an uncommon occurrence.<p>Has anyone else had these issues? If so, has anyone had luck getting this resolved?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "lynndotpy",
    "url": "https://news.ycombinator.com/user?id=lynndotpy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32172741",
  "sameAs": "https://news.ycombinator.com/item?id=32172741",
  "dateCreated": "2022-07-20T21:58:45.422Z",
  "datePublished": "2022-07-20T21:39:48.000Z",
  "dateModified": "2022-07-20T21:58:45.422Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}