{
  "@type": "NewsArticle",
  "identifier": "2022--07--20--en--myfeed--HackerNews--NewsArticle--32162085",
  "url": "https://news.ycombinator.com/item?id=32162085",
  "headline": "The Unreasonable Effectiveness of Hiring Freelancers",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "After five years wrestling with my side project, I'm finally optimistic I'll ship it.<p>How did I become optimistic? The short answer is money. The longer answer is indifference.<p>The Journey.<p>Since 2017 I've been working on a side project which I always intended to launch as a paid SaaS product. I matched every cliche about people bootstrapping their SaaS:<p>- The code isn't clean enough\n- The UI isn't pixel perfect\n- The export feature doesn't work correctly\n- I need to completely refactor the entire app because I learned a new way to write a for loop...<p>On at least two occasions I became so stressed out I had to take a break from working on it.<p>On a side project!<p>Here's how I finally got some momentum.<p>Step 1: Hire a freelance developer<p>You need help. You need a new perspective. Most importantly, you need indifference.<p>Freelancers are hired to achieve a specific outcome. After achieving that outcome, they move on to the next project. They don't have time to refactor that same library three times. They force you to prioritize what's important to ship.<p>Step 2: Hire a UI/UX designer<p>Having a rough outline of what the app should look like gives you a target to work toward. Instead of becoming an expert with Figma, hire someone that can do it for you. You'll be shocked what value two weeks of a designer's time can bring.<p>Step 3: Hire a marketing agency<p>Digital marketing is a highly complex endeavor. If you think spending money on Google Ads or posting on Twitter is sufficient to bring your product to life, you'll be disappointed.<p>Yes this all costs money.<p>Yes you have to give up some control.<p>Yes you might miss some learning opportunities.<p>But if there's one lesson I learned after five years, it's all about shipping!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "strimp099",
    "url": "https://news.ycombinator.com/user?id=strimp099"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32162085",
  "sameAs": "https://news.ycombinator.com/item?id=32162085",
  "dateCreated": "2022-07-20T06:35:02.326Z",
  "datePublished": "2022-07-20T06:14:04.000Z",
  "dateModified": "2022-07-20T06:35:02.326Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}