{
  "@type": "NewsArticle",
  "identifier": "2022--08--25--en--myfeed--HackerNews--NewsArticle--32599943",
  "url": "https://news.ycombinator.com/item?id=32599943",
  "headline": "Lastpass: Notice of Recent Security Incident",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Dear valued customer,<p>We are writing to inform you that we recently detected some unusual activity within portions of the LastPass development environment. We have determined that an unauthorized party gained access to portions of the LastPass development environment through a single compromised developer account and took portions of source code and some proprietary LastPass technical information. We have no evidence that this incident involved any access to customer data or encrypted password vaults. Our products and services are operating normally.<p>In response, we immediately initiated an investigation, deployed containment and mitigation measures, and engaged a leading cybersecurity and forensics firm. While our investigation is ongoing, we have achieved a state of containment, implemented additional enhanced security measures, and see no further evidence of unauthorized activity.<p>Based on what we have learned and implemented, we are evaluating further mitigation techniques to strengthen our environment. We will continue to update our customers with the transparency they deserve.<p>We have set up a blog post dedicated to providing more information on this incident: https://blog.lastpass.com/2022/08/notice-of-recent-security-incident/<p>We thank you for your patience as we work expeditiously to complete our investigation and regret any concerns this may have caused you.<p>Sincerely,\nThe Team at LastPass",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "social_quotient",
    "url": "https://news.ycombinator.com/user?id=social_quotient"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32599943",
  "sameAs": "https://news.ycombinator.com/item?id=32599943",
  "dateCreated": "2022-08-25T21:26:01.906Z",
  "datePublished": "2022-08-25T21:06:06.000Z",
  "dateModified": "2022-08-25T21:26:01.906Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}