{
  "@type": "NewsArticle",
  "identifier": "2022--03--06--en--myfeed--HackerNews--NewsArticle--30575557",
  "url": "https://news.ycombinator.com/item?id=30575557",
  "headline": "Tell HN: Interesting fact I learned about human trafficking",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "A while back, I learned that in a certain country, it's a third world country, People are abducted and sold off as basically slaves. But that's not the interesting part, I am getting to it...<p>So cops are obviously involved in this. Cops say this area is under our jurisdiction, and if you wanna commit crimes here you gotta pay us too. In turn cops turn blind eye to the crimes, unless obviously someone important gets hurt, and cops also keep rivals criminal gangs out of the area by going after them. It's a win-win for both the criminal gang and cops.<p>But this means not all crimes are worth it, i.e. if cops want $10k per crime, you want to make sure your crime is netting you at least $13k to be worth it.<p>Which leads to next part, so what abductors do is before they even abduct people they do live bidding. Kinda like Google ads header bidding.<p>They describe the person they think is vulnerable to interested parties and start stalking him/her.<p>If they get high enough bid, they abduct the person, if not, that person gets to go home.<p>This helps with problem of them abducting someone and not getting high enough price to pay off cops.<p>So imagine getting bid on while you are out just buying an ice cream, fun times.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "lifeplusplus",
    "url": "https://news.ycombinator.com/user?id=lifeplusplus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30575557",
  "sameAs": "https://news.ycombinator.com/item?id=30575557",
  "dateCreated": "2022-03-06T06:52:57.165Z",
  "datePublished": "2022-03-06T06:45:35.000Z",
  "dateModified": "2022-03-06T06:52:57.165Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}