{
  "@type": "NewsArticle",
  "identifier": "2022--08--07--en--showhn--HackerNews--NewsArticle--32377826",
  "url": "https://news.ycombinator.com/item?id=32377826",
  "headline": "Apprise v1.0.0 – A lightweight all-in-one notification solution",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I introduced Hacker News to Apprise back when it was just an experiment (and supported just 30 or so notification services at the time). Now supporting more then 85+ services and with a ton of built in features, I officially created it's first stable v1.0.0 release marking a major milestone for the project.<p>Apprise doesn't compete with other notification services out there; instead it just acts as a proxy (or master switchboard) to support handling messages to them. It's a means of decoupling notification support from the systems that want to provide them. The idea is to adopt Apprise into your environment, and then you no longer have to worry about adding/removing support for new services as the come along and deprecating the ones that go away.<p>The way it works is that every service out there maps to a `schema://credentials/?optional_configuration`. You just need to define the schemas you use, and then you can already use Apprise. Check out the list of the services available today here: <a href=\"https://github.com/caronc/apprise#supported-notifications\" rel=\"nofollow\">https://github.com/caronc/apprise#supported-notifications</a><p>Apprise is 100% open source (MIT Licensed).  It has an acompanied API I built for those who want to centralize their configuration (found here: <a href=\"https://github.com/caronc/apprise-api\" rel=\"nofollow\">https://github.com/caronc/apprise-api</a>).<p>Some reasons you may also all find it useful:<p><pre><code>  - It works perfectly with legacy servers (supporting even Python 2.7).  So this fits system admins using older systems such as CentOS 6+\n  - It has a complete API that developers, devops, and administrators alike can leverage allowing them to control the notifications in their environments.\n  - It supports configuration files allowing you to securely hide your credentials and map them to simple tags like `family`, `devops`, `marketing`, etc. There is no limit to the number of tag assignments. It supports a simple TEXT (https://github.com/caronc/apprise/wiki/config_text) based configuration, as well as a more advanced and configurable YAML (https://github.com/caronc/apprise/wiki/config_yaml) based one.\n  - It sends all notifications asynchronously optimizing setups where there are many end-points to deliver to.\n  - It supports inputs are of MARKDOWN, HTML, and TEXT and can easily convert between these depending on the endpoint. For example: HTML provided input would be converted to TEXT before passing it along as a text message. However the same HTML content provided would not be converted if the endpoint accepted it as such (such as Telegram, or Email). \n  - It supports breaking large messages into smaller ones to fit the upstream service. Hence a text message (160 characters) or a Tweet (280 characters) would be constructed for you if the notification you sent was larger.\n  - It supports file attachments too. So feel free to pass along an image, PDF, etc if the destination supports it.\n  - It can easily allow you to write your own custom notifications and/or simply leverage Apprise as routing service to perform admin tasks for you.  See here for more details: https://github.com/caronc/apprise/wiki/decorator_notify\n  - It has 100% code based test coverage. :)\n</code></pre>\nI hope to continue to add more services (and break 100+ supported services someday). I also hope some of you find it useful for your own project solution!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "l2g",
    "url": "https://news.ycombinator.com/user?id=l2g"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32377826",
  "sameAs": "https://github.com/caronc/apprise",
  "dateCreated": "2022-08-07T17:03:16.178Z",
  "datePublished": "2022-08-07T16:51:08.000Z",
  "dateModified": "2022-08-07T17:03:16.178Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}