{
  "@type": "NewsArticle",
  "identifier": "2022--04--29--en--askhn--HackerNews--NewsArticle--31207390",
  "url": "https://news.ycombinator.com/item?id=31207390",
  "headline": "Should I just buy a home?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Please Excuse the title. I need some perspective.<p>Early Last year I was planning to buy a house in Southern California but ended up taking a job in the Bay Area and moving instead.<p>Kind of kicking myself for not pulling the trigger on a sub 1m house at &lt;3%. I could have just rented it out.<p>Instead I’m in the Bay Area paying in rent what my entire mortgage + taxes would have been while my downpayment money (&gt;200k) just erodes due to inflation- which is accentuated in housing.<p>Now I feel like I’ve missed an opportunity of a lifetime. Housing is much higher across the board and the Bay Area is just nuts.<p>If I was to buy here With a reasonable commute then I’m looking at 1.5m on the lower end for a 3 bedroom (I have a family). Which I can’t (reasonably) pull off at these rates.<p>I make more money than I did but a good portion of that is equity which hasn’t done well. My base income excluding equity is 190k and I’m priced out.<p>I made over $300k last year (it will likely be less than 300k this year due to equity drop) but I’m just as worried about our future as ever.<p>Part of me wonders if I should just buy further away as I just go into work a couple times a week or even go perm remote and buy something for cheaper a lot further away (or even move back).<p>One (of several) downside to living further away is access to career opportunities that are concentrated here. Maybe that’s over valued at this point with the shift to remote work.<p>Or I just put off home ownership for at least the next 5 years. Invest the cash in an index and focus on my career.<p>But I’m only getting older and have a family to support and want to provide stability and security. Housing is a hedge against ever increasing rents so despite the downsides should I just buy what I can and just move.<p>I’m so confused and think about this constantly. Would appreciate perspective.<p>Hope I don’t get flamed. I do feel like I have trouble with perspective and seeing a therapist.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "metabro",
    "url": "https://news.ycombinator.com/user?id=metabro"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31207390",
  "sameAs": "https://news.ycombinator.com/item?id=31207390",
  "dateCreated": "2022-04-29T17:17:20.784Z",
  "datePublished": "2022-04-29T16:37:16.000Z",
  "dateModified": "2022-04-29T17:17:20.784Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ]
}