{
  "@type": "NewsArticle",
  "identifier": "2022--04--29--en--askhn--HackerNews--NewsArticle--31200923",
  "url": "https://news.ycombinator.com/item?id=31200923",
  "headline": "Reasoning for Animal Rights",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Is there a sound argument in favor of (inhuman) animal humanitarianism? I understand that excessive hunting and habitat encroachment is detrimental to the global ecosystem, but what about actions taken in a semi-controlled environment, like slaughterhouses and labs?<p>From what I've seen, parties who object to animal cruelty/mishandling don't cite an ounce of logical proof behind their stance. It's as though they believe that their sentiment stems directly from common sense and as such does not necessitate a formal explanation. I understand that this is often a defining characteristic of interest groups, but it seems unusual for one with such great traction in modern western society.<p>Nearly all of these activism organizations rely on shock and gore media to garner support, taken to extremes by the more popularized instances (e.g. PeTA). At the end of the day, their sole plea is to eliminate suffering inflicted upon animals...for no other reason than because it is within humanity's capability to do so. I've scoured through a dozen sites in the past half-hour, and this generally holds true to each one.<p>The only legitimate thesis I could find essentially claims that animal abusers are liable to harm humans due to moral desensitization, which actually makes a fair amount of sense, until you realize that &quot;abuser&quot; might simply be referring to the common pet-owner or whatnot. Do you guys know any others?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "alchemister",
    "url": "https://news.ycombinator.com/user?id=alchemister"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31200923",
  "sameAs": "https://news.ycombinator.com/item?id=31200923",
  "dateCreated": "2022-04-29T03:48:21.524Z",
  "datePublished": "2022-04-29T03:07:19.000Z",
  "dateModified": "2022-04-29T03:48:21.524Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ]
}