{
  "@type": "NewsArticle",
  "identifier": "2022--04--29--en--askhn--HackerNews--NewsArticle--31205122",
  "url": "https://news.ycombinator.com/item?id=31205122",
  "headline": "Whats the best way to secure a NAS device for outside access?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm looking to setup a NAS device that can be accessed by one remote person. I was thinking the easy way to do this would be to configure home office VPN appliance that has good performance. I have been out of the security field for awhile, and I'm more of a desktop support guy anyway that has some, but not a lot, of security knowledge.<p>My goal is to host files remotely from my NAS device. I dont want to put my device on the net as I am sure it will be hacked, so I am looking for VPN appliances to fit the bill. The last time I worked with VPN related technology (15 years ago) they were slow has hell on the processor end and I am thinking that has improved somewhat. I have one person that needs to be able to read and write PDF files directly to the NAS and I am wondering if anyone versed in this field can point me to some equipment that will fit my use-case and provide that user with fast file system access over a VPN tunnel using an appliance device. I don't have a lot of time to configure and support my own custom device.<p>I currently have a NOKIA BGW320-505 Gateway device with a local provider that supplies ATT's fiber service at 50mpbs Down and 10Mbps Up with a Gigabit Switch. I'm looking for the best way to get reliable and secure VPN capabilities and am thinking of an independent VPN device [like this one](https://www.amazon.com/NETGEAR-Insight-Managed-Business-Router/dp/B08GL497XL), but I am open to suggestions.  Thank you for your time in helping people find good security solutions.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "trinsic2",
    "url": "https://news.ycombinator.com/user?id=trinsic2"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31205122",
  "sameAs": "https://news.ycombinator.com/item?id=31205122",
  "dateCreated": "2022-04-29T14:00:10.030Z",
  "datePublished": "2022-04-29T13:55:40.000Z",
  "dateModified": "2022-04-29T14:00:10.030Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}