{
  "@type": "NewsArticle",
  "identifier": "2022--07--19--en--askhn--HackerNews--NewsArticle--32152652",
  "url": "https://news.ycombinator.com/item?id=32152652",
  "headline": "Personal finance blog as monetizable pet project?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a FAANG tech worker bee (experience as software engineer, tech lead and engineering manager) who is growing significantly tired of the corporate rat race, and the fact that I have really no control over pretty much anything I do all day at work, I am at the whims of corporate politics that make every effort I spend objectively pointless, if it wasn't for the fact that it pays my salary. As such, I am looking to start some sort of pet project to satisfy my craving for ownership.\nI think over the years I gained a unique perspective when it comes to personal finance, financial independence and passive investments, working in tech, tech compensations, startups and equity, and similar topics (a few snippets of this &quot;wisdom&quot; are available in my other comment down below). I routinely get calls from friends/acquaintances/ex coworkers asking for advice regarding one of these topics.<p>I am trying to understand if it would be worth starting a blog that covers these subjects. The goal would be to eventually monetize this in some way (ads, affiliate, consultations, …) just so that I could consider it worth my time.<p>Do you think this could be a viable strategy, or am I embarking on a sad journey that after thousands of hours spent creating content would leave me with nothing valuable to show for? A brutally honest answer would be highly appreciated, since I haven't started yet.<p>Thanks",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "deanmoriarty",
    "url": "https://news.ycombinator.com/user?id=deanmoriarty"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32152652",
  "sameAs": "https://news.ycombinator.com/item?id=32152652",
  "dateCreated": "2022-07-19T15:30:10.044Z",
  "datePublished": "2022-07-19T15:12:45.000Z",
  "dateModified": "2022-07-19T15:30:10.044Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ]
}