{
  "@type": "NewsArticle",
  "identifier": "2022--07--19--en--askhn--HackerNews--NewsArticle--32154985",
  "url": "https://news.ycombinator.com/item?id=32154985",
  "headline": "How to get a company to remove my email from an account",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, I have a sticky issue that I haven't been able to solve and am looking for ideas. My primary email is MyName@gmail.com. I've occasionally gotten email intended for others with my name, until now it has never been an issue.<p>Then someone that shares my name created an account and used my email address as the primary email. At the time I didn't think anything of it, they wouldn't be able to validate the address and would correct that. That correction never happened and now I'm receiving email with all of their account activity. Failed login attempts, receipts, updated credit card info, iCal invitations for upcoming events that they've joined. Some of this is quite personal, I shouldn't be seeing this.<p>I don't know anything about the person that shares my name so I don't have a way of contacting them directly. There is no unsubscribe because this isn't opt-in email. I tried marking the email as spam, but somehow it started showing in my account again.<p>A month ago I contacted their support and asked that my email be removed. They couldn't help me. Their support team sent instructions for how to change an email address or how to recover an account, but neither of these solutions apply in my case.<p>Now I seem to be stuck, once their team realized that I'm not their customer they stopped replying. I tried logging into the account to take it over and change the address myself, but they have 2FA enabled so this wasn't possible. Meanwhile my phone has started automatically adding their iCal invites to my calendar so I just got a notification to appear at the other person's hotel.<p>How can I get my email address removed from an account that belongs to someone else?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lenwood",
    "url": "https://news.ycombinator.com/user?id=lenwood"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32154985",
  "sameAs": "https://news.ycombinator.com/item?id=32154985",
  "dateCreated": "2022-07-19T17:47:00.326Z",
  "datePublished": "2022-07-19T17:21:45.000Z",
  "dateModified": "2022-07-19T17:47:00.326Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}