{
  "@type": "NewsArticle",
  "identifier": "2022--07--04--en--askhn--HackerNews--NewsArticle--31979983",
  "url": "https://news.ycombinator.com/item?id=31979983",
  "headline": "Advice on camera for black and white only photography?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I was very much into black and white SLR photography many years back, shooting manual with b&amp;w film (sometimes developing film myself, but never really enjoyed that side of it so much).<p>I'm looking to get back into it, and was looking advice on modern digital cameras and software/workflows for b&amp;w only photography.<p>I've seen there are now some dedicated monochrome cameras, but they seem hideously expensive for the features, and quite a few years old now (so not sure whether they never caught on, were overpriced, or are so great they didn't need improving).<p>Some posts I've read suggest using Fujifilm cameras due to some different sensor filter pattern. Others suggest shooting in color then converting to b&amp;w in software to make working with color channels easier.<p>SLRs seem to be declining a bit in favour of mirrorless cameras, but I don't really have any experience with these to know whether they're now good enough to fully replace SLRs.<p>It's proving a bit tough to search for, so many search results just get me blogs/sites filled with ads or affiliate links, so hard to know who/what to trust. A lot of focus also seems to be on color performance, video, and autofocus, none of which I care about much (interchangeable lenses are a must though).<p>Any advice or pointers to trusted blogs/videos/sites etc. would be welcome - I've barely used any digital cameras other than my phone for quite some time.<p>FWIW part of the appeal of b&amp;w to me is its limitations, rather than just an effect to be applied to color photos I'd taken.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "nlnn",
    "url": "https://news.ycombinator.com/user?id=nlnn"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31979983",
  "sameAs": "https://news.ycombinator.com/item?id=31979983",
  "dateCreated": "2022-07-04T18:31:51.386Z",
  "datePublished": "2022-07-04T17:57:34.000Z",
  "dateModified": "2022-07-04T18:31:51.386Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}