{
  "@type": "NewsArticle",
  "identifier": "2022--08--26--en--askhn--HackerNews--NewsArticle--32602080",
  "url": "https://news.ycombinator.com/item?id=32602080",
  "headline": "Are there any alternatives to ESO Fund for non-recourse cash advances?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I was an early employee at a private US startup many years ago. I exercised some stock options, but I cannot sell any shares yet due to transfer restrictions (which is quite common.) I am not a US citizen or tax resident, and I have moved back to my home country of New Zealand.<p>I have received an offer from ESO Fund [1]. They are offering to provide a non-recourse cash advance (aka a loan) in exchange for a percentage of the upside after the company has an IPO.<p>One of the conditions of this offer is that I would need to transfer my shares into a trust. This would be a Permitted Transfer, which the company does allow. I believe the purpose of the trust is to function as an escrow, to ensure that they receive their money after the IPO.<p>I've talked to a tax advisor, and this will cause some huge problems due to my country's tax laws (FIF.) We basically have a wealth tax for foreign investments, and this transfer would cause my annual tax bill to increase by hundreds of thousands of dollars. I cannot afford to pay these taxes because my shares are illiquid. I am currently exempt from this FIF tax since I received the shares through an employee share scheme (EX 38.) Transferring my shares to a trust would cause me to lose this exemption.<p>Can anyone suggest any solutions to this problem? Is there some additional clause we could add to the contract, or anything else I could offer them?<p>Otherwise, are there any alternatives to ESO Fund that might allow me to continue owning the shares?<p>Finally, this company is basically ready to have an IPO whenever the conditions are right. They could have had an IPO last year. How much longer do you think I might need to wait for the IPO?<p>[1] https://www.esofund.com",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "equityloan",
    "url": "https://news.ycombinator.com/user?id=equityloan"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32602080",
  "sameAs": "https://news.ycombinator.com/item?id=32602080",
  "dateCreated": "2022-08-26T02:47:17.282Z",
  "datePublished": "2022-08-26T01:01:09.000Z",
  "dateModified": "2022-08-26T02:47:17.282Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}