{
  "@type": "NewsArticle",
  "identifier": "2022--08--26--en--askhn--HackerNews--NewsArticle--32606371",
  "url": "https://news.ycombinator.com/item?id=32606371",
  "headline": "Which OSS codebase can I learn that'll remain relevant after 20 years?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a software developer for many yrs. I've written some opensource projects but they're not popular... only 10-20 stars, one or two bug reports in a year. I've made contributions to large OSS projects but I feel like small fish in large ocean there. There are much bigger fish and whales in OSS who understand the codebase so well and they can extend that code and help others in ways I can only dream of.\nFor sometime I'm having an itch to learn some open source codebase really really well, go deep into it. I want the satisfaction of knowing one open source project deeply. But this takes time and focus. I get such satisfaction in my day job working on proprietary codebases. I want to find the same satisfaction in an OSS project. This could become my weekend hobby. I'm looking for suggestions. What I'm looking for:<p>* Very well established libre/opensource project<p>* Something that will still be relevant and still be around after 20 years<p>* Something that has a community of users around it (it is okay if it is a niche community)<p>The &quot;still be around after 20 years&quot; is important because if I'm going to spend many weekends learning some codebase it'd better be on some codebase that is going to be around after 20 years so what I learn does not go entirely waste. Thoughts? Suggestions?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ctrlmeta",
    "url": "https://news.ycombinator.com/user?id=ctrlmeta"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32606371",
  "sameAs": "https://news.ycombinator.com/item?id=32606371",
  "dateCreated": "2022-08-26T12:50:56.331Z",
  "datePublished": "2022-08-26T12:16:08.000Z",
  "dateModified": "2022-08-26T12:50:56.331Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ]
}