{
  "@type": "NewsArticle",
  "identifier": "2022--08--26--en--askhn--HackerNews--NewsArticle--32613975",
  "url": "https://news.ycombinator.com/item?id=32613975",
  "headline": "Staff engineer with college grad skill level",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a staff engineer at a very large company where tech is not the core product. Been here for ~6 months. I have been in software for ~20 years and I literally have the skills of a CS college grad (maybe). I do not have a bachelors degree. I could not tell you how tcp/ip works or create a linked list. I am very good at interviewing and a pretty good people / project leader. People like me and I look after the people that work for me, always looking to speak well of them to leadership. I have steadily attained higher job positions. I keep each job for a couple years before jumping to a new one for a raise. To say I have imposter syndrome is a massive understatement. I am also really burned out, unable to focus for more than 30 minutes at a time and have been like this for years. I have somehow reached this position far outside of my skillset and a pretty good salary (not faang). I find myself really liking this current company and would like to stay here. How do I make myself a better engineer at this stage of the game? Essentially I need 1 more promotion to director level and then I don't really have to worry about it, I can just do what I like which is manage people and projects. I am probably a couple years away from that. I never liked tech, I just kind of stumbled into it and stayed there because it pays well. I have managed to keep up with most of my work by working 60 - 70 hours a week a lot of the time and now I am fried. What should I do?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "askSrThrowAway",
    "url": "https://news.ycombinator.com/user?id=askSrThrowAway"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32613975",
  "sameAs": "https://news.ycombinator.com/item?id=32613975",
  "dateCreated": "2022-08-26T23:46:45.540Z",
  "datePublished": "2022-08-26T23:31:54.000Z",
  "dateModified": "2022-08-26T23:46:45.540Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}