{
  "@type": "NewsArticle",
  "identifier": "2022--08--26--en--askhn--HackerNews--NewsArticle--32612559",
  "url": "https://news.ycombinator.com/item?id=32612559",
  "headline": "Use my name or a nickname as custom domain and website?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello!<p>I want to move away from gmail for email and want to start using a custom domain and aliases, I also want to start a site/blog to use as portfolio and stuff.\nThis is because I just graduated from college and I read how important having this can be to find jobs and stuff, it also just seems fun to do.\nMy question is, should I use my last name (is pretty unique), or my internet nickname that I have been using for almost 20 years? I already own mynick.com, im just not using it.<p>The nick and last name got connected somewhere at some point, so if you google one you will definitely find the other identity. I dont mind people knowing my online name or looking at what I do (I still use it everyday in many places), but I use it for games, anime and other stuff, and because I've been using it since I was 10 its possible to find some pretty dumb 10 year old stuff out there associated with it. Also about 40% of the related content is in Spanish (now I live in the USA and only looking for jobs here). Im just worried about what prospective employers might think about that.<p>Do you have thoughts or recommendations on this?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "fractalaudio",
    "url": "https://news.ycombinator.com/user?id=fractalaudio"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32612559",
  "sameAs": "https://news.ycombinator.com/item?id=32612559",
  "dateCreated": "2022-08-26T20:59:52.437Z",
  "datePublished": "2022-08-26T20:46:11.000Z",
  "dateModified": "2022-08-26T20:59:52.437Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}