{
  "@type": "NewsArticle",
  "identifier": "2022--03--08--en--myfeed--HackerNews--NewsArticle--30608923",
  "url": "https://news.ycombinator.com/item?id=30608923",
  "headline": "NFT Tallinn",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "NFT Tallinn is a conference introducing NFT technology and the possibilities of web3, which will take place on April 6 at Kultuurikatel.\nWe have put the program together to cover all essential topics on the main stage, including NFT as art, NFT as metaverse, NFT as social tokens, NFT as green tech, NFT other solutions, web3 future, web3 policy, web3 investing (from a professional point of view), Overview of DAOs + several workshops and discussion groups.\nSignificant speakers include William Entriken, creator of the NFT standard, ERC-721, Gary Vee's right-hand woman on NFTs, Avery Akkineni, Binance's European marketing manager, David Prinçay, and 50 other speakers from Europe and the United States.\nIn addition to keynotes, panels and workshops on three stages, we are bringing many early-stage projects and startups to the NFT Tallinn event, organising a proper after-party where Nublu will perform, and we will also organise several side events during the week.\nSince most people think NFTs are simply a form of digital art, our goal is to show that this world is much broader and that we can find many everyday solutions that work even today.\nOf course, the event's content is only one part - it is much more important that we expect 500+ NFT and web3 enthusiasts and professionals to join the event and expand the whole field together. So come join us!\nMore information and tickets can be found at: https://delfi.ee/nfttallinn\n- Discounted tickets are valid until March 20.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "sandergansen",
    "url": "https://news.ycombinator.com/user?id=sandergansen"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30608923",
  "sameAs": "https://news.ycombinator.com/item?id=30608923",
  "dateCreated": "2022-03-08T23:49:56.961Z",
  "datePublished": "2022-03-08T23:39:26.000Z",
  "dateModified": "2022-03-08T23:49:56.961Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}