{
  "@type": "NewsArticle",
  "identifier": "2022--07--01--en--askhn--HackerNews--NewsArticle--31950790",
  "url": "https://news.ycombinator.com/item?id=31950790",
  "headline": "Coping with SaaS consumption tax compliance (sales/VAT/GST/etc.)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "As I move towards a SaaS soft launch, I have been greatly frustrated by the apparent lack of standard advice and practices in the area of complying with consumption taxes (a.k.a. sales tax, VAT, GST, etc), which SaaS operations have become subject to in recent years. Even worse, many accountants simply won't touch the issue, especially if one is or is planning on offering services at a truly worldwide scope.<p>In talking with a number of successful SaaS founders, I've found that typical practice buckets out to three different options:<p>1. Mostly ignoring the problem outside of your immediate jurisdiction (i.e. where your corporation is domiciled), which is probably just fine if your operation is small and is likely to stay that way (thus [hopefully] not exceeding each jurisdiction's taxation thresholds).<p>2. Cobbling together a solution using something like Stripe Tax or Quaderno or Avalara to ensure that you're <i>collecting</i> tax properly, but then having to schlep stuff like per-jurisdiction tax registration and filing. Yes, taxjar exists, but is itself a cost, and only really covers the U.S.<p>3. Using a <i>merchant of record</i> (like fastspring or paddle) as your exclusive worldwide reseller, which then takes on all the work of collecting <i>and</i> filing <i>and</i> remitting consumption taxes (usually on a truly worldwide basis, i.e. covering 80+ countries). Of course, the fees associated with this are somewhat higher (but tbh, not <i>that</i> much higher than e.g. stripe + stripe tax + stripe billing + filing and remittance costs), and these platforms are outside of the stripe ecosystem and are their own things, so developer experience and third-party integrations are somewhat spottier.<p>#2 seems to be the most popular option by far, but often ignores a large portion of the world (e.g. stripe tax only covers ~35 countries), and can be very costly even ignoring registration and filing (i.e. Avalara is wildly expensive for what it does).<p>I'd love to hear from more founders about how they've navigated this, and why they've made the choices they've made. Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cemerick",
    "url": "https://news.ycombinator.com/user?id=cemerick"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31950790",
  "sameAs": "https://news.ycombinator.com/item?id=31950790",
  "dateCreated": "2022-07-01T18:58:04.280Z",
  "datePublished": "2022-07-01T18:35:38.000Z",
  "dateModified": "2022-07-01T18:58:04.280Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}