{
  "@type": "NewsArticle",
  "identifier": "2022--03--08--en--askhn--HackerNews--NewsArticle--30607556",
  "url": "https://news.ycombinator.com/item?id=30607556",
  "headline": "Navigating activist tech organizations during a job hunt",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN,<p>I've got a job now that's been pretty good to me so far, but a recent change in circumstances has put a bad taste in my mouth. As such, I'm considering other options. I do site reliability engineering work, though I could transition into full software if I wanted. I've got about 15 years of experience so it would be for a senior role.<p>One concern I have is accidentally stumbling into a company with a twisted, woke culture that will see me ostracized if I don't self-flagellate (being a white man) and engage in performative social justice. I could probably bring the odds of that down to about 0 if I avoid anything in say, urban California and NYC but that really cuts down on the available job opportunities in tech.<p>A few questions for you all:<p>1. How pervasive is this sort of work culture, actually? I get the impression that it's common in some areas, like Silicon Valley, but that could easily be a misconception.<p>2. Do you have any tips for detecting this kind of culture before signing on at a new company?<p>3. Any specific companies you can recommend looking into? I have roots where I am and not willing to move, so remote work flexibility is a must.<p>Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "dolni",
    "url": "https://news.ycombinator.com/user?id=dolni"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30607556",
  "sameAs": "https://news.ycombinator.com/item?id=30607556",
  "dateCreated": "2022-03-08T21:50:03.077Z",
  "datePublished": "2022-03-08T21:46:16.000Z",
  "dateModified": "2022-03-08T21:50:03.077Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}