{
  "@type": "NewsArticle",
  "identifier": "2022--07--19--en--showhn--HackerNews--NewsArticle--32153063",
  "url": "https://news.ycombinator.com/item?id=32153063",
  "headline": "Spatium – A space odyssey awaits you with beautiful space images",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi there, humans!<p>I'm excited to announce Spatium!<p>I'm a big fan of any topic related to our universe. I'm also a developer, so I've put these things together and I built this new tab Chrome Extension for space lovers, astronomy fans, and science geeks like me.<p>If you enjoyed it, please spread some love &lt;3<p>FEATURES<p>• Space images • Every day, get a fascinating image of our universe. Enjoy pictures of stars, planets, moons, galaxies, nebulae, comets and more right on your browser tab.<p>• Sun Widget • Find out when the sunrise, sunset, first and last light times will be precisely at your location. It also shows a countdown in an easy-to-read display, so you can stay tuned in your favourite sun event - light up your world!.<p>• Moon Widget • See the current moon phase in real-time, countdowns to moon events (New Moon, First Quarter, Full Moon and Last Quarter), along with exact illumination percentages. So never miss an opportunity for moon gazing anymore.<p>• Inspire Yourself Daily • Receive a daily dose of inspiration, insight and positive action with our curated list of quotes from the most intelligent people in history.<p>• Customizable Interface • You can customize your experience with Spatium by showing and hiding widgets as per your needs. You decide what's on your New Tab page - it's up to you!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "titxo",
    "url": "https://news.ycombinator.com/user?id=titxo"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32153063",
  "sameAs": "https://spatium.earth/",
  "dateCreated": "2022-07-19T15:52:06.792Z",
  "datePublished": "2022-07-19T15:35:43.000Z",
  "dateModified": "2022-07-19T15:52:06.792Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}