{
  "@type": "NewsArticle",
  "identifier": "2022--06--01--en--showhn--HackerNews--NewsArticle--31574525",
  "url": "https://news.ycombinator.com/item?id=31574525",
  "headline": "Find_by_AI() Not Xpaths",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HackerNews, It’s Etienne CTO of dev-tools.ai. We are launching our product today and wanted to share because we think it might help folks here.<p>Do you ever have broken selectors in your UI tests?\nAre you tired of maintaining them?\nWe have thought about this issue and come up with a solution.<p>We have created a Python SDK for Selenium that allows you to visually identify elements (using machine learning under the hood). Since our technology uses the visual appearance of elements and ML, it is more resilient than XPaths or pixel perfect match and should help you get rid of broken selectors.<p>We can automatically ingest all the elements from your test cases when you use our package. Any test case can become robust this way with two lines of code.<p>We also have built a feature to interactively navigate and annotate a web app with your selectors, it’s an easier way to automate test case creation by simply clicking around on elements.<p>If any of that sounds interesting to you, check out our product at <a href=\"https://dev-tools.ai/\" rel=\"nofollow\">https://dev-tools.ai/</a> and let us know how we can improve it to help you!<p>A little insight into our tech:<p>- We use EfficientDet as our main object detector + some custom code and heuristics<p>- We distribute the work using Celery + RabbitMQ and GPU workers<p>- We currently are a small team of two, so the frontend is mostly server side rendering with Flask and Jinja.<p>We would love to get power users to test out the system and give feedback.\nThe service is currently free, we are considering different pricing options but not the main concern for now.<p>Happy to dive in on technical details or geek out about QA stuff.\nBest",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "etdeagle",
    "url": "https://news.ycombinator.com/user?id=etdeagle"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31574525",
  "sameAs": "https://dev-tools.ai/",
  "dateCreated": "2022-06-01T16:58:36.940Z",
  "datePublished": "2022-05-31T20:28:50.000Z",
  "dateModified": "2022-06-01T16:58:36.940Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}