{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--askhn--HackerNews--NewsArticle--31590084",
  "url": "https://news.ycombinator.com/item?id=31590084",
  "headline": "Patenting a software system that supports open source?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm working on an open source platform for building 3D content, using what I believe to be a new/clever core system design. This platform exports to open source targets, such as Unity.<p>I hope to make a profit off of the concept, in the admittedly very unlikely event that this platform takes off. One play is selling the tech to a graphics company, to fund my development on it.<p>I've been considering patenting all or part of this system, with options like:\n- Try to patent some or part of the system, and only use it as personal financial protection when trying to sell the product, and never enforce it any other way\n- Patent some specific part of the system that no one would care about, to avoid scaring off open source users<p>Worries:\n- Discouraging open source users, who might think it skeevy or unethical to have patented software (see: Unity patenting ECS)\n- A patent preventing/discouraging this platform from being embedded/used by other open source ecosystems.<p>I have no experience with software patents. I see companies value patents for their IP, and I'm curious about the patent process, and like the idea of having a patent on my CV. Should I try to patent all or part of this design, while still targeting open source?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "stevebmark",
    "url": "https://news.ycombinator.com/user?id=stevebmark"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31590084",
  "sameAs": "https://news.ycombinator.com/item?id=31590084",
  "dateCreated": "2022-06-02T13:54:07.320Z",
  "datePublished": "2022-06-02T00:58:26.000Z",
  "dateModified": "2022-06-02T13:54:07.320Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}