{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--askhn--HackerNews--NewsArticle--31589233",
  "url": "https://news.ycombinator.com/item?id=31589233",
  "headline": "What's the name of that rubber coating crap, do you like it?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi, I don't throw away electronic equipment, I like to keep my old hardware in working condition to repurpose it for my projects. I got my old Nexus5 back from my storage room to repurpose it as SDR and, despite having stored it properly, with desiccant salt bags, in box, surrounded by two layers of pluriball, the rubber coat of the phone now is a nasty, sticky crap. I wasted time to completely remove that disgusting stuff using isopropyl alcohol, not having the proper solvent. This is a problem of a lot of electronic products , having that treatment with the only purpose, I guess, to obtain a better &quot;look and feel&quot; or to implement some kind of induced obsolescence reducing devices in perfect working condition a trap for flies. If you ask me, I'm sick and tired that my stuff literally decompose like corpses in my closets because someone think that nasty shit is cool. Youtube is full of peoples with the same problem, so I think it's time to say &quot;enough&quot;. Anyway, what's the name of that stuff?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "gabrielblack",
    "url": "https://news.ycombinator.com/user?id=gabrielblack"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31589233",
  "sameAs": "https://news.ycombinator.com/item?id=31589233",
  "dateCreated": "2022-06-02T13:54:07.295Z",
  "datePublished": "2022-06-01T23:00:18.000Z",
  "dateModified": "2022-06-02T13:54:07.295Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ]
}