{
  "@type": "NewsArticle",
  "identifier": "2022--04--30--en--askhn--HackerNews--NewsArticle--31220505",
  "url": "https://news.ycombinator.com/item?id=31220505",
  "headline": "Modern Alternatives to C",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Recently with a group of friends I decided to start creating a web browser from the ground up using as few libraries as possible and I wanted to do it in C. I persuaded everyone to learn and start using C, because I personally had a sweet spot for C and I've seen many great applications written in C so I wanted to pay homage to the great developers who coded great software in C.<p>But none of us were familiar with C and graphical libraries such as Xlib and Cairo so it was and is a big learning experience for all of us. However, learning C and Xlib has become a massive hurdle for us. The problem is that C is a remarkably old language and the available learning resources are very old. Most of the information in books have become obsolete as standards and libraries have changed and and updated. The C communities have turned into ghost-towns with the latest posts being from several years ago. And worst of all, an unbelievably large chunk of C code on the internet cannot be compiled due to changes in standards and changes in libraries.<p>I think while it was a novel attempt to try to do the whole project in C with the bare minimums, it is very unproductive. It took out the confidence and fire in all of us so now I'm looking at some of the modern languages as a replacement for C. I still would like to keep it relatively low leveled and be in control. From my knowledge GO and Rust seem to be a modern take on C.<p>GO and Rust have caught my attention because they seem to have an active community, both allow the programmer to be in charge, and they perform quite well.<p>I'm asking you for advice and really like to hear your thoughts. Do you think Rust or GO would be suitable? Do you recommend other languages? What do you think?<p>I am interested to read your thoughts.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "leakbang",
    "url": "https://news.ycombinator.com/user?id=leakbang"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31220505",
  "sameAs": "https://news.ycombinator.com/item?id=31220505",
  "dateCreated": "2022-04-30T23:40:45.268Z",
  "datePublished": "2022-04-30T23:30:11.000Z",
  "dateModified": "2022-04-30T23:40:45.268Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}