{
  "@type": "NewsArticle",
  "identifier": "2022--04--30--en--askhn--HackerNews--NewsArticle--31213682",
  "url": "https://news.ycombinator.com/item?id=31213682",
  "headline": "How to deal with burnout close to a major deadline?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "How do you deal with burnout, especially when close to a big deadline / release?<p>I'm a junior dev and have been at a pretty huge company for about a year now. I generally do good work (manager and other team members say as much at least) and I'm often 'visible', having built a good enough reputation among the other teams and leadership in the project to the point where I tend to be one of the main points of contact for my team outside of our technical architect.<p>However this sprint I've been working on two stories (features?) that I absolutely despise working on (involves working with other team's microservices that have much spaghetti code and parts of the product I've never worked with before), and the deadline for them was cut super short yesterday by leadership as we're close to release. But I am feeling super unmotivated and the mounting pressure isn't helping kick my ass to gear. I know that if I continue work on this I'll just be phoning it in...<p>Honestly this whole  release has felt like a death march and I'm just drained.<p>In any case, apologies if this sounds like just a rant but how do you get through the slog of sh*t work and shit deadlines while your battery is drained? Not even thinking about salary and insurance is getting me anywhere. I'm wondering if this burnout is a symptom of something deeper.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "atsushin",
    "url": "https://news.ycombinator.com/user?id=atsushin"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31213682",
  "sameAs": "https://news.ycombinator.com/item?id=31213682",
  "dateCreated": "2022-04-30T06:12:39.678Z",
  "datePublished": "2022-04-30T05:50:27.000Z",
  "dateModified": "2022-04-30T06:12:39.678Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}