{
  "@type": "NewsArticle",
  "identifier": "2022--08--25--en--showhn--HackerNews--NewsArticle--32594298",
  "url": "https://news.ycombinator.com/item?id=32594298",
  "headline": "We're building a better future for gig work starting with onboarding",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Today we’re announcing a new product we’ve had in the works for the past few months!<p>Corridor is an embeddable no-code solution for HR and Ops teams to onboard their flexible workers at speed and scale. Create, launch, and optimize your onboarding flow, but faster. Improve candidate conversion, automate tasks, collaborate with your team on design, and seamlessly plug-in your favorite HR tools.<p>We’re building this to help our customers and their candidates have a better all-around onboarding experience. Along the way, we captured feedback around how difficult it is to design, manage, and track all the different paperwork and processes that go into getting a worker to their first day of work (not to mention dealing with trying to make this a good UX as apart of your product). We landed on building something that balances ease of creation and delightfulness by focusing on the candidate experience first and working backward toward designing such experiences.<p>We’re still in early beta so we’re looking for testers, early adopters, and design partners. If interested, please feel free to schedule a demo or sign up for early access on our website.<p>P.S. I'm giving away $30 Doordash gift cards in exchange for a 30 minute user research interview...message me at vu.francois@withcorridor if interested! :)",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "flyingmagnolia",
    "url": "https://news.ycombinator.com/user?id=flyingmagnolia"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32594298",
  "sameAs": "https://withcorridor.com/",
  "dateCreated": "2022-08-25T14:45:27.409Z",
  "datePublished": "2022-08-25T14:41:53.000Z",
  "dateModified": "2022-08-25T14:45:27.409Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}