{
  "@type": "NewsArticle",
  "identifier": "2022--05--07--en--showhn--HackerNews--NewsArticle--31286000",
  "url": "https://news.ycombinator.com/item?id=31286000",
  "headline": "I'm building a workspace where companies can map out their Strategy",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I’m building a tool that makes the connection between employee growth and company growth visible.<p>With this tool, you can use several types of cards on a whiteboard to visualize how your company strategy and goals intertwine with the personal goals of your team members. Founders can add the company strategy and goals, and team members can add team- and personal goals. By connecting them, it gets clear how these are related. Team Leads can use these insights to guide their team members in their growth and maximize this way both personal and company growth.<p>When using this tool during communication moments with your team members, for instance, during team sessions, 1:1’s, strategy updates or onboarding sessions, you can optimize alignment and engagement in your company. Team members are easily updated when there are strategy changes and see at the same time how their own work contributes to the bigger picture of the company.<p>Really curious about what you guys think about the tool. Do you see potential? And what would make the tool better? Thanks for your feedback!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "Famskiii",
    "url": "https://news.ycombinator.com/user?id=Famskiii"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31286000",
  "sameAs": "https://www.kinety.app/",
  "dateCreated": "2022-05-07T22:12:27.703Z",
  "datePublished": "2022-05-06T15:03:17.000Z",
  "dateModified": "2022-05-07T22:12:27.703Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}