{
  "@type": "NewsArticle",
  "identifier": "2022--05--07--en--showhn--HackerNews--NewsArticle--31294306",
  "url": "https://news.ycombinator.com/item?id=31294306",
  "headline": "I made Ankify that converts notes to Anki cards",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Backstory: \nI was in medical school and had to study a ton of materials in short period of time. I came across Anki but always had trouble with making cards. In my mind, making cards should be quick, seconds instead of minutes. My other problem is after making the cards, each card does not really relate to the other. When you study the individual card, your thought process is very random and not cohesive. I wanted to be able to still reference to my notes for big concepts and then use the cards to memorize the details but also for long term retention.<p>Ankify came out of that. At the time, I did not know any programming and paid someone to write a script in Python to convert the cards. Then, eventually I learned Python myself and expanded on the script. I also uploaded the markdown files online so I could view them anywhere (<a href=\"https://kangruixiang.github.io/wiki/\" rel=\"nofollow\">https://kangruixiang.github.io/wiki/</a>).<p>I ran into a wall in making user interface for the program. It was difficult to make good looking cross platform user interface with Python. I gave up on making user interface for a year or two with end of med school and residency. After a while, I went back to see if anyone else had made anything similar. Despite many plugins/programs that makes it easy to make cards, none of them really focused on readability of the original notes. I decided to sit down and learn javascript to help with UI creation.<p>After about 3 years, everything finally came together after I learned Svelte, Tailwind, and Electron. I know Electron is not the most efficient program, but it's what works for me.<p>Also, it's also the feeling of being able to make whatever my mind can think of. It feels really refreshing and empowering. Even making the website for Ankify is a lot of fun. You have to think so much about the presentation, typography, logistics.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "kangruixiang",
    "url": "https://news.ycombinator.com/user?id=kangruixiang"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31294306",
  "sameAs": "https://ankify.krxiang.com/",
  "dateCreated": "2022-05-07T22:12:27.857Z",
  "datePublished": "2022-05-07T13:33:11.000Z",
  "dateModified": "2022-05-07T22:12:27.857Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 63
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 34
    }
  ]
}