{
  "@type": "NewsArticle",
  "identifier": "2022--04--28--en--askhn--HackerNews--NewsArticle--31199510",
  "url": "https://news.ycombinator.com/item?id=31199510",
  "headline": "Amazon locked my account and demands copy of my billing statement?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I tried to buy a Macbook Pro on sale two days ago from Amazon USA. Ten minutes later, I get an email saying my account is “on hold” (full message pasted below) to verify that I am the “authorized owner of the payment method”, and requiring me to upload a copy of my billing statement. This seems like an unorthodox process, and from a privacy perspective it seems deleterious for me to send that type of information?<p>Further, it is trivial to modify a PDF billing statement, so it seems like unreliable proof of anything. Amazon says the hold is “for my protection”, but aren’t I already protected by my credit card and bank for unauthorized transactions? So what is the purpose and process of this verification?<p>Also, my account has several hundred dollars of gift card credit that I've been using for purchases, including necessities like groceries, and that is inaccessible when it is locked.<p>This experience is eliciting some deja vu from prior posts on HN about people getting locked out of their Apple ID or Google accounts. It seems like despite massive fintech fundings and innovation, online payments is still not a fully solved problem, if situations like this are still occurring? If, for instance, I paid with crypto, merchants probably wouldn’t care much because the transaction is irreversible?<p>(If any Amazon people see this, I would be grateful for help looking into this and getting my account unlocked as soon as possible. My contact info is on my HN profile. No response from the executive contacts (found on https://www.elliott.org/company-contacts/amazon) so far.)<p><i>Original email from Amazon:</i><p>Hello,<p>We have detected unusual payment activity on your Amazon account. For your protection, we have placed your account on hold temporarily and placed any pending orders or subscriptions on hold as well.<p>If we are unable to confirm your payment information within 72 hours, your pending orders will be canceled. Your account will remain on hold until we are able to confirm that you are the authorized owner of the payment method used in the recent transaction.<p>To restore access to your account, sign in to your Amazon US store account and follow the on-screen instructions. Once you have provided the required information, we will review it and respond within 24 hours.<p>We apologize for any inconvenience this may have caused.<p>Account Specialist\nAmazon.com \nhttps://www.amazon.com \n================",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "hnthrow234",
    "url": "https://news.ycombinator.com/user?id=hnthrow234"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31199510",
  "sameAs": "https://news.ycombinator.com/item?id=31199510",
  "dateCreated": "2022-04-28T23:43:09.303Z",
  "datePublished": "2022-04-28T23:28:48.000Z",
  "dateModified": "2022-04-28T23:43:09.303Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}