{
  "@type": "NewsArticle",
  "identifier": "2022--04--28--en--askhn--HackerNews--NewsArticle--31193561",
  "url": "https://news.ycombinator.com/item?id=31193561",
  "headline": "Has anyone recently had their Dropbox disable?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Dropbox seems to be disabling some accounts in waves, if you are part of this wave you're in danger of losing your data forever.<p>For a little context watch this video:<p>https://www.youtube.com/watch?v=buduP--pZ1Q<p>and read this: https://news.ycombinator.com/item?id=31142845<p>I'm hearing from other people that they are getting their accounts disabled as well. I want us to work together to resolve this issue.<p>Dropbox has made it clear to many of us they will not restore our account, and we would need a court order for any further communication. Therefore we need to hire attorneys to get an injunction.<p>I used to think I understood Dropbox's policy, I was wrong, their policy is incredibly abusive and illegal.<p>Imagine a property manager claiming that drugs were discovered in your home-office, and their solution is to burn down your home-office. The property manager does not show you the actual drugs you are accused of having, nor do they mention the specific drug. They hint that law enforcement is involved but you don't know for sure. Without any due process the property managers says it is their right to burn down your place with the drugs. That's what Dropbox is doing. Dropbox will destroy people's digital files / property without due process.<p>my email is in my profile, thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "rockarage",
    "url": "https://news.ycombinator.com/user?id=rockarage"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31193561",
  "sameAs": "https://news.ycombinator.com/item?id=31193561",
  "dateCreated": "2022-04-28T15:36:16.755Z",
  "datePublished": "2022-04-28T15:19:04.000Z",
  "dateModified": "2022-04-28T15:36:16.755Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}