{
  "@type": "NewsArticle",
  "identifier": "2022--06--01--en--askhn--HackerNews--NewsArticle--31582505",
  "url": "https://news.ycombinator.com/item?id=31582505",
  "headline": "Have you experienced decline in problem-solving skills? How to improve?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I think this might actually be a few questions:<p><pre><code>  1. Has anybody noticed their own cognitive decline? I'm 30 but am interested in experiences at all ages\n  2. Does anybody have a good way of testing their intellect or problem-solving periodically? This would at least help me keep track going forward\n  3. Has anybody found ways to improve their problem-solving skills? Or critical thinking?\n</code></pre>\nI feel like my ability to solve problems well - efficiently, cleverly, satisfactorily, completely - has reduced over time (past year, maybe multiple years? I'm not really sure.) For example, I'll find that a programming solution didn't account for things I should've considered or introduced a new bug; or a co-worker will suggest a different solution and it seems obviously better. I don't think this has always been the case; I used to be pretty school smart in subjects like math and comp sci. My theories:<p><pre><code>  - Maybe my intellect has diminished from using alcohol and weed at an early age?\n  - Maybe that I've been feeling a bit burnt out\n  - Maybe I've gotten lazy and rely too much on, e.g., stackoverflow\n  - Maybe medicine I take for mental health?\n  - Insufficient sleep? I've been getting 6-7 recently but should probably be getting 7-9\n  - Maybe I've actually always been dumb and am only now realizing it!\n</code></pre>\nAny thoughts would be appreciated. If it's something I can change, that would be a huge relief.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Woberto",
    "url": "https://news.ycombinator.com/user?id=Woberto"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31582505",
  "sameAs": "https://news.ycombinator.com/item?id=31582505",
  "dateCreated": "2022-06-01T16:58:16.092Z",
  "datePublished": "2022-06-01T14:44:57.000Z",
  "dateModified": "2022-06-01T16:58:16.092Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 77
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 68
    }
  ]
}