{
  "@type": "NewsArticle",
  "identifier": "2022--06--01--en--askhn--HackerNews--NewsArticle--31579171",
  "url": "https://news.ycombinator.com/item?id=31579171",
  "headline": "Will online voting require to trust crypto experts?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I voted online for the first time this morning, mostly by curiousity.<p>I got a receipt with 2 huge hex numbers and one large base64 blob. The receipt also had a link to an online website to verify that my vote has been registered, and that it will be counted. The website is relatively easy to use, I copy paste my use base64 blob and I get a green success message. It's source code is also available online, in OCaml.<p>Now, I have no good understanding about all of this work. The information page is helpful to get a vague idea of the concepts: https://verifiabilite-legislatives2022.fr/informations.html However you actually need to be a crypto expert to understand it fully, and I'm not one. &quot;More experienced readers may be confronted with a more technical description in English.&quot; https://hal.inria.fr/hal-01576379/file/ZK-securityproof.pdf The paper contains crypto math proofs, it looks fancy and has nice concepts such as homomorphic encryption, zero knowledge proofs and so on. At my level I can only say that my base64 blob contains a JSON document consisting of a few numbers, one huge hex number with homomorphic properties, a schnorr signature, and a public key of something.<p>Moreover, the system has strong limitations because as thex explain, you cannot know that the candidate you selected is the candidate actually registered in your electronic vote, and they cannot ensure that all the registered votes are legitimate.<p>The traditional voting system for French citizen is a transparent box with paper voting ballots in an envelop. You can count the votes later in a group of random citizens, I did it twice personnally, and it's very easy to understand. Most people in my country side village could trust the process with no prior knowledge.<p>I find the online voting part convenient, but I'm afraid people will not trust it because they cannot understand it.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "speedgoose",
    "url": "https://news.ycombinator.com/user?id=speedgoose"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31579171",
  "sameAs": "https://news.ycombinator.com/item?id=31579171",
  "dateCreated": "2022-06-01T16:58:16.013Z",
  "datePublished": "2022-06-01T07:40:03.000Z",
  "dateModified": "2022-06-01T16:58:16.013Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 11
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 21
    }
  ]
}