{
  "@type": "NewsArticle",
  "identifier": "2022--08--26--en--showhn--HackerNews--NewsArticle--32606814",
  "url": "https://news.ycombinator.com/item?id=32606814",
  "headline": "League Legacy – Manage Your Fantasy Football League",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey all, this project may not be that relevant to many or most here but I'm excited to share it either way. Like many here, I'm constantly working on side-projects and for the most part my interest in them fizzles out once I get past the interesting development part, or at least before completion (and the dreaded &quot;marketing&quot;).<p>This is one of the first projects in a long time where I've been excited to work on it daily and see it through to launch. And that's mostly because it's a project that I built primarily for myself. Sometimes the simplest and obvious advice that we overlook because it seems too easy to solve our own problems - actually works out - who woulda thought?<p>So on to the project itself - League Legacy is an application to track and manage your Fantasy Football League history. Anyone who plays in a home league or a league with buddies for several years like myself may like to track stats historically, league records, how you compare vs your friends, etc. In the past, I've tracked all this manually in excel and I've seen several examples here of others doing and sharing those sheets over time. It's been a lot of fun, but well, excel is excel.<p>So I built a tool that does all of this for you and hopefully is a bit nicer than excel and is something I can continue to iterate on overtime and support more leagues/sites and add additional features.<p>You can automatically import your league history from Yahoo or Sleeper, and also manually add season data from other sites that we don't support yet, too. The site will handle displaying all your historical seasons, generate a record book for you, you can see member vs. member stats and matchups, you can even track your league finances through this tool if you'd like.<p>The goal is to (1) continue to fix as many bugs and support as many leagues/variations as possible; (2) continue to build out the historical tools and stats; and (3) build out 'in-season' league management tools and features through-out the season.<p>Anyways, would love to get some feedback and suggestions, and more importantly bug reports. This is an early tool, so undoubtedly there will be some bugs and issues - especially considering how much variation there may be in fantasy league setups, but if you just contact me I'll work on fixing asap for your league.<p>If anyone is interested in checking this out and providing some helpful feedback, you can check out the demo or the full-site. Thanks!<p><a href=\"https://leaguelegacy.io\" rel=\"nofollow\">https://leaguelegacy.io</a>",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "jplata",
    "url": "https://news.ycombinator.com/user?id=jplata"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32606814",
  "sameAs": "https://leaguelegacy.io",
  "dateCreated": "2022-08-26T13:44:03.341Z",
  "datePublished": "2022-08-26T12:55:57.000Z",
  "dateModified": "2022-08-26T13:44:03.341Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}