{
  "@type": "NewsArticle",
  "identifier": "2022--08--26--en--showhn--HackerNews--NewsArticle--32610414",
  "url": "https://news.ycombinator.com/item?id=32610414",
  "headline": "Humanize the web again with Hey Homepage",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN,<p>TLDR: We want to humanize the web again. So we built a do-it-yourself website builder with social functions.<p>Your website and domain are your personal platform. Just as the web is already social media. Loaded with a simple but powerful website tool, you can express yourself and explore others. Design your style and publish your content with a do-it-yourself website builder. Anybody can do it, amateurs and professionals alike. There are multiple software tools out there to assist.<p>Our own tool Hey Homepage [1] comes with a lot of extra functions. Share regular long form content on a blog. Sell physical goods, digital files and service appointments with a webshop. And use a flexible form to ask the info you want. Visitor stats are done without external software that tracks your visitors. Also no cookie banner. Our websites are internet friendly.<p>The cool new Really Social Sites (RSS for short) function enables your website to connect with other websites so you can stay up to date. You decide what sites to connect to and there are no recommendations. You are the algorithm, our tool just makes it easy and fun again.<p>Right now, we offer sites as a service. Subscribe to our starter package or request a trial first. We plan to open source in the future, so devs and nerds can get a license to selfhost the source code. Join the wait list if you're interested.<p>Best regards,\nBram from Hey Homepage<p>P.S. We want to humanize the web again. We're not alone in this. We've seen all kinds of inspiring initiatives on HN the last years. From search engines like Marginalia to personal websites like Micro.blog. And we're not even counting all the interesting RSS feeds we gathered from all of you. Thank you all!<p>[1]: https://www.heyhomepage.com/",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "rambambram",
    "url": "https://news.ycombinator.com/user?id=rambambram"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32610414",
  "sameAs": "https://news.ycombinator.com/item?id=32610414",
  "dateCreated": "2022-08-26T17:39:10.105Z",
  "datePublished": "2022-08-26T17:30:21.000Z",
  "dateModified": "2022-08-26T17:39:10.105Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}