{
  "@type": "NewsArticle",
  "identifier": "2022--04--29--en--hackernews--HackerNews--NewsArticle--31203186",
  "url": "https://news.ycombinator.com/item?id=31203186",
  "headline": "Dealing with Career Mistakes",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Two years ago I had an option to go into the management path. My leadership was supportive and wanted me to take up the opportunity. I chose to pivot into the product management instead. My peer took that role. My role change didn’t go very well. Personally i was unhappy and felt unfulfilled at work. While I was respected at work and my manager very supportive I didn’t enjoy it. I quit and joined another company and pivoted into program management. Since then my work hours have doubled and while I am earning the highest paycheck I could have dreamed of, I am extremely unhappy being an IC.  I have 25 years of industry experience and I feel I should mentor people instead of moving JIRA tickets around.<p>Yesterday I saw my former colleague who grabbed the manager role, got promoted to a director. I was hard working and intelligent than him. I could’ve played my card right and be in that place. Yet here I am being ‘advanced beginner’ in a different role every couple of years doing grunt IC work. How do I turn the wheel of time back and undo my career mistake. I feel incredibly stupid. I am losing confidence in making good decisions.<p>How do I deal with my feelings? Should I seek professional help?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwmeawayapr",
    "url": "https://news.ycombinator.com/user?id=throwmeawayapr"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31203186",
  "sameAs": "https://news.ycombinator.com/item?id=31203186",
  "dateCreated": "2022-04-29T10:51:33.430Z",
  "datePublished": "2022-04-29T09:33:10.000Z",
  "dateModified": "2022-04-29T10:51:33.430Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 8
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 8
    }
  ]
}