{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--askhn--HackerNews--NewsArticle--31586077",
  "url": "https://news.ycombinator.com/item?id=31586077",
  "headline": "Ask HN: How to Deal with ADHD?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been diagnosed with ADHD, but I don't like Adderall much because when I come down I get very irritable.<p>I've been able to manage it and be productive of work, but I get distracted so often that I end up having to &quot;work&quot; 10 hours a day to get a few hours of actual work done.<p>I've recently started taking Modafinil, and it works much better and with way fewer sides than Adderall, but I don't want to take it more than once a week because I'm afraid of tolerance. From [0]:<p>&gt; Anecdotally, the real troll under the bridge for modafinil seems to be that one can develop tolerance, where it no longer has the stimulant or anti-sleep effects that made it so awesome (it has been speculated to be related to liver metabolism). For example, poker player Paul Phillips took 2-300mg daily for a long period and said the effects “have attenuated over time. The body is an amazing adjusting machine, and there’s no upside that I’ve been able to see to just taking more.” (Such comments are common online among those who have used modafinil heavily, to the point where I have successfully predicted tolerance for such users, and I carefully avoid using modafinil more than weekly, if that.) The lack of academic support for these observations of tolerance is a little strange—users hardly have any incentive to make up downsides about their favorite drug.<p>But Modafinil makes me so much more productive that it's easily the best day of my week when I take it. I get all my work done in a normal amount of time and then I have plenty of time at the end of the day to relax and hang out with my friends and family. I'm really desperate for a way to have that level of productivity without medication. Does anyone have any advice?<p>[0]: https://www.gwern.net/Modafinil#tolerance",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ChadNauseam",
    "url": "https://news.ycombinator.com/user?id=ChadNauseam"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31586077",
  "sameAs": "https://news.ycombinator.com/item?id=31586077",
  "dateCreated": "2022-06-02T13:54:07.221Z",
  "datePublished": "2022-06-01T18:29:39.000Z",
  "dateModified": "2022-06-02T13:54:07.221Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 9
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何应对多动症？\n",
  "headline_zh-Hant": "Ask HN: 如何應對多動症？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我被诊断为多动症，但我不太喜欢阿德拉，因为当我下来的时候，我会变得非常烦躁。<p>我已经能够控制它，并能提高工作的效率，但我经常分心，以至于我最终不得不&quot;工作&quot;每天10小时来完成几个小时的实际工作。 <p>我最近开始服用莫达非尼，它的效果比Adderall好得多，副作用也少得多，但我不想每周服用超过一次，因为我怕出现耐受性。从[0]：<p>&gt; 从轶事来看，莫达非尼的真正问题似乎是人们会产生耐受性，即它不再具有使它如此强大的兴奋剂或抗睡眠效果（有人推测这与肝脏代谢有关）。例如，扑克玩家保罗-菲利普斯（Paul Phillips）长期每天服用2-300毫克，并说其效果 \"随着时间的推移有所减弱。身体是一个惊人的调整机器，我已经能够看到只是服用更多的东西没有任何好处\"。(这样的评论在那些大量使用莫达非尼的人中很常见，以至于我成功地预测了这些用户的耐受性，我小心地避免使用莫达非尼超过每周一次，如果是这样的话）。这些关于耐受性的观察缺乏学术支持，这有点奇怪--使用者几乎没有任何动机去编造他们最喜欢的药物的缺点。<p>但是莫达非尼让我的工作效率大大提高，当我服用它时，很容易成为我一周中最好的一天。我在正常的时间内完成了所有的工作，然后在一天结束时，我有足够的时间来放松，与我的朋友和家人一起玩。我真的很想知道有什么办法可以在不吃药的情况下拥有这种水平的生产力。有人有什么建议吗？<p>[0]: https://www.gwern.net/Modafinil#tolerance\n",
  "description_zh-Hant": "我被診斷為多動症，但我不太喜歡阿德拉，因為當我下來的時候，我會變得非常煩躁。<p>我已經能夠控制它，並能提高工作的效率，但我經常分心，以至於我最終不得不&quot;工作&quot;每天10小時來完成幾個小時的實際工作。 <p>我最近開始服用莫達非尼，它的效果比Adderall好得多，副作用也少得多，但我不想每週服用超過一次，因為我怕出現耐受性。從[0]：<p>&gt; 從軼事來看，莫達非尼的真正問題似乎是人們會產生耐受性，即它不再具有使它如此強大的興奮劑或抗睡眠效果（有人推測這與肝臟代謝有關）。例如，撲克玩家保羅-菲利普斯（Paul Phillips）長期每天服用2-300毫克，並說其效果 \"隨著時間的推移有所減弱。身體是一個驚人的調整機器，我已經能夠看到只是服用更多的東西沒有任何好處\"。(這樣的評論在那些大量使用莫達非尼的人中很常見，以至於我成功地預測了這些用戶的耐受性，我小心地避免使用莫達非尼超過每週一次，如果是這樣的話）。這些關於耐受性的觀察缺乏學術支持，這有點奇怪--使用者幾乎沒有任何動機去編造他們最喜歡的藥物的缺點。<p>但是莫達非尼讓我的工作效率大大提高，當我服用它時，很容易成為我一週中最好的一天。我在正常的時間內完成了所有的工作，然後在一天結束時，我有足夠的時間來放鬆，與我的朋友和家人一起玩。我真的很想知道有什麼辦法可以在不吃藥的情況下擁有這種水平的生產力。有人有什麼建議嗎？<p>[0]: https://www.gwern.net/Modafinil#tolerance\n"
}