{
  "@type": "NewsArticle",
  "identifier": "2022--03--25--en--hackernews--HackerNews--NewsArticle--30801845",
  "url": "https://news.ycombinator.com/item?id=30801845",
  "headline": "Show HN: Throw – The new space for asking and answering questions anonymously",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN community,<p>For the past year we’ve been working on this disruptive new thing. It’s about people, community, communication and truth.<p>Throw is the new space for asking and answering questions anonymously. We believe that in today’s world (both online and offline) content in communication exchanges is strongly influenced by the personas, profiles and façades people maintain/upkeep/safeguard socially, ideologically and on relationships.<p>From the way people post on Instagram the life they want others to believe they have, or the way people behave on thanksgiving with family, or at work, or with friends; on every social setting and interaction to some degree acting and behaving according to that setting and the people they interact with. These dynamics influence the content itself, as people don’t just respond to a question like computers do. What ends up happening is that the responder comes up with the answer by blending the possibly objective answer with feelings, setting, desires, commitments, ideologies, fears, insecurities, etc (social pressure or social agenda).<p>Something is missing between social media and the traditional Q&amp;A…<p>Throw addresses this by creating a space free from this social agenda. Thus focusing strictly on the content exchanged and providing a safe, comfortable and unbiased space where people can ask and answer anything freely with no bias, fears or strings attached.<p>Not only may Throw be used for personal and private questions and answers. But the power of crowdsourcing allows for a great variety of use cases like market research, validation of content and ideas, trivia, and much more. Serious matters and also just for fun…<p>It’s a query marketplace which means that “throwers” (people who ask questions) pay a fee proportional to the answers they need and in turn “catchers” (who catch them and respond) get compensated. This way we guarantee every user gets as many responses as he/she needs.<p>As for dealing with anonymity, we have built a sophisticated moderation protocol to neutralize and quickly ban people that contribute negatively as it is a priority people feel safe and comfortable in this community.<p>We have worked very hard to create a delightful product and are currently very close to rolling out our app to the market.<p>If this is something that may be of your interest or you’d like to be one of the first to test it out, you may keep an eye for our launch and other news by subscribing to our waitlist. <a href=\"https://www.throwapp.com\" rel=\"nofollow\">https://www.throwapp.com</a><p>Also, if you have questions there is additional information in the FAQs section on our web page that could be of help.<p>If you still haven't looked at our explainer video I encourage you to see it as it's quite fun and describes pretty well what we are doing. <a href=\"https://youtu.be/3f9RcVVpkNA\" rel=\"nofollow\">https://youtu.be/3f9RcVVpkNA</a><p>Finally, we really appreciate any feedback we can get (of any kind). So if there's anything you like, don't like, or any other thought about Throw, we'd love to hear about it! You may post a comment below or through the contact section on the web page.<p><i>Be curious and dare to know!</i><p>Thank you!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "luisamodio",
    "url": "https://news.ycombinator.com/user?id=luisamodio"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30801845",
  "sameAs": "https://www.throwapp.com/",
  "dateCreated": "2022-03-25T14:28:02.698Z",
  "datePublished": "2022-03-25T13:24:34.000Z",
  "dateModified": "2022-03-25T14:28:02.698Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 8
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 抛出--匿名提问和回答问题的新空间",
  "headline_zh-Hant": "Show HN: 拋出--匿名提問和回答問題的新空間",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN社区，<p>在过去的一年里，我们一直在研究这个颠覆性的新事物。它是关于人、社区、沟通和真理的。<p>Throw是一个匿名提问和回答问题的新空间。我们相信，在当今世界（包括在线和离线），沟通交流的内容受到人们在社会上、意识形态上和关系上保持/维护/保护的角色、档案和门面的强烈影响。<p>从人们在Instagram上发布他们希望别人相信他们的生活的方式，或者人们在感恩节与家人、工作或朋友的行为方式；在每个社会环境和互动中，在某种程度上根据该环境和与他们互动的人行事和表现的方式。这些动态影响着内容本身，因为人们并不像计算机那样只对一个问题做出反应。最终发生的情况是，回答者通过将可能的客观答案与感情、环境、欲望、承诺、意识形态、恐惧、不安全感等（社会压力或社会议程）相融合而得出答案。<p>社交媒体和传统的Q&amp;A之间缺少一些东西。因此，我们严格关注交流的内容，并提供一个安全、舒适和无偏见的空间，人们可以自由地提问和回答任何问题，没有偏见、恐惧或附加条件。<p>Throw不仅可以用于个人和私人问题和答案。但是，众包的力量允许大量的使用案例，如市场研究、内容和想法的验证、琐事，以及更多。<p>它是一个查询市场，这意味着 \"投掷者\"（提出问题的人）支付与他们需要的答案成比例的费用，反过来，\"捕捉者\"（捕捉他们并作出回应）得到补偿。This way we guarantee every user gets as many responses as he/she needs.<p>As for dealing with anonymity, we have built a sophisticated moderation protocol to neutralize and quickly ban people that contribute negatively as it is a priority people feel safe and comfortable in this community. <p>We have worked very hard to create a delightful product and are currently very close to rolling out our app to the market.<p>If this is something that may be of your interest or you’d like to be one of the first to test it out, you may keep an eye for our launch and other news by subscribing to our waitlist. <a href=\"https://www.throwapp.com\" rel=\"nofollow\">https://www.throwapp.com</a><p>此外，如果你有问题，在我们网页上的 \"常见问题 \"部分有更多的信息，可能会有帮助。<p>如果你还没有看我们的解释视频，我鼓励你去看，因为它相当有趣，并很好地描述了我们正在做的事情。<a href=\"https://youtu.be/3f9RcVVpkNA\" rel=\"nofollow\">https://youtu.be/3f9RcVVpkNA</a><p>Finally, we really appreciate any feedback we can get (of any kind). So if there's anything you like, don't like, or any other thought about Throw, we'd love to hear about it! 你可以在下面发表评论，或通过网页上的联系部分。<p><i>要有好奇心，敢于了解！</i><p>谢谢你",
  "description_zh-Hant": "你好，HN社區，<p>在過去的一年裡，我們一直在研究這個顛覆性的新事物。它是關於人、社區、溝通和真理的。<p>Throw是一個匿名提問和回答問題的新空間。我們相信，在當今世界（包括在線和離線），溝通交流的內容受到人們在社會上、意識形態上和關係上保持/維護/保護的角色、檔案和門面的強烈影響。<p>從人們在Instagram上發佈他們希望別人相信他們的生活的方式，或者人們在感恩節與家人、工作或朋友的行為方式；在每個社會環境和互動中，在某種程度上根據該環境和與他們互動的人行事和表現的方式。這些動態影響著內容本身，因為人們並不像計算機那樣只對一個問題做出反應。最終發生的情況是，回答者通過將可能的客觀答案與感情、環境、慾望、承諾、意識形態、恐懼、不安全感等（社會壓力或社會議程）相融合而得出答案。<p>社交媒體和傳統的Q&amp;A之間缺少一些東西。因此，我們嚴格關注交流的內容，並提供一個安全、舒適和無偏見的空間，人們可以自由地提問和回答任何問題，沒有偏見、恐懼或附加條件。<p>Throw不僅可以用於個人和私人問題和答案。但是，眾包的力量允許大量的使用案例，如市場研究、內容和想法的驗證、瑣事，以及更多。<p>它是一個查詢市場，這意味著 \"投擲者\"（提出問題的人）支付與他們需要的答案成比例的費用，反過來，\"捕捉者\"（捕捉他們並作出迴應）得到補償。This way we guarantee every user gets as many responses as he/she needs.<p>As for dealing with anonymity, we have built a sophisticated moderation protocol to neutralize and quickly ban people that contribute negatively as it is a priority people feel safe and comfortable in this community. <p>We have worked very hard to create a delightful product and are currently very close to rolling out our app to the market.<p>If this is something that may be of your interest or you’d like to be one of the first to test it out, you may keep an eye for our launch and other news by subscribing to our waitlist. <a href=\"https://www.throwapp.com\" rel=\"nofollow\">https://www.throwapp.com</a><p>此外，如果你有問題，在我們網頁上的 \"常見問題 \"部分有更多的信息，可能會有幫助。<p>如果你還沒有看我們的解釋視頻，我鼓勵你去看，因為它相當有趣，並很好地描述了我們正在做的事情。<a href=\"https://youtu.be/3f9RcVVpkNA\" rel=\"nofollow\">https://youtu.be/3f9RcVVpkNA</a><p>Finally, we really appreciate any feedback we can get (of any kind). So if there's anything you like, don't like, or any other thought about Throw, we'd love to hear about it! 你可以在下面發表評論，或通過網頁上的聯繫部分。<p><i>要有好奇心，敢於瞭解！</i><p>謝謝你"
}