{
  "@type": "NewsArticle",
  "identifier": "2022--03--23--en--hackernews--HackerNews--NewsArticle--30780455",
  "url": "https://news.ycombinator.com/item?id=30780455",
  "headline": "Launch HN: Charge Robotics (YC S21) - Robots that build solar farms",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN! We are Banks Hunter and Max Justicz, founders of Charge Robotics. We make robots to automate the most labor-intensive parts of solar construction.<p>We just got back from our first demo on a 150MW solar construction site in Iowa, where we showed off our initial prototype: an autonomous forklift that unloads pallets of solar modules from a truck and stages them around the site. It’s a huge milestone for us, and we felt like now would be a good time to share what we’re working on more publicly. You can see a couple videos of our robot in action here:<p>Staging modules on the site in Iowa: <a href=\"https://youtu.be/Fwf4v8upuoI\" rel=\"nofollow\">https://youtu.be/Fwf4v8upuoI</a><p>Performing a two-pallet sliding and unloading operation in our warehouse: <a href=\"https://youtu.be/EOJiyMXpVeQ\" rel=\"nofollow\">https://youtu.be/EOJiyMXpVeQ</a><p>As solar modules have become commoditized and prices have plummeted, solar has become the cheapest form of power generation in many regions. Demand has skyrocketed, and now the primary barrier to getting it installed is labor logistics and bandwidth. Every solar construction company we've talked to is drowning in demand and turning down projects because they don't have the capacity to build them. 1/5th of all the solar that exists in the US was installed last year!<p>We're engineers who have been friends since living together at MIT where we studied robotics and CS. We always wanted to start a company together. We zeroed in on solar after seeing compelling statistics about its cost effectiveness and projected growth – and because we shared a motivation to do something about climate change. We actually started out writing software to predict optimal locations for solar sites (searching land for sale and scoring by price, amount of sunlight, proximity to existing substations) when we decided to learn more about what comes next.<p>Utility-scale solar farms (2MW+) are mechanically quite simple. They feature a steel racking system held to the ground by vertical posts (&quot;piles&quot;), and overwhelmingly (90%+) feature a single motorized axis to track the sun over the course of the day. Modules are then fastened to this axis with brackets.<p>We're using a two-part robotic system to build this racking structure. First, a portable robotic factory placed on-site assembles sections of racking hardware and solar modules. This factory fits inside a shipping container. Robotic arms pick up solar modules from a stack and fasten them to a long metal tube (the &quot;torque tube&quot;). Second, autonomous delivery vehicles distribute these assembled sections into the field and fasten them in place onto target destination piles.<p>This is a hard technical problem, but not research-level hard. We think of it as the &quot;homework version&quot; of self-driving cars, as we're operating in a semi-structured environment (flattened dirt field) with drastically fewer edge cases. Manual construction today breaks about 0.1%-0.5% of modules during installation, which is an easier bar for us to target than the stringent performance requirements of the AV world.<p>We're operating in a risk-averse industry, though, which makes deploying new technology more challenging. One industry-standard term we've become very familiar with is &quot;bankability&quot;. It's difficult for projects to secure funding from lenders if they aren't using parts that have already spent years out in the field.<p>We've seen surprisingly little penetration of technology into this space in general. Projects are largely tracked with sticky notes in a &quot;command room&quot;, material delivery schedules are highly volatile and often not known until days in advance, and there's no live monitoring of construction progress, making current status opaque. We actually had a site we visited outright lose a forklift – we were surprised that all vehicles aren't GPS tagged and monitored, especially given they're operating on multi-thousand acre sites.<p>Our system is the first to handle the full mechanical installation of existing solar components (remember bankability). We've tweaked the order of construction operations slightly to be more robot-friendly, as the more precise operations involved in fastening modules to steel tubes happen in a more controlled factory environment.<p>For our mobile robots, we’re building on top of existing vehicles (called telehandlers, or reach lifts) which are already ubiquitous on these sites due to their enormous tires and broad capabilities. They're able to unload shipping containers due to their extending boom, as well as move materials around the site. On our prototype vehicle, we did some significant up-front reverse engineering including mapping out CAN messages sans documentation. The steering and brake were directly hydraulically actuated (no drive-by-wire), so we added motors to both in order to control them with our software stack. The most unique sensor we contributed was an optical mouse sensor mounted onto the boom joint, telling us the extension distance.<p>The backbone of our robotic sensing is a robust vision system. We're using stereo cameras for SLAM and object detection. Fortunately, solar construction sites already have detailed engineering drawings including GPS coordinates of each vertical post in the ground, so we have a detailed map of the site to localize ourselves on.<p>Watching the existing process for large-scale solar installation in real time evokes the sense of watching paint dry or grass grow, only it involves hundreds of workers. After witnessing the physically grueling and inefficient process of workers manually installing thousands of solar modules, we realized there had to be a better way of building solar, and that increased automation was the way forward.<p>Our goal is to transition the world to renewable energy as quickly as possible. We’re excited to share what we’re working on with HN - please let us know what you think in the comments and we’ll be around to respond!<p>P.S. We’re hiring! If you want to work on cool robots with a positive climate impact, please reach out: <a href=\"https://chargerobotics.com/careers.html\" rel=\"nofollow\">https://chargerobotics.com/careers.html</a>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "justicz",
    "url": "https://news.ycombinator.com/user?id=justicz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30780455",
  "sameAs": "https://news.ycombinator.com/item?id=30780455",
  "dateCreated": "2022-03-23T17:39:22.744Z",
  "datePublished": "2022-03-23T16:47:44.000Z",
  "dateModified": "2022-03-23T17:39:22.744Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 14
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 7
    }
  ],
  "headline_zh-Hans": "启动HN：充电机器人（YC S21）--建造太阳能农场的机器人",
  "headline_zh-Hant": "啟動HN：充電機器人（YC S21）--建造太陽能農場的機器人",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! 我们是Banks Hunter和Max Justicz，Charge Robotics的创始人。We make robots to automate the most labor-intensive parts of solar construction.<p>We just got back from our first demo on a 150MW solar construction site in Iowa, where we showed off our initial prototype: an autonomous forklift that unloads pallets of solar modules from a truck and stages them around the site. It’s a huge milestone for us, and we felt like now would be a good time to share what we’re working on more publicly. You can see a couple videos of our robot in action here:<p>Staging modules on the site in Iowa: <a href=\"https://youtu.be/Fwf4v8upuoI\" rel=\"nofollow\">https://youtu.be/Fwf4v8upuoI</a><p>Performing a two-pallet sliding and unloading operation in our warehouse: <a href=\"https://youtu.be/EOJiyMXpVeQ\" rel=\"nofollow\">https://youtu.be/EOJiyMXpVeQ</a><p>随着太阳能组件的商品化和价格暴跌，太阳能已成为许多地区最便宜的发电方式。需求激增，而现在安装太阳能的主要障碍是劳动力物流和带宽。我们所接触到的每一家太阳能建筑公司都被需求淹没，并拒绝了项目，因为他们没有能力建造这些项目。美国现有的所有太阳能的1/5是去年安装的！<p>我们是工程师，自从在麻省理工学院学习机器人和CS时住在一起后，我们就是朋友。我们一直想一起创办一家公司。在看到关于太阳能的成本效益和预期增长的令人信服的统计数据后，我们将目光锁定在了太阳能上--因为我们有共同的动机，要为气候变化做点事情。实际上，当我们决定更多地了解下一步时，我们开始编写软件来预测太阳能场地的最佳位置（搜索待售土地并根据价格、日照量、与现有变电站的接近程度进行评分）。它们的特点是通过垂直支柱（&quot;桩&quot;）将钢架系统固定在地面上，并且绝大多数（90%以上）都有一个单一的电动轴来追踪一天中的太阳。然后用支架将模块固定在这个轴上。<p>我们使用一个两部分的机器人系统来建造这个架子结构。首先，一个可移动的机器人工厂放置在现场，组装部分支架硬件和太阳能模块。这个工厂适合放在一个海运集装箱内。机器人手臂将太阳能模块从堆栈中拾起，并将其固定在一根长的金属管上（扭矩管）。其次，自主交付车辆将这些组装好的部分分配到现场，并将它们固定在目标目标桩上。<p>这是一个困难的技术问题，但不是研究级别的困难。我们把它看作是自驾车的 \"家庭作业版\"，因为我们是在一个半结构化的环境（平整的土场）中操作，边缘情况大大减少。今天，人工施工在安装过程中会破坏约0.1%-0.5%的模块，这对我们来说是一个更容易达到的目标，而不是AV世界的严格性能要求。<p>虽然我们是在一个规避风险的行业中运作，这使得部署新技术更具挑战性。我们已经非常熟悉的一个行业标准术语是 \"可担保性\"。如果项目没有使用已经在野外工作多年的部件，就很难从贷款人那里获得资金。<p>我们已经看到，一般来说，技术在这个领域的渗透率出奇的低。项目在很大程度上是在指挥室里用便签来跟踪的，材料交付时间表非常不稳定，往往要提前几天才知道，而且没有对施工进度的实时监控，使得目前的状态不透明。实际上，我们访问过的一个工地直接丢失了一辆叉车--我们很惊讶所有的车辆都没有GPS标记和监控，特别是考虑到他们在数千英亩的工地上作业。<p>我们的系统是第一个处理现有太阳能组件的全面机械安装的系统（记住是银行性）。我们稍稍调整了施工作业的顺序，使之更适合机器人，因为将模块固定在钢管上所涉及的更精确的操作是在一个更受控制的工厂环境中进行的。<p>对于我们的移动机器人，我们是在现有车辆（称为远距离搬运车，或称前移式升降机）的基础上进行的，这些车辆在这些工地上已经无处不在，因为它们具有巨大的",
  "description_zh-Hant": "嗨，HN! 我們是Banks Hunter和Max Justicz，Charge Robotics的創始人。We make robots to automate the most labor-intensive parts of solar construction.<p>We just got back from our first demo on a 150MW solar construction site in Iowa, where we showed off our initial prototype: an autonomous forklift that unloads pallets of solar modules from a truck and stages them around the site. It’s a huge milestone for us, and we felt like now would be a good time to share what we’re working on more publicly. You can see a couple videos of our robot in action here:<p>Staging modules on the site in Iowa: <a href=\"https://youtu.be/Fwf4v8upuoI\" rel=\"nofollow\">https://youtu.be/Fwf4v8upuoI</a><p>Performing a two-pallet sliding and unloading operation in our warehouse: <a href=\"https://youtu.be/EOJiyMXpVeQ\" rel=\"nofollow\">https://youtu.be/EOJiyMXpVeQ</a><p>隨著太陽能組件的商品化和價格暴跌，太陽能已成為許多地區最便宜的發電方式。需求激增，而現在安裝太陽能的主要障礙是勞動力物流和帶寬。我們所接觸到的每一家太陽能建築公司都被需求淹沒，並拒絕了項目，因為他們沒有能力建造這些項目。美國現有的所有太陽能的1/5是去年安裝的！<p>我們是工程師，自從在麻省理工學院學習機器人和CS時住在一起後，我們就是朋友。我們一直想一起創辦一家公司。在看到關於太陽能的成本效益和預期增長的令人信服的統計數據後，我們將目光鎖定在了太陽能上--因為我們有共同的動機，要為氣候變化做點事情。實際上，當我們決定更多地瞭解下一步時，我們開始編寫軟件來預測太陽能場地的最佳位置（搜索待售土地並根據價格、日照量、與現有變電站的接近程度進行評分）。它們的特點是通過垂直支柱（&quot;樁&quot;）將鋼架系統固定在地面上，並且絕大多數（90%以上）都有一個單一的電動軸來追蹤一天中的太陽。然後用支架將模塊固定在這個軸上。<p>我們使用一個兩部分的機器人系統來建造這個架子結構。首先，一個可移動的機器人工廠放置在現場，組裝部分支架硬件和太陽能模塊。這個工廠適合放在一個海運集裝箱內。機器人手臂將太陽能模塊從堆棧中拾起，並將其固定在一根長的金屬管上（扭矩管）。其次，自主交付車輛將這些組裝好的部分分配到現場，並將它們固定在目標目標樁上。<p>這是一個困難的技術問題，但不是研究級別的困難。我們把它看作是自駕車的 \"家庭作業版\"，因為我們是在一個半結構化的環境（平整的土場）中操作，邊緣情況大大減少。今天，人工施工在安裝過程中會破壞約0.1%-0.5%的模塊，這對我們來說是一個更容易達到的目標，而不是AV世界的嚴格性能要求。<p>雖然我們是在一個規避風險的行業中運作，這使得部署新技術更具挑戰性。我們已經非常熟悉的一個行業標準術語是 \"可擔保性\"。如果項目沒有使用已經在野外工作多年的部件，就很難從貸款人那裡獲得資金。<p>我們已經看到，一般來說，技術在這個領域的滲透率出奇的低。項目在很大程度上是在指揮室裡用便籤來跟蹤的，材料交付時間表非常不穩定，往往要提前幾天才知道，而且沒有對施工進度的實時監控，使得目前的狀態不透明。實際上，我們訪問過的一個工地直接丟失了一輛叉車--我們很驚訝所有的車輛都沒有GPS標記和監控，特別是考慮到他們在數千英畝的工地上作業。<p>我們的系統是第一個處理現有太陽能組件的全面機械安裝的系統（記住是銀行性）。我們稍稍調整了施工作業的順序，使之更適合機器人，因為將模塊固定在鋼管上所涉及的更精確的操作是在一個更受控制的工廠環境中進行的。<p>對於我們的移動機器人，我們是在現有車輛（稱為遠距離搬運車，或稱前移式升降機）的基礎上進行的，這些車輛在這些工地上已經無處不在，因為它們具有巨大的"
}