{
  "@type": "NewsArticle",
  "identifier": "2022--03--10--en--hackernews--HackerNews--NewsArticle--30631991",
  "url": "https://news.ycombinator.com/item?id=30631991",
  "headline": "Launch HN: Prepform – AI and spaced-repetition to optimize learning",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi, I'm Eric and I'm the founder and lead developer of Prepform.<p>A high-quality education helped me pursue my interests and achieve my goals. I started Prepform so students of all backgrounds have access to the same kind of education.<p>I grew up in Southern California, surrounded by dozens of SAT prep programs, and I swear I must have gone to all of them. Different programs followed different styles and techniques, but the strategy they shared was to create a study plan and review mistakes.<p>A study plan is\ntaking a diagnostic test,<p>setting a target score,<p>creating a study schedule,<p>identifying mistakes, and finally<p>reviewing those mistakes.<p>I wanted to take this structure and optimize it with machine learning, while accounting for elements of human learning and memory.\nI'm a big fan of SuperMemo, a memorization technique developed by Piotr Wozniak, where you review material just as you're about to forget it. Cognitive psychology tells us human forgetting follows a pattern, but Piotr quantified this behavior to identify the precise moment forgetting happens.<p>The goal was to build on his research with AI and tailor it to not only test prep but to the individual student, and make it the engine of the study plan.<p>The result is Blended Prep, which guides students to internalize knowledge rather than memorize material, and gives them the best chance to ace their next exam.<p>I'm so excited to share this with the HN community, and would love to know what you think. You can try it out at https://prepform.com. Thanks for reading.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "techmowgli",
    "url": "https://news.ycombinator.com/user?id=techmowgli"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30631991",
  "sameAs": "https://news.ycombinator.com/item?id=30631991",
  "dateCreated": "2022-03-10T20:50:34.447Z",
  "datePublished": "2022-03-10T20:27:51.000Z",
  "dateModified": "2022-03-10T20:50:34.447Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "启动HN：Prepform - 人工智能和间隔重复来优化学习",
  "headline_zh-Hant": "啟動HN：Prepform - 人工智能和間隔重複來優化學習",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，我是Eric，我是Prepform的创始人和首席开发者。<p>高质量的教育帮助我追求我的兴趣并实现我的目标。我创办Prepform是为了让所有背景的学生都能获得同样的教育。<p>我在南加州长大，周围有几十个SAT预科项目，我发誓我一定去过所有这些项目。不同的课程遵循不同的风格和技巧，但他们共同的策略是制定学习计划和复习错误。\n<p>学习计划是指进行诊断性测试，<p>设定目标分数，<p>创建学习计划，<p>识别错误，最后<p>回顾这些错误。<p>我想采用这种结构并通过机器学习对其进行优化，同时考虑人类学习和记忆的因素。\n我是SuperMemo的忠实粉丝，这是由Piotr Wozniak开发的一种记忆技术，你在即将忘记时复习材料。认知心理学告诉我们，人类的遗忘是有规律可循的，但Piotr对这种行为进行了量化，以确定遗忘发生的精确时刻。<p>目标是在他与人工智能的研究基础上，不仅为考试准备，而且为学生个人量身定制，并使其成为学习计划的引擎。<p>结果是混合准备，它引导学生内化知识，而不是记忆材料，并给他们最好的机会，在下次考试中获得胜利。你可以在https://prepform.com。谢谢你的阅读。",
  "description_zh-Hant": "嗨，我是Eric，我是Prepform的創始人和首席開發者。<p>高質量的教育幫助我追求我的興趣並實現我的目標。我創辦Prepform是為了讓所有背景的學生都能獲得同樣的教育。<p>我在南加州長大，周圍有幾十個SAT預科項目，我發誓我一定去過所有這些項目。不同的課程遵循不同的風格和技巧，但他們共同的策略是制定學習計劃和複習錯誤。\n<p>學習計劃是指進行診斷性測試，<p>設定目標分數，<p>創建學習計劃，<p>識別錯誤，最後<p>回顧這些錯誤。<p>我想採用這種結構並通過機器學習對其進行優化，同時考慮人類學習和記憶的因素。\n我是SuperMemo的忠實粉絲，這是由Piotr Wozniak開發的一種記憶技術，你在即將忘記時複習材料。認知心理學告訴我們，人類的遺忘是有規律可循的，但Piotr對這種行為進行了量化，以確定遺忘發生的精確時刻。<p>目標是在他與人工智能的研究基礎上，不僅為考試準備，而且為學生個人量身定製，並使其成為學習計劃的引擎。<p>結果是混合準備，它引導學生內化知識，而不是記憶材料，並給他們最好的機會，在下次考試中獲得勝利。你可以在https://prepform.com。謝謝你的閱讀。"
}