{
  "@type": "NewsArticle",
  "identifier": "2022--03--01--en--hackernews--HackerNews--NewsArticle--30508314",
  "url": "https://news.ycombinator.com/item?id=30508314",
  "headline": "Tell HN: If You Are in Russia",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Every Russian citizen and every Russian company that is currently relying on businesses in the West such as Amazon, Google, Microsoft and so on for hosting, communications, connectivity and other services should expect those services to be cut off at some point in the near future, and plan accordingly. This also goes for stuff deeply integrated into services in your home country that you have come to rely on, which may stop to function.<p>Regardless, you won't be able to pay for any of these services at the next billing period so they will be terminated one way or another.<p><i>Back up your stuff, move your service while you can or you risk losing everything</i>, this is <i>not</i> a drill.<p>Understand that the level at which this is currently playing out means that it could very well happen that governments will sanction businesses in the West that continue to work with and do business with Russian entities, businesses or individuals.<p>Some may decide to do this unilaterally for reasons all their own, some may give you warnings, some won't. Contrary to how these things normally play out the speed with which sanctions are being enacted and their severity should not be underestimated. Effectively threatening the world with nuclear annihilation has put the pressure on in a way that I have never seen before, leading to a degree of unity that is unique and which will speed up the process of ordering and implementing these sanctions to unprecedented levels.<p>Use the time while you have it.<p>If you are a private individual from a Western country get out while you can, even if that means a detour via Dubai or China. This could very well get ugly and you don't want to get caught in a country where lots of people are being made to believe that you and/or your country of origin are the cause for their hardship. Waiting it out is a risk you probably can not afford. Some Western governments have already ordered their citizens out of Russia.<p>I hope sincerely that all of this will be behind us soon and in a way that minimizes bloodshed on both sides, but I <i>especially</i> wish that for the defenders, who had no agency at all.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jacquesm",
    "url": "https://news.ycombinator.com/user?id=jacquesm"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30508314",
  "sameAs": "https://news.ycombinator.com/item?id=30508314",
  "dateCreated": "2022-03-01T06:36:07.203Z",
  "datePublished": "2022-03-01T02:01:14.000Z",
  "dateModified": "2022-03-01T06:36:07.203Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 81
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 8
    }
  ],
  "headline_zh-Hans": "告诉HN：如果你在俄罗斯",
  "headline_zh-Hant": "告訴HN：如果你在俄羅斯",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "每一个俄罗斯公民和每一个目前依靠西方企业，如亚马逊、谷歌、微软等提供托管、通信、连接和其他服务的俄罗斯公司，都应该期待这些服务在不久的将来的某个时刻被切断，并制定相应计划。This also goes for stuff deeply integrated into services in your home country that you have come to rely on, which may stop to function.<p>Regardless, you won't be able to pay for any of these services at the next billing period so they will be terminated one way or another.<p><i>Back up your stuff, move your service while you can or you risk losing everything</i>, this is <i>not</i> a drill. <p>请理解，目前这种情况的程度意味着，很可能发生政府将制裁继续与俄罗斯实体、企业或个人合作和做生意的西方企业。<p>有些人可能出于自己的原因单方面决定这样做，有些人可能给你警告，有些人不会。与这些事情通常发生的情况相反，制裁的速度和其严重性不应低估。有效地用核毁灭来威胁世界，以一种我从未见过的方式施加压力，导致了一种独特的团结程度，这将加快命令和实施这些制裁的进程，达到前所未有的水平。<p>在你有时间的时候利用它。<p>如果你是来自西方国家的个人，在你可以的时候离开，即使这意味着绕道迪拜或中国。这很可能会变得很难看，你不想在一个很多人都认为你和/或你的原籍国是他们困难的原因的国家里被抓。等待是一种你可能无法承受的风险。一些西方国家的政府已经命令他们的公民离开俄罗斯。<p>我真诚地希望，所有这一切将很快结束，并以一种尽量减少双方流血的方式，但我<i>特别</i>希望捍卫者，他们根本就没有任何代理。",
  "description_zh-Hant": "每一個俄羅斯公民和每一個目前依靠西方企業，如亞馬遜、谷歌、微軟等提供託管、通信、連接和其他服務的俄羅斯公司，都應該期待這些服務在不久的將來的某個時刻被切斷，並制定相應計劃。This also goes for stuff deeply integrated into services in your home country that you have come to rely on, which may stop to function.<p>Regardless, you won't be able to pay for any of these services at the next billing period so they will be terminated one way or another.<p><i>Back up your stuff, move your service while you can or you risk losing everything</i>, this is <i>not</i> a drill. <p>請理解，目前這種情況的程度意味著，很可能發生政府將制裁繼續與俄羅斯實體、企業或個人合作和做生意的西方企業。<p>有些人可能出於自己的原因單方面決定這樣做，有些人可能給你警告，有些人不會。與這些事情通常發生的情況相反，制裁的速度和其嚴重性不應低估。有效地用核毀滅來威脅世界，以一種我從未見過的方式施加壓力，導致了一種獨特的團結程度，這將加快命令和實施這些制裁的進程，達到前所未有的水平。<p>在你有時間的時候利用它。<p>如果你是來自西方國家的個人，在你可以的時候離開，即使這意味著繞道迪拜或中國。這很可能會變得很難看，你不想在一個很多人都認為你和/或你的原籍國是他們困難的原因的國家裡被抓。等待是一種你可能無法承受的風險。一些西方國家的政府已經命令他們的公民離開俄羅斯。<p>我真誠地希望，所有這一切將很快結束，並以一種儘量減少雙方流血的方式，但我<i>特別</i>希望捍衛者，他們根本就沒有任何代理。"
}