{
  "@type": "NewsArticle",
  "identifier": "2022--03--29--en--hackernews--HackerNews--NewsArticle--30838788",
  "url": "https://news.ycombinator.com/item?id=30838788",
  "headline": "Ask HN: Does anyone else lie on the internet?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Over the years I've found writing on HackerNews, Reddit and other online sites has given me an outlet to get creative and engage with folks in a way that will shift discourse towards something I'm more interested in.<p>I regularly lie and pretend I know about topics and areas I have zero experience in. I began noticing I received more upvotes and engagement when I pandered to views or opinions that are either the direct opposite of what the original content suggests (through cherry-picked exceptions), or I'll find a tangentially related view that's either current and popular, or supports a topic or viewpoint I'd like to know more about - often pandered with some popular topic.<p>Often this results in a thread about stuff that I actually want to read about, or someone <i>actually</i> knowledgeable on the subject will correct me - and call me out, but will receive far less approval (and often be flamed for criticizing me). On the plus side, I get to learn from someone really knowledgeable about how something works! (EDIT: Later I'll often go back and reply to the person saying they are correct, I was wrong - and thank them for their reply.)<p>Here's one of the worst examples (which I regret) because it perpetuates a view about a place I've never been, I've never stepped foot in the continent of Africa - it's one of the few times I wish I could go back and &quot;correct the record&quot;: https://news.ycombinator.com/item?id=9309170<p>I know nothing about IP law - &gt;200+ upvotes: https://news.ycombinator.com/item?id=27035901<p>I know nothing about, and have never been through Australia's ACCC courts - almost 200 upvotes: https://news.ycombinator.com/item?id=26787289<p>I've never hosted any copyrighted media, ever: https://news.ycombinator.com/context?id=16955522<p>I know nothing about tax havens, I've never even submitted my own taxes: https://news.ycombinator.com/context?id=16809428<p>Does anyone else do this?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Mandatum",
    "url": "https://news.ycombinator.com/user?id=Mandatum"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30838788",
  "sameAs": "https://news.ycombinator.com/item?id=30838788",
  "dateCreated": "2022-03-29T06:55:38.863Z",
  "datePublished": "2022-03-29T04:33:20.000Z",
  "dateModified": "2022-03-29T06:55:38.863Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 27
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 32
    }
  ],
  "headline_zh-Hans": "Ask HN: 还有人在网上撒谎吗？",
  "headline_zh-Hant": "Ask HN: 還有人在網上撒謊嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "多年来，我发现在HackerNews、Reddit和其他在线网站上的写作给了我一个出口，让我能够发挥创意，并以一种能够将话语权转移到我更感兴趣的东西上。<p>我经常撒谎，假装我对一些我没有经验的话题和领域有所了解。I began noticing I received more upvotes and engagement when I pandered to views or opinions that are either the direct opposite of what the original content suggests (through cherry-picked exceptions), or I'll find a tangentially related view that's either current and popular, or supports a topic or viewpoint I'd like to know more about - often pandered with some popular topic. <p>Often this results in a thread about stuff that I actually want to read about, or someone <i>actually</i> knowledgeable on the subject will correct me - and call me out, but will receive far less approval (and often be flamed for criticizing me). 从好的方面看，我可以从一个真正有知识的人那里学到一些东西是如何运作的 (编辑：后来我经常会回去回复那个人说他们是正确的，我错了--并感谢他们的回复。)<p>这是一个最糟糕的例子（我很后悔），因为它延续了一个关于我从未去过的地方的观点，我从未踏足过非洲大陆--这是我希望能回去并&quot;纠正记录&quot;的少数几次之一：https://news.ycombinator.com/item?id=9309170<p>我对知识产权法一无所知--&gt;200+的支持率：https://news。 ycombinator.com/item?id=27035901<p>我对澳大利亚的ACCC法庭一无所知，也从未经历过ACCC法庭--近200次投票：https://news.ycombinator.com/item?id=26787289<p>我从未主持过任何有版权的媒体，从来没有：https://news.ycombinator.com/context?id=16955522<p>我对避税天堂一无所知，我甚至从未提交过自己的税收：https://news.ycombinator.com/context?id=16809428<p>还有人这么做吗？",
  "description_zh-Hant": "多年來，我發現在HackerNews、Reddit和其他在線網站上的寫作給了我一個出口，讓我能夠發揮創意，並以一種能夠將話語權轉移到我更感興趣的東西上。<p>我經常撒謊，假裝我對一些我沒有經驗的話題和領域有所瞭解。I began noticing I received more upvotes and engagement when I pandered to views or opinions that are either the direct opposite of what the original content suggests (through cherry-picked exceptions), or I'll find a tangentially related view that's either current and popular, or supports a topic or viewpoint I'd like to know more about - often pandered with some popular topic. <p>Often this results in a thread about stuff that I actually want to read about, or someone <i>actually</i> knowledgeable on the subject will correct me - and call me out, but will receive far less approval (and often be flamed for criticizing me). 從好的方面看，我可以從一個真正有知識的人那裡學到一些東西是如何運作的 (編輯：後來我經常會回去回覆那個人說他們是正確的，我錯了--並感謝他們的回覆。)<p>這是一個最糟糕的例子（我很後悔），因為它延續了一個關於我從未去過的地方的觀點，我從未踏足過非洲大陸--這是我希望能回去並&quot;糾正記錄&quot;的少數幾次之一：https://news.ycombinator.com/item?id=9309170<p>我對知識產權法一無所知--&gt;200+的支持率：https://news。 ycombinator.com/item?id=27035901<p>我對澳大利亞的ACCC法庭一無所知，也從未經歷過ACCC法庭--近200次投票：https://news.ycombinator.com/item?id=26787289<p>我從未主持過任何有版權的媒體，從來沒有：https://news.ycombinator.com/context?id=16955522<p>我對避稅天堂一無所知，我甚至從未提交過自己的稅收：https://news.ycombinator.com/context?id=16809428<p>還有人這麼做嗎？"
}