{
  "@type": "NewsArticle",
  "identifier": "2022--04--05--en--hackernews--HackerNews--NewsArticle--30923701",
  "url": "https://news.ycombinator.com/item?id=30923701",
  "headline": "Ask HN: Beating depression with or without anti-depressants?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I realize this is somewhat of a taboo topic but I feel like if there is anywhere we can have a real discussion on mental health it's going to be HN.<p>I have been struggling with depression for as long as I can remember.<p>Life has taken me on ups and downs but as far as I can can tell I'm fairly lucky, well-off and have every reason to be happy.<p>Unfortunately I'm not.<p>I wake up with a pit in my stomach that I carry around all day and no matter how hard I try I just can't shake it.<p>It also gets really bad in waves to the point where I nearly can't function but most of all it makes me procrastinate on almost everything.<p>I usually end up using all my effort just to be a functional member of my team at work.<p>The sad part is that I know that if I didn't have this condition and I was able to sleep when I wanted to I could be many times more productive, not only at work but also in life.<p>The obvious solution to these problems are SSRIs and other anti-depressants. These drugs are very powerful but have really bad side-effects for most people that take them.<p>For these reasons I am completely shit-scared of them. I see them as my option of last resort but increasingly I feel my options running out.<p>I have tried therapy, I have tried all sorts of coping mechanisms but nothing solves the problem permanently.<p>So HN, what has your experience been with depression? Have you tried the drugs? What worked or didn't?\nHave you been able to triumph without chemical assistance and what did that look like?\nIs my utter terror of these drugs warranted or should I just bite the bullet and try them?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jpgvm",
    "url": "https://news.ycombinator.com/user?id=jpgvm"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30923701",
  "sameAs": "https://news.ycombinator.com/item?id=30923701",
  "dateCreated": "2022-04-05T23:31:15.006Z",
  "datePublished": "2022-04-05T19:24:19.000Z",
  "dateModified": "2022-04-05T23:31:15.006Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 44
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 48
    }
  ],
  "headline_zh-Hans": "Ask HN: 使用或不使用抗抑郁药就能战胜抑郁症？",
  "headline_zh-Hant": "Ask HN: 使用或不使用抗抑鬱藥就能戰勝抑鬱症？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我意识到这是一个有些禁忌的话题，但我觉得如果有什么地方我们可以就心理健康进行真正的讨论，那就是HN。<p>从我有记忆以来，我一直在与抑郁症作斗争。 <p>生活让我起起伏伏，但就我所知，我相当幸运，生活富裕，有各种理由感到高兴。<p>不幸的是，我没有。<p>我醒来时，肚子里有一个坑，我整天都带着它，不管我怎么努力，我就是无法摆脱它。 <p>它也会变得非常糟糕，以至于我几乎无法正常工作，但最重要的是，它使我在几乎所有的事情上都会拖延。<p>我通常最终会用尽我所有的努力，只是为了在工作中成为团队的一个正常成员。<p>可悲的是，我知道，如果我没有这种情况，我能够在我想睡觉的时候睡觉，我可以提高许多倍的生产力，不仅是在工作中，而且在生活中。<p>这些问题的明显解决方案是SSRI和其他抗抑郁药。这些药物非常强大，但对大多数人来说有非常糟糕的副作用。<p>由于这些原因，我完全害怕它们。我把它们看作是我最后的选择，但我越来越觉得我的选择已经不多了。<p>我试过治疗，我试过各种应对机制，但没有什么能永久解决这个问题。<p>那么，HN，你对抑郁症有什么经验？你试过药物吗？什么方法有效或无效？\n你是否能够在没有化学援助的情况下取得胜利，那是什么样子的？\n我对这些药物的极度恐惧是有道理的，还是我应该咬紧牙关去尝试？",
  "description_zh-Hant": "我意識到這是一個有些禁忌的話題，但我覺得如果有什麼地方我們可以就心理健康進行真正的討論，那就是HN。<p>從我有記憶以來，我一直在與抑鬱症作鬥爭。 <p>生活讓我起起伏伏，但就我所知，我相當幸運，生活富裕，有各種理由感到高興。<p>不幸的是，我沒有。<p>我醒來時，肚子裡有一個坑，我整天都帶著它，不管我怎麼努力，我就是無法擺脫它。 <p>它也會變得非常糟糕，以至於我幾乎無法正常工作，但最重要的是，它使我在幾乎所有的事情上都會拖延。<p>我通常最終會用盡我所有的努力，只是為了在工作中成為團隊的一個正常成員。<p>可悲的是，我知道，如果我沒有這種情況，我能夠在我想睡覺的時候睡覺，我可以提高許多倍的生產力，不僅是在工作中，而且在生活中。<p>這些問題的明顯解決方案是SSRI和其他抗抑鬱藥。這些藥物非常強大，但對大多數人來說有非常糟糕的副作用。<p>由於這些原因，我完全害怕它們。我把它們看作是我最後的選擇，但我越來越覺得我的選擇已經不多了。<p>我試過治療，我試過各種應對機制，但沒有什麼能永久解決這個問題。<p>那麼，HN，你對抑鬱症有什麼經驗？你試過藥物嗎？什麼方法有效或無效？\n你是否能夠在沒有化學援助的情況下取得勝利，那是什麼樣子的？\n我對這些藥物的極度恐懼是有道理的，還是我應該咬緊牙關去嘗試？"
}