{
  "@type": "NewsArticle",
  "identifier": "2022--03--13--en--hackernews--HackerNews--NewsArticle--30658324",
  "url": "https://news.ycombinator.com/item?id=30658324",
  "headline": "Ask HN: What ML platform are you using?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am interested to know what ML platforms you use for personal/hobbyist projects... Do you rent GPU instances from the likes of Azure, GCP, AWS or do you use managed solutions like Paperspace Gradient, or Colab? why or not?<p>I am very much a beginner in the space of machine learning and have been overwhelmed by the choices available. Eventually I do want to simply want to build my own rig and just train models on that, but I don't have that kind of money right now, nor is it easy to find GPUs even if could afford them.<p>So I am basically stuck to cloud solutions for now, which is why I want to hear personal experiences of HN folks who have used any of the available ML platforms. Their benefits, short comings, which are more beginner friendly, cost effective, etc<p>I am also not opposed to configuring environments myself rather than using managed solutions (such as Gradient) if it is more cost effective to do so, or affords better reliability // better than average resource availability... because I read some complaints that Colab has poor GPU availability since shared among subscribers, and that the more you use it the less time is allocated to you... not sure how big of a problem it actually is though.<p>I am very motivated to delve into this space (it's been on my mind a while) and I want to do it right, which is why I am asking for personal experiences on this forum given that there is a very healthy mix of technology hobbyists as well as professionals on HN, of which the opinion of both is equally valuable to me for different reasons.<p>Also please feel free to include any unsolicited advice such as learning resources, anecdotes, etc,<p>Thanks for reading until the end.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "speedylight",
    "url": "https://news.ycombinator.com/user?id=speedylight"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30658324",
  "sameAs": "https://news.ycombinator.com/item?id=30658324",
  "dateCreated": "2022-03-13T06:46:09.930Z",
  "datePublished": "2022-03-13T05:38:38.000Z",
  "dateModified": "2022-03-13T06:46:09.930Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "Ask HN: 你使用的是什么ML平台？",
  "headline_zh-Hant": "Ask HN: 你使用的是什麼ML平臺？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我很想知道你在个人/业余项目中使用什么ML平台......。你是否从Azure、GCP、AWS等租用GPU实例，还是使用Paperspace Gradient或Colab等管理解决方案？ 为什么或不？<p>在机器学习领域，我是一个非常大的初学者，并且已经被现有的选择淹没了。最终，我确实想简单地建立自己的设备，并在上面训练模型，但我现在没有那么多钱，即使买得起，也不容易找到GPU。<p>所以我现在基本上只能使用云解决方案，这就是为什么我想听听使用过任何现有ML平台的HN朋友的个人经验。我也不反对自己配置环境，而不是使用管理解决方案（如Gradient），如果这样做更有成本效益，或提供更好的可靠性//比平均资源可用性更好......因为我读到一些抱怨，Colab的GPU可用性很差，因为用户之间共享，而且你越是使用它，分配给你的时间就越少...... <p>我很想进入这个领域（我已经想了很久了），我想把它做好，这就是为什么我在这个论坛上询问个人经验，因为HN上有非常健康的技术爱好者和专业人士，出于不同的原因，两者的意见对我来说同样有价值。 <p>此外，请随时包括任何不请自来的建议，如学习资源、轶事等，<p>感谢您阅读到最后。",
  "description_zh-Hant": "我很想知道你在個人/業餘項目中使用什麼ML平臺......。你是否從Azure、GCP、AWS等租用GPU實例，還是使用Paperspace Gradient或Colab等管理解決方案？ 為什麼或不？<p>在機器學習領域，我是一個非常大的初學者，並且已經被現有的選擇淹沒了。最終，我確實想簡單地建立自己的設備，並在上面訓練模型，但我現在沒有那麼多錢，即使買得起，也不容易找到GPU。<p>所以我現在基本上只能使用雲解決方案，這就是為什麼我想聽聽使用過任何現有ML平臺的HN朋友的個人經驗。我也不反對自己配置環境，而不是使用管理解決方案（如Gradient），如果這樣做更有成本效益，或提供更好的可靠性//比平均資源可用性更好......因為我讀到一些抱怨，Colab的GPU可用性很差，因為用戶之間共享，而且你越是使用它，分配給你的時間就越少...... <p>我很想進入這個領域（我已經想了很久了），我想把它做好，這就是為什麼我在這個論壇上詢問個人經驗，因為HN上有非常健康的技術愛好者和專業人士，出於不同的原因，兩者的意見對我來說同樣有價值。 <p>此外，請隨時包括任何不請自來的建議，如學習資源、軼事等，<p>感謝您閱讀到最後。"
}