{
  "@type": "NewsArticle",
  "identifier": "2022--03--29--en--hackernews--HackerNews--NewsArticle--30831396",
  "url": "https://news.ycombinator.com/item?id=30831396",
  "headline": "Show HN: Narratives Project – A news product for a more peaceful internet",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN! I’m Shaun, and I started the Narratives Project (https://www.narrativesproject.com/), a non-profit that presents divisive news events as contrasting narratives to show why people disagree. Our goal is to lower people’s distress about the news and animosity towards those they disagree with.<p>Our current news media system incites instead of informs. On-the-ground reporting has been replaced by armchair journalism, most people are locked in viewpoint silos that are occasionally penetrated by the worst of the other side, and the entire system is in an escalating panic about Those Bad People Over There.<p>People of different political persuasions look at the same event and immediately come to different conclusions, and often become agitated with those on the other side. When asked why others disagree, they usually give one of four answers: they're stupid, ignorant, brainwashed, or evil. Or all of the above!<p>It's probably not helpful to think that half the country is stupid, and it's a recipe for catastrophe to think that half the country is evil. So we're trying to work on the better answer, which is that people come to different conclusions because they have different priors and experiences. That may be obvious, but it’s difficult to remember in the moment, when we're confronted with someone on the other side of an intense topic.<p>We produce short, substantive analyses that present the perspectives on either side of an issue, and illustrate the underlying reasons for how people come to those conclusions. We identify what either side is focusing on, how they're interpreting new information, and how they're reasoning.<p>When we summarize the narratives, we describe them as though we believe them. In this way, we center diversity of perspectives as default. Presenting conflicts this way nudges the reader away from mind-reading bad intentions into their political opponents.<p>We like to imagine a person on their lunch break, who only has a few minutes to investigate a news event that everyone is talking about. They scroll through Twitter, read the opinions of people they agree with, and then open up our content to get a quick overview of the whole discourse. Most likely they go back to work still entrenched in their opinion, but hopefully also with an understanding of why people disagree with them (and it's not that they're evil).<p>Or imagine a mainstream conservative aunt who watches Fox News, and her progressive niece who watches left-leaning Twitch streamers. They have difficulty discussing news, not just because they disagree, but because they don't have any way of talking between their worldviews. They just end up sending each other links to partisan articles, which is not a great way to have a conversation. Instead of this, the niece sends her aunt our content about the topic, which helps them both feel acknowledged and talk productively about the disagreement (values, experiences, priors, etc.). They still disagree, but they don't think each other are crazy or stupid, and they’re no longer on a track that was pointing toward hating each other.<p>We believe that when news consumers can at least minimally understand those they disagree with, it helps to alleviate distress, understand their own position and feel acknowledged, and is a key step towards the humanization of their apparent enemy.<p>Here's two examples of recent posts:<p>https://www.narrativesproject.com/news/why-cant-we-agree-on-the-nonexistence-of-biolabs-in-ukraine/<p>https://www.narrativesproject.com/news/perspectives-on-ketanji-brown-jacksons-supreme-court-confirmation-hearings-days-2-4/<p>And here's a recent Instagram version:<p>https://www.instagram.com/p/Cbh6kxhArKa/<p>There are other organizations and products out there that share our concern, such as AllSides, The Flip Side, Braver Angels, Ground News, etc. We’re different in two ways.<p>First, news aggregators offer people news from both the right and the left to see where others are coming from. But there are too many divisive stories and too few hours in the day for this to be practical for the average person. Also, I think that watching oppositional news often just confirms people’s beliefs that the other side is awful.<p>More deeply, other organizations rely primarily on partisan media articles to build their understanding of the discourse. They assume that narratives are the product of top-down influence. We think narrative emerges from the interactions of individual agents sharing information, which is then picked up by the media and propagated. So we rely primarily on a social media listening tool (Meltwater) that gives us access to the full firehose of Twitter, Facebook, and other platforms. Our understanding of the discourse comes from looking directly at online conversations, and aggregating the different perspectives and positions.<p>We've learned a lot this year, but one of the biggest things we've figured out (through user testing) is that our design is not yet intuitive. Once users get what we're doing, they see value in it and want to share it, but there's a gap before that point, which we need to bridge.<p>So at the moment, our biggest questions are: How can we design our product to be accessible, obvious, and useful to the average media consumer? And how can we best compete within the incentives of our unhealthy media ecosystem?\nAnd that's why I'm showing this to you. What do you think? Does it make sense? Are there considerations I'm missing? Is there a different format that we should experiment with? I would love to hear your thoughts!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "ShaunCammack",
    "url": "https://news.ycombinator.com/user?id=ShaunCammack"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30831396",
  "sameAs": "https://news.ycombinator.com/item?id=30831396",
  "dateCreated": "2022-03-29T16:13:11.359Z",
  "datePublished": "2022-03-28T15:18:26.000Z",
  "dateModified": "2022-03-29T16:13:11.359Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Show HN: 叙事项目 - 为更和平的互联网提供新闻产品",
  "headline_zh-Hant": "Show HN: 敘事項目 - 為更和平的互聯網提供新聞產品",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! 我是肖恩，我创办了叙事项目（https://www.narrativesproject.com/），这是一个非营利组织，将有分歧的新闻事件以对比性叙事的方式呈现出来，以显示人们为什么会有分歧。我们的目标是降低人们对新闻的困扰和对他们不同意的人的敌意。实地报道已被 \"椅子上的新闻 \"所取代，大多数人被锁在观点的孤岛上，偶尔会被另一方最坏的观点所渗透，整个系统对那边的坏人的恐慌不断升级。<p>不同政治派别的人看了同一事件，立即得出不同的结论，并经常对另一方的人感到激动。当被问及其他人为什么不同意时，他们通常会给出四个答案中的一个：他们愚蠢、无知、被洗脑或邪恶。或者以上都是！<p>认为一半的国家是愚蠢的可能没有帮助，而认为一半的国家是邪恶的则是灾难的秘诀。所以我们正在努力寻找更好的答案，那就是人们会得出不同的结论，因为他们有不同的先验和经验。这可能是显而易见的，但当我们面对一个激烈话题的另一方时，却很难记住。<p>我们制作简短的实质性分析报告，介绍问题的任何一方的观点，并说明人们如何得出这些结论的根本原因。我们确定任何一方关注的是什么，他们是如何解释新信息的，以及他们是如何推理的。<p>当我们总结这些叙述时，我们把它们描述得好像我们相信它们。通过这种方式，我们将视角的多样性作为默认的中心。<p>我们喜欢想象一个正在午休的人，他只有几分钟的时间来调查一个大家都在讨论的新闻事件。他们滚动浏览Twitter，阅读他们同意的人的意见，然后打开我们的内容，快速了解整个论述的概况。最有可能的是，他们回去工作时仍然固守自己的观点，但希望也能理解为什么人们不同意他们的观点（并不是说他们很邪恶）。<p>或者想象一下，一个主流的保守派阿姨看福克斯新闻，而她的进步派侄女则看左倾的Twitch流媒体人。他们很难讨论新闻，不仅仅是因为他们的意见不一致，还因为他们的世界观之间没有任何交流方式。他们最终只是互相发送党派文章的链接，这不是一个很好的对话方式。取而代之的是，侄女给姑姑发送我们关于这个话题的内容，这有助于他们都感到被认可，并就分歧（价值观、经验、先例等）进行有成效的交谈。他们仍然有分歧，但他们不认为对方是疯子或傻子，而且他们不再走在指向仇恨对方的轨道上。<p>我们相信，当新闻消费者能够至少最低限度地理解那些与他们有分歧的人时，这有助于减轻痛苦，理解他们自己的立场并感到被认可，而且是使他们明显的敌人人性化的关键一步。<p>这里有两个最近帖子的例子：<p>https://www。 narrativesproject.com/news/why-cant-we-agree-the-non-existence-biolabs-in-ukraine/<p>https://www.narrativesproject.com/news/perspectives-on-ketanji-brown-jacksons-supreme-court-confirmation-hearings-days-2-4/<p>而这里是最近的Instagram版本：<p>https://www.instagram.com/p/Cbh6kxhArKa/<p>还有其他组织和产品与我们有同样的关注，如AllSides、The Flip Side、Braver Angels、Ground News等等。我们在两个方面有所不同。<p>首先，新闻聚合器为人们提供来自右翼和左翼的新闻，以了解其他人的想法。但是，有太多的分裂故事，而一天中的时间太少，这对普通人来说是不实际的。此外，我认为观看反对派的新闻往往只是证实了人们的信念，即另一方是可怕的。<p>更深入地说，其他组织主要依靠党派媒体文章来建立他们对话语的理解。他们认为，叙事是自上而下影响的产物。我们认为，叙事是在个人代理人的互动中产生的，而这些个人代理人的行为是对社会的贡献。",
  "description_zh-Hant": "嗨，HN! 我是肖恩，我創辦了敘事項目（https://www.narrativesproject.com/），這是一個非營利組織，將有分歧的新聞事件以對比性敘事的方式呈現出來，以顯示人們為什麼會有分歧。我們的目標是降低人們對新聞的困擾和對他們不同意的人的敵意。實地報道已被 \"椅子上的新聞 \"所取代，大多數人被鎖在觀點的孤島上，偶爾會被另一方最壞的觀點所滲透，整個系統對那邊的壞人的恐慌不斷升級。<p>不同政治派別的人看了同一事件，立即得出不同的結論，並經常對另一方的人感到激動。當被問及其他人為什麼不同意時，他們通常會給出四個答案中的一個：他們愚蠢、無知、被洗腦或邪惡。或者以上都是！<p>認為一半的國家是愚蠢的可能沒有幫助，而認為一半的國家是邪惡的則是災難的秘訣。所以我們正在努力尋找更好的答案，那就是人們會得出不同的結論，因為他們有不同的先驗和經驗。這可能是顯而易見的，但當我們面對一個激烈話題的另一方時，卻很難記住。<p>我們製作簡短的實質性分析報告，介紹問題的任何一方的觀點，並說明人們如何得出這些結論的根本原因。我們確定任何一方關注的是什麼，他們是如何解釋新信息的，以及他們是如何推理的。<p>當我們總結這些敘述時，我們把它們描述得好像我們相信它們。通過這種方式，我們將視角的多樣性作為默認的中心。<p>我們喜歡想象一個正在午休的人，他只有幾分鐘的時間來調查一個大家都在討論的新聞事件。他們滾動瀏覽Twitter，閱讀他們同意的人的意見，然後打開我們的內容，快速瞭解整個論述的概況。最有可能的是，他們回去工作時仍然固守自己的觀點，但希望也能理解為什麼人們不同意他們的觀點（並不是說他們很邪惡）。<p>或者想象一下，一個主流的保守派阿姨看福克斯新聞，而她的進步派侄女則看左傾的Twitch流媒體人。他們很難討論新聞，不僅僅是因為他們的意見不一致，還因為他們的世界觀之間沒有任何交流方式。他們最終只是互相發送黨派文章的鏈接，這不是一個很好的對話方式。取而代之的是，侄女給姑姑發送我們關於這個話題的內容，這有助於他們都感到被認可，並就分歧（價值觀、經驗、先例等）進行有成效的交談。他們仍然有分歧，但他們不認為對方是瘋子或傻子，而且他們不再走在指向仇恨對方的軌道上。<p>我們相信，當新聞消費者能夠至少最低限度地理解那些與他們有分歧的人時，這有助於減輕痛苦，理解他們自己的立場並感到被認可，而且是使他們明顯的敵人人性化的關鍵一步。<p>這裡有兩個最近帖子的例子：<p>https://www。 narrativesproject.com/news/why-cant-we-agree-the-non-existence-biolabs-in-ukraine/<p>https://www.narrativesproject.com/news/perspectives-on-ketanji-brown-jacksons-supreme-court-confirmation-hearings-days-2-4/<p>而這裡是最近的Instagram版本：<p>https://www.instagram.com/p/Cbh6kxhArKa/<p>還有其他組織和產品與我們有同樣的關注，如AllSides、The Flip Side、Braver Angels、Ground News等等。我們在兩個方面有所不同。<p>首先，新聞聚合器為人們提供來自右翼和左翼的新聞，以瞭解其他人的想法。但是，有太多的分裂故事，而一天中的時間太少，這對普通人來說是不實際的。此外，我認為觀看反對派的新聞往往只是證實了人們的信念，即另一方是可怕的。<p>更深入地說，其他組織主要依靠黨派媒體文章來建立他們對話語的理解。他們認為，敘事是自上而下影響的產物。我們認為，敘事是在個人代理人的互動中產生的，而這些個人代理人的行為是對社會的貢獻。"
}