{
  "@type": "NewsArticle",
  "identifier": "2022--04--13--en--hackernews--HackerNews--NewsArticle--31017120",
  "url": "https://news.ycombinator.com/item?id=31017120",
  "headline": "8vdX (YC W22) Is Hiring a Product Manager",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "8vdX is hiring its first Product Manager. Come revolutionize the early-stage financing market with us!<p>8vdX is the first tech-enabled venture debt marketplace for startups, think of us as AngelList for venture debt. We currently provide founder-friendly venture debt to startups in YC and want to be the debt partner to the breakout companies as they scale and raise their Series A, B, and beyond. We are on a mission to revolutionize the early-stage venture financing market for startups and investors.<p>As our first dedicated Product Manager, you'll:<p>Define and execute our product strategy and roadmap, translating company goals into a clear product strategy<p>Work closely with the technology and design team to build a world-class product for both startups and investors, from product design to production roll-out<p>Look at product discovery and validation, making sure our customers are happy and satisfied with 8vdx's platform<p>Refine and maintain constantly our product backlog, aligning priorities with stakeholders<p>Create and refine organizational processes and standards while working in a fast-paced and unstructured environment<p>We want to offer a world-class solution for both startups and investors so our platform experience has to be top-notch. We are growing quite fast so we also expect you to grow with us.<p>What we're looking for:<p>A solid working experience in either building products in fast-paced environments or leading high-growth teams<p>Deep care about the end-user experience and creating business value: our clients are the priority!<p>A highly entrepreneurial mindset along with a desire to use your experience to good use. Great ideas are always welcome!<p>Data-driven: the ability to work well with numbers<p>Excellent verbal and written communication skills",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "rchachra",
    "url": "https://news.ycombinator.com/user?id=rchachra"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31017120",
  "sameAs": "https://news.ycombinator.com/item?id=31017120",
  "dateCreated": "2022-04-13T17:34:49.945Z",
  "datePublished": "2022-04-13T17:01:10.000Z",
  "dateModified": "2022-04-13T17:34:49.945Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": null
    }
  ],
  "headline_zh-Hans": "8vdX (YC W22)正在招聘一名产品经理",
  "headline_zh-Hant": "8vdX (YC W22)正在招聘一名產品經理",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "8vdX正在招聘其首位产品经理。快来和我们一起革新早期融资市场吧！<p>8vdX是第一个为初创企业提供的科技型风险债务市场，可以把我们想象成风险债务的AngelList。我们目前为YC的初创公司提供对创始人友好的风险债务，并希望成为突破性公司的债务伙伴，因为他们正在扩大规模并筹集A、B轮及更多资金。我们的使命是为初创企业和投资者彻底改变早期风险融资市场。 <p>作为我们第一个专门的产品经理，你将。 <p>定义并执行我们的产品战略和路线图，将公司目标转化为清晰的产品战略<p>与技术和设计团队密切合作，为初创企业和投资者打造世界级的产品，从产品设计到生产推广<p>关注产品的发现和验证。确保我们的客户对8vdx的平台感到高兴和满意<p>不断完善和维护我们的产品积压，与利益相关者协调优先事项<p>创建和完善组织流程和标准，同时在一个快节奏和非结构化的环境中工作<p>我们希望为初创企业和投资者提供世界级的解决方案，因此我们的平台体验必须是一流的。我们正在快速成长，所以我们也希望你能与我们一起成长。<p>我们正在寻找的是：<p>在快节奏的环境中建立产品或领导高增长团队方面的坚实工作经验<p>对最终用户体验和创造商业价值的深切关注：我们的客户是优先考虑的！<p>高度的创业心态，以及将你的经验用于良好用途的愿望。我们永远欢迎伟大的想法！<p>数据驱动：能够很好地处理数字工作<p>出色的口头和书面沟通能力",
  "description_zh-Hant": "8vdX正在招聘其首位產品經理。快來和我們一起革新早期融資市場吧！<p>8vdX是第一個為初創企業提供的科技型風險債務市場，可以把我們想象成風險債務的AngelList。我們目前為YC的初創公司提供對創始人友好的風險債務，並希望成為突破性公司的債務夥伴，因為他們正在擴大規模並籌集A、B輪及更多資金。我們的使命是為初創企業和投資者徹底改變早期風險融資市場。 <p>作為我們第一個專門的產品經理，你將。 <p>定義並執行我們的產品戰略和路線圖，將公司目標轉化為清晰的產品戰略<p>與技術和設計團隊密切合作，為初創企業和投資者打造世界級的產品，從產品設計到生產推廣<p>關注產品的發現和驗證。確保我們的客戶對8vdx的平臺感到高興和滿意<p>不斷完善和維護我們的產品積壓，與利益相關者協調優先事項<p>創建和完善組織流程和標準，同時在一個快節奏和非結構化的環境中工作<p>我們希望為初創企業和投資者提供世界級的解決方案，因此我們的平臺體驗必須是一流的。我們正在快速成長，所以我們也希望你能與我們一起成長。<p>我們正在尋找的是：<p>在快節奏的環境中建立產品或領導高增長團隊方面的堅實工作經驗<p>對最終用戶體驗和創造商業價值的深切關注：我們的客戶是優先考慮的！<p>高度的創業心態，以及將你的經驗用於良好用途的願望。我們永遠歡迎偉大的想法！<p>數據驅動：能夠很好地處理數字工作<p>出色的口頭和書面溝通能力"
}