{
  "@type": "NewsArticle",
  "identifier": "2022--02--23--en--hackernews--HackerNews--NewsArticle--30440486",
  "url": "https://news.ycombinator.com/item?id=30440486",
  "headline": "Show HN: Elestio – Managed platform for over 150 open-source software stacks",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello Hacker News! We're Joseph, Kieran and David from elestio (<a href=\"https://elest.io/\" rel=\"nofollow\">https://elest.io/</a>).\nWe've built a platform that offers open-source software as a managed service - we take care of the OS and app updates, security, SSL, networking, backups, the whole deal.<p>In 2009, we started deploying open-source software for websites and web apps we built, many for SMB and enterprise customers. Our process was basically: spin up VM's from a hosting provider, install the software we needed, then update it manually / when it was needed / critical, etc.<p>Once we hit &gt; 100 servers/services needing updates, backups, capacity monitoring and alerting, etc. we saw that it was getting totally unmanageable… so we built what would eventually become elestio.<p>We've put a lot, a lot, a lot of work into building something that allows us (and now you) to deploy a new service in just a few minutes, with zero ongoing maintenance / devops overhead. We basically turned open-source software into a SaaS experience.<p>We update all the apps, respecting SemVer on the branch you select, issue and renew SSL certs automatically (even for your own domains, for free), automatically implement a 3-2-1 backup strategy, caching is handled and we put your service behind a configurable firewall and rate limiter with sane defaults. We have implemented Nebula to connect your services hosted in different datacenters across regions and providers as if they were on the same network and Borg backups to do deduplicated incremental backups in a remote datacenter.<p>There were many challenges in building it… VM providers don't have homogenous or feature-complete APIs for provisioning servers, we tested 6 different mesh networking/VPN solutions to enable services running in different datacenters, regions, or providers to connect to each other securely, and we did a lot of work to create a sane templating system that covers setup, security, backups, upgrade, migrations and monitoring, lots of work to test the safest ways to update OS and apps without breaking things… but we got there and it works really well (we think)! Deployments are based on Docker, which helped a lot to standardize everything.<p>We've been using it to deploy and maintain over 12,000 services for our own enterprise clients and we've spent the last year making it user-friendly (and even more bulletproof for end-user configs). Elestio can currently deploy any one of over 150 open-source software stacks like Postgres, MySQL, OpenSearch, Redis, Wordpress, NodeBB, Jitsi, Uptime-kuma, Plausible, GitLab,, Strapi, Ghost, or even PowerDns, Grafana, ClickHouse, etc. in about 3 minutes, flat.<p>We currently support AWS Lightsail, Linode, Hetzner, Vultr and Digital Ocean, and BringYourOwnVM, if you want to run on your own provider account or even on-premise but have all the features of managed services. We are offering 1 BYOVM service per customer for free forever.<p>Something we really wanted to do was make sure we were part of a healthy open-source ecosystem. To that end, elestio will donate part of all revenue to the open-source projects our customers are using. We will review this annually and if it's possible to increase it, we will. This is a win-win-win to us. Open-source developers and communities get more resources to improve their software while our customers, our staff and other stakeholders know that they are helping to support the open-source community.<p>For this launch we made a partnership with DigitalOcean, they are offering $250 of free credits on Elestio if you go through this link: <a href=\"https://try.digitalocean.com/elestio/\" rel=\"nofollow\">https://try.digitalocean.com/elestio/</a><p>Alternatively you can also register here and get $20 of free credits but not limited to DO infrastructure: <a href=\"https://dash.elest.io/signup\" rel=\"nofollow\">https://dash.elest.io/signup</a><p>All your questions and comments are welcome and if you want to share any devops horror stories, please do! We're giving out free credits for the best ones!!<p>Joseph, Kieran and David",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "js4ever",
    "url": "https://news.ycombinator.com/user?id=js4ever"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30440486",
  "sameAs": "https://news.ycombinator.com/item?id=30440486",
  "dateCreated": "2022-02-23T14:09:48.690Z",
  "datePublished": "2022-02-23T13:00:36.000Z",
  "dateModified": "2022-02-23T14:09:48.690Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 14
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 9
    }
  ],
  "headline_zh-Hans": "Show HN: Elestio - 150多个开源软件堆栈的管理平台",
  "headline_zh-Hant": "Show HN: Elestio - 150多個開源軟件堆棧的管理平臺",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，Hacker News! 我们是来自elestio（<a href=\"https://elest.io/\" rel=\"nofollow\">https://elest.io/</a>）的Joseph、Kieran和David。\n我们建立了一个平台，将开源软件作为一种管理服务来提供--我们负责操作系统和应用程序的更新、安全、SSL、网络、备份，整个交易。<p>2009年，我们开始为我们建立的网站和网络应用程序部署开源软件，其中许多是为中小企业和企业客户提供的。我们的流程基本上是：从托管提供商那里旋转虚拟机，安装我们需要的软件，然后手动更新/当它需要/关键时，等等。<p>当我们达到需要更新、备份、容量监控和警报等的100台服务器/服务时，我们发现它变得完全无法管理......所以我们建立了最终成为elestio的东西。<p>我们已经投入了大量、大量、大量的工作来建立一个允许我们（以及现在的你）在短短几分钟内部署一个新的服务，并且没有持续维护/devops开销。我们基本上把开源软件变成了SaaS体验。<p>我们更新所有的应用程序，尊重您选择的分支的SemVer，自动签发和更新SSL证书（甚至为您自己的域名免费），自动实施3-2-1备份策略，处理缓存，我们把您的服务放在可配置的防火墙和具有合理默认值的速率限制器后面。我们已经实施了Nebula，将您在不同地区和供应商的不同数据中心托管的服务连接起来，就像它们在同一个网络上一样，并实施了Borg备份，在远程数据中心做重复的增量备份。 <p>在构建它时有许多挑战......虚拟机供应商没有用于配置服务器的同质化或功能完整的API，我们测试了6种不同的网状网络/VPN解决方案，以使运行在不同数据中心、地区或供应商的服务能够安全地相互连接，我们做了大量的工作来创建一个合理的模板系统，涵盖设置、安全、备份、升级、迁移和监控，大量的工作来测试更新操作系统和应用程序的最安全方式，而不破坏事情......但我们做到了，它工作得非常好（我们认为）! <p>我们一直在使用它为我们自己的企业客户部署和维护超过12,000个服务，我们花了一年的时间使它对用户友好（甚至对终端用户的配置更加防弹）。Elestio目前可以部署150多个开源软件栈中的任何一个，如Postgres、MySQL、OpenSearch、Redis、Wordpress、NodeBB、Jitsi、Uptime-kuma、Plausible、GitLab、Strapi、Ghost，甚至是PowerDns、Grafana、ClickHouse等。<p>我们目前支持AWS Lightsail、Linode、Hetzner、Vultr和Digital Ocean，以及BringYourOwnVM，如果你想在你自己的供应商账户上运行，甚至在企业内部运行，但拥有管理服务的所有功能。我们为每位客户提供1个BYOVM服务，永久免费。<p>我们真正想做的是确保我们是健康的开源生态系统的一部分。为此，elestio将把所有收入的一部分捐赠给我们的客户正在使用的开源项目。我们将每年审查一次，如果有可能的话，我们会增加。这对我们来说是一个三赢的结果。Open-source developers and communities get more resources to improve their software while our customers, our staff and other stakeholders know that they are helping to support the open-source community.<p>For this launch we made a partnership with DigitalOcean, they are offering $250 of free credits on Elestio if you go through this link: <a href=\"https://try.digitalocean.com/elestio/\" rel=\"nofollow\">https://try.digitalocean.com/elestio/</a><p>Alternatively you can also register here and get $20 of free credits but not limited to DO infrastructure: <a href=\"https://dash.elest.io/signup\" rel=\"nofollow\">https://dash.elest.io/signup</a><p>我们欢迎你的所有问题和评论，如果你想分享任何devops的恐怖故事，也请你提出来! 我们将为最好的故事提供免费学分！<p>Joseph、Kieran和David",
  "description_zh-Hant": "你好，Hacker News! 我們是來自elestio（<a href=\"https://elest.io/\" rel=\"nofollow\">https://elest.io/</a>）的Joseph、Kieran和David。\n我們建立了一個平臺，將開源軟件作為一種管理服務來提供--我們負責操作系統和應用程序的更新、安全、SSL、網絡、備份，整個交易。<p>2009年，我們開始為我們建立的網站和網絡應用程序部署開源軟件，其中許多是為中小企業和企業客戶提供的。我們的流程基本上是：從託管提供商那裡旋轉虛擬機，安裝我們需要的軟件，然後手動更新/當它需要/關鍵時，等等。<p>當我們達到需要更新、備份、容量監控和警報等的100臺服務器/服務時，我們發現它變得完全無法管理......所以我們建立了最終成為elestio的東西。<p>我們已經投入了大量、大量、大量的工作來建立一個允許我們（以及現在的你）在短短几分鐘內部署一個新的服務，並且沒有持續維護/devops開銷。我們基本上把開源軟件變成了SaaS體驗。<p>我們更新所有的應用程序，尊重您選擇的分支的SemVer，自動簽發和更新SSL證書（甚至為您自己的域名免費），自動實施3-2-1備份策略，處理緩存，我們把您的服務放在可配置的防火牆和具有合理默認值的速率限制器後面。我們已經實施了Nebula，將您在不同地區和供應商的不同數據中心託管的服務連接起來，就像它們在同一個網絡上一樣，並實施了Borg備份，在遠程數據中心做重複的增量備份。 <p>在構建它時有許多挑戰......虛擬機供應商沒有用於配置服務器的同質化或功能完整的API，我們測試了6種不同的網狀網絡/VPN解決方案，以使運行在不同數據中心、地區或供應商的服務能夠安全地相互連接，我們做了大量的工作來創建一個合理的模板系統，涵蓋設置、安全、備份、升級、遷移和監控，大量的工作來測試更新操作系統和應用程序的最安全方式，而不破壞事情......但我們做到了，它工作得非常好（我們認為）! <p>我們一直在使用它為我們自己的企業客戶部署和維護超過12,000個服務，我們花了一年的時間使它對用戶友好（甚至對終端用戶的配置更加防彈）。Elestio目前可以部署150多個開源軟件棧中的任何一個，如Postgres、MySQL、OpenSearch、Redis、Wordpress、NodeBB、Jitsi、Uptime-kuma、Plausible、GitLab、Strapi、Ghost，甚至是PowerDns、Grafana、ClickHouse等。<p>我們目前支持AWS Lightsail、Linode、Hetzner、Vultr和Digital Ocean，以及BringYourOwnVM，如果你想在你自己的供應商賬戶上運行，甚至在企業內部運行，但擁有管理服務的所有功能。我們為每位客戶提供1個BYOVM服務，永久免費。<p>我們真正想做的是確保我們是健康的開源生態系統的一部分。為此，elestio將把所有收入的一部分捐贈給我們的客戶正在使用的開源項目。我們將每年審查一次，如果有可能的話，我們會增加。這對我們來說是一個三贏的結果。Open-source developers and communities get more resources to improve their software while our customers, our staff and other stakeholders know that they are helping to support the open-source community.<p>For this launch we made a partnership with DigitalOcean, they are offering $250 of free credits on Elestio if you go through this link: <a href=\"https://try.digitalocean.com/elestio/\" rel=\"nofollow\">https://try.digitalocean.com/elestio/</a><p>Alternatively you can also register here and get $20 of free credits but not limited to DO infrastructure: <a href=\"https://dash.elest.io/signup\" rel=\"nofollow\">https://dash.elest.io/signup</a><p>我們歡迎你的所有問題和評論，如果你想分享任何devops的恐怖故事，也請你提出來! 我們將為最好的故事提供免費學分！<p>Joseph、Kieran和David"
}