{
  "@type": "NewsArticle",
  "identifier": "2022--03--09--en--hackernews--HackerNews--NewsArticle--30612691",
  "url": "https://news.ycombinator.com/item?id=30612691",
  "headline": "Launch HN: 8vdX (YC W22) – Venture debt to complement a seed round",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN! We are Ravi and Vijay from 8vdX! We are building a founder-friendly venture debt marketplace for early stage startups. We also provide seed-extension debt to breakout companies to extend their runway to get to a better Series A raise. Our mission is to be the preferred debt partner for high growth startups and scale with them as they grow from seed stage to Series A and beyond.<p>Vijay and I were both working at Eight Capital, a high yield fund that I cofounded, when we gave a bridge loan to Kodo (a startup from YC W21) to support their high growth rate while they were getting their YC funding. Kodo is an Indian company and had to complete some standard processes for that to happen, but they needed money right away. Our loan allowed them to accelerate their growth and they ended up having an amazing Demo Day result.<p>We wondered, could this be repeated with other startups or was it a one and done investment? We looked at publicly available data and quickly came to the conclusion that we could indeed underwrite venture debt to seed to early stage startups. That was the genesis of the 8vdX venture debt marketplace.<p>We launched 3 months ago and have already provided venture debt to 16 startups. In good YC fashion, we’ve been focused on our batchmates to begin with :) But we believe this model can scale beyond the YC ecosystem and we’re very interested in that.<p>Why do we think this makes sense right now? Seed rounds today are the same size as Series A used to be a decade ago. But there are no existing players who provide venture debt to early stage startups. Last year, seed and early stage and Series A startups raised ~$100B from equity investors. Venture debt can be up to 25% of the balance sheet of these rapidly growing companies, making this a $25B annual opportunity in this underserved market.<p>Our loans are founder friendly. We do not force founders to open captive bank accounts, cash flow sweeps, take personal guarantees of the founders, or force the startup into bankruptcy if the startup is unable to repay. We have a simple and transparent application process to receive funds through the 8vdX digital platform.<p>Currently, startups can apply digitally for up to $150k of debt by visiting our startup portal at 8vdx.com, and upon approval, the funds are wired to their account on the same day. 8vdX has a capital-light business model as the venture debt to the startups are entirely funded by angels and institutional investors through the marketplace. We have a deep product pipeline which includes multi-currency venture debt that can be extended on day zero to international companies. We will be supporting local currency venture debt for startups in India, Australia, United Kingdom, Mexico and Indonesia for the YC S22 batch and our goal is to support even more countries in the future. We are also inviting platform partnerships from online investment apps to distribute the 8vdX venture debt offering to their clients.<p>Vijay and I look forward to hearing your ideas, questions and feedback. Thank you!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "rchachra",
    "url": "https://news.ycombinator.com/user?id=rchachra"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30612691",
  "sameAs": "https://news.ycombinator.com/item?id=30612691",
  "dateCreated": "2022-03-09T10:32:45.948Z",
  "datePublished": "2022-03-09T09:47:10.000Z",
  "dateModified": "2022-03-09T10:32:45.948Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 14
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      },
      "@version": 1.1
    }
  ],
  "description_zh-Hans": "嗨，HN! 我们是8vdX的Ravi和Vijay! 我们正在为早期创业公司建立一个有利于创始人的风险债务市场。我们还为突围的公司提供种子延期债务，以延长他们的运行时间，从而获得更好的A轮融资。我们的使命是成为高增长初创企业的首选债务合作伙伴，并在他们从种子阶段成长为A轮及以上的过程中与他们一起成长。<p>Vijay和我都在Eight Capital工作，这是一家我共同创立的高收益基金，当时我们向Kodo（一家来自YC W21的初创企业）提供了一笔过桥贷款，以支持他们在获得YC资金时的高增长率。Kodo是一家印度公司，必须完成一些标准流程才能实现，但他们马上就需要钱。我们的贷款使他们能够加速增长，他们最终在演示日取得了惊人的成绩。<p>我们想知道，这种情况是否可以在其他创业公司中重复出现，或者是一次性的投资？我们研究了公开可用的数据，并很快得出结论，我们确实可以为早期阶段的创业公司的种子期风险债务提供担保。这就是8vdX风险债务市场的起源。<p>我们在3个月前启动，已经向16家初创企业提供了风险债务。以良好的YC方式，我们一开始就把重点放在了我们的同学身上 :) 但我们相信这种模式可以扩展到 YC 生态系统之外，我们对此非常感兴趣。<p>为什么我们认为现在这样做有意义？今天的种子轮融资与十年前的A轮融资规模相同。但目前还没有为早期创业公司提供风险债务的参与者。去年，种子期和早期阶段以及A轮创业公司从股权投资者那里筹集了约1000亿美元。风险债务可占这些快速增长的公司资产负债表的25%，这使得这个未得到充分服务的市场每年有250亿美元的机会。我们不强迫创始人开设专属银行账户、现金流扫描、接受创始人的个人担保，或在创业公司无力偿还时迫使其破产。我们有一个简单而透明的申请过程，通过8vdX数字平台获得资金。<p>目前，初创企业可以通过访问我们的初创企业门户网站8vdx.com，以数字方式申请高达15万美元的债务，一旦获得批准，资金将在当天汇入其账户。8vdX具有轻资产的商业模式，因为对初创企业的风险债务完全由天使和机构投资者通过市场提供资金。我们有一个深入的产品管道，其中包括多币种的风险债务，可以在零天内扩展到国际公司。我们将为YC S22批次的印度、澳大利亚、英国、墨西哥和印度尼西亚的初创企业提供本地货币风险债务支持，我们的目标是在未来支持更多国家。我们还邀请在线投资应用程序的平台合作伙伴向其客户分发8vdX风险债务产品。<p>Vijay和我期待着听到你的想法、问题和反馈。谢谢你",
  "description_zh-Hant": "嗨，HN! 我們是8vdX的Ravi和Vijay! 我們正在為早期創業公司建立一個有利於創始人的風險債務市場。我們還為突圍的公司提供種子延期債務，以延長他們的運行時間，從而獲得更好的A輪融資。我們的使命是成為高增長初創企業的首選債務合作伙伴，並在他們從種子階段成長為A輪及以上的過程中與他們一起成長。<p>Vijay和我都在Eight Capital工作，這是一家我共同創立的高收益基金，當時我們向Kodo（一家來自YC W21的初創企業）提供了一筆過橋貸款，以支持他們在獲得YC資金時的高增長率。Kodo是一家印度公司，必須完成一些標準流程才能實現，但他們馬上就需要錢。我們的貸款使他們能夠加速增長，他們最終在演示日取得了驚人的成績。<p>我們想知道，這種情況是否可以在其他創業公司中重複出現，或者是一次性的投資？我們研究了公開可用的數據，並很快得出結論，我們確實可以為早期階段的創業公司的種子期風險債務提供擔保。這就是8vdX風險債務市場的起源。<p>我們在3個月前啟動，已經向16家初創企業提供了風險債務。以良好的YC方式，我們一開始就把重點放在了我們的同學身上 :) 但我們相信這種模式可以擴展到 YC 生態系統之外，我們對此非常感興趣。<p>為什麼我們認為現在這樣做有意義？今天的種子輪融資與十年前的A輪融資規模相同。但目前還沒有為早期創業公司提供風險債務的參與者。去年，種子期和早期階段以及A輪創業公司從股權投資者那裡籌集了約1000億美元。風險債務可佔這些快速增長的公司資產負債表的25%，這使得這個未得到充分服務的市場每年有250億美元的機會。我們不強迫創始人開設專屬銀行賬戶、現金流掃描、接受創始人的個人擔保，或在創業公司無力償還時迫使其破產。我們有一個簡單而透明的申請過程，通過8vdX數字平臺獲得資金。<p>目前，初創企業可以通過訪問我們的初創企業門戶網站8vdx.com，以數字方式申請高達15萬美元的債務，一旦獲得批准，資金將在當天匯入其賬戶。8vdX具有輕資產的商業模式，因為對初創企業的風險債務完全由天使和機構投資者通過市場提供資金。我們有一個深入的產品管道，其中包括多幣種的風險債務，可以在零天內擴展到國際公司。我們將為YC S22批次的印度、澳大利亞、英國、墨西哥和印度尼西亞的初創企業提供本地貨幣風險債務支持，我們的目標是在未來支持更多國家。我們還邀請在線投資應用程序的平臺合作伙伴向其客戶分發8vdX風險債務產品。<p>Vijay和我期待著聽到你的想法、問題和反饋。謝謝你"
}