{
  "@type": "NewsArticle",
  "identifier": "2022--02--19--en--hackernews--HackerNews--NewsArticle--30398529",
  "url": "https://news.ycombinator.com/item?id=30398529",
  "headline": "Legion Health (YC S21) Is Hiring a Founding Engineer – Austin, TX",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Full-stack engineer\nat Legion Health\nAustin, TX<p>What is Legion Health?<p>Legion Health is tackling the biggest problem in the mental health space: the massive (and growing) lack of high-quality mental health professionals—and, the resulting lack of access to care.<p>Today, most telemedicine services, hospitals, and insurance companies are in dire need of mental health clinicians. Yet, thousands of these talented clinicians spend many of their days feeling unproductive; they are interrupted by administrative tasks, patient no-shows, and sub-optimal scheduling.<p>Legion more efficiently schedules and load-balances doctors' and nurses' time, allowing companies API-based access to a sizable latent supply of clinical time. This also allows doctors and nurses the flexibility to work for as many (or as few) hours as they want, maximizing their pay by matching them with the best patients for their backgrounds.<p>Join us in building the future of mental health.<p>About the role:<p>We're looking for a passionate and creative founding engineer to join our team as an early member! You will work closely with the co-founders, help define the product roadmap, and have a lot of room for flexibility. You are expected to gradually take responsibility for the full engineering stack at Legion Health. You should take the initiative to improve the system at both the design and implementation levels. As Legion grows, you may also help with recruiting and managing our engineering team.<p>Responsibilities include:<p>Own end-to-end implementation of projects including initial scoping of features, design of product, architecture of the database, and development of the final deliverable\nWork directly with customers to understand their needs and to inform product design decisions<p>Collaborate with teammates across a wide range of functions including mentoring more junior engineers\nLearn new skills and technologies (as required) to solve different engineering challenges while maintaining flexibility\nUphold security requirements and maintain compliance with HIPAA security regulations.<p>Why you should join Legion Health:<p>Legion Health is expanding access to mental health care by more optimally balancing clinician time.<p>Our organization is still incredibly small. We (the co-founders) have been best friends since college. We treat everyone we work with as part of our family—including our contractors and interns. We love those who seek ownership, dream about possibility, and are driven towards building the future they want to see.<p>What we're looking for:<p>- “Full-stack capable” engineer with 2+ years of experience as part of a development team\n- Enjoys innovating with little direction and having the autonomy to learn and experiment.\n- Data-oriented and ruthlessly measures the success of hypotheses.\n- Loves building things together as a team.\n- Familiar with TypeScript and Node.js\n- Strong backend experience and a passion for clean code\n- Capable of weighing tradeoffs between robustness and speed\n- Based in (or willing to move to) Austin, TX\n- Willing to consider remote in certain circumstances<p>Bonus:\n- Experience with React, NextJS, GraphQL\n- DevOps experience (AWS/Heroku/GitHub)\n- Experience with API design for public APIs and platforms\n- Experience in health care (or other highly regulated industries)<p>Legion Health is an equal opportunity employer.<p>Equal employment opportunity:\nAt Legion Health, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law. Legion Health believes that diversity and inclusion among our teammates is critical to our success as a global company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "ympatel",
    "url": "https://news.ycombinator.com/user?id=ympatel"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30398529",
  "sameAs": "https://news.ycombinator.com/item?id=30398529",
  "dateCreated": "2022-02-19T17:13:45.443Z",
  "datePublished": "2022-02-19T17:01:15.000Z",
  "dateModified": "2022-02-19T17:13:45.443Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": null
    }
  ],
  "headline_zh-Hans": "Legion Health (YC S21)正在招聘一名创始工程师 - 德克萨斯州奥斯汀市",
  "headline_zh-Hant": "Legion Health (YC S21)正在招聘一名創始工程師 - 德克薩斯州奧斯汀市",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "全栈工程师\n在 Legion Health\n德克萨斯州奥斯汀市<p>什么是Legion Health？<p>Legion Health正在解决心理健康领域的最大问题：大量（而且越来越多）高质量的心理健康专业人员的缺乏，以及由此导致的医疗服务的缺乏。<p>今天，大多数远程医疗服务、医院和保险公司都迫切需要心理健康临床医生。<p>Legion更有效地安排和平衡了医生和护士的时间，使公司能够通过API获得大量潜在的临床时间。这也使医生和护士能够灵活地工作，工作时间可多可少，通过为他们匹配最适合他们背景的病人，使他们的报酬最大化。<p>加入我们，构建心理健康的未来。<p>关于角色：<p>我们正在寻找一位充满激情和创造力的创始工程师，作为早期成员加入我们的团队 你将与联合创始人紧密合作，帮助确定产品路线图，并有很大的灵活性空间。你要逐步承担起在Legion Health的整个工程堆栈的责任。你应该主动在设计和实施层面上改进系统。随着Legion的发展，你也可以帮助招聘和管理我们的工程团队。<p>职责包括：<p>拥有项目的端到端实施，包括功能的初始范围，产品设计，数据库的架构，以及最终交付物的开发。\n直接与客户合作，了解他们的需求，并为产品设计决策提供信息<p>与不同职能的团队成员合作，包括指导更多的初级工程师\n学习新的技能和技术（根据需要）以解决不同的工程挑战，同时保持灵活性\n坚持安全要求，保持对HIPAA安全法规的遵守。<p>为什么你应该加入Legion Health：<p>Legion Health正在通过更优化地平衡临床医生的时间来扩大心理健康护理的机会。<p>我们的组织仍然非常小。我们（联合创始人）从大学开始就是最好的朋友。我们把与我们合作的每个人都当作我们家庭的一部分--包括我们的承包商和实习生。我们喜欢那些寻求所有权、梦想有可能实现的人，以及有动力建设他们希望看到的未来的人。<p>我们正在寻找：<p>- 具有2年以上开发团队经验的 \"全栈能力 \"工程师\n- 喜欢在没有指导的情况下进行创新，并拥有学习和实验的自主权。\n- 以数据为导向，无情地衡量假设的成功。\n- 喜欢作为一个团队共同构建事物。\n- 熟悉TypeScript和Node.js\n- 有丰富的后端经验，对简洁的代码有热情\n- 能够权衡鲁棒性和速度之间的取舍\n- 工作地点在（或愿意搬到）德克萨斯州奥斯汀市\n- 愿意在某些情况下考虑远程工作<p>奖励。\n- 有React、NextJS、GraphQL的经验\n- 有DevOps经验（AWS/Heroku/GitHub）。\n- 有公共API和平台的API设计经验\n- 有医疗保健（或其他高度管制行业）方面的经验<p>Legion Health是一个机会平等的雇主。\n在军团健康，我们致力于提供一个相互尊重的环境，为所有申请人和团队成员提供平等的就业机会，而不考虑种族、肤色、宗教、性别、怀孕（包括分娩、哺乳和相关医疗条件）、国籍、年龄、身体和精神残疾、婚姻状况、性取向、性别认同、性别表达、遗传信息（包括特征和测试）、军人和退伍军人身份，以及受适用法律保护的任何其他特征。Legion Health相信我们的团队成员的多样性和包容性对我们作为一家全球公司的成功至关重要，我们寻求从不同的候选人中招募、培养和保留最有才华的人。",
  "description_zh-Hant": "全棧工程師\n在 Legion Health\n德克薩斯州奧斯汀市<p>什麼是Legion Health？<p>Legion Health正在解決心理健康領域的最大問題：大量（而且越來越多）高質量的心理健康專業人員的缺乏，以及由此導致的醫療服務的缺乏。<p>今天，大多數遠程醫療服務、醫院和保險公司都迫切需要心理健康臨床醫生。<p>Legion更有效地安排和平衡了醫生和護士的時間，使公司能夠通過API獲得大量潛在的臨床時間。這也使醫生和護士能夠靈活地工作，工作時間可多可少，通過為他們匹配最適合他們背景的病人，使他們的報酬最大化。<p>加入我們，構建心理健康的未來。<p>關於角色：<p>我們正在尋找一位充滿激情和創造力的創始工程師，作為早期成員加入我們的團隊 你將與聯合創始人緊密合作，幫助確定產品路線圖，並有很大的靈活性空間。你要逐步承擔起在Legion Health的整個工程堆棧的責任。你應該主動在設計和實施層面上改進系統。隨著Legion的發展，你也可以幫助招聘和管理我們的工程團隊。<p>職責包括：<p>擁有項目的端到端實施，包括功能的初始範圍，產品設計，數據庫的架構，以及最終交付物的開發。\n直接與客戶合作，瞭解他們的需求，併為產品設計決策提供信息<p>與不同職能的團隊成員合作，包括指導更多的初級工程師\n學習新的技能和技術（根據需要）以解決不同的工程挑戰，同時保持靈活性\n堅持安全要求，保持對HIPAA安全法規的遵守。<p>為什麼你應該加入Legion Health：<p>Legion Health正在通過更優化地平衡臨床醫生的時間來擴大心理健康護理的機會。<p>我們的組織仍然非常小。我們（聯合創始人）從大學開始就是最好的朋友。我們把與我們合作的每個人都當作我們家庭的一部分--包括我們的承包商和實習生。我們喜歡那些尋求所有權、夢想有可能實現的人，以及有動力建設他們希望看到的未來的人。<p>我們正在尋找：<p>- 具有2年以上開發團隊經驗的 \"全棧能力 \"工程師\n- 喜歡在沒有指導的情況下進行創新，並擁有學習和實驗的自主權。\n- 以數據為導向，無情地衡量假設的成功。\n- 喜歡作為一個團隊共同構建事物。\n- 熟悉TypeScript和Node.js\n- 有豐富的後端經驗，對簡潔的代碼有熱情\n- 能夠權衡魯棒性和速度之間的取捨\n- 工作地點在（或願意搬到）德克薩斯州奧斯汀市\n- 願意在某些情況下考慮遠程工作<p>獎勵。\n- 有React、NextJS、GraphQL的經驗\n- 有DevOps經驗（AWS/Heroku/GitHub）。\n- 有公共API和平臺的API設計經驗\n- 有醫療保健（或其他高度管制行業）方面的經驗<p>Legion Health是一個機會平等的僱主。\n在軍團健康，我們致力於提供一個相互尊重的環境，為所有申請人和團隊成員提供平等的就業機會，而不考慮種族、膚色、宗教、性別、懷孕（包括分娩、哺乳和相關醫療條件）、國籍、年齡、身體和精神殘疾、婚姻狀況、性取向、性別認同、性別表達、遺傳信息（包括特徵和測試）、軍人和退伍軍人身份，以及受適用法律保護的任何其他特徵。Legion Health相信我們的團隊成員的多樣性和包容性對我們作為一家全球公司的成功至關重要，我們尋求從不同的候選人中招募、培養和保留最有才華的人。"
}