{
  "@type": "NewsArticle",
  "identifier": "2022--03--16--en--hackernews--HackerNews--NewsArticle--30701377",
  "url": "https://news.ycombinator.com/item?id=30701377",
  "headline": "Show HN: Civic – Online Hub for Causes",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN! Matias and Jessica here, we're the founders of Civic (https://civicapp.co/), an online platform that connects people to causes in their area. That could mean everything from volunteering opportunities to activism and politics.<p>Every year, over 180M Americans contribute to social causes, yet doing so takes a significant amount of time and energy — information on how to get involved or take action often spreads through disconnected pages, newsletters, and word of mouth. Civic plans to solve this by creating a hub for people to find and organize events, connect, and donate to causes around them.<p>We just launched our MVP in NYC, focusing exclusively on events. I (Matias) started working on Civic while still in college, where I also spent a lot of my time in politics, having worked with ActBlue and a presidential campaign. I also served as a hyper-local elected official in DC, where I represented about 2k constituents to the city. Jessica is a full-stack software engineer and spent 5 years working at Google before joining us. She's fully responsible for our tech and is the reason why we're able to build this at all.<p>During my time in DC, one of the most interesting things I observed was how the causes that were most likely to get people engaged were the local/neighborhood issues that affected them directly. Yet, because of their local nature, those causes were also the ones least likely to get publicity. That plus the general lack of a true online hub for civic engagement led us to start Civic.<p>The MVP is rough around the edges and we're definitely looking for ideas and feedback on how we can improve! Some of the features in our dev pipeline include an onboarding process to customize the content seen by each user (causes are very broad); easy and streamlined, no-fee donations to organizations; social &quot;spaces&quot; based on location and interests where users can meet and discuss issues with others; and much more!<p>For those curious about revenue, we plan to monetize by introducing donations. Right now, over $300B are donated by individuals to non-profits in the United States each year, much of which goes through outdated platforms that charge high fees. We'd target smaller, local organizations that aren't well served by existing platforms, and would follow the same model as GoFundMe and a few other companies, allowing users to add an optional &quot;tip&quot; to Civic after each donation. From our research, this tends to lead to tips of about 6-8% per transaction.<p>You can check out our MVP here: https://civicapp.co/<p>We'd really appreciate any and all feedback (especially related to features, new and existing), please let us know what you think! :)",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "mab477",
    "url": "https://news.ycombinator.com/user?id=mab477"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30701377",
  "sameAs": "https://news.ycombinator.com/item?id=30701377",
  "dateCreated": "2022-03-16T18:35:42.412Z",
  "datePublished": "2022-03-16T17:07:14.000Z",
  "dateModified": "2022-03-16T18:35:42.412Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 16
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Show HN: 公民--事业的在线枢纽",
  "headline_zh-Hant": "Show HN: 公民--事業的在線樞紐",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! 我是马蒂亚斯和杰西卡，我们是Civic（https://civicapp.co/）的创始人，这是一个在线平台，将人们与他们所在地区的事业联系起来。这可能意味着从志愿服务机会到行动主义和政治的一切。<p>每年，超过1.8亿美国人为社会事业做出贡献，但这样做需要大量的时间和精力--关于如何参与或采取行动的信息往往通过不相干的网页、通讯和口碑传播。Civic计划通过创建一个中心，让人们寻找和组织活动，建立联系，并为他们周围的事业捐款来解决这个问题。<p>我们刚刚在纽约市推出了我们的MVP，专门关注活动。我（Matias）在大学期间就开始了Civic的工作，在大学期间我也花了很多时间在政治上，曾与ActBlue和一个总统竞选团队合作。我还在华盛顿担任过一个超地方的民选官员，在那里我代表大约2千名选民到市里。杰西卡是一名全栈软件工程师，在加入我们之前，她在谷歌工作了5年。她完全负责我们的技术工作，这也是我们能够建立这个网站的原因。<p>在华盛顿特区工作期间，我观察到的最有趣的事情之一是，最有可能让人们参与的事业是直接影响他们的当地/邻里问题。然而，由于其本地性质，这些事业也是最不可能得到宣传的。这一点再加上普遍缺乏一个真正的公民参与的在线中心，使我们开始了Civic。<p>MVP的边缘很粗糙，我们肯定在寻找关于我们如何改进的想法和反馈 我们开发管道中的一些功能包括一个入职流程，以定制每个用户看到的内容（原因非常广泛）；简单和简化的，不收费的组织捐赠；基于位置和兴趣的社交空间，用户可以与其他人见面并讨论问题；以及更多！<p>对于那些对收入感到好奇的人，我们计划通过引入捐赠来实现货币化。现在，美国每年有超过3000亿美元的个人捐款给非营利组织，其中大部分是通过收取高额费用的过时平台。我们的目标是现有平台没有很好服务的较小的地方组织，并将遵循与GoFundMe和其他一些公司相同的模式，允许用户在每次捐款后向Civic添加可选的&quot;提示&quot;。根据我们的研究，这往往会导致每笔交易的小费约为6-8%。<p>你可以在这里查看我们的MVP：https://civicapp.co/<p>我们非常感谢任何和所有的反馈（特别是与功能有关的，新的和现有的），请让我们知道你的想法！:) :)",
  "description_zh-Hant": "嗨，HN! 我是馬蒂亞斯和傑西卡，我們是Civic（https://civicapp.co/）的創始人，這是一個在線平臺，將人們與他們所在地區的事業聯繫起來。這可能意味著從志願服務機會到行動主義和政治的一切。<p>每年，超過1.8億美國人為社會事業做出貢獻，但這樣做需要大量的時間和精力--關於如何參與或採取行動的信息往往通過不相干的網頁、通訊和口碑傳播。Civic計劃通過創建一箇中心，讓人們尋找和組織活動，建立聯繫，併為他們周圍的事業捐款來解決這個問題。<p>我們剛剛在紐約市推出了我們的MVP，專門關注活動。我（Matias）在大學期間就開始了Civic的工作，在大學期間我也花了很多時間在政治上，曾與ActBlue和一個總統競選團隊合作。我還在華盛頓擔任過一個超地方的民選官員，在那裡我代表大約2千名選民到市裡。傑西卡是一名全棧軟件工程師，在加入我們之前，她在谷歌工作了5年。她完全負責我們的技術工作，這也是我們能夠建立這個網站的原因。<p>在華盛頓特區工作期間，我觀察到的最有趣的事情之一是，最有可能讓人們參與的事業是直接影響他們的當地/鄰里問題。然而，由於其本地性質，這些事業也是最不可能得到宣傳的。這一點再加上普遍缺乏一個真正的公民參與的在線中心，使我們開始了Civic。<p>MVP的邊緣很粗糙，我們肯定在尋找關於我們如何改進的想法和反饋 我們開發管道中的一些功能包括一個入職流程，以定製每個用戶看到的內容（原因非常廣泛）；簡單和簡化的，不收費的組織捐贈；基於位置和興趣的社交空間，用戶可以與其他人見面並討論問題；以及更多！<p>對於那些對收入感到好奇的人，我們計劃通過引入捐贈來實現貨幣化。現在，美國每年有超過3000億美元的個人捐款給非營利組織，其中大部分是通過收取高額費用的過時平臺。我們的目標是現有平臺沒有很好服務的較小的地方組織，並將遵循與GoFundMe和其他一些公司相同的模式，允許用戶在每次捐款後向Civic添加可選的&quot;提示&quot;。根據我們的研究，這往往會導致每筆交易的小費約為6-8%。<p>你可以在這裡查看我們的MVP：https://civicapp.co/<p>我們非常感謝任何和所有的反饋（特別是與功能有關的，新的和現有的），請讓我們知道你的想法！:) :)"
}