{
  "@type": "NewsArticle",
  "identifier": "2022--03--22--en--hackernews--HackerNews--NewsArticle--30767471",
  "url": "https://news.ycombinator.com/item?id=30767471",
  "headline": "Launch HN: Helio Sleep (YC S21) – One-stop portal for sleep apnea",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN! We’re Helio Sleep (<a href=\"https://www.heliosleep.com\" rel=\"nofollow\">https://www.heliosleep.com</a>). We help treat sleep apnea at home using sleep tests, best-in-class treatment devices, and board-certified physicians. We prescribe and deliver medical equipment, so that patients can get care affordably and easily from their homes.<p>An estimated 30M Americans suffer from sleep apnea. Getting diagnosis, treatment devices, and ongoing support can be difficult, and is getting harder, because fewer physicians are practicing sleep medicine. There is a serious &quot;conversion funnel&quot; problem. 50% of patients give up before making it to a sleep specialist; of those that get to a sleep specialist, 50% don't get a sleep study; and of those that do get care, more than a third fail to continue within 6 months. As a result, 24M Americans are currently untreated, leaving them tired and also at risk for serious health problems such as diabetes, heart disease, and high blood pressure.<p>Clearly, a lot more support is needed. That's our intention with Helio Sleep. We coordinate the care journey by connecting patients directly with sleep specialists, following up to make sure they have access to treatment, and coaching them to help them stay with it.<p>We encountered this problem repeatedly with family and friends who were having difficulties getting diagnosed and treated for sleep problems. Because of our backgrounds in digital health, we knew we could assemble a process to do something about it. We had previously worked at digital health companies including Medallion, Truepill, Counsyl, and Q Bio, building tools for patient education, telemedicine networks, pharmacy fulfillment, and automated reporting. We knew a lot about the difficulties of delivering and supporting prescription medical devices for at-home care.<p>One of the biggest challenges for such a solution is the complexity of the healthcare system. There are regulatory barriers to operating a provider network and a licensed durable medical equipment supplier. We also need to coordinate with payers and manufacturers. We’re building tools to coordinate all of these steps and provide a seamless experience.<p>Sleep apnea lies at the intersection of medical and dental treatment in the US, so due to US billing structures, patients typically aren't presented with all treatment options. There is a need for a sleep apnea 'portal' where everything relevant is addressed, and nothing major falls through the cracks.<p>At Helio Sleep, patients can self-refer or be referred through their medical or dental provider. They are evaluated for sleep apnea through a protocol-driven provider consult and a home sleep test. They then select from a range of evidence-driven therapies to treat their sleep apnea, and also their snoring if that’s needed. To help patients adhere to their treatments, we follow up with them, closely monitoring efficacy and adjusting care as required.<p>We went live at the end of February, offering consultations with licensed providers, home sleep tests interpreted by board-certified sleep physicians, and treatment devices including oral appliances and sleep positioners from industry-leading manufacturers, and we look forward to adding other treatment options including CPAP. We make money in an old-fashioned way by charging for diagnostic and treatment devices and for provider consults. We currently accept cash payment, and we’ll be adding insurance coverage. Getting medical care in the US is expensive, and we’re committed to finding ways to extend access to as many people as possible.<p>We’re excited to share what we’re working on and look forward to your thoughts! If you have or suspect you have sleep apnea, we’d be really interested to hear about any experiences that you’ve had in getting care. If you’re curious about your risk, one of the most widely used sleep apneas screeners is the STOP-BANG questionnaire. You can find a version of it here: <a href=\"https://www.heliosleep.com/quiz\" rel=\"nofollow\">https://www.heliosleep.com/quiz</a>. And if you’re a healthcare professional, we’d be interested to hear about your experience with delivering care for patients. If anyone would prefer to reach out directly, we can be reached by email at support@heliosleep.com. We look forward to your comments!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "maxgreenfeld",
    "url": "https://news.ycombinator.com/user?id=maxgreenfeld"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30767471",
  "sameAs": "https://www.heliosleep.com//",
  "dateCreated": "2022-03-22T15:52:44.787Z",
  "datePublished": "2022-03-22T15:43:21.000Z",
  "dateModified": "2022-03-22T15:52:44.787Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "启动HN：Helio睡眠（YC S21）--睡眠呼吸障碍的一站式门户",
  "headline_zh-Hant": "啟動HN：Helio睡眠（YC S21）--睡眠呼吸障礙的一站式門戶",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN! 我们是Helio Sleep（<a href=\"https://www.heliosleep.com\" rel=\"nofollow\">https://www.heliosleep.com</a>）。我们利用睡眠测试、一流的治疗设备和委员会认证的医生，帮助在家里治疗睡眠呼吸暂停症。我们开具和提供医疗设备，使病人能够在家中轻松地获得护理。<p>估计有3千万美国人患有睡眠呼吸暂停症。获得诊断、治疗设备和持续支持可能很困难，而且越来越难，因为从事睡眠医学的医生越来越少。有一个严重的 \"转换漏斗 \"问题。50%的患者在找到睡眠专家之前就放弃了；在那些找到睡眠专家的患者中，50%没有得到睡眠研究；而在那些得到护理的患者中，超过三分之一的人在6个月内没有继续治疗。因此，目前有2,400万美国人没有得到治疗，使他们在疲惫的同时也面临着严重的健康问题，如糖尿病、心脏病和高血压。这就是我们推出Helio Sleep的目的。我们通过直接将患者与睡眠专家联系起来，协调护理过程，跟进以确保他们获得治疗，并辅导他们，帮助他们坚持治疗。<p>我们的家人和朋友反复遇到这个问题，他们的睡眠问题难以得到诊断和治疗。由于我们在数字健康方面的背景，我们知道我们可以组建一个流程来解决这个问题。我们以前曾在数字健康公司工作，包括Medallion、Truepill、Counsyl和Q Bio，为病人教育、远程医疗网络、药房履行和自动报告建立工具。我们对为家庭护理提供和支持处方医疗设备的困难有很多了解。<p>这种解决方案的最大挑战之一是医疗系统的复杂性。经营供应商网络和特许耐用医疗设备供应商存在着监管障碍。我们还需要与付款人和制造商协调。我们正在开发工具，以协调所有这些步骤，并提供无缝体验。<p>在美国，睡眠呼吸暂停处于医疗和牙科治疗的交叉点，因此，由于美国的计费结构，患者通常不会被告知所有的治疗方案。我们需要一个睡眠呼吸暂停的 \"门户\"，在这里，所有相关的问题都得到了解决，没有什么大问题会被忽略。<p>在Helio Sleep，病人可以自我介绍，也可以通过他们的医疗或牙科医生介绍。他们通过协议驱动的提供者咨询和家庭睡眠测试来评估睡眠呼吸障碍。然后，他们从一系列以证据为导向的治疗方法中选择，以治疗他们的睡眠呼吸暂停，如果需要的话，也可以治疗他们的打鼾。为了帮助患者坚持治疗，我们对他们进行跟踪，密切监测疗效，并根据需要调整护理。<p>我们在2月底上线，提供有执照的医疗服务提供者的咨询，由委员会认证的睡眠医生解释的家庭睡眠测试，以及来自业界领先制造商的治疗设备，包括口腔器具和睡眠定位器，我们期待着增加其他治疗选择，包括CPAP。我们以老式的方式赚钱，对诊断和治疗设备以及提供者的咨询进行收费。我们目前接受现金支付，我们将增加保险范围。在美国获得医疗服务是很昂贵的，我们致力于寻找方法，让尽可能多的人获得医疗服务。<p>我们很高兴分享我们正在做的事情，并期待着您的意见 如果你有或怀疑你有睡眠呼吸暂停，我们很想听听你在获得护理方面的任何经验。如果你对自己的风险感到好奇，最广泛使用的睡眠呼吸暂停筛查工具之一是STOP-BANG问卷。你可以在这里找到它的一个版本。<a href=\"https://www.heliosleep.com/quiz\" rel=\"nofollow\">https://www.heliosleep.com/quiz</a>。如果你是一名医疗专业人士，我们很想听听你为病人提供护理的经验。如果有人愿意直接联系我们，可以通过电子邮件联系我们：support@heliosleep.com。我们期待着您的意见!",
  "description_zh-Hant": "你好，HN! 我們是Helio Sleep（<a href=\"https://www.heliosleep.com\" rel=\"nofollow\">https://www.heliosleep.com</a>）。我們利用睡眠測試、一流的治療設備和委員會認證的醫生，幫助在家裡治療睡眠呼吸暫停症。我們開具和提供醫療設備，使病人能夠在家中輕鬆地獲得護理。<p>估計有3千萬美國人患有睡眠呼吸暫停症。獲得診斷、治療設備和持續支持可能很困難，而且越來越難，因為從事睡眠醫學的醫生越來越少。有一個嚴重的 \"轉換漏斗 \"問題。50%的患者在找到睡眠專家之前就放棄了；在那些找到睡眠專家的患者中，50%沒有得到睡眠研究；而在那些得到護理的患者中，超過三分之一的人在6個月內沒有繼續治療。因此，目前有2,400萬美國人沒有得到治療，使他們在疲憊的同時也面臨著嚴重的健康問題，如糖尿病、心臟病和高血壓。這就是我們推出Helio Sleep的目的。我們通過直接將患者與睡眠專家聯繫起來，協調護理過程，跟進以確保他們獲得治療，並輔導他們，幫助他們堅持治療。<p>我們的家人和朋友反覆遇到這個問題，他們的睡眠問題難以得到診斷和治療。由於我們在數字健康方面的背景，我們知道我們可以組建一個流程來解決這個問題。我們以前曾在數字健康公司工作，包括Medallion、Truepill、Counsyl和Q Bio，為病人教育、遠程醫療網絡、藥房履行和自動報告建立工具。我們對為家庭護理提供和支持處方醫療設備的困難有很多瞭解。<p>這種解決方案的最大挑戰之一是醫療系統的複雜性。經營供應商網絡和特許耐用醫療設備供應商存在著監管障礙。我們還需要與付款人和製造商協調。我們正在開發工具，以協調所有這些步驟，並提供無縫體驗。<p>在美國，睡眠呼吸暫停處於醫療和牙科治療的交叉點，因此，由於美國的計費結構，患者通常不會被告知所有的治療方案。我們需要一個睡眠呼吸暫停的 \"門戶\"，在這裡，所有相關的問題都得到了解決，沒有什麼大問題會被忽略。<p>在Helio Sleep，病人可以自我介紹，也可以通過他們的醫療或牙科醫生介紹。他們通過協議驅動的提供者諮詢和家庭睡眠測試來評估睡眠呼吸障礙。然後，他們從一系列以證據為導向的治療方法中選擇，以治療他們的睡眠呼吸暫停，如果需要的話，也可以治療他們的打鼾。為了幫助患者堅持治療，我們對他們進行跟蹤，密切監測療效，並根據需要調整護理。<p>我們在2月底上線，提供有執照的醫療服務提供者的諮詢，由委員會認證的睡眠醫生解釋的家庭睡眠測試，以及來自業界領先製造商的治療設備，包括口腔器具和睡眠定位器，我們期待著增加其他治療選擇，包括CPAP。我們以老式的方式賺錢，對診斷和治療設備以及提供者的諮詢進行收費。我們目前接受現金支付，我們將增加保險範圍。在美國獲得醫療服務是很昂貴的，我們致力於尋找方法，讓儘可能多的人獲得醫療服務。<p>我們很高興分享我們正在做的事情，並期待著您的意見 如果你有或懷疑你有睡眠呼吸暫停，我們很想聽聽你在獲得護理方面的任何經驗。如果你對自己的風險感到好奇，最廣泛使用的睡眠呼吸暫停篩查工具之一是STOP-BANG問卷。你可以在這裡找到它的一個版本。<a href=\"https://www.heliosleep.com/quiz\" rel=\"nofollow\">https://www.heliosleep.com/quiz</a>。如果你是一名醫療專業人士，我們很想聽聽你為病人提供護理的經驗。如果有人願意直接聯繫我們，可以通過電子郵件聯繫我們：support@heliosleep.com。我們期待著您的意見!"
}