{
  "@type": "NewsArticle",
  "identifier": "2022--02--22--en--hackernews--HackerNews--NewsArticle--30433104",
  "url": "https://news.ycombinator.com/item?id=30433104",
  "headline": "Launch HN: Hyperbeam API (YC W22) – Multiplayer embeds of any website",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, we’re Philip, Amby, and Declan from Hyperbeam (<a href=\"https://www.hyperbeam.dev\" rel=\"nofollow\">https://www.hyperbeam.dev</a>). Hyperbeam is an API that makes it easy for developers to embed real-time multiplayer capabilities into their web apps—including any other web app that you want to provide multiplayer access to.<p>Building software to connect people in real time is hard. We experienced this in college when we built a “watch party” site for people to watch movies together (<a href=\"https://hyperbeam.com\" rel=\"nofollow\">https://hyperbeam.com</a>). Other watch party solutions were unreliable, so we spent two years building tech to allow friends to watch stuff together with ease.<p>The key piece was a “multiplayer web browser”. By that we mean a Chromium instance that you embed inside your own web app (i.e. web browser inception) which is actually hosted on a server and streamed via WebRTC, and so can be shared and controlled by multiple people at the same time.<p>For example, say you have an online tutoring platform. An instructor can open any application in the embedded web browser and then work on it with the student together.<p>Another use case is making non-multiplayer apps multiplayer. One of our customers wanted to add a collaborative version of Google Slides to their product, so multiple participants could navigate the slides at once. Google doesn't provide an API for that, so users had to screen share, which isn't multiplayer. With Hyperbeam, you just open up a shared instance of Google Slides and then multiple people can control it.<p>We didn’t learn about those use cases until later, though. What happened was that we grew hyperbeam.com to 150k monthly active users and over 1M hours of video per month, but then it stopped growing. Despite this, we got into YC, and soon had multiple companies asking to buy our multiplayer browsing tech. After closing three deals, we decided to sell our multiplayer web browsers as an API. That way other companies can build products to connect others without going through two years of WebRTC hell like we did.<p>We allow developers to embed multiplayer web browsers in their web apps with a few lines of code. Users can then visit any website from inside that web app together. Developers can specify control permissions, programmatically navigate to specific URLs, and hide the browser UI so apps appear as if they are natively integrated.<p>Unlike screen share solutions that upload your personal computer stream to participants, Hyperbeam’s multiplayer web browsers run on our own virtual machines. This eliminates the upload speed bottleneck that many users experience.<p>We host a Chromium browser instance on our server, record the video and audio output and stream it to all participants using WebRTC. That sounds simple, but hosting full-blown Chromium instances is challenging, especially doing it cost-effectively: what we learned is Chromium instances, at scale, love memory bandwidth a lot more than the amount of memory. Also, network unreliability, like last-mile packet loss, is also a problem, especially audio packet loss which is a lot more noticeable than video packet loss. A simple hack we have in place is literally sending every audio RTP packet twice, which improves audio quality drastically over spotty connections.<p>Anyone is welcome to get a free playground API key and try our product! Rather than spend time building a UI for that, we’ve just put up a Google Form in the spirit of do-things-that-don’t-scale. Go to <a href=\"https://forms.gle/RSQhbFXbdrcqwqsc9\" rel=\"nofollow\">https://forms.gle/RSQhbFXbdrcqwqsc9</a>, fill in your email and we promise to send you an API key right away. The API docs are here: <a href=\"https://showy-backpack-b3f.notion.site/Hyperbeam-API-eb9874bd1ef54c22ba7197324ce2223\" rel=\"nofollow\">https://showy-backpack-b3f.notion.site/Hyperbeam-API-eb9874b...</a>.<p>Pricing is not transparent on our website yet—we’re still working it out. However, we’re going to use the same business model as CPaaS companies such as Agora and Twilio. We’ll charge customers a minimum amount per month and provide a set amount of participant hours. If a customer exceeds the provided participant hours, we continue charging at a fixed rate.<p>If you want to try out tech in action, you can do that by signing up for free and creating a room using our original Hyperbeam watch party platform: <a href=\"https://hyperbeam.com/app/register\" rel=\"nofollow\">https://hyperbeam.com/app/register</a><p>We’re happy to answer any questions you have, and would love to hear your ideas for other potential use cases as well. Thanks!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "declan_g",
    "url": "https://news.ycombinator.com/user?id=declan_g"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30433104",
  "sameAs": "https://www.hyperbeam.dev/",
  "dateCreated": "2022-02-22T20:30:30.445Z",
  "datePublished": "2022-02-22T20:16:33.000Z",
  "dateModified": "2022-02-22T20:30:30.445Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 7
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "启动HN: Hyperbeam API (YC W22) - 任何网站的多人嵌入",
  "headline_zh-Hant": "啟動HN: Hyperbeam API (YC W22) - 任何網站的多人嵌入",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hi HN，我们是来自Hyperbeam（<a href=\"https://www.hyperbeam.dev\" rel=\"nofollow\">https://www.hyperbeam.dev</a>）的Philip、Amby和Declan。Hyperbeam是一个API，它使开发人员能够轻松地将实时多人游戏功能嵌入到他们的网络应用中--包括任何其他你想提供多人游戏访问的网络应用。<p>构建软件以实时连接人们是很难的。我们在大学时就经历过这种情况，当时我们建立了一个 \"观看聚会 \"网站，让人们一起观看电影（<a href=\"https://hyperbeam.com\" rel=\"nofollow\">https://hyperbeam.com</a>）。其他观看聚会的解决方案是不可靠的，因此我们花了两年时间来构建技术，使朋友们能够轻松地一起观看东西。<p>关键部分是一个 \"多人网络浏览器\"。我们指的是一个Chromium实例，它被嵌入到你自己的网络应用中（即网络浏览器的概念），它实际上被托管在一个服务器上，并通过WebRTC进行流式传输，因此可以被多个人同时共享和控制。<p>例如，假设你有一个在线辅导平台。教员可以在嵌入式 Web 浏览器中打开任何应用程序，然后与学生一起工作。<p>另一个用例是使非多人应用程序成为多人游戏。我们的一个客户希望在他们的产品中添加一个协作版本的 Google Slides，这样多个参与者就可以同时浏览幻灯片了。谷歌没有提供这方面的API，所以用户不得不进行屏幕共享，这不是多人游戏。有了Hyperbeam，你只需打开谷歌幻灯片的共享实例，然后多人就可以控制它。<p>不过，我们后来才了解到这些用例。发生的情况是，我们将 hyperbeam.com 发展到 15 万月度活跃用户和每月超过 100 万小时的视频，但后来它停止了增长。尽管如此，我们还是进入了YC，并很快有多家公司要求购买我们的多人浏览技术。在完成三笔交易后，我们决定将我们的多人网络浏览器作为API出售。这样，其他公司就可以建立产品来连接其他人，而不必像我们一样经历两年的WebRTC地狱。<p>我们允许开发人员通过几行代码将多人网络浏览器嵌入他们的网络应用中。然后，用户可以从该网络应用内部一起访问任何网站。开发人员可以指定控制权限，以编程方式导航到特定的URL，并隐藏浏览器的UI，使应用程序看起来就像它们是原生集成的一样。<p>与向参与者上传个人电脑流的屏幕共享解决方案不同，Hyperbeam的多人网络浏览器在我们自己的虚拟机上运行。<p>我们在服务器上托管一个Chromium浏览器实例，记录视频和音频输出，并使用WebRTC将其流传给所有参与者。这听起来很简单，但托管完整的 Chromium 实例是具有挑战性的，尤其是在成本效益方面：我们了解到，Chromium 实例在规模上对内存带宽的喜爱远远超过内存的数量。另外，网络不可靠，比如最后一公里的丢包，也是一个问题，尤其是音频丢包，比视频丢包要明显得多。我们有一个简单的黑客技术，就是把每个音频RTP数据包发送两次，这样就能在不稳定的连接中大幅提高音频质量。<p>欢迎任何人获得免费的游乐场API密钥并尝试我们的产品 Rather than spend time building a UI for that, we’ve just put up a Google Form in the spirit of do-things-that-don’t-scale. 请访问<a href=\"https://forms.gle/RSQhbFXbdrcqwqsc9\" rel=\"nofollow\">https://forms.gle/RSQhbFXbdrcqwqsc9</a>，填写您的电子邮件，我们承诺将立即向您发送一个API密钥。API的文档在这里。<a href=\"https://showy-backpack-b3f.notion.site/Hyperbeam-API-eb9874bd1ef54c22ba7197324ce2223\" rel=\"nofollow\">https://showy-backpack-b3f.notion.site/Hyperbeam-API-eb9874b...</a>。<p>定价在我们的网站上还不透明，我们仍在努力。然而，我们将采用与Agora和Twilio等CPaaS公司相同的商业模式。我们将向客户收取每月最低金额，并提供一定数量的参与时间。如果客户超过了所提供的参与小时数，我们将继续按固定费率收费。<p>如果你想在行动中尝试技术，你可以通过免费注册并使用我们最初的Hyperbeam观察聚会平台创建一个房间来实现。<a href=\"https://hyperbeam.com/app/register\" rel=\"nofollow\">https://hyperbeam.com/app/register</a><p>我们很乐意回答你的任何问题，并希望听到你对其他潜在用例的想法。谢谢!",
  "description_zh-Hant": "Hi HN，我們是來自Hyperbeam（<a href=\"https://www.hyperbeam.dev\" rel=\"nofollow\">https://www.hyperbeam.dev</a>）的Philip、Amby和Declan。Hyperbeam是一個API，它使開發人員能夠輕鬆地將實時多人遊戲功能嵌入到他們的網絡應用中--包括任何其他你想提供多人遊戲訪問的網絡應用。<p>構建軟件以實時連接人們是很難的。我們在大學時就經歷過這種情況，當時我們建立了一個 \"觀看聚會 \"網站，讓人們一起觀看電影（<a href=\"https://hyperbeam.com\" rel=\"nofollow\">https://hyperbeam.com</a>）。其他觀看聚會的解決方案是不可靠的，因此我們花了兩年時間來構建技術，使朋友們能夠輕鬆地一起觀看東西。<p>關鍵部分是一個 \"多人網絡瀏覽器\"。我們指的是一個Chromium實例，它被嵌入到你自己的網絡應用中（即網絡瀏覽器的概念），它實際上被託管在一個服務器上，並通過WebRTC進行流式傳輸，因此可以被多個人同時共享和控制。<p>例如，假設你有一個在線輔導平臺。教員可以在嵌入式 Web 瀏覽器中打開任何應用程序，然後與學生一起工作。<p>另一個用例是使非多人應用程序成為多人遊戲。我們的一個客戶希望在他們的產品中添加一個協作版本的 Google Slides，這樣多個參與者就可以同時瀏覽幻燈片了。谷歌沒有提供這方面的API，所以用戶不得不進行屏幕共享，這不是多人遊戲。有了Hyperbeam，你只需打開谷歌幻燈片的共享實例，然後多人就可以控制它。<p>不過，我們後來才瞭解到這些用例。發生的情況是，我們將 hyperbeam.com 發展到 15 萬月度活躍用戶和每月超過 100 萬小時的視頻，但後來它停止了增長。儘管如此，我們還是進入了YC，並很快有多家公司要求購買我們的多人瀏覽技術。在完成三筆交易後，我們決定將我們的多人網絡瀏覽器作為API出售。這樣，其他公司就可以建立產品來連接其他人，而不必像我們一樣經歷兩年的WebRTC地獄。<p>我們允許開發人員通過幾行代碼將多人網絡瀏覽器嵌入他們的網絡應用中。然後，用戶可以從該網絡應用內部一起訪問任何網站。開發人員可以指定控制權限，以編程方式導航到特定的URL，並隱藏瀏覽器的UI，使應用程序看起來就像它們是原生集成的一樣。<p>與向參與者上傳個人電腦流的屏幕共享解決方案不同，Hyperbeam的多人網絡瀏覽器在我們自己的虛擬機上運行。<p>我們在服務器上託管一個Chromium瀏覽器實例，記錄視頻和音頻輸出，並使用WebRTC將其流傳給所有參與者。這聽起來很簡單，但託管完整的 Chromium 實例是具有挑戰性的，尤其是在成本效益方面：我們瞭解到，Chromium 實例在規模上對內存帶寬的喜愛遠遠超過內存的數量。另外，網絡不可靠，比如最後一公里的丟包，也是一個問題，尤其是音頻丟包，比視頻丟包要明顯得多。我們有一個簡單的黑客技術，就是把每個音頻RTP數據包發送兩次，這樣就能在不穩定的連接中大幅提高音頻質量。<p>歡迎任何人獲得免費的遊樂場API密鑰並嘗試我們的產品 Rather than spend time building a UI for that, we’ve just put up a Google Form in the spirit of do-things-that-don’t-scale. 請訪問<a href=\"https://forms.gle/RSQhbFXbdrcqwqsc9\" rel=\"nofollow\">https://forms.gle/RSQhbFXbdrcqwqsc9</a>，填寫您的電子郵件，我們承諾將立即向您發送一個API密鑰。API的文檔在這裡。<a href=\"https://showy-backpack-b3f.notion.site/Hyperbeam-API-eb9874bd1ef54c22ba7197324ce2223\" rel=\"nofollow\">https://showy-backpack-b3f.notion.site/Hyperbeam-API-eb9874b...</a>。<p>定價在我們的網站上還不透明，我們仍在努力。然而，我們將採用與Agora和Twilio等CPaaS公司相同的商業模式。我們將向客戶收取每月最低金額，並提供一定數量的參與時間。如果客戶超過了所提供的參與小時數，我們將繼續按固定費率收費。<p>如果你想在行動中嘗試技術，你可以通過免費註冊並使用我們最初的Hyperbeam觀察聚會平臺創建一個房間來實現。<a href=\"https://hyperbeam.com/app/register\" rel=\"nofollow\">https://hyperbeam.com/app/register</a><p>我們很樂意回答你的任何問題，並希望聽到你對其他潛在用例的想法。謝謝!"
}