{
  "@type": "NewsArticle",
  "identifier": "2022--02--24--en--hackernews--HackerNews--NewsArticle--30448991",
  "url": "https://news.ycombinator.com/item?id=30448991",
  "headline": "Moonshot Brands (YC W21) Is Hiring",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "About Moonshot Brands<p>We are Moonshot Brands, a Y-combinator-backed company (W21) with $160M in debt and equity funding from leading Silicon Valley VC firms, including Victory Park Capital, Liquid 2 Ventures (Joe Montana), and Garage Capital. Among our founding team of MIT Sloan and Wharton graduates, we have operated and sold five businesses and have come together as Moonshot Brands to acquire, operate, and grow profitable e-commerce brands.<p>From our experience, we want to build the acquisition process that we wish we could have had and to provide the post-acquisition resources to grow your business to its fullest potential. As entrepreneurs ourselves, we believe in empowering our founders, giving them a stake in Moonshot’s continued success, and collaborating with an all-star team to change the e-commerce landscape. We connect our portfolio to growth capital, data, and expertise in operations, marketing, supply chain management, and product development to provide owner-operators with infrastructure to grow and compete at scale. Moonshot is building a technology-centric ecosystem to provide our portfolio with cutting-edge tools and data-driven insights to succeed in global marketplaces. From inventory forecasting to performance marketing and automation, we are building the technology that allows brands to achieve peak performance and win in their markets.<p>If you’d like to be part of this Moonshot which will be a fun fast-paced rocketship that will drive the future of e-commerce brands and you think you add significant value to our mission we’d love to hear from you.<p>About the Web Designer Position<p>Moonshots Brands is seeking an Ecommerce Web Designer extraordinaire. This person is an expert in designing for the shopify platform. You know what it takes to create excellent web experiences that actually convert.  In this role, you will be responsible for leading site-wide design improvements across our portfolio of brands, setting the gold standard of design execution, and transforming a visual identity into effective user experiences and landing pages. You will be accountable for maintaining, optimizing, deploying, and our customer-facing marketing websites. Collaborating with marketers, and stakeholders, you will capture requirements to build sites from concept all the way to completion, developing everything from the home page to site layout and function.<p>Web Designer Responsibilities<p>Lead the ideation and production of mockups and prototypes during the wireframing and design phases respectively.\nBuild beautiful websites and design engaging digital experiences that convert\nDesigning &amp; developing new Shopify stores using Shopify themes as the foundation\nAssisting in managing content on multiple brand websites\nGenerating new ideas to help improve user experience, mobile experience, load times, usability, average order value, conversion rates, and lead captures\nProvide UI design and direction for responsive digital experiences, then work closely with our production partners to produce the assets we need\nWork with our team to synthesize business objectives, brand strategy, identity, and marketing insights in order to develop high-fidelity wireframes that will guide our design processes\nCollaborate on and evolve information architecture and user experience flows\nPush the envelope by creating visual narratives on the web that are engaging, unique, and award-worthy by effectively balancing creativity and performance\nBe our internal expert on all things e-commerce, user experience, mobile usability \nSkills &amp; Experience<p>Be awesome at designing Shopify stores and have the portfolio to prove it \nProbably have 4+ years working in web design at an agency, startup, as a consultant, or similar environments, but we know excellence can be crafted within many environments",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "AllanFischMB",
    "url": "https://news.ycombinator.com/user?id=AllanFischMB"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30448991",
  "sameAs": "https://news.ycombinator.com/item?id=30448991",
  "dateCreated": "2022-02-24T01:52:25.666Z",
  "datePublished": "2022-02-24T01:00:07.000Z",
  "dateModified": "2022-02-24T01:52:25.666Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": null
    }
  ],
  "headline_zh-Hans": "月光品牌(YC W21)正在招聘人员",
  "headline_zh-Hant": "月光品牌(YC W21)正在招聘人員",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "关于Moonshot Brands<p>我们是Moonshot Brands，一家由Y-combinator支持的公司（W21），拥有1.6亿美元的债务和股权资金，来自硅谷领先的风险投资公司，包括Victory Park Capital、Liquid 2 Ventures（Joe Montana）和Garage Capital。在我们由麻省理工学院斯隆商学院和沃顿商学院毕业生组成的创始团队中，我们已经经营和出售了五家企业，并作为Moonshot Brands走到一起，收购、经营和发展盈利的电子商务品牌。<p>根据我们的经验，我们希望建立一个我们希望能够拥有的收购过程，并提供收购后的资源，使您的企业发展到最大潜力。作为企业家本身，我们相信要赋予创始人权力，让他们在Moonshot的持续成功中拥有股份，并与一个全明星团队合作，改变电子商务的格局。我们将我们的投资组合与增长资本、数据以及运营、营销、供应链管理和产品开发方面的专业知识联系起来，为业主经营者提供基础设施，以实现规模增长和竞争。Moonshot正在建立一个以技术为中心的生态系统，为我们的投资组合提供最先进的工具和数据驱动的洞察力，以便在全球市场上取得成功。从库存预测到绩效营销和自动化，我们正在建立技术，使品牌能够达到峰值性能，并在他们的市场中获胜。<p>如果你想成为Moonshot的一部分，这将是一个有趣的快节奏的火箭，将推动电子商务品牌的未来，你认为你为我们的使命增加了重要的价值，我们很想听到你的意见。<p>关于网页设计师职位<p>Moonshots Brands正在寻找一名电子商务网页设计师。这个人是一个为shopify平台设计的专家。你知道如何创造优秀的网络体验，使之真正转化。 在这个职位上，你将负责在我们的品牌组合中领导整个网站的设计改进，设定设计执行的黄金标准，并将视觉识别转化为有效的用户体验和登陆页面。你将负责维护、优化、部署和我们面向客户的营销网站。你将与营销人员和利益相关者合作，捕捉需求，从概念到完成，开发从主页到网站布局和功能的一切。<p>网页设计师的职责<p>在线框和设计阶段分别领导模拟和原型的构思和制作。\n建立美丽的网站，设计吸引人的数字体验，以实现转换\n设计&amp；使用Shopify主题作为基础，开发新的Shopify商店\n协助管理多个品牌网站的内容\n产生新的想法，以帮助改善用户体验，移动体验，加载时间，可用性，平均订单价值，转换率和线索捕获。\n为响应式数字体验提供UI设计和指导，然后与我们的生产伙伴紧密合作，制作我们需要的资产\n与我们的团队合作，综合业务目标、品牌战略、身份识别和营销洞察力，以开发高保真线框，指导我们的设计流程。\n协作并发展信息架构和用户体验流程\n通过有效地平衡创意和性能，在网络上创造出吸引人的、独特的和值得奖励的视觉叙事，从而推陈出新。\n成为我们在电子商务、用户体验和移动可用性方面的内部专家。\n技能和经验<p>在设计Shopify商店方面表现出色，并有作品集来证明这一点。\n可能有4年以上在机构、创业公司、顾问或类似环境中从事网页设计工作的经验，但我们知道在许多环境中都可以创造出卓越的作品。",
  "description_zh-Hant": "關於Moonshot Brands<p>我們是Moonshot Brands，一家由Y-combinator支持的公司（W21），擁有1.6億美元的債務和股權資金，來自硅谷領先的風險投資公司，包括Victory Park Capital、Liquid 2 Ventures（Joe Montana）和Garage Capital。在我們由麻省理工學院斯隆商學院和沃頓商學院畢業生組成的創始團隊中，我們已經經營和出售了五家企業，並作為Moonshot Brands走到一起，收購、經營和發展盈利的電子商務品牌。<p>根據我們的經驗，我們希望建立一個我們希望能夠擁有的收購過程，並提供收購後的資源，使您的企業發展到最大潛力。作為企業家本身，我們相信要賦予創始人權力，讓他們在Moonshot的持續成功中擁有股份，並與一個全明星團隊合作，改變電子商務的格局。我們將我們的投資組合與增長資本、數據以及運營、營銷、供應鏈管理和產品開發方面的專業知識聯繫起來，為業主經營者提供基礎設施，以實現規模增長和競爭。Moonshot正在建立一個以技術為中心的生態系統，為我們的投資組合提供最先進的工具和數據驅動的洞察力，以便在全球市場上取得成功。從庫存預測到績效營銷和自動化，我們正在建立技術，使品牌能夠達到峰值性能，並在他們的市場中獲勝。<p>如果你想成為Moonshot的一部分，這將是一個有趣的快節奏的火箭，將推動電子商務品牌的未來，你認為你為我們的使命增加了重要的價值，我們很想聽到你的意見。<p>關於網頁設計師職位<p>Moonshots Brands正在尋找一名電子商務網頁設計師。這個人是一個為shopify平臺設計的專家。你知道如何創造優秀的網絡體驗，使之真正轉化。 在這個職位上，你將負責在我們的品牌組合中領導整個網站的設計改進，設定設計執行的黃金標準，並將視覺識別轉化為有效的用戶體驗和登陸頁面。你將負責維護、優化、部署和我們面向客戶的營銷網站。你將與營銷人員和利益相關者合作，捕捉需求，從概念到完成，開發從主頁到網站佈局和功能的一切。<p>網頁設計師的職責<p>在線框和設計階段分別領導模擬和原型的構思和製作。\n建立美麗的網站，設計吸引人的數字體驗，以實現轉換\n設計&amp；使用Shopify主題作為基礎，開發新的Shopify商店\n協助管理多個品牌網站的內容\n產生新的想法，以幫助改善用戶體驗，移動體驗，加載時間，可用性，平均訂單價值，轉換率和線索捕獲。\n為響應式數字體驗提供UI設計和指導，然後與我們的生產夥伴緊密合作，製作我們需要的資產\n與我們的團隊合作，綜合業務目標、品牌戰略、身份識別和營銷洞察力，以開發高保真線框，指導我們的設計流程。\n協作並發展信息架構和用戶體驗流程\n通過有效地平衡創意和性能，在網絡上創造出吸引人的、獨特的和值得獎勵的視覺敘事，從而推陳出新。\n成為我們在電子商務、用戶體驗和移動可用性方面的內部專家。\n技能和經驗<p>在設計Shopify商店方面表現出色，並有作品集來證明這一點。\n可能有4年以上在機構、創業公司、顧問或類似環境中從事網頁設計工作的經驗，但我們知道在許多環境中都可以創造出卓越的作品。"
}