{
  "@type": "NewsArticle",
  "identifier": "2022--03--03--en--hackernews--HackerNews--NewsArticle--30532939",
  "url": "https://news.ycombinator.com/item?id=30532939",
  "headline": "Show HN: I made a cloud security product that actually saves time",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have been a Cloud Security Consultant for over 13 years and all that experience I put into building ARGOS Cloud Security.<p>Probably the most common thing I've seen was teams spending loads of time manually investigating alerts from security products. Detecting security issues is not what it’s ever been about, but about the investigation of these detected issues. If you don’t have time to investigate everything, then what’s the point?<p>Organizations spend time and money on security consultants to help them investigate their environments, but these are often only point-in-time engagements, where, once done, nothing &quot;reusable&quot; is left behind. The cloud environment might be in slightly better shape, but maybe only for a short period, before the next contractor must come in to start the process all over again.<p>I, and many others I've worked with, always believed that the most difficult part of cloud security is distinguishing security issues from &quot;just best practice violations&quot;. Using an &quot;everything must be compliant&quot; approach never really works and usually means things just don't get done. If everything is red, what do you do?<p>So, people spend immense amounts of time trying to figure out what cloud misconfigurations are actual security issues, what else is put at risk because of something that is misconfigured, and how it can be fixed. All that information is important to eventually prioritize and fix issues.<p>ARGOS investigates the things it finds, that's what it does. It's not about &quot;finding more&quot;, it's about understanding what misconfiguration is exposing a cloud system to the internet and what else in your cloud environment is that misconfiguration indirectly putting at risk.<p>One awesome side-effect of this is that we even draw something like an architecture diagram of the environment &quot;around the misconfigured resource&quot;. This specifically is something I know most past customers of mine lacked. Architecture diagrams were hard to come by, and never up to date.<p>It's easy to try out if you have access to a cloud environment like Azure or AWS, GCP is in a very early version right now. 20 minutes or less even is all it takes to get everything going, including a one-click Slack integration. First results should be in your dashboard minutes later and are continuously and automatically updated.<p>Really looking forward to people's feedback.\nThanks all!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "david_obrien",
    "url": "https://news.ycombinator.com/user?id=david_obrien"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30532939",
  "sameAs": "https://argos-security.io/",
  "dateCreated": "2022-03-03T04:55:42.421Z",
  "datePublished": "2022-03-02T20:51:22.000Z",
  "dateModified": "2022-03-03T04:55:42.421Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Show HN: 我做了一个真正能节省时间的云安全产品",
  "headline_zh-Hant": "Show HN: 我做了一個真正能節省時間的雲安全產品",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我已经做了13年的云安全顾问，所有这些经验都被我用于建立ARGOS云安全。<p>我所看到的最常见的事情是团队花费大量时间手动调查安全产品的警报。检测安全问题不是它的目的，而是对这些检测到的问题进行调查。如果你没有时间去调查所有的事情，那么还有什么意义呢？<p>组织花时间和金钱请安全顾问帮助他们调查他们的环境，但这些往往只是时间点的参与，一旦完成，没有留下任何可重复使用的东西。<p>我和其他许多与我合作过的人一直认为，云安全最困难的部分是区分安全问题和违反最佳实践的行为。使用&quot;一切都必须符合&quot;的方法从来没有真正发挥作用，通常意味着事情没有得到解决。因此，人们花了大量的时间试图弄清楚哪些云的错误配置是实际的安全问题，还有哪些东西因为错误配置而被置于风险之中，以及如何修复它。所有这些信息对于最终确定问题的优先次序和修复问题都很重要。<p>ARGOS调查它所发现的事情，这就是它的工作。<p>ARGOS 并不是要寻找更多的东西，而是要了解哪些错误的配置将云系统暴露在互联网上，以及在你的云环境中还有哪些错误的配置间接地将你置于风险之中。<p>这一点的一个令人敬畏的副作用是，我们甚至会围绕错误配置的资源绘制类似环境架构图的东西。我知道我过去的大多数客户都缺乏这样的东西。架构图很难得，而且从来没有更新过。<p>如果你能接触到Azure或AWS这样的云环境，就很容易试出来，GCP现在还处于非常早期的版本。甚至只需20分钟或更短的时间就能完成所有工作，包括一键式Slack整合。第一批结果应该在几分钟后出现在你的仪表板上，并持续自动更新。<p>真的很期待人们的反馈。\n谢谢大家!",
  "description_zh-Hant": "我已經做了13年的雲安全顧問，所有這些經驗都被我用於建立ARGOS雲安全。<p>我所看到的最常見的事情是團隊花費大量時間手動調查安全產品的警報。檢測安全問題不是它的目的，而是對這些檢測到的問題進行調查。如果你沒有時間去調查所有的事情，那麼還有什麼意義呢？<p>組織花時間和金錢請安全顧問幫助他們調查他們的環境，但這些往往只是時間點的參與，一旦完成，沒有留下任何可重複使用的東西。<p>我和其他許多與我合作過的人一直認為，雲安全最困難的部分是區分安全問題和違反最佳實踐的行為。使用&quot;一切都必須符合&quot;的方法從來沒有真正發揮作用，通常意味著事情沒有得到解決。因此，人們花了大量的時間試圖弄清楚哪些雲的錯誤配置是實際的安全問題，還有哪些東西因為錯誤配置而被置於風險之中，以及如何修復它。所有這些信息對於最終確定問題的優先次序和修復問題都很重要。<p>ARGOS調查它所發現的事情，這就是它的工作。<p>ARGOS 並不是要尋找更多的東西，而是要了解哪些錯誤的配置將雲系統暴露在互聯網上，以及在你的雲環境中還有哪些錯誤的配置間接地將你置於風險之中。<p>這一點的一個令人敬畏的副作用是，我們甚至會圍繞錯誤配置的資源繪製類似環境架構圖的東西。我知道我過去的大多數客戶都缺乏這樣的東西。架構圖很難得，而且從來沒有更新過。<p>如果你能接觸到Azure或AWS這樣的雲環境，就很容易試出來，GCP現在還處於非常早期的版本。甚至只需20分鐘或更短的時間就能完成所有工作，包括一鍵式Slack整合。第一批結果應該在幾分鐘後出現在你的儀表板上，並持續自動更新。<p>真的很期待人們的反饋。\n謝謝大家!"
}