{
  "@type": "NewsArticle",
  "identifier": "2022--06--08--en--hackernews--HackerNews--NewsArticle--31668788",
  "url": "https://news.ycombinator.com/item?id=31668788",
  "headline": "Ask HN: Co-Founder pivoting, what are my options?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello, a co-founder and I started a company in December of 2021. We’ve built an MVP that runs well, and have created a lot of content and built a presence in the community we aim to solve a problem for. We do not have any paying customers or a meaningful non-paying user base.<p>My co-founder has written all of the code, I have been responsible for leading growth, marketing, content creation, and have been central to product development/design/mockups etc (while not writing code). We signed a founders agreement, we each have a seat on the board, and he holds a majority of shares. None of our shares have vested - my first vesting date is in 6 months when ¼ of my shares vest.<p>My co-founder has decided he wants to pivot to what I view as an entirely new business that has little to do with the problem or mission we set off to address. We set out to build a product that solves a problem, and he has decided to start a staffing agency. He is quite “failure-averse”, and while I can understand he believes a staffing agency may have a higher likelihood of success, it is uninteresting to me and I don’t believe it is a good use of my time.<p>As we have only been trying this for a short period, I am still interested in pursuing our initial idea and seeing if I can make it work.<p>My co-founder has said he would be fine with me pursuing the initial idea as an entirely separate venture. The code is not proprietary in nature, it supports a very simple workflow and presents basic data. As I am not technical enough to re-create the product myself, it would be time/resource intensive to build something similar from scratch. When I asked my co-founder for rights to use the existing code in my new venture, he refused, citing concerns over sharing IP.<p>I have dedicated myself to this mission for the past 6 months (which I recognize is relatively short), and don’t love the idea of walking away with nothing to show for my time - but is that my only option?<p>Really appreciate any insights from anyone who has been through something like this or has any thoughts. Will answer any questions that might come up. Thank you very much for reading.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "weusedto",
    "url": "https://news.ycombinator.com/user?id=weusedto"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31668788",
  "sameAs": "https://news.ycombinator.com/item?id=31668788",
  "dateCreated": "2022-06-08T16:37:55.599Z",
  "datePublished": "2022-06-08T15:27:43.000Z",
  "dateModified": "2022-06-08T16:37:55.599Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 25
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 24
    }
  ],
  "headline_zh-Hans": "Ask HN: 联合创始人的支点，我有什么选择？\n",
  "headline_zh-Hant": "Ask HN: 聯合創始人的支點，我有什麼選擇？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，我和一位联合创始人在2021年12月创办了一家公司。我们已经建立了一个运行良好的MVP，并创建了大量的内容，在我们旨在解决问题的社区中建立了一个存在。我们没有任何付费客户或有意义的非付费用户群。<p>我的联合创始人写了所有的代码，我一直负责领导增长、营销、内容创作，并且一直是产品开发/设计/模型等的核心（同时不写代码）。我们签署了一份创始人协议，我们在董事会都有一个席位，他持有大部分股份。我们的股份都没有归属--我的第一个归属日期是在6个月后，届时我的1/4股份将归属。<p>我的联合创始人决定他要转向我认为是一个全新的业务，与我们开始解决的问题或使命没有什么关系。我们的出发点是建立一个能解决问题的产品，而他却决定开办一家人事代理公司。他相当 \"厌恶失败\"，虽然我可以理解他认为人事代理可能会有更大的成功可能性，但这对我来说毫无意义，我认为这不是对我时间的良好利用。<p>由于我们只尝试了很短的时间，我仍然有兴趣追求我们最初的想法，看看我是否能使它成功。<p>我的联合创始人说他可以接受我将最初的想法作为一个完全独立的企业来进行。该代码在性质上不是专有的，它支持一个非常简单的工作流程，并呈现基本数据。由于我的技术水平不足以自己重新创建产品，从头开始建立类似的东西将需要大量时间/资源。当我向我的联合创始人要求在我的新企业中使用现有的代码时，他拒绝了，理由是担心分享知识产权。<p>在过去的6个月里，我一直致力于这项任务（我认识到这是相对较短的时间），并且不喜欢在离开时一无所获的想法--但这是我唯一的选择吗？<p>非常感谢任何经历过这样的事情或有任何想法的人的见解。我将回答任何可能出现的问题。非常感谢您的阅读。\n",
  "description_zh-Hant": "你好，我和一位聯合創始人在2021年12月創辦了一家公司。我們已經建立了一個運行良好的MVP，並創建了大量的內容，在我們旨在解決問題的社區中建立了一個存在。我們沒有任何付費客戶或有意義的非付費用戶群。<p>我的聯合創始人寫了所有的代碼，我一直負責領導增長、營銷、內容創作，並且一直是產品開發/設計/模型等的核心（同時不寫代碼）。我們簽署了一份創始人協議，我們在董事會都有一個席位，他持有大部分股份。我們的股份都沒有歸屬--我的第一個歸屬日期是在6個月後，屆時我的1/4股份將歸屬。<p>我的聯合創始人決定他要轉向我認為是一個全新的業務，與我們開始解決的問題或使命沒有什麼關係。我們的出發點是建立一個能解決問題的產品，而他卻決定開辦一家人事代理公司。他相當 \"厭惡失敗\"，雖然我可以理解他認為人事代理可能會有更大的成功可能性，但這對我來說毫無意義，我認為這不是對我時間的良好利用。<p>由於我們只嘗試了很短的時間，我仍然有興趣追求我們最初的想法，看看我是否能使它成功。<p>我的聯合創始人說他可以接受我將最初的想法作為一個完全獨立的企業來進行。該代碼在性質上不是專有的，它支持一個非常簡單的工作流程，並呈現基本數據。由於我的技術水平不足以自己重新創建產品，從頭開始建立類似的東西將需要大量時間/資源。當我向我的聯合創始人要求在我的新企業中使用現有的代碼時，他拒絕了，理由是擔心分享知識產權。<p>在過去的6個月裡，我一直致力於這項任務（我認識到這是相對較短的時間），並且不喜歡在離開時一無所獲的想法--但這是我唯一的選擇嗎？<p>非常感謝任何經歷過這樣的事情或有任何想法的人的見解。我將回答任何可能出現的問題。非常感謝您的閱讀。\n"
}