{
  "@type": "NewsArticle",
  "identifier": "2022--04--16--en--hackernews--HackerNews--NewsArticle--31038133",
  "url": "https://news.ycombinator.com/item?id=31038133",
  "headline": "Ask HN: What should I bring up during salary negotiation as a junior developer?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So i am a junior software developer in a large consultant company and have my first salary negotitations soon and need some help.<p>I was told all juniors would increase the same in a sort of collective way since some did not get the same chances when it came to projects and performance, however my boss said there was a small change they would consider giving a larger raise based on performance.<p>I have been lucky and got a very good project, as in I could show my strengths and it's a high value customer. During the project i took a lot of initiative and responsibility, we were 3 developers working on it (2 seniors and me) and luckily one of them is my boss. The project is now being used by the customer and I am the only one maintaining the project and feeling I have taken even more responsibility than was expected.<p>The project was fairly large consisting of 2 frontends and one backend, where I made ~80% of both the frontends and did all the database work on the backend. To be honest being told that my performance wont impact my salary is kind of a bummer considering i have to wait another year for the next possible raise. I can see myself working here for some time, but i feel like saying that would make them feel like they can pay me less as im not going to leave in the foreseeable future.<p>The project is now also being used as a reference to sell consultants to other customers and it has also garnered attention in nationwide news.<p>So my question to you is how should approach the salary negotiation and how should i present my case to my boss?<p>Sorry if this is incoherent, english is not my first language. Thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "_lgj5",
    "url": "https://news.ycombinator.com/user?id=_lgj5"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31038133",
  "sameAs": "https://news.ycombinator.com/item?id=31038133",
  "dateCreated": "2022-04-16T18:36:07.110Z",
  "datePublished": "2022-04-15T09:27:55.000Z",
  "dateModified": "2022-04-16T18:36:07.110Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 7
    }
  ],
  "headline_zh-Hans": "Ask HN: 作为一名初级开发人员，我应该在薪酬谈判中提出什么？",
  "headline_zh-Hant": "Ask HN: 作為一名初級開發人員，我應該在薪酬談判中提出什麼？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一家大型咨询公司的初级软件开发人员，很快就要进行第一次工资谈判，需要一些帮助。<p>我被告知所有初级人员都会以一种集体的方式增加，因为有些人在项目和业绩方面没有得到同样的机会，但是我的老板说有一个小变化，他们会考虑根据业绩给予更大的加薪。在这个项目中，我发挥了很大的主动性和责任感，我们有三个开发人员在做这个项目（两个前辈和我），幸运的是其中一个是我的老板。这个项目现在被客户使用，我是唯一一个维护这个项目的人，我觉得自己承担了比预期更多的责任。<p>这个项目相当大，包括两个前端和一个后端，其中我做了两个前端的80%，并在后端做了所有的数据库工作。说实话，被告知我的表现不会影响我的薪水，这有点令人沮丧，因为我还得再等一年才有可能加薪。我可以看到自己在这里工作了一段时间，但我觉得这样说会让他们觉得他们可以少付我一些钱，因为我在可预见的未来不会离开。<p>这个项目现在也被用作向其他客户推销顾问的参考，它也获得了全国性新闻的关注。<p>所以我向你提问，应该如何处理薪酬谈判，我应该如何向老板陈述我的情况？谢谢。",
  "description_zh-Hant": "我是一家大型諮詢公司的初級軟件開發人員，很快就要進行第一次工資談判，需要一些幫助。<p>我被告知所有初級人員都會以一種集體的方式增加，因為有些人在項目和業績方面沒有得到同樣的機會，但是我的老闆說有一個小變化，他們會考慮根據業績給予更大的加薪。在這個項目中，我發揮了很大的主動性和責任感，我們有三個開發人員在做這個項目（兩個前輩和我），幸運的是其中一個是我的老闆。這個項目現在被客戶使用，我是唯一一個維護這個項目的人，我覺得自己承擔了比預期更多的責任。<p>這個項目相當大，包括兩個前端和一個後端，其中我做了兩個前端的80%，並在後端做了所有的數據庫工作。說實話，被告知我的表現不會影響我的薪水，這有點令人沮喪，因為我還得再等一年才有可能加薪。我可以看到自己在這裡工作了一段時間，但我覺得這樣說會讓他們覺得他們可以少付我一些錢，因為我在可預見的未來不會離開。<p>這個項目現在也被用作向其他客戶推銷顧問的參考，它也獲得了全國性新聞的關注。<p>所以我向你提問，應該如何處理薪酬談判，我應該如何向老闆陳述我的情況？謝謝。"
}