{
  "@type": "NewsArticle",
  "identifier": "2022--07--30--en--hackernews--HackerNews--NewsArticle--32285573",
  "url": "https://news.ycombinator.com/item?id=32285573",
  "headline": "Tell HN: Banned site-wide from Reddit for helping a fellow mod fight hate speech",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been using reddit almost daily for well over a year now, both as a moderator and as a user. To keep it short, moderators on Reddit use an official bot called u/AutoModerator that is primarily used to automatically perform a set of actions when certain keywords are used.<p>The problem with this bot is that it's not user-friendly at all, so even to make it do the most basic action you need to read the documentation. Since most people are to lazy to read it, there's an official subreddit called r/AutoModerator to let people ask and answer questions about it, and I've been fairly active there.<p>6 days ago, I came across a post from a user that didn't understand why their AutoMod code wasn't working. I asked them to send me the code, and when they did I fixed it by simply adding two square brackets around the keywords. The code they were trying to make would remove comments that contained some common racist words. After I send them the working code, they thanked me for being helpful and added it to their own AutoMod configuration.<p>6 days after that, I receive a primave message from the official Reddit account saying:<p>&gt; You’ve been banned from Reddit for three days for violating Reddit’s rule against promoting hate in the following content.\n&gt; Link to reported content: https://new.reddit.com/r/AutoModerator/comments/w5l6sd/comment/ihhhqi2/\n&gt; Reddit is a place for creating community and belonging, not for attacking marginalized or vulnerable groups of people. We don’t tolerate promoting hate based on identity or vulnerability, and any communities or people that encourage or incite violence or hate towards marginalized or vulnerable groups will be banned.<p>Reddit literally site-wide banned me, an active moderator of 7+ communities, for helping a fellow moderator remove racist comments in their own community. The reason? &quot;Promoting hate based on identity or vulnerability&quot;. No good deed goes unpunished, I guess<p>I have already submitted a ban appeal and I'm currently waiting for a response. Feel free to ask any questions in the comments, since I can't use Reddit I have a lot of time to answer them...",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "FaviFake",
    "url": "https://news.ycombinator.com/user?id=FaviFake"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32285573",
  "sameAs": "https://news.ycombinator.com/item?id=32285573",
  "dateCreated": "2022-07-30T10:58:53.022Z",
  "datePublished": "2022-07-30T10:05:58.000Z",
  "dateModified": "2022-07-30T10:58:53.022Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 8
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "告诉HN：因帮助同僚打击仇恨言论而被Reddit全站封杀\n",
  "headline_zh-Hant": "告訴HN：因幫助同僚打擊仇恨言論而被Reddit全站封殺\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我几乎每天都在使用Reddit，已经有一年多了，无论是作为版主还是作为用户。简而言之，Reddit上的版主使用一个名为u/AutoModerator的官方机器人，主要用于在使用某些关键词时自动执行一系列操作。<p>这个机器人的问题是，它根本不方便用户使用，所以即使要让它做最基本的动作，你也需要阅读文档。由于大多数人都懒得去读，所以有一个官方的subreddit叫r/AutoModerator，让人们询问和回答有关它的问题，我在那里相当活跃。<p>6天前，我看到一个用户的帖子，他不明白为什么他们的AutoMod代码不工作。我让他们把代码发给我，当他们把代码发给我时，我只是在关键词周围加了两个方括号，就解决了这个问题。他们想做的代码将删除包含一些常见的种族主义词汇的评论。在我把工作代码发给他们后，他们感谢我的帮助，并把它添加到他们自己的AutoMod配置中。<p>6天后，我收到来自Reddit官方账户的primave消息说：<p>&gt; 你已经被Reddit禁止三天了，因为你在以下内容中违反了Reddit禁止宣传仇恨的规定。\n&gt; 被举报内容的链接：https://new.reddit.com/r/AutoModerator/comments/w5l6sd/comment/ihhhqi2/\n&gt; Reddit是一个创造社区和归属感的地方，而不是攻击边缘化或弱势人群的地方。我们不容忍鼓吹基于身份或弱势的仇恨，任何鼓励或煽动对边缘化或弱势群体的暴力或仇恨的社区或人都将被禁止。<p>Reddit在全站范围内禁止了我，一个7个以上社区的活跃版主，因为我帮助其他版主删除了他们自己社区中的种族主义言论。原因是什么？&quot;促进基于身份或弱点的仇恨&quot;。我想，没有什么好事是不受惩罚的<p>我已经提交了禁言上诉，目前正在等待答复。欢迎在评论中提出任何问题，因为我不能使用Reddit，我有很多时间来回答他们...\n",
  "description_zh-Hant": "我幾乎每天都在使用Reddit，已經有一年多了，無論是作為版主還是作為用戶。簡而言之，Reddit上的版主使用一個名為u/AutoModerator的官方機器人，主要用於在使用某些關鍵詞時自動執行一系列操作。<p>這個機器人的問題是，它根本不方便用戶使用，所以即使要讓它做最基本的動作，你也需要閱讀文檔。由於大多數人都懶得去讀，所以有一個官方的subreddit叫r/AutoModerator，讓人們詢問和回答有關它的問題，我在那裡相當活躍。<p>6天前，我看到一個用戶的帖子，他不明白為什麼他們的AutoMod代碼不工作。我讓他們把代碼發給我，當他們把代碼發給我時，我只是在關鍵詞周圍加了兩個方括號，就解決了這個問題。他們想做的代碼將刪除包含一些常見的種族主義詞彙的評論。在我把工作代碼發給他們後，他們感謝我的幫助，並把它添加到他們自己的AutoMod配置中。<p>6天后，我收到來自Reddit官方賬戶的primave消息說：<p>&gt; 你已經被Reddit禁止三天了，因為你在以下內容中違反了Reddit禁止宣傳仇恨的規定。\n&gt; 被舉報內容的鏈接：https://new.reddit.com/r/AutoModerator/comments/w5l6sd/comment/ihhhqi2/\n&gt; Reddit是一個創造社區和歸屬感的地方，而不是攻擊邊緣化或弱勢人群的地方。我們不容忍鼓吹基於身份或弱勢的仇恨，任何鼓勵或煽動對邊緣化或弱勢群體的暴力或仇恨的社區或人都將被禁止。<p>Reddit在全站範圍內禁止了我，一個7個以上社區的活躍版主，因為我幫助其他版主刪除了他們自己社區中的種族主義言論。原因是什麼？&quot;促進基於身份或弱點的仇恨&quot;。我想，沒有什麼好事是不受懲罰的<p>我已經提交了禁言上訴，目前正在等待答覆。歡迎在評論中提出任何問題，因為我不能使用Reddit，我有很多時間來回答他們...\n"
}