{
  "@type": "NewsArticle",
  "identifier": "2022--04--26--en--hackernews--HackerNews--NewsArticle--31167368",
  "url": "https://news.ycombinator.com/item?id=31167368",
  "headline": "Launch HN: Kraftful (YC S19) – UX Analytics for IoT Products",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN, I’m Yana from Kraftful (<a href=\"https://kraftful.com\" rel=\"nofollow\">https://kraftful.com</a>). We’re an analytics product that helps IoT companies make their apps and displays more usable.<p>As you’ve probably noticed, everything is becoming internet connected: home appliances, furniture, exercise equipment, toys. But it’s often done in a clumsy, unusable, or unnecessary way—IoT toasters, anybody? Hardware companies haven’t yet figured out where connectivity makes sense and where it doesn’t. At the same time, some great use cases are beginning to emerge for elder care, micro mobility, preventative care, energy saving, and more.<p>I ran into this problem as head of product at IFTTT, working with the makers of hundreds of connected devices. Unfortunately, the apps and displays that control these products tend to have terrible usability, especially for less technical people. Hardware companies don't understand how to use data to track how their products are used, where they have usability problems, and how to fix them. The usability methods developed at software companies haven't made it into their universe. In particular, they hardly ever use analytics tools because those require lots of configuration, and IoT PMs have more than software and UX on their plate. If they use anything, it’s usually Google Analytics because it’s pre-configured. But when they want to answer IoT specific questions (like where users get stuck when they try to connect the device), PMs need to export the data and query it outside of Google Analytics. Most of them don’t know how to do that and don’t have time.<p>When I was at IFTTT, I would hear from IoT PMs that even when they’d sell millions of connected devices with a recognizable brand, only a few thousand people would ever use the product as a connected device via the app. I wanted to help them get to the root of the problem: How many people tried to connect the device? How far did they get? Which connected features did users care about most and are those features easily discoverable? I was surprised that hardware companies, big and small, couldn’t answer such questions.<p>I’m sure some of you are thinking: do hardware companies really need more data? But often they’re stuck in the worst of both worlds: product design that enables invasive data collection, while not even using non-invasive anonymous events to improve the experience.<p>Our goal is to provide IoT companies with everything they need to make their products usable by everyone without collecting unnecessary data beyond anonymous events. I’m particularly passionate about protecting user rights. In a prior life, I drove the rollout of HTTPS by default across Wikipedia and worked with privacy at EFF. As we continue developing the product, I want to think through how to nudge the IoT industry in the right direction.<p>Today, we provide a pre-configured dashboard with metrics that matter for IoT experiences, like device connection success rate. The dashboard includes usability recommendations for how to improve the experience based on the data and industry benchmarks to show how the experience compares to other connected devices.<p>For example, our dashboard shows where users drop off when using a device for the first time. If users struggle connecting the device in the app, the PM can read about how to simplify the connection flow (like avoiding app permissions not needed to connect the device and any configuration before the device is connected). They can track whether adoption goes up after they make improvements. They can also track how frequently people use different features in the app and learn where to move features so the experience becomes more intuitive. If they need to do a drill down on something beyond our pre-configured charts, they can create a custom chart directly in the dashboard. No need to export data or write queries.<p>The dashboard is based on anonymized events tracked by an SDK embedded in mobile apps that control the hardware. It does not analyze events from the hardware itself, like sensor data.<p>We also surface feedback from app store reviews to contextualize the data. IoT PMs can analyze reviews of their own apps or other apps from their industry and get GPT-3 powered summaries of common complaints, features requests, and how users’ general sentiment changes in response to app releases. The idea behind this feature is to give PMs more product insights and identify areas for improvement without burdening users with UX surveys or waiting until things are so bad that complaints bubble up from customer support calls. (Part of this is still in development and will launch shortly.)<p>I’m excited to get your thoughts on what we’re building! I recorded a short video to show you how the interaction data shows up in the dashboard: <a href=\"https://www.youtube.com/watch?v=hndsQzowic0\" rel=\"nofollow\">https://www.youtube.com/watch?v=hndsQzowic0</a>. If you have a connected device app to try out with the SDK, feel free to pick a free trial on the plans page. Eager to hear everyone’s comments and feedback in the thread!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "yana",
    "url": "https://news.ycombinator.com/user?id=yana"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31167368",
  "sameAs": "https://news.ycombinator.com/item?id=31167368",
  "dateCreated": "2022-04-26T14:10:00.467Z",
  "datePublished": "2022-04-26T13:43:54.000Z",
  "dateModified": "2022-04-26T14:10:00.467Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 10
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Launch HN: Kraftful (YC S19) - 物联网产品的用户体验分析",
  "headline_zh-Hant": "Launch HN: Kraftful (YC S19) - 物聯網產品的用戶體驗分析",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，我是来自Kraftful（<a href=\"https://kraftful.com\" rel=\"nofollow\">https://kraftful.com</a>）的Yana。我们是一个分析产品，帮助物联网公司使他们的应用程序和显示器更易于使用。<p>正如你可能已经注意到的那样，所有东西都开始与互联网连接：家用电器、家具、运动器材、玩具。但是，这往往是以一种笨拙的、无法使用的或不必要的方式进行的，有人说是物联网烤面包机吗？硬件公司还没有弄清楚哪里的连接有意义，哪里的连接没有意义。同时，在老年人护理、微型移动性、预防性护理、节能等方面开始出现一些伟大的用例。<p>我在IFTTT担任产品主管时遇到了这个问题，与数百个连接设备的制造商合作。不幸的是，控制这些产品的应用程序和显示器往往具有糟糕的可用性，特别是对于技术水平较低的人来说。硬件公司不了解如何使用数据来跟踪他们的产品是如何被使用的，哪里有可用性问题，以及如何解决这些问题。在软件公司开发的可用性方法还没有进入他们的世界。特别是，他们几乎不使用分析工具，因为这些工具需要大量的配置，而物联网项目管理人员的任务不仅仅是软件和用户体验。如果他们使用任何东西，通常是谷歌分析，因为它是预先配置的。但当他们想回答物联网的具体问题时（比如用户在尝试连接设备时被卡住的地方），PM需要导出数据并在Google Analytics之外查询。<p>当我在IFTTT工作时，我从物联网PM那里听说，即使他们卖出了数百万个具有公认品牌的连接设备，也只有几千人通过应用程序将产品作为连接设备使用。我想帮助他们找到问题的根源：有多少人试图连接设备？他们走了多远？用户最关心哪些连接功能，这些功能是否容易被发现？我很惊讶，大大小小的硬件公司都无法回答这样的问题。<p>我相信你们中的一些人在想：硬件公司真的需要更多数据吗？但他们往往陷入了两难境地：产品设计实现了侵入性的数据收集，同时甚至没有使用非侵入性的匿名事件来改善体验。<p>我们的目标是为物联网公司提供他们所需要的一切，使他们的产品能够为每个人所用，而不会收集匿名事件以外的不必要的数据。我特别热衷于保护用户权利。在之前的生活中，我推动了HTTPS在整个维基百科的推广，并在EFF从事隐私工作。随着我们继续开发该产品，我希望思考如何促使物联网行业朝着正确的方向发展。<p>今天，我们提供了一个预配置的仪表板，其中包含对物联网体验很重要的指标，如设备连接成功率。该仪表板包括关于如何根据数据和行业基准改善体验的可用性建议，以显示体验与其他连接设备的比较。<p>例如，我们的仪表板显示了用户在首次使用设备时的落差。如果用户在应用中连接设备时遇到困难，PM可以阅读如何简化连接流程（如避免连接设备时不需要的应用权限，以及在设备连接前的任何配置）。他们可以跟踪在他们做出改进后，采用率是否上升。他们还可以跟踪人们使用应用程序中不同功能的频率，并学习在哪里移动功能，使体验变得更加直观。如果他们需要对我们预先配置的图表以外的东西进行钻研，他们可以直接在仪表盘中创建一个自定义图表。<p>该仪表板基于嵌入控制硬件的移动应用程序的SDK所追踪的匿名事件。它不分析来自硬件本身的事件，如传感器数据。<p>我们还浮现了来自应用商店评论的反馈，以使数据具有背景意义。物联网项目管理人员可以分析他们自己的应用程序或其行业的其他应用程序的评论，并获得GPT-3驱动的常见投诉、功能要求以及用户的总体情绪如何因应用程序的发布而变化的摘要。这个功能背后的想法是给PM提供更多的产品洞察力，并确定需要改进的地方，而不需要买单。",
  "description_zh-Hant": "嗨，HN，我是來自Kraftful（<a href=\"https://kraftful.com\" rel=\"nofollow\">https://kraftful.com</a>）的Yana。我們是一個分析產品，幫助物聯網公司使他們的應用程序和顯示器更易於使用。<p>正如你可能已經注意到的那樣，所有東西都開始與互聯網連接：家用電器、傢俱、運動器材、玩具。但是，這往往是以一種笨拙的、無法使用的或不必要的方式進行的，有人說是物聯網烤麵包機嗎？硬件公司還沒有弄清楚哪裡的連接有意義，哪裡的連接沒有意義。同時，在老年人護理、微型移動性、預防性護理、節能等方面開始出現一些偉大的用例。<p>我在IFTTT擔任產品主管時遇到了這個問題，與數百個連接設備的製造商合作。不幸的是，控制這些產品的應用程序和顯示器往往具有糟糕的可用性，特別是對於技術水平較低的人來說。硬件公司不瞭解如何使用數據來跟蹤他們的產品是如何被使用的，哪裡有可用性問題，以及如何解決這些問題。在軟件公司開發的可用性方法還沒有進入他們的世界。特別是，他們幾乎不使用分析工具，因為這些工具需要大量的配置，而物聯網項目管理人員的任務不僅僅是軟件和用戶體驗。如果他們使用任何東西，通常是谷歌分析，因為它是預先配置的。但當他們想回答物聯網的具體問題時（比如用戶在嘗試連接設備時被卡住的地方），PM需要導出數據並在Google Analytics之外查詢。<p>當我在IFTTT工作時，我從物聯網PM那裡聽說，即使他們賣出了數百萬個具有公認品牌的連接設備，也只有幾千人通過應用程序將產品作為連接設備使用。我想幫助他們找到問題的根源：有多少人試圖連接設備？他們走了多遠？用戶最關心哪些連接功能，這些功能是否容易被發現？我很驚訝，大大小小的硬件公司都無法回答這樣的問題。<p>我相信你們中的一些人在想：硬件公司真的需要更多數據嗎？但他們往往陷入了兩難境地：產品設計實現了侵入性的數據收集，同時甚至沒有使用非侵入性的匿名事件來改善體驗。<p>我們的目標是為物聯網公司提供他們所需要的一切，使他們的產品能夠為每個人所用，而不會收集匿名事件以外的不必要的數據。我特別熱衷於保護用戶權利。在之前的生活中，我推動了HTTPS在整個維基百科的推廣，並在EFF從事隱私工作。隨著我們繼續開發該產品，我希望思考如何促使物聯網行業朝著正確的方向發展。<p>今天，我們提供了一個預配置的儀表板，其中包含對物聯網體驗很重要的指標，如設備連接成功率。該儀表板包括關於如何根據數據和行業基準改善體驗的可用性建議，以顯示體驗與其他連接設備的比較。<p>例如，我們的儀表板顯示了用戶在首次使用設備時的落差。如果用戶在應用中連接設備時遇到困難，PM可以閱讀如何簡化連接流程（如避免連接設備時不需要的應用權限，以及在設備連接前的任何配置）。他們可以跟蹤在他們做出改進後，採用率是否上升。他們還可以跟蹤人們使用應用程序中不同功能的頻率，並學習在哪裡移動功能，使體驗變得更加直觀。如果他們需要對我們預先配置的圖表以外的東西進行鑽研，他們可以直接在儀表盤中創建一個自定義圖表。<p>該儀表板基於嵌入控制硬件的移動應用程序的SDK所追蹤的匿名事件。它不分析來自硬件本身的事件，如傳感器數據。<p>我們還浮現了來自應用商店評論的反饋，以使數據具有背景意義。物聯網項目管理人員可以分析他們自己的應用程序或其行業的其他應用程序的評論，並獲得GPT-3驅動的常見投訴、功能要求以及用戶的總體情緒如何因應用程序的發佈而變化的摘要。這個功能背後的想法是給PM提供更多的產品洞察力，並確定需要改進的地方，而不需要買單。"
}