{
  "@type": "NewsArticle",
  "identifier": "2022--07--22--en--hackernews--HackerNews--NewsArticle--32193016",
  "url": "https://news.ycombinator.com/item?id=32193016",
  "headline": "Ask HN: Remote work credit? I built an app that the company thinks my boss built",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So long story short, I was in Bali just before COVID and decided to stick around...for 3 years. After freelancing as a designer/developer for nearly a decade I decided to look for a remote job - cuz why the fuck not everyone was hiring remote. I applied and got a job posted for 'hybrid' work - took 2 months to convince them I would do the work and come back in the summer (traditional finance company not used to remote ).<p>Over the past 3 months, I solo built an entire application from scratch that was presented to the Board 3 times which my boss says they're all ecstatic about. He mentioned the head of the project doesn't know I exist - thinks my boss made the entire thing. CEO, President, etc. all know about the project and are excited about 'my bosses project'. Basically the head of the project passed on sketches and screenshots of excel sheets which my boss would give me one sentence of what to build, no design. Usually, I don't give a fuck but it's different as a freelancer working directly with clients - definitely stings the ego thinking I was part of the company and having put in all the effort. Have I been freelancing so long I just forgot that's how office work hierarchy goes? Kinda makes me wanna say  and go back to freelancing.<p>I'm moving back to NJ to be 'hybrid' beginning of August...Do I mention to the head of the project the first time I meet him that I built the entire app or just let my boss have his glory and mention I'm on the team that helped build it?  Don't want bad blood with the boss as he's a nice guy and gives me freedom, but don't mind if I need to find another job as I'm not stoked on this company and I'm financially stable.<p>I guess more generally...do more people in remote companies also feel not being acknowledged for their work?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pmanning11",
    "url": "https://news.ycombinator.com/user?id=pmanning11"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32193016",
  "sameAs": "https://news.ycombinator.com/item?id=32193016",
  "dateCreated": "2022-07-22T16:41:27.836Z",
  "datePublished": "2022-07-22T15:28:08.000Z",
  "dateModified": "2022-07-22T16:41:27.836Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 21
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 23
    }
  ],
  "headline_zh-Hans": "Ask HN: 远程工作的功劳？我做了一个应用程序，公司认为是我的老板做的\n",
  "headline_zh-Hant": "Ask HN: 遠程工作的功勞？我做了一個應用程序，公司認為是我的老闆做的\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "因此，长话短说，我在巴厘岛就在COVID之前，并决定坚持...3年。在做了近十年的自由设计师/开发人员后，我决定寻找一份远程工作--因为为什么他妈的不是每个人都在招聘远程人员。我申请并得到了一个 \"混合 \"工作的职位--花了2个月的时间说服他们我愿意做这个工作并在夏天回来（传统的金融公司不习惯远程工作）。<p>在过去的3个月里，我独自建立了一个完整的应用程序，并向董事会提交了三次，我的老板说他们都很高兴。他提到该项目负责人不知道我的存在--认为我的老板做了整件事。首席执行官、总裁等都知道这个项目，并对 \"我老板的项目 \"感到兴奋。基本上，项目负责人传递的是草图和excel表的截图，我的老板会给我一句话，说要建立什么，没有设计。通常情况下，我不在乎，但作为一个自由职业者，直接与客户合作是不同的--认为我是公司的一部分，并付出了所有的努力，肯定会刺痛自我。难道我做自由职业者这么久，只是忘记了办公室工作的等级制度是这样的吗？<p>我八月初要搬回新泽西州做 \"混血儿\"......我应该在第一次见到项目负责人时向他提及整个应用程序是我做的，还是让我的老板享受他的荣耀，并提及我是帮助建立它的团队的一员？ 我不想和老板交恶，因为他是个好人，给了我自由，但如果我需要找到另一份工作，我也不介意，因为我对这家公司不感冒，而且我的经济状况很稳定。<p>我想更普遍的是......在远程公司的人是否也觉得自己的工作没有得到认可？\n",
  "description_zh-Hant": "因此，長話短說，我在巴厘島就在COVID之前，並決定堅持...3年。在做了近十年的自由設計師/開發人員後，我決定尋找一份遠程工作--因為為什麼他媽的不是每個人都在招聘遠程人員。我申請並得到了一個 \"混合 \"工作的職位--花了2個月的時間說服他們我願意做這個工作並在夏天回來（傳統的金融公司不習慣遠程工作）。<p>在過去的3個月裡，我獨自建立了一個完整的應用程序，並向董事會提交了三次，我的老闆說他們都很高興。他提到該項目負責人不知道我的存在--認為我的老闆做了整件事。首席執行官、總裁等都知道這個項目，並對 \"我老闆的項目 \"感到興奮。基本上，項目負責人傳遞的是草圖和excel表的截圖，我的老闆會給我一句話，說要建立什麼，沒有設計。通常情況下，我不在乎，但作為一個自由職業者，直接與客戶合作是不同的--認為我是公司的一部分，並付出了所有的努力，肯定會刺痛自我。難道我做自由職業者這麼久，只是忘記了辦公室工作的等級制度是這樣的嗎？<p>我八月初要搬回新澤西州做 \"混血兒\"......我應該在第一次見到項目負責人時向他提及整個應用程序是我做的，還是讓我的老闆享受他的榮耀，並提及我是幫助建立它的團隊的一員？ 我不想和老闆交惡，因為他是個好人，給了我自由，但如果我需要找到另一份工作，我也不介意，因為我對這家公司不感冒，而且我的經濟狀況很穩定。<p>我想更普遍的是......在遠程公司的人是否也覺得自己的工作沒有得到認可？\n"
}