{
  "@type": "NewsArticle",
  "identifier": "2022--07--16--en--hackernews--HackerNews--NewsArticle--32115693",
  "url": "https://news.ycombinator.com/item?id=32115693",
  "headline": "Ask HN: How do you use Bitcoin in a trustless way?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm still trying to figure out, if it is possible to use Bitcoin in a trustless way. So that no matter which parts of your tech stack are faulty or malicious, you keep control over your funds.<p>The following is what I got so far. I never used Bitcoin. So correct me, if something is wrong please.<p>1: Create a seed phrase with dices<p>2: Write it down on paper or carve it into metal<p>3: Buy a hardware wallet with no internet connectivity.<p>4: Never connect that wallet to any other device.<p>5: Type the seed phrase into the hardware wallet<p>6: The hardware wallet will display an extended public key<p>7: Install a software wallet on a computer with internet access<p>8: Type the extended public key into the software wallet<p>9: To do transactions: Create a transaction in the software wallet<p>10: The software wallet will show a hash of the transaction<p>11: Type that hash into the hardware wallet<p>12: The hardware wallet will show a signature<p>13: Type that signature into the software wallet<p>That's it.<p>As I understand it, there still is trust involved in steps 3 and steps 6:<p>3: There is not an easy way to check if the hardware wallet really has no internet connectivity.<p>6: There is no way to check if the hardware wallet really uses the seed phrase to create the extended public key. It could create an extended public key that the vendor can predict. One could test it a few times with throw-away seed phrases, but one would never be 100% sure.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "JonathanBeuys",
    "url": "https://news.ycombinator.com/user?id=JonathanBeuys"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32115693",
  "sameAs": "https://news.ycombinator.com/item?id=32115693",
  "dateCreated": "2022-07-16T07:23:12.736Z",
  "datePublished": "2022-07-16T06:20:25.000Z",
  "dateModified": "2022-07-16T07:23:12.736Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 8
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 7
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何以一种无信任的方式使用比特币？\n",
  "headline_zh-Hant": "Ask HN: 你如何以一種無信任的方式使用比特幣？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我仍然在试图弄清楚，是否有可能以一种无信任的方式使用比特币。这样，无论你的技术栈的哪个部分有问题或有恶意，你都能保持对你的资金的控制。<p>以下是我到目前为止的收获。我从未使用过比特币。<p>1：用骰子创建一个种子短语<p>2：把它写在纸上或刻在金属上<p>3：买一个没有互联网连接的硬件钱包。<p>4：不要把这个钱包连接到任何其他设备上。 <p>5：在硬件钱包中键入种子短语<p>6：硬件钱包将显示一个扩展公钥<p>7：在可以上网的电脑上安装一个软件钱包<p>8：在软件钱包中键入扩展公钥<p>9：要进行交易。在软件钱包中创建一个交易<p>10：软件钱包将显示交易的哈希值<p>11：将该哈希值输入硬件钱包<p>12：硬件钱包将显示一个签名<p>13：将该签名输入软件钱包<p>就这样了。 <p>根据我的理解，步骤3和步骤6仍然涉及信任问题：<p>3：没有一个简单的方法来检查硬件钱包是否真的没有互联网连接。<p>6：没有办法检查硬件钱包是否真的使用种子短语来创建扩展公钥。它可以创建一个供应商可以预测的扩展公钥。我们可以用随机的种子短语测试几次，但我们永远不会100%确定。\n",
  "description_zh-Hant": "我仍然在試圖弄清楚，是否有可能以一種無信任的方式使用比特幣。這樣，無論你的技術棧的哪個部分有問題或有惡意，你都能保持對你的資金的控制。<p>以下是我到目前為止的收穫。我從未使用過比特幣。<p>1：用骰子創建一個種子短語<p>2：把它寫在紙上或刻在金屬上<p>3：買一個沒有互聯網連接的硬件錢包。<p>4：不要把這個錢包連接到任何其他設備上。 <p>5：在硬件錢包中鍵入種子短語<p>6：硬件錢包將顯示一個擴展公鑰<p>7：在可以上網的電腦上安裝一個軟件錢包<p>8：在軟件錢包中鍵入擴展公鑰<p>9：要進行交易。在軟件錢包中創建一個交易<p>10：軟件錢包將顯示交易的哈希值<p>11：將該哈希值輸入硬件錢包<p>12：硬件錢包將顯示一個簽名<p>13：將該簽名輸入軟件錢包<p>就這樣了。 <p>根據我的理解，步驟3和步驟6仍然涉及信任問題：<p>3：沒有一個簡單的方法來檢查硬件錢包是否真的沒有互聯網連接。<p>6：沒有辦法檢查硬件錢包是否真的使用種子短語來創建擴展公鑰。它可以創建一個供應商可以預測的擴展公鑰。我們可以用隨機的種子短語測試幾次，但我們永遠不會100%確定。\n"
}