{
  "@type": "NewsArticle",
  "identifier": "2022--06--11--en--hackernews--HackerNews--NewsArticle--31707349",
  "url": "https://news.ycombinator.com/item?id=31707349",
  "headline": "Tell HN: My wife was banned from WhatsApp without reason or recourse",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Like many people, my wife and I use WhatsApp to keep in touch with various family and friends who prefer that platform.  I actually use it more than she does—she basically just chats with close family and a few friends from highschool.<p>A few days ago, she opened the app to find the message,<p>&gt; This account is not allowed to use WhatsApp\n&gt; Chats are still on this device.<p>This didn't make any sense, as she only uses it to chat with family and friends and certainly hadn't broken any terms.  Found the option to appeal and submitted that.  A day later, the app now says<p>&gt; This account cannot use WhatsApp\n&gt; We've completed our review and found this account's activity goes against WhatsApp's terms of service<p>There's no way she's actually broken any terms, so it appears this is some kind of mistake, but given the speed of the &quot;review&quot;, I doubt any human has actually looked at it.  She's tried contacting them via their contact page, but given the review is already &quot;complete&quot;, I'm not too hopeful.<p>Our only guess as to what could have caused this is that a week or so before the ban she received a spam message sent to a giant group and marked it as spam.  Perhaps somehow all numbers in that group ended up associated with the spamming?  Regardless, pretty frustrating situation since she has a couple of long-running chats with family and friend groups that she can no longer participate in.  Always fun to be at the whims of the algorithm.<p>Posting in case there's anything to the connection between marking a message as spam and getting blocked (maybe it's safer to just mute spam messages instead), as well as on the off chance someone from Facebook ends up reading this and can help.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "tempestn",
    "url": "https://news.ycombinator.com/user?id=tempestn"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31707349",
  "sameAs": "https://news.ycombinator.com/item?id=31707349",
  "dateCreated": "2022-06-11T20:25:45.085Z",
  "datePublished": "2022-06-11T19:17:28.000Z",
  "dateModified": "2022-06-11T20:25:45.085Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 28
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 11
    }
  ],
  "headline_zh-Hans": "告诉HN：我的妻子被禁止使用WhatsApp，没有任何理由和追索权\n",
  "headline_zh-Hant": "告訴HN：我的妻子被禁止使用WhatsApp，沒有任何理由和追索權\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "像许多人一样，我和妻子使用WhatsApp与各种喜欢该平台的家人和朋友保持联系。 实际上，我比她用得更多--她基本上只和亲密的家人和几个高中同学聊天。<p>几天前，她打开应用程序，发现有一条信息，<p>&gt; 这个账户不允许使用WhatsApp。\n&gt; 聊天记录还在这个设备上。<p>这没有任何意义，因为她只用它与家人和朋友聊天，当然也没有违反任何条款。 她找到了上诉的选项，并提交了上诉。 一天后，该应用程序现在说<p>&gt; 这个帐户不能使用WhatsApp\n&gt; 我们已经完成了审查，发现这个账户的活动违反了WhatsApp的服务条款<p>她不可能真的违反任何条款，所以这似乎是某种错误，但考虑到&quot;审查&quot;的速度，我怀疑是否有人真的看了它。 她试图通过他们的联系页面与他们联系，但鉴于审查已经完成，我不抱太大希望。<p>我们对造成这种情况的唯一猜测是，在被禁止前一周左右，她收到了一条发送到一个巨大的小组的垃圾邮件，并将其标记为垃圾邮件。 也许该组中的所有号码最终都与垃圾邮件有关？ 不管怎么说，情况相当令人沮丧，因为她有几个与家人和朋友组的长期聊天记录，她不能再参加了。 <p>发帖是为了防止将信息标记为垃圾邮件和被屏蔽之间有什么联系（也许将垃圾邮件静音会更安全），同时也是为了防止Facebook的人最终看到这篇文章并能提供帮助。\n",
  "description_zh-Hant": "像許多人一樣，我和妻子使用WhatsApp與各種喜歡該平臺的家人和朋友保持聯繫。 實際上，我比她用得更多--她基本上只和親密的家人和幾個高中同學聊天。<p>幾天前，她打開應用程序，發現有一條信息，<p>&gt; 這個賬戶不允許使用WhatsApp。\n&gt; 聊天記錄還在這個設備上。<p>這沒有任何意義，因為她只用它與家人和朋友聊天，當然也沒有違反任何條款。 她找到了上訴的選項，並提交了上訴。 一天後，該應用程序現在說<p>&gt; 這個帳戶不能使用WhatsApp\n&gt; 我們已經完成了審查，發現這個賬戶的活動違反了WhatsApp的服務條款<p>她不可能真的違反任何條款，所以這似乎是某種錯誤，但考慮到&quot;審查&quot;的速度，我懷疑是否有人真的看了它。 她試圖通過他們的聯繫頁面與他們聯繫，但鑑於審查已經完成，我不抱太大希望。<p>我們對造成這種情況的唯一猜測是，在被禁止前一週左右，她收到了一條發送到一個巨大的小組的垃圾郵件，並將其標記為垃圾郵件。 也許該組中的所有號碼最終都與垃圾郵件有關？ 不管怎麼說，情況相當令人沮喪，因為她有幾個與家人和朋友組的長期聊天記錄，她不能再參加了。 <p>發帖是為了防止將信息標記為垃圾郵件和被屏蔽之間有什麼聯繫（也許將垃圾郵件靜音會更安全），同時也是為了防止Facebook的人最終看到這篇文章並能提供幫助。\n"
}