{
  "@type": "NewsArticle",
  "identifier": "2022--07--21--en--hackernews--HackerNews--NewsArticle--32181619",
  "url": "https://news.ycombinator.com/item?id=32181619",
  "headline": "Tell HN: You can't hire because you don't post salary ranges",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "At the start of this year, Colorado has changed to require every job posted to list a salary range. Other states are also beginning to follow suit.<p>I am currently job hunting. I started looking locally, everything lists salary ranges, perfect. I can know which positions to skip and which ones might be a good match right away. No need to waste time with 7 rounds of interviewing only to find out the salary is 50% of what I currently make.<p>Now I've begun widening my search to remote work, as the idea of commuting to an office in 2022 is completely insane to me.<p>Most jobs on nation-wide job boards do not post a salary range. I will not even click on those job postings. It's simply not worth it.<p>Further, after seeing so many positions listed _with_ salary ranges, when I see one without a salary range it makes me feel like you have something to hide and are trying to trick me.<p>So the next time your team starts discussing why you can't seem to hire, maybe ask if you are publicly posting salary ranges on these positions?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Carrok",
    "url": "https://news.ycombinator.com/user?id=Carrok"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32181619",
  "sameAs": "https://news.ycombinator.com/item?id=32181619",
  "dateCreated": "2022-07-21T17:39:15.715Z",
  "datePublished": "2022-07-21T16:46:57.000Z",
  "dateModified": "2022-07-21T17:39:15.715Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 110
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 56
    }
  ],
  "headline_zh-Hans": "告诉HN：你不能雇用，因为你没有公布工资范围\n",
  "headline_zh-Hant": "告訴HN：你不能僱用，因為你沒有公佈工資範圍\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "今年年初，科罗拉多州已经改变，要求每份发布的工作都要列出工资范围。其他州也开始效仿。<p>我目前正在找工作。我开始在当地寻找，所有的东西都列出了工资范围，很完美。我可以马上知道哪些职位可以跳过，哪些可能是很好的匹配。没有必要浪费时间进行7轮面试，却发现工资是我目前收入的50%。<p>现在我已经开始扩大搜索范围，寻找远程工作，因为在2022年通勤到办公室的想法对我来说是完全疯狂的。<p>全国范围的招聘网站上的大多数职位都没有发布工资范围。我甚至不会去点击那些招聘信息。<p>此外，在看到这么多列有薪资范围的职位后，当我看到没有薪资范围的职位时，我觉得你有什么隐情，并试图欺骗我。<p>因此，当你的团队开始讨论为什么你似乎无法雇用时，也许会问你是否在这些职位上公开发布薪资范围？\n",
  "description_zh-Hant": "今年年初，科羅拉多州已經改變，要求每份發佈的工作都要列出工資範圍。其他州也開始效仿。<p>我目前正在找工作。我開始在當地尋找，所有的東西都列出了工資範圍，很完美。我可以馬上知道哪些職位可以跳過，哪些可能是很好的匹配。沒有必要浪費時間進行7輪面試，卻發現工資是我目前收入的50%。<p>現在我已經開始擴大搜索範圍，尋找遠程工作，因為在2022年通勤到辦公室的想法對我來說是完全瘋狂的。<p>全國範圍的招聘網站上的大多數職位都沒有發佈工資範圍。我甚至不會去點擊那些招聘信息。<p>此外，在看到這麼多列有薪資範圍的職位後，當我看到沒有薪資範圍的職位時，我覺得你有什麼隱情，並試圖欺騙我。<p>因此，當你的團隊開始討論為什麼你似乎無法僱用時，也許會問你是否在這些職位上公開發布薪資範圍？\n"
}