{
  "@type": "NewsArticle",
  "identifier": "2022--04--25--en--hackernews--HackerNews--NewsArticle--31112115",
  "url": "https://news.ycombinator.com/item?id=31112115",
  "headline": "Ask HN: Was this a phishing attempt?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I got this email nominally from  inmail-hit-reply@linkedin.com with a reply-to directing to &lt;gobbledygook@reply.linkedin.com&gt;<p>This email I pasted below says it's an inmail and at the bottom says they made a connection request but I don't see a message in my linkedin inbox. The person who supposedly sent it has a linkedin profile listing themselves as a recruiter for AWS. GMail didn't say &quot;Be careful with this message&quot; or anything like that. I am a data engineer and from what I can tell that's the right level for me, and I get pinged by AWS or Amazon to apply around once a month<p>Was this a phishing attempt or just LinkedIn weirdness?<p>Here's the Email:<p>Hello,<p>My name is &lt;seemingly real AWS recruiter name&gt; and I am a Recruiter with Amazon Web Services. My Hiring Manager and I recently reviewed your profile and we believe your background and skills could be a good fit for our L5 Data Engineer role. I wanted to gauge your interest in the position and its location to see if this is something you would want to pursue. Please note, we have other positions available, so if this role doesn’t pique your interest, let me know what you are interested in and I may be able to find a more suitable opportunity.<p>JOB DESCRIPTION:<p>As a Data Engineer, you will work on our Science team and partner closely with other Data Engineers, Data Scientists, BIEs, Technical Program Managers, and Software teams to create data pipelines that are used to optimize power, cooling, and supply chain decisions for AWS Infrastructure. You will be responsible for synthesizing data across our organization in a data warehouse environment. This job is able to be located in Seattle, WA.<p>You have a passion for Excellence. You have a proven track record of building the right Data Engineering solutions that scale, provide high availability, and require minimal maintenance. You write code that is clean, readable, and straight forward.<p>LINK:<p>https://www.amazon.jobs/en/jobs/&lt;yada yada yada&gt;<p>I look forward to your response after you have reviewed the job description. Thank you for your time!<p>&lt;seemingly real AWS recruiter name&gt;<p>AWS Recruiter<p>You received an invitation to connect. LinkedIn will use your email address to make suggestions to our members in features like People You May Know.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "starwind",
    "url": "https://news.ycombinator.com/user?id=starwind"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31112115",
  "sameAs": "https://news.ycombinator.com/item?id=31112115",
  "dateCreated": "2022-04-25T23:51:40.648Z",
  "datePublished": "2022-04-21T17:05:26.000Z",
  "dateModified": "2022-04-25T23:51:40.648Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 7
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 这是一个网络钓鱼的尝试吗？",
  "headline_zh-Hant": "Ask HN: 這是一個網絡釣魚的嘗試嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我收到这封名义上来自inmail-hit-reply@linkedin.com，回复指向&lt;gobbledygook@reply.linkedin.com&gt;<p>我粘贴在下面的这封邮件说这是一封内信，在底部说他们提出了一个连接请求，但我在linkedin收件箱中没有看到消息。据称发送邮件的人在linkedin的资料中把自己列为AWS的招聘人员。GMail没有说&quot;要小心这个消息&quot;或类似的东西。我是一名数据工程师，据我所知，这是适合我的级别，而且我每个月都会被AWS或亚马逊通知申请一次<p>这是个网络钓鱼的尝试还是只是LinkedIn的怪事？<p>以下是电子邮件：<p>你好，<p>我的名字是&lt;似乎是真正的AWS招聘人员名字&gt;，我是亚马逊网络服务的一名招聘人员。我的招聘经理和我最近审查了你的资料，我们认为你的背景和技能可能很适合我们的L5数据工程师职位。我想了解你对这个职位的兴趣和位置，看看这是否是你想追求的东西。请注意，我们还有其他职位，所以如果这个角色没有引起你的兴趣，请告诉我你对什么感兴趣，我可能会找到一个更合适的机会。<p>工作描述：<p>作为一名数据工程师，你将在我们的科学团队工作，与其他数据工程师、数据科学家、BIE、技术项目经理和软件团队密切合作，创建数据管道，用于优化AWS基础设施的电源、冷却和供应链决策。你将负责在数据仓库环境中综合我们整个组织的数据。这份工作能够在华盛顿州的西雅图市进行。<p>你有追求卓越的热情。你在建立正确的数据工程解决方案方面有良好的记录，这些解决方案可以扩展，提供高可用性，并需要最少的维护。你写的代码是干净的、可读的和直接的。<p>链接：<p>https://www.amazon.jobs/en/jobs/&lt;yada yada yada&gt;<p>我期待着你在审查工作描述后的回应。谢谢您的时间！<p>&lt;貌似真实的AWS招聘人员姓名&gt;<p>AWS招聘人员<p>您收到了连接邀请。LinkedIn将使用您的电子邮件地址，在 \"您可能认识的人 \"等功能中向我们的会员提出建议。",
  "description_zh-Hant": "我收到這封名義上來自inmail-hit-reply@linkedin.com，回覆指向&lt;gobbledygook@reply.linkedin.com&gt;<p>我粘貼在下面的這封郵件說這是一封內信，在底部說他們提出了一個連接請求，但我在linkedin收件箱中沒有看到消息。據稱發送郵件的人在linkedin的資料中把自己列為AWS的招聘人員。GMail沒有說&quot;要小心這個消息&quot;或類似的東西。我是一名數據工程師，據我所知，這是適合我的級別，而且我每個月都會被AWS或亞馬遜通知申請一次<p>這是個網絡釣魚的嘗試還是隻是LinkedIn的怪事？<p>以下是電子郵件：<p>你好，<p>我的名字是&lt;似乎是真正的AWS招聘人員名字&gt;，我是亞馬遜網絡服務的一名招聘人員。我的招聘經理和我最近審查了你的資料，我們認為你的背景和技能可能很適合我們的L5數據工程師職位。我想了解你對這個職位的興趣和位置，看看這是否是你想追求的東西。請注意，我們還有其他職位，所以如果這個角色沒有引起你的興趣，請告訴我你對什麼感興趣，我可能會找到一個更合適的機會。<p>工作描述：<p>作為一名數據工程師，你將在我們的科學團隊工作，與其他數據工程師、數據科學家、BIE、技術項目經理和軟件團隊密切合作，創建數據管道，用於優化AWS基礎設施的電源、冷卻和供應鏈決策。你將負責在數據倉庫環境中綜合我們整個組織的數據。這份工作能夠在華盛頓州的西雅圖市進行。<p>你有追求卓越的熱情。你在建立正確的數據工程解決方案方面有良好的記錄，這些解決方案可以擴展，提供高可用性，並需要最少的維護。你寫的代碼是乾淨的、可讀的和直接的。<p>鏈接：<p>https://www.amazon.jobs/en/jobs/&lt;yada yada yada&gt;<p>我期待著你在審查工作描述後的迴應。謝謝您的時間！<p>&lt;貌似真實的AWS招聘人員姓名&gt;<p>AWS招聘人員<p>您收到了連接邀請。LinkedIn將使用您的電子郵件地址，在 \"您可能認識的人 \"等功能中向我們的會員提出建議。"
}