{
  "@type": "NewsArticle",
  "identifier": "2022--07--25--en--hackernews--HackerNews--NewsArticle--32225652",
  "url": "https://news.ycombinator.com/item?id=32225652",
  "headline": "Ask HN: Why has the quality of discourse on HN gone downhill?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I know - this is probably the thousandth time you have heard this complaint, but please hear me out.<p>I have been lurking and reading on HN since 2016 (I never actively commented til 2019), and the spirit of discussion was outstanding then (2016-2020). The amount of high quality posts and discussions about the technical and operational sides of technology and the tech industry was astounding! Yet, something seems to have changed with the culture on this site since 2020 - it feels as if the site has become a parody of itself, with “edgy” hot takes, cargo culting around supposedly conventional knowledge, and the insane amount of “stanning” of certain figures gossip and a handful of companies.<p>The increase in political content as well has been a massive change on this site as well, and as this is a discussion board it is fair game for everyone to have a say assuming civility. Yet this civility does not exist - discussions instead devolve into a passive aggressive form of brawling, with no actual insights coming out from other side.<p>Finally, as someone who is friends with a number of YC founders, there has been a recent trend among batchmates to start creating false traction/“demand Gen” for their products by astroturfing comments and submissions. And this is without explicitly saying it’s a marketing post.<p>Big picture, it almost appears as if HN has become what Reddit felt like in 2015-16, which pushed me to this site itself, and it is extremely depressing for me to see a discussion board that has helped propel my career start to lose it’s low noise to story ratio.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "alephnerd",
    "url": "https://news.ycombinator.com/user?id=alephnerd"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32225652",
  "sameAs": "https://news.ycombinator.com/item?id=32225652",
  "dateCreated": "2022-07-25T15:51:42.592Z",
  "datePublished": "2022-07-25T15:23:14.000Z",
  "dateModified": "2022-07-25T15:51:42.592Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 32
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 37
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么HN的论述质量走下坡路？\n",
  "headline_zh-Hant": "Ask HN: 為什麼HN的論述質量走下坡路？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我知道--这可能是你第一千次听到这种抱怨了，但请听我说。<p>我从2016年起就一直在HN上潜伏和阅读（直到2019年我才积极发表评论），那时（2016-2020年）的讨论精神非常出色。关于技术和科技行业的技术和操作方面的高质量的帖子和讨论的数量是惊人的！但是，随着时间的推移，似乎有些变化。然而，自2020年以来，这个网站的文化似乎发生了一些变化--感觉这个网站好像变成了对自己的模仿，\"前卫 \"的热议，围绕着所谓的传统知识的货物崇拜，以及对某些人物八卦和少数公司的疯狂 \"追捧\"。<p>政治内容的增加也是这个网站的一个巨大变化，由于这是一个讨论区，每个人都可以在假设文明的情况下发表意见。<p>最后，作为一个与一些YC创始人交好的人，最近有一种趋势，即开始为他们的产品创造虚假的牵引力/\"需求源\"，通过天价的评论和提交。而这并没有明确说这是一个营销帖子。<p>从大的方面来看，HN几乎已经变成了Reddit在2015-16年的感觉，它把我推到了这个网站本身，看到一个帮助推动我的职业生涯的讨论板开始失去它的低噪音和故事比例，这让我感到非常郁闷。\n",
  "description_zh-Hant": "我知道--這可能是你第一千次聽到這種抱怨了，但請聽我說。<p>我從2016年起就一直在HN上潛伏和閱讀（直到2019年我才積極發表評論），那時（2016-2020年）的討論精神非常出色。關於技術和科技行業的技術和操作方面的高質量的帖子和討論的數量是驚人的！但是，隨著時間的推移，似乎有些變化。然而，自2020年以來，這個網站的文化似乎發生了一些變化--感覺這個網站好像變成了對自己的模仿，\"前衛 \"的熱議，圍繞著所謂的傳統知識的貨物崇拜，以及對某些人物八卦和少數公司的瘋狂 \"追捧\"。<p>政治內容的增加也是這個網站的一個巨大變化，由於這是一個討論區，每個人都可以在假設文明的情況下發表意見。<p>最後，作為一個與一些YC創始人交好的人，最近有一種趨勢，即開始為他們的產品創造虛假的牽引力/\"需求源\"，通過天價的評論和提交。而這並沒有明確說這是一個營銷帖子。<p>從大的方面來看，HN幾乎已經變成了Reddit在2015-16年的感覺，它把我推到了這個網站本身，看到一個幫助推動我的職業生涯的討論板開始失去它的低噪音和故事比例，這讓我感到非常鬱悶。\n"
}