{
  "@type": "NewsArticle",
  "identifier": "2022--07--14--en--hackernews--HackerNews--NewsArticle--32094339",
  "url": "https://news.ycombinator.com/item?id=32094339",
  "headline": "Ask HN: Should I sell my vintage computer collection?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm moving house after 10 years and realising just how many computers I have accumulated in 20 years of collecting.<p>I have all sorts of machines, and in fact whilst packing up the house I keep finding boxes that have been mailed to me from eBay purchases that I never opened - I don't even know what's in them.<p>To illustrate how many I have, the other day I thought &quot;Do I have an Amiga? I think I do.&quot; and I went looking through boxes.  I opened a box and on top was an Amiga 1200.  Underneath it were two Amiga 1000's.<p>I have two Apple 2 computers signed by Steve Wozniak.<p>I'm conflicted about whether to keep all these machines or not.  On one hand, having them makes me feel good inside at some level.  Howver, I don't DO anything with them - they mostly stay in boxes.  Partly this is because I am way too busy doing real world stuff to be fiddling with vintage technology, partly it's because I think for me the joy is in the wanting, the finding and the buying.<p>I'm pretty sure I've developed this habit because as a child in the last 1970's and early 80's we could never afford a computer for many years, when it was something I wanted more than anything in the world.<p>Partly I hold back from selling them because firstly if I regret it then I'll never be able to build such a collection again.  Partly I think maybe I'll get around to playing with them when (if) I ever &quot;retire&quot;.<p>On the other hand it's sort of a burden to have this giant collection of &quot;stuff&quot;.  I don't have anywhere nice to display them, and vintage computers need a level of care and attention I just can't give.<p>In favor of selling them I would probably get maybe a number of thousand dollars which would help buy a house - something I ned a whole lot more than I need a bunch of vintage computers.<p>I dunno - what do you think HN, sell the collection or keep them?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "andrewstuart",
    "url": "https://news.ycombinator.com/user?id=andrewstuart"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32094339",
  "sameAs": "https://news.ycombinator.com/item?id=32094339",
  "dateCreated": "2022-07-14T11:21:57.010Z",
  "datePublished": "2022-07-14T10:59:23.000Z",
  "dateModified": "2022-07-14T11:21:57.010Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该出售我的古董电脑收藏吗？\n",
  "headline_zh-Hant": "Ask HN: 我應該出售我的古董電腦收藏嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在10年后搬了家，并意识到我在20年的收集过程中积累了多少电脑。<p>我有各种各样的机器，事实上，在收拾房子的时候，我不断发现从eBay购买的邮寄给我的箱子，我从来没有打开过 - 我甚至不知道里面有什么。我想我有。&quot; 然后我就去翻箱倒柜。 我打开了一个盒子，上面是一台Amiga 1200。 下面是两台Amiga 1000。<p>我有两台由Steve Wozniak签名的Apple 2电脑。<p>我对是否保留所有这些机器感到很矛盾。 一方面，拥有它们让我在某种程度上感觉良好。 然而，我并没有用它们做任何事情--它们大多都呆在盒子里。 部分原因是我太忙于做现实世界的事情，没有时间摆弄老式技术，部分原因是我认为对我来说，快乐是在想要、发现和购买的过程中。 <p>我很确定我养成了这个习惯，因为在上世纪70年代和80年代初，作为一个孩子，我们有很多年都买不起电脑，而当时我对电脑的渴望超过了世界上的任何东西。<p>部分原因是我忍住不卖，因为首先如果我后悔了，那么我将永远无法再建立这样一个收藏。 <p>另一方面，拥有这些巨大的收藏品也是一种负担。 我没有什么好地方可以展示它们，而且古董电脑需要一定程度的照顾和关注，我实在给不了。<p>如果卖掉它们，我可能会得到几千美元，这将有助于买房子--我需要的东西比我需要的一堆古董电脑多得多。<p>我不知道--你认为HN，卖掉收藏品还是保留它们？\n",
  "description_zh-Hant": "我在10年後搬了家，並意識到我在20年的收集過程中積累了多少電腦。<p>我有各種各樣的機器，事實上，在收拾房子的時候，我不斷髮現從eBay購買的郵寄給我的箱子，我從來沒有打開過 - 我甚至不知道里面有什麼。我想我有。&quot; 然後我就去翻箱倒櫃。 我打開了一個盒子，上面是一臺Amiga 1200。 下面是兩臺Amiga 1000。<p>我有兩臺由Steve Wozniak簽名的Apple 2電腦。<p>我對是否保留所有這些機器感到很矛盾。 一方面，擁有它們讓我在某種程度上感覺良好。 然而，我並沒有用它們做任何事情--它們大多都呆在盒子裡。 部分原因是我太忙於做現實世界的事情，沒有時間擺弄老式技術，部分原因是我認為對我來說，快樂是在想要、發現和購買的過程中。 <p>我很確定我養成了這個習慣，因為在上世紀70年代和80年代初，作為一個孩子，我們有很多年都買不起電腦，而當時我對電腦的渴望超過了世界上的任何東西。<p>部分原因是我忍住不賣，因為首先如果我後悔了，那麼我將永遠無法再建立這樣一個收藏。 <p>另一方面，擁有這些巨大的收藏品也是一種負擔。 我沒有什麼好地方可以展示它們，而且古董電腦需要一定程度的照顧和關注，我實在給不了。<p>如果賣掉它們，我可能會得到幾千美元，這將有助於買房子--我需要的東西比我需要的一堆古董電腦多得多。<p>我不知道--你認為HN，賣掉收藏品還是保留它們？\n"
}