{
  "@type": "NewsArticle",
  "identifier": "2022--07--03--en--hackernews--HackerNews--NewsArticle--31965367",
  "url": "https://news.ycombinator.com/item?id=31965367",
  "headline": "Ask HN: What exactly Is a Mindfulness Meditation?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I spent many years learning about different ways and schools of meditation. Not professionally but as one of hobbies constantly running in the background.<p>And I still don’t get it.<p>Honestly It still looks like a big scam to me.<p>Some “teachers” say that you just focus your attention on breath or whatever you choose as a focus point.<p>But then isn’t our whole life a sequence of meditations? Because we always focus on something (with sleep breaks).<p>And then following Occam’s razor - why need separate concept for that?<p>Other gurus teach that meditation is “doing nothing”. Okay, but then again there’s nothing special about it, we all do it from time to time.<p>More than that, it means you can’t really practice such meditation, by its definition.<p>Another way to look at it - just sit peacefully and observe your thoughts.<p>Then again, aren’t we doing it anyway on a regular basis without introducing a word for it?<p>Can you please share your own personal specific definition — what exactly is a meditation for you?<p>Please be as detailed as possible and avoid abstract discussions and arguments (I’ve had enough of it already :), just your own experience.<p>Thank you.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "aristofun",
    "url": "https://news.ycombinator.com/user?id=aristofun"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31965367",
  "sameAs": "https://news.ycombinator.com/item?id=31965367",
  "dateCreated": "2022-07-03T06:51:06.681Z",
  "datePublished": "2022-07-03T05:36:48.000Z",
  "dateModified": "2022-07-03T06:51:06.681Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 6
    }
  ],
  "headline_zh-Hans": "Ask HN: 究竟什么是正念冥想？\n",
  "headline_zh-Hant": "Ask HN: 究竟什麼是正念冥想？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我花了很多年时间学习不同的冥想方法和流派。有些 \"老师 \"说，你只需把注意力集中在呼吸或任何你选择的焦点上。<p>但是，我们的整个生活不就是一连串的冥想吗？因为我们总是专注于某件事情（有睡眠休息时间）。<p>然后按照奥卡姆剃刀的说法--为什么需要单独的概念？<p>其他大师教导说，冥想是 \"什么都不做\"。好吧，但这并没有什么特别之处，我们都会不时地做。<p>更多的是，这意味着你不能真正地练习这样的冥想，根据它的定义。<p>另一种方式来看待它--只是平静地坐着，观察你的想法。<p>话说回来，我们不是经常这样做，而没有为它引入一个词？ <p>你能不能分享一下你个人的具体定义--对你来说，冥想到底是什么？<p>请尽可能详细，避免抽象的讨论和争论（我已经受够了：），只说你自己的经验。<p>谢谢。\n",
  "description_zh-Hant": "我花了很多年時間學習不同的冥想方法和流派。有些 \"老師 \"說，你只需把注意力集中在呼吸或任何你選擇的焦點上。<p>但是，我們的整個生活不就是一連串的冥想嗎？因為我們總是專注於某件事情（有睡眠休息時間）。<p>然後按照奧卡姆剃刀的說法--為什麼需要單獨的概念？<p>其他大師教導說，冥想是 \"什麼都不做\"。好吧，但這並沒有什麼特別之處，我們都會不時地做。<p>更多的是，這意味著你不能真正地練習這樣的冥想，根據它的定義。<p>另一種方式來看待它--只是平靜地坐著，觀察你的想法。<p>話說回來，我們不是經常這樣做，而沒有為它引入一個詞？ <p>你能不能分享一下你個人的具體定義--對你來說，冥想到底是什麼？<p>請儘可能詳細，避免抽象的討論和爭論（我已經受夠了：），只說你自己的經驗。<p>謝謝。\n"
}