{
  "@type": "NewsArticle",
  "identifier": "2022--06--16--en--hackernews--HackerNews--NewsArticle--31769520",
  "url": "https://news.ycombinator.com/item?id=31769520",
  "headline": "GitHub waited 3 months to notify about potential compromise",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "It seems GitHub became aware of the issue around March 2 (or before, since the fix was released on March 2), and waited until June 16 to disclose the problem.<p>See full text below:<p>Hi zwass,<p>We're writing to let you know that between 2022-02-25 18:28 UTC and 2022-03-02 20:47 UTC, due to a bug, GitHub Apps were able to generate new scoped installation tokens with elevated permissions. You are an owner of an organization on GitHub with GitHub Apps installed that generated at least one new token during this time period. While we do not have evidence that this bug was maliciously exploited, with our available data, we are not able to determine if a token was generated with elevated permissions.<p>User privacy and security are essential for maintaining trust, and we want to remain as transparent as possible about events like these. GitHub itself did not experience a compromise or data breach that either created or resulted from this event. Read on for more information.<p>* What happened? *<p>GitHub learned via a customer support ticket that GitHub Apps were able to generate scoped installation tokens with elevated permissions. Each of these tokens are valid for up to 1 hour.<p>GitHub quickly fixed the issue and established that this bug was recently introduced, existing for approximately 5 days between 2022-02-25 18:28 UTC and 2022-03-02 20:47 UTC.<p>GitHub Apps generate scoped installation tokens based on the scopes and permissions granted when the GitHub App is installed into a user account or organization. For example, if a GitHub App requests and is granted read permission to issues during installation, the scoped installation token the App generates to function would have `issues:read` permission.<p>This bug would potentially allow the above installation to generate a token with `issues:write`, an elevation of permission from the granted `issues:read` permission. The bug did not allow a GitHub App to generate a token with additional scopes that were not already granted, such as `discussions:read` in the above example. The bug did not allow a GitHub App to access any repositories that the App did not already have access to.<p>In order to exploit this bug, the GitHub App author would need to modify their app's code to request elevated permissions on generated tokens.<p>* What information was involved? *<p>The following GitHub Apps generated scoped installation tokens during the bug window for your organization(s). We are not able to determine if a token was generated with elevated permissions.<p>Organization: GitHub Apps\n&lt;redacted&gt;<p>* What GitHub is doing *<p>GitHub immediately began working to fix the bug and started an investigation into the potential impact. However due to the scale and complexity of GitHub Apps and their short-lived tokens, we were unable to determine whether this bug was ever exploited.<p>We are notifying all organization and user account owners that had GitHub Apps installed and had a scoped installation token generated during the bug window so that they can stay informed and perform their own audit of their installed GitHub Apps.<p>As a followup to this investigation, GitHub is looking at ways to improve our logging to enable more in-depth analysis on scoped token generation and GitHub App permissions in the future.<p>* What was the potential impact? *<p>Due to the variety of GitHub Apps, their possible scopes, and the repositories they may have been given access to, we are unable to advise on any potential impacts as each customer's situation will be unique.<p>* What you can do *<p>While we have updated our systems to resolve this bug and no action is required on your end, we do recommend you review your installed GitHub Apps. You can use the following guidance for assessing GitHub Apps, their permissions, and their access to your private organization repositories:<p>https://docs.github.com/en/organizations/keeping-your-organization-secure",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "zwass",
    "url": "https://news.ycombinator.com/user?id=zwass"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31769520",
  "sameAs": "https://news.ycombinator.com/item?id=31769520",
  "dateCreated": "2022-06-16T19:41:12.964Z",
  "datePublished": "2022-06-16T18:47:20.000Z",
  "dateModified": "2022-06-16T19:41:12.964Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 32
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 7
    }
  ],
  "headline_zh-Hans": "GitHub等了3个月才通知潜在泄露事件\n",
  "headline_zh-Hant": "GitHub等了3個月才通知潛在洩露事件\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "似乎GitHub在3月2日左右意识到了这个问题（或者更早，因为修复程序是在3月2日发布的），直到6月16日才披露这个问题。<p>全文如下：<p>Hi zwass,<p>我们写信告诉你，在2022-02-25 18:28 UTC和2022-03-02 20:47 UTC之间，由于一个错误，GitHub应用程序能够生成具有更高权限的新范围安装令牌。你是GitHub上一个安装了GitHub应用程序的组织的所有者，在这段时间内至少生成了一个新的令牌。虽然我们没有证据表明这个漏洞被恶意利用，但根据我们现有的数据，我们无法确定是否有以高权限生成的令牌。<p>用户隐私和安全对于维护信任至关重要，我们希望对类似事件保持尽可能的透明。GitHub本身并没有经历产生或导致这一事件的妥协或数据泄露。继续阅读以了解更多信息。<p>* 发生了什么？*<p>GitHub通过客户支持单了解到，GitHub应用程序能够生成具有更高权限的范围内安装令牌。<p>GitHub很快修复了这个问题，并确定这个错误是最近才出现的，在2022-02-25 18:28 UTC和2022-03-02 20:47 UTC之间存在约5天。<p>GitHub应用程序根据GitHub应用程序安装到用户账户或组织时授予的范围和权限生成范围内的安装令牌。例如，如果一个GitHub应用程序在安装过程中请求并被授予对问题的读取权限，该应用程序生成的范围内的安装令牌将具有`issues:read`权限。<p>这个错误可能会允许上述安装产生一个具有`issues:write`的令牌，从授予的`issues:read`权限提升了权限。该错误不允许GitHub应用程序生成具有额外作用域的令牌，例如上述例子中的 \"discussions:read\"。该漏洞不允许GitHub应用访问任何该应用尚未访问的仓库。<p>为了利用这个漏洞，GitHub应用的作者需要修改他们应用的代码，以要求提高生成的令牌的权限。*<p>下列GitHub应用程序在您的组织的错误窗口期间生成了范围广泛的安装令牌。我们无法确定代币是否以高权限生成。<p>组织。GitHub应用程序\n<p>GitHub正在做什么 *<p>GitHub立即着手修复该漏洞，并开始调查其潜在影响。<p>我们正在通知所有安装了GitHub应用程序并在该漏洞窗口期间生成了范围内安装令牌的组织和用户账户所有者，以便他们能够保持知情并对其安装的GitHub应用程序进行审计。 <p>作为这次调查的后续行动，GitHub正在研究如何改进我们的日志记录，以便在未来对范围内的令牌生成和GitHub应用程序的权限进行更深入的分析。*<p>由于GitHub应用程序的多样性，它们可能的范围，以及它们可能被授予访问的存储库，我们无法就任何潜在的影响提供建议，因为每个客户的情况都是独特的。<p>你可以做什么 *<p>虽然我们已经更新了我们的系统来解决这个错误，你不需要采取行动，我们确实建议你审查你安装的GitHub应用程序。您可以使用以下指南来评估GitHub应用程序、它们的权限以及它们对您的私有组织仓库的访问：<p>https://docs.github.com/en/organizations/keeping-your-organization-secure\n",
  "description_zh-Hant": "似乎GitHub在3月2日左右意識到了這個問題（或者更早，因為修復程序是在3月2日發佈的），直到6月16日才披露這個問題。<p>全文如下：<p>Hi zwass,<p>我們寫信告訴你，在2022-02-25 18:28 UTC和2022-03-02 20:47 UTC之間，由於一個錯誤，GitHub應用程序能夠生成具有更高權限的新範圍安裝令牌。你是GitHub上一個安裝了GitHub應用程序的組織的所有者，在這段時間內至少生成了一個新的令牌。雖然我們沒有證據表明這個漏洞被惡意利用，但根據我們現有的數據，我們無法確定是否有以高權限生成的令牌。<p>用戶隱私和安全對於維護信任至關重要，我們希望對類似事件保持儘可能的透明。GitHub本身並沒有經歷產生或導致這一事件的妥協或數據洩露。繼續閱讀以瞭解更多信息。<p>* 發生了什麼？*<p>GitHub通過客戶支持單瞭解到，GitHub應用程序能夠生成具有更高權限的範圍內安裝令牌。<p>GitHub很快修復了這個問題，並確定這個錯誤是最近才出現的，在2022-02-25 18:28 UTC和2022-03-02 20:47 UTC之間存在約5天。<p>GitHub應用程序根據GitHub應用程序安裝到用戶賬戶或組織時授予的範圍和權限生成範圍內的安裝令牌。例如，如果一個GitHub應用程序在安裝過程中請求並被授予對問題的讀取權限，該應用程序生成的範圍內的安裝令牌將具有`issues:read`權限。<p>這個錯誤可能會允許上述安裝產生一個具有`issues:write`的令牌，從授予的`issues:read`權限提升了權限。該錯誤不允許GitHub應用程序生成具有額外作用域的令牌，例如上述例子中的 \"discussions:read\"。該漏洞不允許GitHub應用訪問任何該應用尚未訪問的倉庫。<p>為了利用這個漏洞，GitHub應用的作者需要修改他們應用的代碼，以要求提高生成的令牌的權限。*<p>下列GitHub應用程序在您的組織的錯誤窗口期間生成了範圍廣泛的安裝令牌。我們無法確定代幣是否以高權限生成。<p>組織。GitHub應用程序\n<p>GitHub正在做什麼 *<p>GitHub立即著手修復該漏洞，並開始調查其潛在影響。<p>我們正在通知所有安裝了GitHub應用程序並在該漏洞窗口期間生成了範圍內安裝令牌的組織和用戶賬戶所有者，以便他們能夠保持知情並對其安裝的GitHub應用程序進行審計。 <p>作為這次調查的後續行動，GitHub正在研究如何改進我們的日誌記錄，以便在未來對範圍內的令牌生成和GitHub應用程序的權限進行更深入的分析。*<p>由於GitHub應用程序的多樣性，它們可能的範圍，以及它們可能被授予訪問的存儲庫，我們無法就任何潛在的影響提供建議，因為每個客戶的情況都是獨特的。<p>你可以做什麼 *<p>雖然我們已經更新了我們的系統來解決這個錯誤，你不需要採取行動，我們確實建議你審查你安裝的GitHub應用程序。您可以使用以下指南來評估GitHub應用程序、它們的權限以及它們對您的私有組織倉庫的訪問：<p>https://docs.github.com/en/organizations/keeping-your-organization-secure\n"
}