{
  "@type": "NewsArticle",
  "identifier": "2022--07--11--en--hackernews--HackerNews--NewsArticle--32057297",
  "url": "https://news.ycombinator.com/item?id=32057297",
  "headline": "Ask HN: Moving from Corporate to Solo Dev?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm pretty disillusioned with the corporate rat race...I naively took on some additional managerial/strategic responsibilities assuming I'd get a promotion, but I'm finding that even if I did get the promotion, I'm not enjoying my current work as much, as I'm far less hands-on. I know I can provide value--I've got industry-specific domain expertise and I can write high-quality software.<p>One of the projects I've recently been managing is the outsourcing of some programming work--work outsourced to a team of &quot;professional programmers&quot; but with no domain expertise. I think I could have done better myself in terms of code quality, but even if I had, I know I wouldn't have gotten paid as much since I'm an employee. I'd like to capture that value myself instead of dealing with an OK bonus and sub-inflationary raise.<p>I've been considering trying my hand going solo, offering my skills on a contract basis. But I've never done this, and it's a big change for me. Ideally, I could start with my current employer as a client.<p>How often is this done? What steps should I take and what should I consider? Any resources that you'd recommend?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "disenchanted_ds",
    "url": "https://news.ycombinator.com/user?id=disenchanted_ds"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32057297",
  "sameAs": "https://news.ycombinator.com/item?id=32057297",
  "dateCreated": "2022-07-11T17:46:46.931Z",
  "datePublished": "2022-07-11T15:18:47.000Z",
  "dateModified": "2022-07-11T17:46:46.931Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 17
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 10
    }
  ],
  "headline_zh-Hans": "Ask HN: 从企业转向个人开发？\n",
  "headline_zh-Hant": "Ask HN: 從企業轉向個人開發？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我对公司的竞争相当失望......我天真地承担了一些额外的管理/战略责任，以为自己会得到晋升，但我发现，即使我真的得到了晋升，我也不太喜欢我目前的工作，因为我的动手能力要差得多。我知道我可以提供价值--我有特定行业领域的专业知识，我可以编写高质量的软件。<p>我最近管理的一个项目是外包一些编程工作--工作外包给一个由&quot;专业程序员&quot;组成的团队，但没有领域专业知识。我认为在代码质量方面我自己可以做得更好，但即使我做了，我知道我也不会得到那么多的报酬，因为我是一个雇员。我希望自己能抓住这个价值，而不是应付一个还不错的奖金和次通货膨胀的加薪。<p>我一直在考虑尝试单干，以合同的形式提供我的技能。但我从来没有这样做过，而且这对我来说是一个很大的改变。理想情况下，我可以从我目前的雇主作为客户开始。<p>这种情况经常发生吗？我应该采取什么步骤，应该考虑什么？你有什么资源可以推荐吗？\n",
  "description_zh-Hant": "我對公司的競爭相當失望......我天真地承擔了一些額外的管理/戰略責任，以為自己會得到晉升，但我發現，即使我真的得到了晉升，我也不太喜歡我目前的工作，因為我的動手能力要差得多。我知道我可以提供價值--我有特定行業領域的專業知識，我可以編寫高質量的軟件。<p>我最近管理的一個項目是外包一些編程工作--工作外包給一個由&quot;專業程序員&quot;組成的團隊，但沒有領域專業知識。我認為在代碼質量方面我自己可以做得更好，但即使我做了，我知道我也不會得到那麼多的報酬，因為我是一個僱員。我希望自己能抓住這個價值，而不是應付一個還不錯的獎金和次通貨膨脹的加薪。<p>我一直在考慮嘗試單幹，以合同的形式提供我的技能。但我從來沒有這樣做過，而且這對我來說是一個很大的改變。理想情況下，我可以從我目前的僱主作為客戶開始。<p>這種情況經常發生嗎？我應該採取什麼步驟，應該考慮什麼？你有什麼資源可以推薦嗎？\n"
}