{
  "@type": "NewsArticle",
  "identifier": "2022--07--04--en--hackernews--HackerNews--NewsArticle--31979104",
  "url": "https://news.ycombinator.com/item?id=31979104",
  "headline": "Ask HN: I'm disabled and out of money. Now what?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "TL;DR: I'm a founder who had some success, but now I'm disabled, can't seem to hold down a job.  I'm close to defaulting on my car.  I am (unsurprisingly) depressed.  I need help but don't know where to go.<p>I spent the 2010s as a founder. My company was funded by YC and several others.  We were moderately successful but didn't see a meaningful exit.  After my startup failed, I started consulting to pay the bills.<p>In 2018 I started having problems with chronic pain and gradually became less and less capable on the job.  Consulting gigs were letting me go because I couldn't keep up. The last time I worked was over a year ago, and I finally exhausted my savings in early June 2022.<p>I live as cheaply as I possibly can at this point.  I live with family and only pay for absolute necessities.  It comes out between $1200 and $1500 per month.<p>I'm in the US and I have an application in for SSDI, but, from what I've heard, it's very hard to get benefits, especially if you have an invisible illness like chronic pain.  It's likely that my application will be initially denied and I will have to focus on an appeal.  It could take a year or more of fighting to be approved.<p>I am selling some of my old stuff on eBay but it's exhausting and frustrating given my limitations.  It's not sustainable.<p>I have a car payment due soon and I'm already behind by one.<p>Worst of all, my life is pretty drab at this point.  I am obviously depressed. I see a therapist and a psychiatrist but, fundamentally, the source of my depression is the state of my life. I have nothing to look forward to. I can't even afford to toss a few bucks into side projects so I at least have something to do with my time... I mostly watch TV, play video games and lurk on the internet. It's absolutely soul sucking.<p>I think, given the right environment, I could finish a weekly workload of a bit less than half-time and slowly re-learn how to work again even with my limitations, but no one wants to hire a middle-aged disabled person for part-time work.  Further, all of my experience is in startups and that makes me less palatable to larger companies, but larger companies have more options to accommodate disabled people.<p>I don't know what to do. Has anyone in the HN community been here?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "thrwtllwy",
    "url": "https://news.ycombinator.com/user?id=thrwtllwy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31979104",
  "sameAs": "https://news.ycombinator.com/item?id=31979104",
  "dateCreated": "2022-07-04T17:09:14.105Z",
  "datePublished": "2022-07-04T16:49:13.000Z",
  "dateModified": "2022-07-04T17:09:14.105Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 60
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 16
    }
  ],
  "headline_zh-Hans": "Ask HN: 我是残疾人，没有钱了。现在怎么办？\n",
  "headline_zh-Hant": "Ask HN: 我是殘疾人，沒有錢了。現在怎麼辦？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "TL;DR：我是一个有一些成功的创始人，但现在我是个残疾人，似乎无法坚持工作。 我几乎要拖欠我的车款了。 我（不出所料）很沮丧。 我需要帮助，但不知道该去哪里。<p>我在2010年代是一个创始人。我的公司得到了YC和其他几个人的资助。 我们取得了适度的成功，但没有看到一个有意义的退出。 <p>2018年，我开始出现慢性疼痛的问题，并逐渐变得越来越没有工作能力。 咨询工作让我离开，因为我无法坚持下去。我最后一次工作是在一年多以前，我终于在2022年6月初用完了我的积蓄。<p>在这一点上，我尽可能地生活得便宜。 我和家人住在一起，只支付绝对必需品的费用。 <p>我在美国，我已经申请了SSDI，但是，据我所知，要获得福利是非常困难的，特别是如果你有慢性疼痛这样的隐形疾病。 我的申请很可能一开始就被拒绝了，我将不得不集中精力进行上诉。 <p>我正在eBay上出售我的一些旧东西，但鉴于我的局限性，这很累人，也很让人沮丧。 <p>我的车款很快就要到期了，我已经拖欠了一笔。<p>最糟糕的是，我的生活在这一点上相当单调。 我明显感到抑郁。我去看治疗师和心理医生，但从根本上说，我的抑郁症的根源是我的生活状态。我没有什么可期待的。我甚至没有能力在副业上折腾几块钱，这样我至少能在时间上做点什么......。我主要是看电视、玩电子游戏和在网上闲逛。<p>我认为，如果有合适的环境，我可以完成每周少于一半的工作量，并慢慢地重新学习如何在我的限制下重新工作，但没有人愿意雇用一个中年残疾人做兼职工作。 此外，我所有的经验都是在初创公司，这使我不太容易被大公司接受，但大公司有更多的选择来容纳残疾人。<p>我不知道该怎么办。HN社区中有人来过这里吗？\n",
  "description_zh-Hant": "TL;DR：我是一個有一些成功的創始人，但現在我是個殘疾人，似乎無法堅持工作。 我幾乎要拖欠我的車款了。 我（不出所料）很沮喪。 我需要幫助，但不知道該去哪裡。<p>我在2010年代是一個創始人。我的公司得到了YC和其他幾個人的資助。 我們取得了適度的成功，但沒有看到一個有意義的退出。 <p>2018年，我開始出現慢性疼痛的問題，並逐漸變得越來越沒有工作能力。 諮詢工作讓我離開，因為我無法堅持下去。我最後一次工作是在一年多以前，我終於在2022年6月初用完了我的積蓄。<p>在這一點上，我儘可能地生活得便宜。 我和家人住在一起，只支付絕對必需品的費用。 <p>我在美國，我已經申請了SSDI，但是，據我所知，要獲得福利是非常困難的，特別是如果你有慢性疼痛這樣的隱形疾病。 我的申請很可能一開始就被拒絕了，我將不得不集中精力進行上訴。 <p>我正在eBay上出售我的一些舊東西，但鑑於我的侷限性，這很累人，也很讓人沮喪。 <p>我的車款很快就要到期了，我已經拖欠了一筆。<p>最糟糕的是，我的生活在這一點上相當單調。 我明顯感到抑鬱。我去看治療師和心理醫生，但從根本上說，我的抑鬱症的根源是我的生活狀態。我沒有什麼可期待的。我甚至沒有能力在副業上折騰幾塊錢，這樣我至少能在時間上做點什麼......。我主要是看電視、玩電子遊戲和在網上閒逛。<p>我認為，如果有合適的環境，我可以完成每週少於一半的工作量，並慢慢地重新學習如何在我的限制下重新工作，但沒有人願意僱用一箇中年殘疾人做兼職工作。 此外，我所有的經驗都是在初創公司，這使我不太容易被大公司接受，但大公司有更多的選擇來容納殘疾人。<p>我不知道該怎麼辦。HN社區中有人來過這裡嗎？\n"
}