{
  "@type": "NewsArticle",
  "identifier": "2022--06--05--en--hackernews--HackerNews--NewsArticle--31630610",
  "url": "https://news.ycombinator.com/item?id=31630610",
  "headline": "Show HN: To prevent dry eyes and back pain, I create a macOS app",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "In 2019, I experienced eye soreness and back pain for a while because I was constantly working long hours in front of my 16 inch Macbook without any rest.<p>I decided to do something to change that. I’m not a fan of Apple Watch or smartbands. So the first thing I did was looking for some reminder software to remind me to take a break in the App Store, but none of them were smart enough for my needs. I wish the software could automatically tell if I was working, rather than requiring me to manually set an alarm. At the same time, when I go to the bathroom or drink coffee, it can automatically increase the time I can continue to work afterward.<p>So I created Eye Monitor. Eye Monitor is an automatic reminder tool. It judges whether you are using the computer through the use of the mouse and keyboard.  (which means when a user is watching Youtube videos, Eye Monitor will consider it as not using computer. I haven't found a solution yet.) Whenever you use it continuously, your fatigue value will increase, and after a period of rest, your fatigue value will decrease automatically. When your fatigue value reaches the threshold you set, it will trigger a reminder (including the dock icon, status bar, notification, full-screen pop-up window, etc.).<p>After a year of iteration, Eye monitor now has a chart to show your usage of the day. And users now  can customize the fatigue threshold, rest duration, reminder interval, reminder style, etc., and even customize the text of the notification (My customized notification text is “All work and no play makes Jack a dull boy”) or upload your favorite picture as the wallpaper of the full-screen pop-up window.(Not so useful, but I like it.)<p>I like to set the reminder interval very small, like 1 minute, so that when I turn off the reminder, 1 minute later the reminder will reappear again and I will decide to take a break.<p>This software is like a bit of a nagging mom, taking the trouble to remind you to rest. I hope you will like it. Here is the App Store URL: [https://apps.apple.com/cn/app/eye-monitor/id1527031341?l=en&amp;mt=12](https://apps.apple.com/cn/app/eye-monitor/id1527031341?l=en&amp;mt=12)",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "cswenshuo",
    "url": "https://news.ycombinator.com/user?id=cswenshuo"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31630610",
  "sameAs": "https://news.ycombinator.com/item?id=31630610",
  "dateCreated": "2022-06-05T14:56:09.838Z",
  "datePublished": "2022-06-05T13:01:42.000Z",
  "dateModified": "2022-06-05T14:56:09.838Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 为了防止眼睛干涩和背部疼痛，我创建了一个macOS应用程序\n",
  "headline_zh-Hant": "Show HN: 為了防止眼睛乾澀和背部疼痛，我創建了一個macOS應用程序\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "2019年，我有一段时间经历了眼睛酸痛和背部疼痛，因为我经常长时间在16英寸Macbook前工作，没有任何休息。<p>我决定做一些事情来改变这种状况。我不是苹果手表或智能手环的粉丝。因此，我做的第一件事是在App Store中寻找一些提醒我休息的软件，但没有一款软件足够智能，能满足我的需求。我希望软件能自动判断我是否在工作，而不是要求我手动设置闹钟。同时，当我去洗手间或喝咖啡时，它可以自动增加我之后可以继续工作的时间。<p>所以我创建了Eye Monitor。Eye Monitor是一个自动提醒工具。它判断你是否在通过使用鼠标和键盘来使用电脑。 (这意味着当用户在看Youtube视频时，Eye Monitor会认为它没有使用电脑）。我还没有找到解决办法）。每当你连续使用时，你的疲劳值会增加，经过一段时间的休息，你的疲劳值会自动减少。当你的疲劳值达到你设定的阈值时，就会触发提醒（包括Dock图标、状态栏、通知、全屏弹出窗口等）。<p>经过一年的迭代，Eye monitor现在有一个图表来显示你一天的使用情况。而且用户现在可以定制疲劳阈值、休息时间、提醒间隔、提醒风格等。甚至可以自定义通知的文字（我自定义的通知文字是 \"只工作不玩耍使杰克成为一个无趣的男孩\"）或上传你最喜欢的图片作为全屏弹出窗口的壁纸。（不是很有用，但我喜欢。）<p>我喜欢把提醒间隔设置得非常小，比如1分钟，这样当我关闭提醒时，1分钟后提醒会再次出现，我就会决定休息一下。<p>这个软件就像一个有点唠叨的妈妈，不辞辛苦地提醒你休息。我希望你会喜欢它。这里是App Store的网址。[https://apps.apple.com/cn/app/eye-monitor/id1527031341?l=en&amp;mt=12](https://apps.apple.com/cn/app/eye-monitor/id1527031341?l=en&amp;mt=12)\n",
  "description_zh-Hant": "2019年，我有一段時間經歷了眼睛痠痛和背部疼痛，因為我經常長時間在16英寸Macbook前工作，沒有任何休息。<p>我決定做一些事情來改變這種狀況。我不是蘋果手錶或智能手環的粉絲。因此，我做的第一件事是在App Store中尋找一些提醒我休息的軟件，但沒有一款軟件足夠智能，能滿足我的需求。我希望軟件能自動判斷我是否在工作，而不是要求我手動設置鬧鐘。同時，當我去洗手間或喝咖啡時，它可以自動增加我之後可以繼續工作的時間。<p>所以我創建了Eye Monitor。Eye Monitor是一個自動提醒工具。它判斷你是否在通過使用鼠標和鍵盤來使用電腦。 (這意味著當用戶在看Youtube視頻時，Eye Monitor會認為它沒有使用電腦）。我還沒有找到解決辦法）。每當你連續使用時，你的疲勞值會增加，經過一段時間的休息，你的疲勞值會自動減少。當你的疲勞值達到你設定的閾值時，就會觸發提醒（包括Dock圖標、狀態欄、通知、全屏彈出窗口等）。<p>經過一年的迭代，Eye monitor現在有一個圖表來顯示你一天的使用情況。而且用戶現在可以定製疲勞閾值、休息時間、提醒間隔、提醒風格等。甚至可以自定義通知的文字（我自定義的通知文字是 \"只工作不玩耍使傑克成為一個無趣的男孩\"）或上傳你最喜歡的圖片作為全屏彈出窗口的壁紙。（不是很有用，但我喜歡。）<p>我喜歡把提醒間隔設置得非常小，比如1分鐘，這樣當我關閉提醒時，1分鐘後提醒會再次出現，我就會決定休息一下。<p>這個軟件就像一個有點嘮叨的媽媽，不辭辛苦地提醒你休息。我希望你會喜歡它。這裡是App Store的網址。[https://apps.apple.com/cn/app/eye-monitor/id1527031341?l=en&amp;mt=12](https://apps.apple.com/cn/app/eye-monitor/id1527031341?l=en&amp;mt=12)\n"
}