{
  "@type": "NewsArticle",
  "identifier": "2022--07--16--en--hackernews--HackerNews--NewsArticle--32121858",
  "url": "https://news.ycombinator.com/item?id=32121858",
  "headline": "Ask HN: How did free people in USA thrive in high heat before air-conditioning?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I live in Mid-West USA. It's been hitting 95°F the past few days. I experimented with trying to go without air-conditioning. Couldn't do it. Couldn't work on my computer despite being indoors and having a fan on my desk. Had terrible sleep (despite having a powerful ceiling fan).<p>Air-conditioning is not even a hundred years old and was originally not even invented to keep people cool (it was invented to keep machines from overheating).<p>How did free people stay thriving and productive during summer in places like Florida, and certain other parts of America where there's not only extreme heat but also extreme humidity?<p>Is it a case of:<p>- temps have gotten hotter more recently?<p>- if I had continued my experiment, I would have eventually gotten used to the heat and learned to thrive in it?<p>When it gets extremely hot around here, I think a lot about the Bedouin with all their layers of clothes in unimaginable heat. I also think about photos of Americans from around a hundred years ago when all men seemed to be dressed in suits and a hat. Such a mystery to me. (And yes, I realize the Bedouin wear all those layers to protect themselves from hot wind. But still, it must feel like an oven in there.)",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "reactspa",
    "url": "https://news.ycombinator.com/user?id=reactspa"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32121858",
  "sameAs": "https://news.ycombinator.com/item?id=32121858",
  "dateCreated": "2022-07-16T23:24:27.210Z",
  "datePublished": "2022-07-16T20:53:11.000Z",
  "dateModified": "2022-07-16T23:24:27.210Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 16
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 23
    }
  ],
  "headline_zh-Hans": "Ask HN: 在没有空调之前，美国的自由人是如何在高温下生存的？\n",
  "headline_zh-Hant": "Ask HN: 在沒有空調之前，美國的自由人是如何在高溫下生存的？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我住在美国中西部地区。在过去的几天里，气温一直达到95华氏度。我试着尝试不开空调。没能做到这一点。尽管我在室内，而且我的桌子上有一个风扇，但我无法在电脑上工作。<p>空调甚至没有一百年的历史，最初甚至不是为了让人们保持凉爽而发明的（它是为了防止机器过热而发明的）。<p>在佛罗里达这样的地方，以及美国的某些其他地方，不仅有极端的热量，还有极端的湿度，自由人是如何在夏天保持繁荣和生产力的？ <p>是不是因为：<p>-最近温度越来越高？<p>-如果我继续我的实验，我最终会习惯于热，并学会在热中茁壮成长？<p>当这里变得非常热时，我经常想到贝都因人在难以想象的热中穿了那么多层衣服。我还想到了大约一百年前的美国人的照片，当时所有的男人似乎都穿着西装和帽子。这对我来说是个谜。(是的，我知道贝都因人穿那么多层衣服是为了保护自己不受热风侵袭。但是，在那里一定感觉像一个烤箱）。\n",
  "description_zh-Hant": "我住在美國中西部地區。在過去的幾天裡，氣溫一直達到95華氏度。我試著嘗試不開空調。沒能做到這一點。儘管我在室內，而且我的桌子上有一個風扇，但我無法在電腦上工作。<p>空調甚至沒有一百年的歷史，最初甚至不是為了讓人們保持涼爽而發明的（它是為了防止機器過熱而發明的）。<p>在佛羅里達這樣的地方，以及美國的某些其他地方，不僅有極端的熱量，還有極端的溼度，自由人是如何在夏天保持繁榮和生產力的？ <p>是不是因為：<p>-最近溫度越來越高？<p>-如果我繼續我的實驗，我最終會習慣於熱，並學會在熱中茁壯成長？<p>當這裡變得非常熱時，我經常想到貝都因人在難以想象的熱中穿了那麼多層衣服。我還想到了大約一百年前的美國人的照片，當時所有的男人似乎都穿著西裝和帽子。這對我來說是個謎。(是的，我知道貝都因人穿那麼多層衣服是為了保護自己不受熱風侵襲。但是，在那裡一定感覺像一個烤箱）。\n"
}