{
  "@type": "NewsArticle",
  "identifier": "2022--04--27--en--hackernews--HackerNews--NewsArticle--31181237",
  "url": "https://news.ycombinator.com/item?id=31181237",
  "headline": "Show HN: Loodio – A Bathroom Privacy Device",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN!<p>A few years ago our company moved to a new office. That office has a insufferable bathroom in terms of privacy. You could hear a needle fall on the floor inside of it which made it very uncomfortable to use the bathroom.<p>Many people ran the tap water or fake coughed to cover their “noises”, especially doing “no 2”.<p>I got sick of not being able to be comfortable in the bathroom and hearing everyone’s toilet business so I decided to make a music player using a Raspberry Pi and soldered on a motion detector that started a white noise and music whenever you entered the bathroom to hide these sounds.<p>A lot of people said they wanted one so I thought hey I should try to make this into a product.<p>A lot of time and money was wasted hiring consultants until I 13 months ago said “enough of wasting money, I’ll just build it myself”.<p>Today I launched a kickstarter and am selling 50 units.<p>Link: https://www.kickstarter.com/projects/loodio/loodio-bathroom-privacy<p>I know people in US have loud fans and such to cover for this, and a lot of people just play music on their phones but the problem with that is: when you manually play music in there you indicate you are going to do something embarrassing!<p>How else are you solving this problem?<p>I tried all existing solutions like the Sound Princess from Japan and other chinese crap on Amazon/Ali but they were not up to the task.<p>I think there could be a market for Loodio. \nWhat do you think?",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "testmasterflex",
    "url": "https://news.ycombinator.com/user?id=testmasterflex"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31181237",
  "sameAs": "https://news.ycombinator.com/item?id=31181237",
  "dateCreated": "2022-04-27T15:55:40.041Z",
  "datePublished": "2022-04-27T15:32:12.000Z",
  "dateModified": "2022-04-27T15:55:40.041Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 9
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 8
    }
  ],
  "headline_zh-Hans": "Show HN: Loodio - 一种浴室隐私装置",
  "headline_zh-Hant": "Show HN: Loodio - 一種浴室隱私裝置",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN！<p>几年前，我们公司搬到一个新的办公室。那间办公室有一个在隐私方面令人难以忍受的浴室。你可以听到里面的针掉在地上的声音，这让你在使用卫生间时非常不舒服。<p>许多人用自来水冲洗或假咳嗽来掩盖他们的 \"噪音\"，特别是做 \"无2\"。 <p>我厌倦了在浴室里不能自在，听到每个人的厕所业务，所以我决定用Raspberry Pi制作一个音乐播放器，并在运动探测器上焊接，只要你进入浴室就会启动白噪声和音乐，以掩盖这些声音。<p>很多人说他们想要一个，所以我想，嘿，我应该试着把这个做成一个产品。 <p>聘请顾问浪费了很多时间和金钱，直到13个月前我说：\"浪费的钱够多了，我就自己做吧。<p>今天我发起了一个kickstarter，正在销售50台。<p>链接：https://www.kickstarter. com/projects/loodio/loodio-bathroom-privacy<p>我知道美国人有大风扇之类的东西来掩盖这个问题，很多人只是用手机播放音乐，但问题是：当你在里面手动播放音乐时，你就表明你要做一些令人尴尬的事情！<p>你还能怎么解决？ <p>你还如何解决这个问题？<p>我尝试了所有现有的解决方案，如来自日本的声音公主和亚马逊/阿里上的其他中国垃圾，但它们都不能胜任。<p>我认为Loodio可能有一个市场。\n你怎么看？",
  "description_zh-Hant": "嗨，HN！<p>幾年前，我們公司搬到一個新的辦公室。那間辦公室有一個在隱私方面令人難以忍受的浴室。你可以聽到裡面的針掉在地上的聲音，這讓你在使用衛生間時非常不舒服。<p>許多人用自來水沖洗或假咳嗽來掩蓋他們的 \"噪音\"，特別是做 \"無2\"。 <p>我厭倦了在浴室裡不能自在，聽到每個人的廁所業務，所以我決定用Raspberry Pi製作一個音樂播放器，並在運動探測器上焊接，只要你進入浴室就會啟動白噪聲和音樂，以掩蓋這些聲音。<p>很多人說他們想要一個，所以我想，嘿，我應該試著把這個做成一個產品。 <p>聘請顧問浪費了很多時間和金錢，直到13個月前我說：\"浪費的錢夠多了，我就自己做吧。<p>今天我發起了一個kickstarter，正在銷售50臺。<p>鏈接：https://www.kickstarter. com/projects/loodio/loodio-bathroom-privacy<p>我知道美國人有大風扇之類的東西來掩蓋這個問題，很多人只是用手機播放音樂，但問題是：當你在裡面手動播放音樂時，你就表明你要做一些令人尷尬的事情！<p>你還能怎麼解決？ <p>你還如何解決這個問題？<p>我嘗試了所有現有的解決方案，如來自日本的聲音公主和亞馬遜/阿里上的其他中國垃圾，但它們都不能勝任。<p>我認為Loodio可能有一個市場。\n你怎麼看？"
}