{
  "@type": "NewsArticle",
  "identifier": "2022--06--05--en--hackernews--HackerNews--NewsArticle--31634704",
  "url": "https://news.ycombinator.com/item?id=31634704",
  "headline": "Ask HN: Has anyone successfully used LibreOffice for their business?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We're a ~40 person startup, about to scale post-series A. We have been using Google Suite since the beginning in 2015, and honestly it's just terrible software and feels like it has had zero updates in 7 years. One of the biggest problems for me with Gsuite is that there is no real offline support (I know there is supposed to be, but it has never worked for me, plus the drive isn't available offline). I work a lot on trains crossing Europe, or sometimes on flights. I just want to have my files accessible.<p>I use LibreOffice personally, and I'm thinking about moving the team to it before we seriously grow.<p>Has anyone tried this in their companies? Was it successful? I'm especially interested in companies of a similar size (or larger) than ours, and those where not everyone is super technical / a software engineer.<p>My big concerns are support and training, I think there are companies who offer this which would make it a lot easier.<p>(Edit: to be clear, our CFO will probably continue to use Excel, as will some of the team who build very complicated modelling sheets as that is what they're used to, but I'm thinking for the rest of us who mostly need decent spreadsheets, and good word-processing and presentation tools).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "gtf21",
    "url": "https://news.ycombinator.com/user?id=gtf21"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31634704",
  "sameAs": "https://news.ycombinator.com/item?id=31634704",
  "dateCreated": "2022-06-05T22:23:49.969Z",
  "datePublished": "2022-06-05T20:50:37.000Z",
  "dateModified": "2022-06-05T22:23:49.969Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 12
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "Ask HN: 有人成功地将LibreOffice用于他们的业务吗？\n",
  "headline_zh-Hant": "Ask HN: 有人成功地將LibreOffice用於他們的業務嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们是一家约40人的初创公司，即将在A轮融资后扩大规模。我们从2015年开始使用谷歌套件，说实话，它只是糟糕的软件，感觉它在7年内没有任何更新。对我来说，Gsuite最大的问题之一是没有真正的离线支持（我知道应该有，但它从来没有为我工作过，另外驱动器也不能离线）。我经常在穿越欧洲的火车上工作，或者有时在飞机上工作。我只是想让我的文件可以被访问。<p>我个人使用LibreOffice，我正在考虑在我们认真发展之前将团队转移到它。<p>有人在他们的公司尝试过这个吗？它是否成功？我特别感兴趣的是那些规模与我们相似（或更大）的公司，以及那些不是每个人都是超级技术员/软件工程师的公司。<p>我最关心的是支持和培训，我认为有一些公司提供这种服务，这将使它变得更加容易。 <p>（编辑：为了明确，我们的首席财务官可能会继续使用Excel，一些建立非常复杂的建模表的团队也会使用，因为他们已经习惯了，但我在想，对于我们其他人来说，他们大多需要体面的电子表格，以及良好的文字处理和演示工具）。\n",
  "description_zh-Hant": "我們是一家約40人的初創公司，即將在A輪融資後擴大規模。我們從2015年開始使用谷歌套件，說實話，它只是糟糕的軟件，感覺它在7年內沒有任何更新。對我來說，Gsuite最大的問題之一是沒有真正的離線支持（我知道應該有，但它從來沒有為我工作過，另外驅動器也不能離線）。我經常在穿越歐洲的火車上工作，或者有時在飛機上工作。我只是想讓我的文件可以被訪問。<p>我個人使用LibreOffice，我正在考慮在我們認真發展之前將團隊轉移到它。<p>有人在他們的公司嘗試過這個嗎？它是否成功？我特別感興趣的是那些規模與我們相似（或更大）的公司，以及那些不是每個人都是超級技術員/軟件工程師的公司。<p>我最關心的是支持和培訓，我認為有一些公司提供這種服務，這將使它變得更加容易。 <p>（編輯：為了明確，我們的首席財務官可能會繼續使用Excel，一些建立非常複雜的建模表的團隊也會使用，因為他們已經習慣了，但我在想，對於我們其他人來說，他們大多需要體面的電子表格，以及良好的文字處理和演示工具）。\n"
}