{
  "@type": "NewsArticle",
  "identifier": "2022--06--27--en--hackernews--HackerNews--NewsArticle--31897878",
  "url": "https://news.ycombinator.com/item?id=31897878",
  "headline": "Tell HN: Google deleted my spreadsheet, review request says file can't be found",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have (or had as it seems now) a spreadsheet in google docs tracking important business metrics. I was trying to look at it today and got the message:<p>&quot;We're sorry. You can't access this item because it is in violation of our Terms of Service. If you feel this is in error, please request a review. Find out more about this topic at the Google Drive Help Center.&quot;<p>If I click the request a review I get:<p>&quot;404. That's an error. Sorry, this item cannot be found or is not available.&quot;<p>This spreadsheet simply had metrics and domains. I find it near impossible it was violating any terms of service unless there is a shadow blacklist of domain names which somehow trigger a file being removed. And I'm left with no recourse to even request a review or get my file back?<p>I turned on airplane mode on my phone and was able to get an old cached copy, export was only possible as a PDF. So at least I have a slightly stale version of raw data that way.<p>Even as a paying customer, this is pretty embarrassing and there seems no recourse is possible?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "ohashi",
    "url": "https://news.ycombinator.com/user?id=ohashi"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31897878",
  "sameAs": "https://news.ycombinator.com/item?id=31897878",
  "dateCreated": "2022-06-27T19:02:39.369Z",
  "datePublished": "2022-06-27T17:35:18.000Z",
  "dateModified": "2022-06-27T19:02:39.369Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 41
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "告诉HN：谷歌删除了我的电子表格，审查请求说找不到文件\n",
  "headline_zh-Hant": "告訴HN：谷歌刪除了我的電子表格，審查請求說找不到文件\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在google docs里有一个追踪重要业务指标的电子表格（或者说现在看来是有的）。我今天想看看它，得到的信息是：<p>&quot;我们很抱歉。你不能访问这个项目，因为它违反了我们的服务条款。如果你觉得这是个错误，请请求审查。<p>如果我点击请求审查，我得到：<p>&quot;404。这是一个错误。对不起，找不到这个项目或无法使用。&quot;<p>这个电子表格只是有指标和域名。我发现它几乎不可能违反任何服务条款，除非有一个域名的影子黑名单，以某种方式触发文件被删除。我甚至没有办法要求审查或取回我的文件？<p>我打开了手机的飞行模式，能够得到一个旧的缓存副本，但只能以PDF格式导出。所以，至少我有一个稍微陈旧的原始数据版本。<p>即使作为一个付费客户，这也是相当尴尬的，而且似乎没有任何追索权是可能的？\n",
  "description_zh-Hant": "我在google docs裡有一個追蹤重要業務指標的電子表格（或者說現在看來是有的）。我今天想看看它，得到的信息是：<p>&quot;我們很抱歉。你不能訪問這個項目，因為它違反了我們的服務條款。如果你覺得這是個錯誤，請請求審查。<p>如果我點擊請求審查，我得到：<p>&quot;404。這是一個錯誤。對不起，找不到這個項目或無法使用。&quot;<p>這個電子表格只是有指標和域名。我發現它幾乎不可能違反任何服務條款，除非有一個域名的影子黑名單，以某種方式觸發文件被刪除。我甚至沒有辦法要求審查或取回我的文件？<p>我打開了手機的飛行模式，能夠得到一箇舊的緩存副本，但只能以PDF格式導出。所以，至少我有一個稍微陳舊的原始數據版本。<p>即使作為一個付費客戶，這也是相當尷尬的，而且似乎沒有任何追索權是可能的？\n"
}