{
  "@type": "NewsArticle",
  "identifier": "2022--04--28--en--hackernews--HackerNews--NewsArticle--31189762",
  "url": "https://news.ycombinator.com/item?id=31189762",
  "headline": "Why isn't anyone talking about soil? The cause of a potential apocalypse by 2040",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Soil is the one of the largest ecosystems on the planet. Each handful of soil has billions of microorganisms in it. These microorganisms are the very basis of our existence. Without them the soil will not have organic content. If soil doesn't have organic content, then we can't grow our food. If we can't go our food, we will die of starvation. Soil extinction means that the soil has been stripped of all its organic content. The threat of soil extinction is not restricted to a small part of the world. It is estimated that 52% of the world's agricultural land is already degraded. It is estimated that at the current pace of soil extinction we are heading for a sure apocalypse sort of situation in just 30, 40 years from now.<p>What is the cause of soil extinction?<p>Modern agricultural practices have become extremely unsustainable. A huge percentage of farmers across the world go in for mono-cropping. This means that tilled land is left open in the sun for weeks on end. This results in the death of the many microorganisms which call the soil home. This will lead to a direct decrease in the quality of the soil. The gradual degradation of soil quality will culminate in soil extinction.<p>How can we rejuvenate the soil?<p>Soil is rejuvenated when we cover it with plant and animal waste. The plant and animal waste is manure which rejuvenates the soil and enhances the organic content. It is said that soil across the world now has around 0.5% organic content. If we can increase it to around 5-6% we can rejuvenate the soil and reverse soil extinction. The general suggestion is that if a farmer has at least a small percentage of his/her agricultural land under tree cover and then uses the plant waste that it generates to rejuvenate his entire farm, then we will surely be on track towards soil rejuvenation. But this needs to happen at a global scale, small scale solutions can't reverse the damage we have done. That is why need everyone in the world to talk about soil and create awareness about it, so that we can have governments all across the world creating policies which encourage farmers to bring land under tree cover.<p>Carbon stored in soil is 3x that in living plants, and 2x that in the atmosphere, which means soil is crucial for carbon sequestration. Therefore, unsustainable farming practices are a huge contributor to the release of greenhouse gases and as a result a direct contributor towards climate change. If the world's soils are not revitalized, they could release 850 billion tonnes of carbon dioxide into the atmosphere contributing to climate change. This is more than all of humanity's emissions in the last 30 years combined.<p>Even though we are facing such a dire situation threatening our very existence, we hardly ever hear soil being discussed on mainstream media and social media.<p>It is extremely important that we all wake up before it is too late. We are indeed staring at a potential apocalypse. But the good news is that we have a 5-6 year window wherein we can come out of this dire situation through with the right policy change and worldwide awareness.<p>So, all that I humbly ask you to do is just this: please do your own research on this disaster-in-waiting and please talk to literally everyone you know about this. We need worldwide awareness of this potential apocalypse. Only then will governments across the world wake up and do the necessary policy change needed to ensure that humanity doesn't die of starvation and global warming.<p>It is also important to know that what is a huge threat can also be turned into the biggest opportunity to reverse climate change. We can leverage the carbon holding capabilities of the soil to finally provide a solution for climate change.<p>So, we need to speak out and drive policy change to revitalize soil. Doing this will get us out of the mess we are in now and also make this earth a much better place to live 20 years from now.<p>Soil revitalization is all we need to do!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "expansiveonenes",
    "url": "https://news.ycombinator.com/user?id=expansiveonenes"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31189762",
  "sameAs": "https://news.ycombinator.com/item?id=31189762",
  "dateCreated": "2022-04-28T08:13:54.184Z",
  "datePublished": "2022-04-28T07:39:15.000Z",
  "dateModified": "2022-04-28T08:13:54.184Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 7
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "为什么没有人谈论土壤问题？到2040年可能出现的世界末日的原因",
  "headline_zh-Hant": "為什麼沒有人談論土壤問題？到2040年可能出現的世界末日的原因",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "土壤是地球上最大的生态系统之一。每一把土壤中都有数十亿的微生物。这些微生物是我们生存的基础。没有它们，土壤就没有有机成分。如果土壤没有有机物含量，那么我们就不能种植我们的食物。如果我们不能去我们的食物，我们将死于饥饿。土壤灭绝意味着土壤已经被剥夺了所有的有机成分。土壤灭绝的威胁并不限于世界上的一小部分地区。据估计，世界上52%的农业用地已经退化了。据估计，按照目前土壤灭绝的速度，我们将在30、40年后面临一个肯定的启示。<p>土壤灭绝的原因是什么？世界各地有很大比例的农民采用单一的种植方式。这意味着翻耕的土地在阳光下连续几个星期都是露天的。这导致了以土壤为家的许多微生物的死亡。这将导致土壤质量的直接下降。土壤质量的逐渐退化将最终导致土壤灭绝。<p>我们如何使土壤恢复活力？<p>当我们用植物和动物粪便覆盖土壤时，土壤就会恢复活力。植物和动物粪便就是粪便，它能使土壤恢复活力并提高有机成分。据说，现在全世界的土壤都有大约0.5%的有机含量。如果我们能将其提高到5-6%左右，我们就能使土壤恢复活力，并扭转土壤灭绝的局面。一般的建议是，如果农民至少有一小部分农田被树木覆盖，然后利用其产生的植物废料来恢复整个农场的活力，那么我们就一定会走上土壤复兴的道路。但这需要在全球范围内进行，小规模的解决方案无法扭转我们已经造成的损害。这就是为什么需要世界上每个人都来讨论土壤问题，并建立这方面的意识，这样我们就可以让世界各地的政府制定政策，鼓励农民将土地置于树木覆盖之下。因此，不可持续的耕作方式是释放温室气体的一个巨大贡献者，因此也是气候变化的直接贡献者。如果世界上的土壤没有得到振兴，它们可能会向大气层释放8500亿吨二氧化碳，导致气候变化。这比人类在过去30年中的所有排放量加起来还要多。<p>尽管我们正面临着如此严峻的形势，威胁着我们的生存，但我们几乎没有在主流媒体和社交媒体上听到过对土壤的讨论。<p>在为时已晚之前，我们都应该醒过来，这一点极其重要。我们确实在盯着一个潜在的启示录。但好消息是，我们有5-6年的时间，通过正确的政策变化和全球意识，我们可以走出这个可怕的局面。<p>因此，我谦卑地要求你做的只是：请对这个正在等待的灾难做自己的研究，并请与你认识的所有人谈论这个问题。我们需要全世界对这个潜在的世界末日的认识。只有这样，世界各国政府才会醒悟，并进行必要的政策改革，以确保人类不会死于饥饿和全球变暖。<p>同样重要的是要知道，一个巨大的威胁也可以变成扭转气候变化的最大机会。我们可以利用土壤的持碳能力，最终为气候变化提供一个解决方案。<p>因此，我们需要大声疾呼，推动政策变革，以振兴土壤。这样做将使我们摆脱现在的困境，也使这个地球在20年后成为一个更美好的居住地。<p>土壤振兴是我们需要做的一切",
  "description_zh-Hant": "土壤是地球上最大的生態系統之一。每一把土壤中都有數十億的微生物。這些微生物是我們生存的基礎。沒有它們，土壤就沒有有機成分。如果土壤沒有有機物含量，那麼我們就不能種植我們的食物。如果我們不能去我們的食物，我們將死於飢餓。土壤滅絕意味著土壤已經被剝奪了所有的有機成分。土壤滅絕的威脅並不限於世界上的一小部分地區。據估計，世界上52%的農業用地已經退化了。據估計，按照目前土壤滅絕的速度，我們將在30、40年後面臨一個肯定的啟示。<p>土壤滅絕的原因是什麼？世界各地有很大比例的農民採用單一的種植方式。這意味著翻耕的土地在陽光下連續幾個星期都是露天的。這導致了以土壤為家的許多微生物的死亡。這將導致土壤質量的直接下降。土壤質量的逐漸退化將最終導致土壤滅絕。<p>我們如何使土壤恢復活力？<p>當我們用植物和動物糞便覆蓋土壤時，土壤就會恢復活力。植物和動物糞便就是糞便，它能使土壤恢復活力並提高有機成分。據說，現在全世界的土壤都有大約0.5%的有機含量。如果我們能將其提高到5-6%左右，我們就能使土壤恢復活力，並扭轉土壤滅絕的局面。一般的建議是，如果農民至少有一小部分農田被樹木覆蓋，然後利用其產生的植物廢料來恢復整個農場的活力，那麼我們就一定會走上土壤復興的道路。但這需要在全球範圍內進行，小規模的解決方案無法扭轉我們已經造成的損害。這就是為什麼需要世界上每個人都來討論土壤問題，並建立這方面的意識，這樣我們就可以讓世界各地的政府制定政策，鼓勵農民將土地置於樹木覆蓋之下。因此，不可持續的耕作方式是釋放溫室氣體的一個巨大貢獻者，因此也是氣候變化的直接貢獻者。如果世界上的土壤沒有得到振興，它們可能會向大氣層釋放8500億噸二氧化碳，導致氣候變化。這比人類在過去30年中的所有排放量加起來還要多。<p>儘管我們正面臨著如此嚴峻的形勢，威脅著我們的生存，但我們幾乎沒有在主流媒體和社交媒體上聽到過對土壤的討論。<p>在為時已晚之前，我們都應該醒過來，這一點極其重要。我們確實在盯著一個潛在的啟示錄。但好消息是，我們有5-6年的時間，通過正確的政策變化和全球意識，我們可以走出這個可怕的局面。<p>因此，我謙卑地要求你做的只是：請對這個正在等待的災難做自己的研究，並請與你認識的所有人談論這個問題。我們需要全世界對這個潛在的世界末日的認識。只有這樣，世界各國政府才會醒悟，並進行必要的政策改革，以確保人類不會死於飢餓和全球變暖。<p>同樣重要的是要知道，一個巨大的威脅也可以變成扭轉氣候變化的最大機會。我們可以利用土壤的持碳能力，最終為氣候變化提供一個解決方案。<p>因此，我們需要大聲疾呼，推動政策變革，以振興土壤。這樣做將使我們擺脫現在的困境，也使這個地球在20年後成為一個更美好的居住地。<p>土壤振興是我們需要做的一切"
}