{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--hackernews--HackerNews--NewsArticle--32299674",
  "url": "https://news.ycombinator.com/item?id=32299674",
  "headline": "Show HN: Rentaflop – Render your Blender projects without sacrificing quality",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN,<p>My name is David Sokol, and I'm the founder of rentaflop (https://rentaflop.com). We're a crowdsourced render farm aimed at making Blender rendering fast and affordable.<p>If you've used Blender, then I'm sure you've experienced the pain of waiting around for your animations to render. You've probably even had to sacrifice the quality of your work to reduce your render times. I've been there too.<p>If you're like me, then you're also disappointed with the alternative solutions: spending thousands of dollars on graphics cards or using prohibitively expensive cloud render farms to get fast render times. Our solution to this dilemma is to leverage low opportunity cost hardware from around the world to allow Blender artists to render their projects quickly, affordably, and without compromising on quality. Since most graphics card owners aren't utilizing their hardware to do valuable work 24/7, we provide them with a way to make money without lifting a finger, while lowering the cost curve for 3D rendering.<p>We're currently doing a private beta. If you'd like to get early access, check out our site (https://rentaflop.com) and join the waitlist. If you're a graphics card owner who wants to help Blender artists while earning money, reach out to support@rentaflop.com and we'll help you get set up.<p>Please leave a comment below, we'd love to hear your thoughts :)",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "dasokol112358",
    "url": "https://news.ycombinator.com/user?id=dasokol112358"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32299674",
  "sameAs": "https://news.ycombinator.com/item?id=32299674",
  "dateCreated": "2022-07-31T23:57:35.997Z",
  "datePublished": "2022-07-31T22:59:26.000Z",
  "dateModified": "2022-07-31T23:57:35.997Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 9
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "Show HN: Rentaflop - 渲染你的Blender项目而不牺牲质量\n",
  "headline_zh-Hant": "Show HN: Rentaflop - 渲染你的Blender項目而不犧牲質量\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hi HN,<p>我叫David Sokol，我是rentaflop（https://rentaflop.com）的创始人。我们是一个众包的渲染农场，旨在让Blender的渲染速度更快，价格更合理。<p>如果你使用过Blender，那么我相信你一定经历过等待动画渲染的痛苦。你甚至可能不得不牺牲你的工作质量来减少你的渲染时间。<p>如果你和我一样，那么你也会对其他的解决方案感到失望：花费数千美元购买显卡或使用昂贵的云渲染农场来获得快速的渲染时间。我们对这一困境的解决方案是利用世界各地的低机会成本硬件，让Blender艺术家快速、经济地渲染他们的项目，并且不影响质量。由于大多数显卡拥有者并没有利用他们的硬件来做有价值的工作，我们为他们提供了一种不用动一根手指就能赚钱的方法，同时降低了3D渲染的成本曲线。如果你想获得早期访问，请查看我们的网站（https://rentaflop.com）并加入等待名单。如果你是一个显卡拥有者，想在赚钱的同时帮助Blender艺术家，请联系support@rentaflop.com，我们会帮助你建立起来。<p>请在下面留言，我们很想听听你的想法：)\n",
  "description_zh-Hant": "Hi HN,<p>我叫David Sokol，我是rentaflop（https://rentaflop.com）的創始人。我們是一個眾包的渲染農場，旨在讓Blender的渲染速度更快，價格更合理。<p>如果你使用過Blender，那麼我相信你一定經歷過等待動畫渲染的痛苦。你甚至可能不得不犧牲你的工作質量來減少你的渲染時間。<p>如果你和我一樣，那麼你也會對其他的解決方案感到失望：花費數千美元購買顯卡或使用昂貴的雲渲染農場來獲得快速的渲染時間。我們對這一困境的解決方案是利用世界各地的低機會成本硬件，讓Blender藝術家快速、經濟地渲染他們的項目，並且不影響質量。由於大多數顯卡擁有者並沒有利用他們的硬件來做有價值的工作，我們為他們提供了一種不用動一根手指就能賺錢的方法，同時降低了3D渲染的成本曲線。如果你想獲得早期訪問，請查看我們的網站（https://rentaflop.com）並加入等待名單。如果你是一個顯卡擁有者，想在賺錢的同時幫助Blender藝術家，請聯繫support@rentaflop.com，我們會幫助你建立起來。<p>請在下面留言，我們很想聽聽你的想法：)\n"
}