{
  "@type": "NewsArticle",
  "identifier": "2022--08--16--en--hackernews--HackerNews--NewsArticle--32481555",
  "url": "https://news.ycombinator.com/item?id=32481555",
  "headline": "Ask HN: Are we building a tech dystopia?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Is it just me or are we heading into a future we don't want? I find it weird as a software engineer but sometimes I feel like we're building a tyrannical system of control. An all-encompassing tech monster where we'll be plugged into the matrix by implants, a VR metaverse dominated by super sophisticated ad tech, all controlled by super intelligent AGI that will be owned by an ever richer and smaller tech elite, consuming culture that's increasingly produced by AI (think DALL E and where that's headed...). It sounds like hell on earth to me if I'm honest.<p>Sorry to be such a doomer, and maybe I'm getting old, but so much of where we heading these days fills me with quiet dread.<p>Before someone posts it, I'm well-aware of the Douglas Adam quote...<p>&quot;I've come up with a set of rules that describe our reactions to technologies:\n1. Anything that is in the world when you’re born is normal and ordinary and is just a natural part of the way the world works.\n2. Anything that's invented between when you’re fifteen and thirty-five is new and exciting and revolutionary and you can probably get a career in it.\n3. Anything invented after you're thirty-five is against the natural order of things.&quot;<p>Maybe this is me (I'm 40 something), but maybe, just maybe, I have a point? Talk me out of my despair Hacker News!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jmfldn",
    "url": "https://news.ycombinator.com/user?id=jmfldn"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32481555",
  "sameAs": "https://news.ycombinator.com/item?id=32481555",
  "dateCreated": "2022-08-16T16:37:04.267Z",
  "datePublished": "2022-08-16T11:40:43.000Z",
  "dateModified": "2022-08-16T16:37:04.267Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 67
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 44
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们是否正在建立一个科技二元论？\n",
  "headline_zh-Hant": "Ask HN: 我們是否正在建立一個科技二元論？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "是我的问题，还是我们正在走向一个我们不想要的未来？作为一名软件工程师，我觉得这很奇怪，但有时我觉得我们正在建立一个暴虐的控制系统。一个包罗万象的科技怪物，我们将被植入矩阵，一个由超级复杂的广告技术主导的VR元空间，所有这些都由超级智能的AGI控制，这些AGI将被一个越来越富有、越来越小的科技精英所拥有，消费文化越来越由AI生产（想想DALL E和它的走向...）。如果我说实话，这对我来说就像是人间地狱。<p>很抱歉我是这样的人，也许我已经老了，但我们这些天的走向让我充满了安静的恐惧。<p>在有人发帖之前，我很清楚道格拉斯-亚当的那句话...<p>&quot;我想出了一套描述我们对技术反应的规则。\n1. 当你出生时，世界上的任何东西都是正常和普通的，只是世界运作方式的一个自然部分。\n2. 2.在你15岁到35岁之间发明的任何东西都是新的、令人兴奋的和革命性的，你可能会在其中找到职业。\n3. 任何在你35岁之后发明的东西都是违反自然规律的。<quot;<p>也许这就是我（我已经40多岁了），但也许，只是也许，我有一个观点？说说我的绝望Hacker News!\n",
  "description_zh-Hant": "是我的問題，還是我們正在走向一個我們不想要的未來？作為一名軟件工程師，我覺得這很奇怪，但有時我覺得我們正在建立一個暴虐的控制系統。一個包羅萬象的科技怪物，我們將被植入矩陣，一個由超級複雜的廣告技術主導的VR元空間，所有這些都由超級智能的AGI控制，這些AGI將被一個越來越富有、越來越小的科技精英所擁有，消費文化越來越由AI生產（想想DALL E和它的走向...）。如果我說實話，這對我來說就像是人間地獄。<p>很抱歉我是這樣的人，也許我已經老了，但我們這些天的走向讓我充滿了安靜的恐懼。<p>在有人發帖之前，我很清楚道格拉斯-亞當的那句話...<p>&quot;我想出了一套描述我們對技術反應的規則。\n1. 當你出生時，世界上的任何東西都是正常和普通的，只是世界運作方式的一個自然部分。\n2. 2.在你15歲到35歲之間發明的任何東西都是新的、令人興奮的和革命性的，你可能會在其中找到職業。\n3. 任何在你35歲之後發明的東西都是違反自然規律的。<quot;<p>也許這就是我（我已經40多歲了），但也許，只是也許，我有一個觀點？說說我的絕望Hacker News!\n"
}