{
  "@type": "NewsArticle",
  "identifier": "2022--08--22--en--hackernews--HackerNews--NewsArticle--32545466",
  "url": "https://news.ycombinator.com/item?id=32545466",
  "headline": "Ask HN: Our users don't want to pay taxes",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Our platform caters to small business owners and individual sellers in a very particular niche. On the surface we're doing well; we have no trouble getting more users without spending a dime on marketing, our buyers and sellers are frequently using the platform and are happy, users are engaged and willing to talk with us, and we're even making a bit of money too.<p>However, we have one massive problem: our merchants are not used to paying taxes and are deeply afraid of using our more monetized features because we are legally required to fill out a 1099-K on their behalf. It's one part &quot;I don't want the government taking my money&quot; to two parts &quot;I don't know how taxes work&quot; in most cases that we've looked into.<p>Now, some of our sellers don't mind, but the vast (and growing) majority are not comfortable with taxes. This presents a problem as we're still growing, but not sustainably. We obviously want to keep pursuing this startup idea but unless something changes, it doesn't seem likely to work out.<p>To solve this, we've tried hiring tax experts to explain how taxes work or why it's not as scary as they might think, but it hasn't been very convincing. On the more drastic side we've been thinking about switching business models a bit, but it seems so crazy to me when there is a huge opportunity right in front of us that we can't seem to capitalize on.<p>Anyone have any experience with this sort of thing? What works? What doesn't?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway5678i",
    "url": "https://news.ycombinator.com/user?id=throwaway5678i"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32545466",
  "sameAs": "https://news.ycombinator.com/item?id=32545466",
  "dateCreated": "2022-08-22T02:29:22.133Z",
  "datePublished": "2022-08-21T23:17:48.000Z",
  "dateModified": "2022-08-22T02:29:22.133Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 27
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 17
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们的用户不愿意交税\n",
  "headline_zh-Hant": "Ask HN: 我們的用戶不願意交稅\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们的平台迎合了小企业主和个人卖家在一个非常特殊的利基市场。从表面上看，我们做得很好；我们不花一分钱就能获得更多的用户，我们的买家和卖家经常使用这个平台，而且很高兴，用户参与其中，愿意与我们交谈，我们甚至还赚了一点钱。<p>然而，我们有一个巨大的问题：我们的商家不习惯交税，而且非常害怕使用我们更多的货币化功能，因为我们在法律上需要代表他们填写1099-K表格。<p>现在，我们的一些卖家并不介意，但绝大多数（而且越来越多）卖家对税收感到不舒服。这带来了一个问题，因为我们仍然在增长，但不是可持续的。<p>为了解决这个问题，我们曾试图聘请税务专家来解释税收是如何运作的，或者为什么它不像他们想象的那么可怕，但这并不具有说服力。在更激烈的方面，我们一直在考虑转换商业模式，但在我看来，当有一个巨大的机会摆在我们面前，但我们似乎无法利用的时候，这是很疯狂的。<p>有人对这种事情有任何经验吗？哪些方法可行？什么不可行？\n",
  "description_zh-Hant": "我們的平臺迎合了小企業主和個人賣家在一個非常特殊的利基市場。從表面上看，我們做得很好；我們不花一分錢就能獲得更多的用戶，我們的買家和賣家經常使用這個平臺，而且很高興，用戶參與其中，願意與我們交談，我們甚至還賺了一點錢。<p>然而，我們有一個巨大的問題：我們的商家不習慣交稅，而且非常害怕使用我們更多的貨幣化功能，因為我們在法律上需要代表他們填寫1099-K表格。<p>現在，我們的一些賣家並不介意，但絕大多數（而且越來越多）賣家對稅收感到不舒服。這帶來了一個問題，因為我們仍然在增長，但不是可持續的。<p>為了解決這個問題，我們曾試圖聘請稅務專家來解釋稅收是如何運作的，或者為什麼它不像他們想象的那麼可怕，但這並不具有說服力。在更激烈的方面，我們一直在考慮轉換商業模式，但在我看來，當有一個巨大的機會擺在我們面前，但我們似乎無法利用的時候，這是很瘋狂的。<p>有人對這種事情有任何經驗嗎？哪些方法可行？什麼不可行？\n"
}