{
  "@type": "NewsArticle",
  "identifier": "2022--08--20--en--hackernews--HackerNews--NewsArticle--32532430",
  "url": "https://news.ycombinator.com/item?id=32532430",
  "headline": "Ask HN: I automated part of someone else's job in my free time – how to proceed?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN<p>I've been working at this company for some time in an administrative role. As part of my job, we – and many others – work with data which gets aggregated and refined by a centralized team of specialists. This process is only partially automated and therefore still quite heavy-handed. As I understand it, significant time is spent on the manual part of it all.<p>Out of curiosity I started building this small project in my free time just to see if I could automate it myself, since most of the data required is available open source. There are still many rough edges but what I have now is already superior to what we have at work.<p>Now I'm wondering about where to go from here - so far I haven't told anyone. Strictly speaking, this is not part of my job and I am &quot;poaching&quot; in someone else's area of expertise. I like my job and don't want to make enemies. On the other hand, I would love to see my solution put to use and maybe even enhance and/or expand it jointly with IT. However, this is code I wrote in my free time and I am rather unwilling to give it away without any benefit.<p>Any ideas?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "JGugtw",
    "url": "https://news.ycombinator.com/user?id=JGugtw"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32532430",
  "sameAs": "https://news.ycombinator.com/item?id=32532430",
  "dateCreated": "2022-08-20T16:36:42.601Z",
  "datePublished": "2022-08-20T14:49:06.000Z",
  "dateModified": "2022-08-20T16:36:42.601Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 10
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 15
    }
  ],
  "headline_zh-Hans": "Ask HN: 我在空闲时间自动完成了别人的部分工作--如何进行？\n",
  "headline_zh-Hant": "Ask HN: 我在空閒時間自動完成了別人的部分工作--如何進行？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN<p>我已经在这家公司工作了一段时间，担任行政职务。作为我工作的一部分，我们--以及其他许多人--与数据打交道，这些数据由一个集中的专家团队进行汇总和提炼。这个过程只是部分自动化，因此仍然相当繁重。<p>出于好奇，我开始在空闲时间建立这个小项目，只是想看看我是否能自己将其自动化，因为所需的大部分数据都是开源的。还有很多粗糙的边缘，但我现在所拥有的已经比我们工作中的要好。<p>现在我想知道从这里开始该怎么走 - 到目前为止，我还没有告诉任何人。严格来说，这不是我工作的一部分，我是在别人的专业领域里挖人。我喜欢我的工作，不想树敌。另一方面，我很想看到我的解决方案被投入使用，甚至可能与IT部门共同加强和/或扩展它。然而，这是我在空闲时间写的代码，我不愿意在没有任何好处的情况下把它送给别人。<p>有什么想法吗？\n",
  "description_zh-Hant": "你好，HN<p>我已經在這家公司工作了一段時間，擔任行政職務。作為我工作的一部分，我們--以及其他許多人--與數據打交道，這些數據由一個集中的專家團隊進行彙總和提煉。這個過程只是部分自動化，因此仍然相當繁重。<p>出於好奇，我開始在空閒時間建立這個小項目，只是想看看我是否能自己將其自動化，因為所需的大部分數據都是開源的。還有很多粗糙的邊緣，但我現在所擁有的已經比我們工作中的要好。<p>現在我想知道從這裡開始該怎麼走 - 到目前為止，我還沒有告訴任何人。嚴格來說，這不是我工作的一部分，我是在別人的專業領域裡挖人。我喜歡我的工作，不想樹敵。另一方面，我很想看到我的解決方案被投入使用，甚至可能與IT部門共同加強和/或擴展它。然而，這是我在空閒時間寫的代碼，我不願意在沒有任何好處的情況下把它送給別人。<p>有什麼想法嗎？\n"
}