{
  "@type": "NewsArticle",
  "identifier": "2022--08--10--en--hackernews--HackerNews--NewsArticle--32413070",
  "url": "https://news.ycombinator.com/item?id=32413070",
  "headline": "Launch HN: Sematic (YC S22) – Open-source framework to build ML pipelines faster",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN – I’m Emmanuel, founder of Sematic (<a href=\"https://sematic.dev\" rel=\"nofollow\">https://sematic.dev</a>). Sematic is an open-source framework to prototype and productionize end-to-end Machine Learning (ML) and Data Science (DS) pipelines in days instead of weeks or months. The idea is to do for ML development what Rails and Heroku did for web development.<p>I started my career searching for Supersymmetry and the Higgs boson on the Large Hadron Collider at CERN, then moved to industry. I spent the last four years building ML infrastructure at Cruise. In both academia and industry, I witnessed researchers, data scientists, and ML engineers spending an absurd share of their time building makeshift tooling, stitching up infrastructure, and battling obscure systems, instead of focusing on their core area of expertise: extracting insights and predictions from data.<p>This was painfully apparent at Cruise where the ML Platform team needed to grow linearly with the number of users to support and models to ship to the car. What should have just taken a click (e.g. retraining a model when world conditions change – COVID parklets, road construction sites, deployment to new cities) often required weeks of painstaking work. Existing tools for prototyping and productionizing ML/DS models did not enable developers to become autonomous and tackle new projects instead of babysitting current ones.<p>For example, a widely adopted tool such as Kubeflow Pipelines requires users to learn an obscure Python API, package and deploy their code and dependencies by hand, and does not offer exhaustive tracking and visualization of artifacts beyond simple metadata.<p>In order to become autonomous, users needed a dead-simple way to iterate seamlessly between local and cloud environments (change code, validate locally, run at scale in the cloud, repeat) and visualize objects (metrics, plots, datasets, configs) in a UI. Strong guarantees around dependency packaging, traceability of artifact lineage, and reproducibility would have to be provided out-of-the-box.<p>Sematic lets ML/DS developers build and run pipelines of arbitrary complexity with nothing more than minimalistic Python APIs. Business logic, dynamic pipeline graphs, configurations, resource requirements, etc. — all with only Python. We are bringing the lovable aspects of Jupyter Notebooks (iterative development, visualizations) to the actual pipeline.<p>How it works: Sematic resolves dynamic nested graphs of pipeline steps (simple Python functions) and intercepts all inputs and outputs of each step to type-check, serialize, version, and track them. Individual steps are orchestrated as Kubernetes jobs according to required resources (e.g. GPU, high-memory), and all tracking and visualization information is surfaced in a modern UI. Build assets (user code, third-party dependencies, drivers, static libraries) are packaged and shipped to remote workers at runtime, which enables a fast and seamless iterative development experience.<p>Sematic lets you achieve results much faster by not wasting time on packaging dependencies, foraging for output artifacts to visualize, investigating obscure failures in black-box container jobs, bookkeeping configurations, writing complex YAML templates to run multiple experiments, etc.<p>It can run on a local machine or be deployed to leverage cloud resources (e.g. GPUs, high-memory instances, map/reduce clusters, etc.) with minimal external dependencies: Python, PostgreSQL, and Kubernetes.<p>Sematic is open-source and free to use locally or self-hosted in your own cloud. We will provide a SaaS offering to enable access to cloud resources without the hassle of maintaining a cloud deployment.\nTo get started, simply run `$ pip install sematic; sematic start`. Check us out at <a href=\"https://sematic.dev\" rel=\"nofollow\">https://sematic.dev</a>, star our Github repo, and join our Discord for updates, feature requests, and bug reports.<p>We would love to hear from everyone about your experience building reliable end-to-end ML training pipelines, and anything else you’d like to share in the comments!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "neutralino1",
    "url": "https://news.ycombinator.com/user?id=neutralino1"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32413070",
  "sameAs": "https://news.ycombinator.com/item?id=32413070",
  "dateCreated": "2022-08-10T15:27:24.085Z",
  "datePublished": "2022-08-10T14:56:50.000Z",
  "dateModified": "2022-08-10T15:27:24.085Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 15
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "启动HN：思迈特（YC S22）--快速构建ML管道的开源框架\n",
  "headline_zh-Hant": "啟動HN：思邁特（YC S22）--快速構建ML管道的開源框架\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hi HN - 我是 Emmanuel，思迈特（<a href=\"https://sematic.dev\" rel=\"nofollow\">https://sematic.dev</a>）的创始人。Sematic 是一个开源框架，用于在数天内完成端到端机器学习（ML）和数据科学（DS）管道的原型设计和生产，而非数周或数月。<p>我的职业生涯始于欧洲核子研究中心（CERN）大型强子对撞机上搜索超对称性和希格斯玻色子，然后转入工业领域。在过去的四年里，我在Cruise建立了ML基础设施。在学术界和工业界，我目睹了研究人员、数据科学家和ML工程师花费了大量的时间来构建临时工具、缝合基础设施和与不知名的系统作斗争，而不是专注于他们的核心专业领域：从数据中提取洞察力和预测。<p>这在Cruise是非常明显的，因为ML平台团队需要随着要支持的用户和要运送到车上的模型数量而线性增长。本应只需点击一下就能完成的工作（例如，当世界条件发生变化时重新训练模型--COVID小公园、道路施工现场、部署到新城市）往往需要数周的艰苦工作。<p>例如，像Kubeflow Pipelines这样被广泛采用的工具需要用户学习晦涩难懂的Python API，手工打包和部署他们的代码和依赖，而且除了简单的元数据之外，并没有提供详尽的跟踪和可视化的工件。 <p>为了实现自主性，用户需要一种简单的方式在本地和云环境之间进行无缝迭代（修改代码、本地验证、在云中大规模运行、重复），并在用户界面中可视化对象（度量、图、数据集、配置）。<p>Sematic让ML/DS开发人员只需使用最简单的Python API就能构建和运行任意复杂的管道。业务逻辑、动态管线图、配置、资源要求等--所有这些都只需使用Python。我们将 Jupyter 笔记本的可爱之处（迭代开发、可视化）带到实际管道中。思迈特解决管道步骤的动态嵌套图（简单的 Python 函数），并拦截每个步骤的所有输入和输出，对其进行类型检查、序列化、版本和跟踪。根据所需资源（如 GPU、高内存），将各个步骤作为 Kubernetes 工作进行协调，所有跟踪和可视化信息都浮现在一个现代 UI 中。构建资产（用户代码、第三方依赖、驱动程序、静态库）在运行时被打包并运送给远程工作人员，从而实现快速、无缝的迭代开发体验。 <p>Sematic可让您更快地取得成果，无需在打包依赖关系、寻找输出工件以实现可视化、调查黑盒容器作业中的模糊故障、记账配置、编写复杂的YAML模板以运行多个实验等方面浪费时间。<p>它可在本地机器上运行，也可部署为利用云资源（如GPU、高内存实例、map/reduce集群等），并将外部依赖关系降至最低。Python, PostgreSQL, and Kubernetes.<p>Sematic is open-source and free to use locally or self-hosted in your own cloud. We will provide a SaaS offering to enable access to cloud resources without the hassle of maintaining a cloud deployment.\nTo get started, simply run `$ pip install sematic; sematic start`. Check us out at <a href=\"https://sematic.dev\" rel=\"nofollow\">https://sematic.dev</a>, star our Github repo, and join our Discord for updates, feature requests, and bug reports.<p>We would love to hear from everyone about your experience building reliable end-to-end ML training pipelines, and anything else you’d like to share in the comments!\n",
  "description_zh-Hant": "Hi HN - 我是 Emmanuel，思邁特（<a href=\"https://sematic.dev\" rel=\"nofollow\">https://sematic.dev</a>）的創始人。Sematic 是一個開源框架，用於在數天內完成端到端機器學習（ML）和數據科學（DS）管道的原型設計和生產，而非數週或數月。<p>我的職業生涯始於歐洲核子研究中心（CERN）大型強子對撞機上搜索超對稱性和希格斯玻色子，然後轉入工業領域。在過去的四年裡，我在Cruise建立了ML基礎設施。在學術界和工業界，我目睹了研究人員、數據科學家和ML工程師花費了大量的時間來構建臨時工具、縫合基礎設施和與不知名的系統作鬥爭，而不是專注於他們的核心專業領域：從數據中提取洞察力和預測。<p>這在Cruise是非常明顯的，因為ML平臺團隊需要隨著要支持的用戶和要運送到車上的模型數量而線性增長。本應只需點擊一下就能完成的工作（例如，當世界條件發生變化時重新訓練模型--COVID小公園、道路施工現場、部署到新城市）往往需要數週的艱苦工作。<p>例如，像Kubeflow Pipelines這樣被廣泛採用的工具需要用戶學習晦澀難懂的Python API，手工打包和部署他們的代碼和依賴，而且除了簡單的元數據之外，並沒有提供詳盡的跟蹤和可視化的工件。 <p>為了實現自主性，用戶需要一種簡單的方式在本地和雲環境之間進行無縫迭代（修改代碼、本地驗證、在雲中大規模運行、重複），並在用戶界面中可視化對象（度量、圖、數據集、配置）。<p>Sematic讓ML/DS開發人員只需使用最簡單的Python API就能構建和運行任意複雜的管道。業務邏輯、動態管線圖、配置、資源要求等--所有這些都只需使用Python。我們將 Jupyter 筆記本的可愛之處（迭代開發、可視化）帶到實際管道中。思邁特解決管道步驟的動態嵌套圖（簡單的 Python 函數），並攔截每個步驟的所有輸入和輸出，對其進行類型檢查、序列化、版本和跟蹤。根據所需資源（如 GPU、高內存），將各個步驟作為 Kubernetes 工作進行協調，所有跟蹤和可視化信息都浮現在一個現代 UI 中。構建資產（用戶代碼、第三方依賴、驅動程序、靜態庫）在運行時被打包並運送給遠程工作人員，從而實現快速、無縫的迭代開發體驗。 <p>Sematic可讓您更快地取得成果，無需在打包依賴關係、尋找輸出工件以實現可視化、調查黑盒容器作業中的模糊故障、記賬配置、編寫複雜的YAML模板以運行多個實驗等方面浪費時間。<p>它可在本地機器上運行，也可部署為利用雲資源（如GPU、高內存實例、map/reduce集群等），並將外部依賴關係降至最低。Python, PostgreSQL, and Kubernetes.<p>Sematic is open-source and free to use locally or self-hosted in your own cloud. We will provide a SaaS offering to enable access to cloud resources without the hassle of maintaining a cloud deployment.\nTo get started, simply run `$ pip install sematic; sematic start`. Check us out at <a href=\"https://sematic.dev\" rel=\"nofollow\">https://sematic.dev</a>, star our Github repo, and join our Discord for updates, feature requests, and bug reports.<p>We would love to hear from everyone about your experience building reliable end-to-end ML training pipelines, and anything else you’d like to share in the comments!\n"
}