{
  "@type": "NewsArticle",
  "identifier": "2022--08--12--en--hackernews--HackerNews--NewsArticle--32437234",
  "url": "https://news.ycombinator.com/item?id=32437234",
  "headline": "Launch HN: Pana (YC S22) – Social Trust Banking with a US Latino Focus",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN! We are Piero and Luis, co-founders at Pana (<a href=\"https://joinpana.com\" rel=\"nofollow\">https://joinpana.com</a>), a banking app that uses social trust to help people save money and access healthier and better financial products. We’re open to everyone, but are focusing on the 62M Latinos in the USA, a particularly under-served market that we know a lot about.<p>US Hispanics have largely been ignored by traditional banks [1], resulting in 5% of this population being unbanked and an additional 13% underbanked. This is mainly due to cultural differences and lack of trust, as well as in-person and Social Security Number requirements that exclude a significant number of people.<p>Why is this market under-served? In Latino communities, a lot of transactions take place within family and personal networks based on trust. But this trust network isn't connected to the standard banking system, and therefore they don't get access to the financial products they should, if their creditworthiness were evaluated properly.<p>In addition to remittances, Latinos commonly lend amongst each other. Lending circles are an example of trust and credit-worthiness currently outside the formal financial system, and are common among US Hispanics (e.g. [2]).<p>We’re working on a new “social banking” concept that is designed to be a better fit for the trust-based behaviors that are common and familiar to this community. Of course, everyone is welcome! But we believe that social banking is especially applicable to the US Latino market, so we’re focusing there for now.<p>It’s worth adding that a proper evaluation of trust-based payment behavior should help us lend to people who are currently being abused by predatory rates.<p>The inspiration for Pana came during my time as head of Scotiabank’s Caribbean &amp; Central America Digital Factory, where I saw the power of building digital banking products for the Hispanic market. In stark contrast, I was surprised to learn on a trip to the US that without a Social Security Number I had to visit a traditional branch. After numerous signatures and hours of waiting, I was finally able to open the account—and then handed an ATM card instead of a debit card which would only allow me to do cash withdrawals and not the ability to make purchases. Adding insult to injury, I could never reach the bank officer again for support.<p>Because this was so surprising to me, I checked with friends and family, and all of them shared similar experiences. “Lack of trust,” “high fees,” and “cultural differences” were words I heard repeatedly.<p>It isn’t just end-customers who struggle with this system. Employers and sellers transacting with the 12M people living in the U.S. without a Social Security Number have to rely on cumbersome paper checks, cash or money order, and seriously, you have no idea how complicated it still is to perform basic transactions like sending money abroad.<p>Encountering this broken situation made me realize that a new startup would be best positioned to fix it. I had already, working with a team that’s knowledgeable about the Hispanic market, built digital banking solutions solving some of these issues—but only for big banks; smaller institutions tend to lack the scale, technology, and reach. However, the big banks are the ones who ignore this demographic in the first place because they have “bigger fish to fry”—a catch-22! The market, however, is easily large enough to support a new business, so we decided to build it ourselves.<p>With Pana, we’re applying the functionality and community-building aspects of familiar apps like WhatsApp to the banking space. Today, Whatsapp is widespread in the US Latino market -specially around informal peer-to-peer financial transactions-, proving that when one tool catches on, it will probably become the norm across this diaspora. We’re building on the social trust strongly embedded within the Latino culture to help achieve personal financial goals. Individuals can choose to share milestones and celebrate achievements with close friends or public groups of peers with similar needs. Within a group, payments and requests for payment among users can be made.<p>If this works, banking on social trust could potentially disrupt the $320B in yearly transactions through Alternative Financial Services (money orders, check cashers, payday loans, etc.), and who knows, maybe eventually the banking industry as a whole!<p>Latinos represent the fastest-growing diaspora in the USA with a 1.7T buying power and are often forgotten—in part, because we are not compelled to use existing banking products and therefore, no one can see how trustworthy many of us really are. We're now on a mission to remove these financial barriers.<p>We really hope you guys check out Pana and tell us any feedback you might have, and we look forward to your comments!<p>[1] <a href=\"https://www.federalreserve.gov/publications/2021-economic-well-being-of-us-households-in-2020-banking-and-credit.htm\" rel=\"nofollow\">https://www.federalreserve.gov/publications/2021-economic-we...</a><p>[2] <a href=\"https://www.npr.org/sections/codeswitch/2014/04/01/292580644/lending-circles-help-latinas-pay-bills-and-invest\" rel=\"nofollow\">https://www.npr.org/sections/codeswitch/2014/04/01/292580644...</a>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Piero0909",
    "url": "https://news.ycombinator.com/user?id=Piero0909"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32437234",
  "sameAs": "https://news.ycombinator.com/item?id=32437234",
  "dateCreated": "2022-08-12T12:51:30.712Z",
  "datePublished": "2022-08-12T12:07:08.000Z",
  "dateModified": "2022-08-12T12:51:30.712Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 8
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "启动HN：Pana（YC S22）--以美国拉丁裔为重点的社会信托银行业务\n",
  "headline_zh-Hant": "啟動HN：Pana（YC S22）--以美國拉丁裔為重點的社會信託銀行業務\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hey HN! We are Piero and Luis, co-founders at Pana (<a href=\"https://joinpana.com\" rel=\"nofollow\">https://joinpana.com</a>), a banking app that uses social trust to help people save money and access healthier and better financial products. We’re open to everyone, but are focusing on the 62M Latinos in the USA, a particularly under-served market that we know a lot about.<p>US Hispanics have largely been ignored by traditional banks [1], resulting in 5% of this population being unbanked and an additional 13% underbanked. This is mainly due to cultural differences and lack of trust, as well as in-person and Social Security Number requirements that exclude a significant number of people.<p>Why is this market under-served? In Latino communities, a lot of transactions take place within family and personal networks based on trust. But this trust network isn't connected to the standard banking system, and therefore they don't get access to the financial products they should, if their creditworthiness were evaluated properly.<p>In addition to remittances, Latinos commonly lend amongst each other. Lending circles are an example of trust and credit-worthiness currently outside the formal financial system, and are common among US Hispanics (e.g. [2]).<p>We’re working on a new “social banking” concept that is designed to be a better fit for the trust-based behaviors that are common and familiar to this community. Of course, everyone is welcome! 但我们认为，社会银行特别适用于美国的拉丁裔市场，所以我们暂时把重点放在那里。<p>值得补充的是，对基于信任的支付行为进行适当的评估，应该有助于我们向目前被掠夺性利率滥用的人提供贷款。<p>Pana的灵感来自我担任丰业银行加勒比&amp; 中美洲数字工厂负责人期间，我看到了为西班牙裔市场建立数字银行产品的力量。与此形成鲜明对比的是，我在一次美国之行中惊讶地发现，如果没有社会安全号码，我就必须去传统的分行。经过无数次的签名和数小时的等待，我终于能够开立账户--然后递给我一张ATM卡，而不是借记卡，这只允许我提取现金，而不能进行购物。更加糟糕的是，我再也无法联系到银行官员寻求支持。<p>由于这对我来说太过意外，我向朋友和家人核实，他们都有类似的经历。我反复听到 \"缺乏信任\"、\"高额费用 \"和 \"文化差异 \"等字眼。<p>在这个系统中挣扎的不仅仅是终端客户。雇主和卖家与生活在美国的1200万没有社会安全号码的人进行交易时，不得不依赖繁琐的纸质支票、现金或汇票，而且说真的，你不知道执行基本交易（如向国外汇款）有多复杂。<p>遇到这种破碎的情况使我意识到，一家新的创业公司将是解决这一问题的最佳选择。我已经与一个了解西班牙市场的团队合作，建立了数字银行解决方案，解决了其中的一些问题，但只是针对大银行；小机构往往缺乏规模、技术和影响力。然而，大银行一开始就忽视了这一人群，因为他们有 \"更大的鱼要钓\"--这是一个陷阱。<p>通过Pana，我们将WhatsApp等熟悉的应用程序的功能和社区建设方面应用到银行领域。今天，Whatsapp在美国拉丁裔市场上很普遍--特别是在非正式的点对点金融交易方面--证明了当一种工具流行起来时，它很可能会成为整个侨民的规范。我们正在建立在拉丁裔文化中强烈嵌入的社会信任，以帮助实现个人财务目标。个人可以选择与亲密的朋友或具有类似需求的公共同龄人群体分享里程碑和庆祝成就。在一个群体中，用户之间可以进行支付和请求支付。<p>如果这行得通，基于社会信任的银行业务可能会破坏每年通过替代金融服务（汇票、支票兑现、发薪日贷款等）进行的3200亿美元的交易，谁知道呢，也许最终会破坏整个银行业！<p>拉美裔代表了增长最快的侨民群体 \n",
  "description_zh-Hant": "Hey HN! We are Piero and Luis, co-founders at Pana (<a href=\"https://joinpana.com\" rel=\"nofollow\">https://joinpana.com</a>), a banking app that uses social trust to help people save money and access healthier and better financial products. We’re open to everyone, but are focusing on the 62M Latinos in the USA, a particularly under-served market that we know a lot about.<p>US Hispanics have largely been ignored by traditional banks [1], resulting in 5% of this population being unbanked and an additional 13% underbanked. This is mainly due to cultural differences and lack of trust, as well as in-person and Social Security Number requirements that exclude a significant number of people.<p>Why is this market under-served? In Latino communities, a lot of transactions take place within family and personal networks based on trust. But this trust network isn't connected to the standard banking system, and therefore they don't get access to the financial products they should, if their creditworthiness were evaluated properly.<p>In addition to remittances, Latinos commonly lend amongst each other. Lending circles are an example of trust and credit-worthiness currently outside the formal financial system, and are common among US Hispanics (e.g. [2]).<p>We’re working on a new “social banking” concept that is designed to be a better fit for the trust-based behaviors that are common and familiar to this community. Of course, everyone is welcome! 但我們認為，社會銀行特別適用於美國的拉丁裔市場，所以我們暫時把重點放在那裡。<p>值得補充的是，對基於信任的支付行為進行適當的評估，應該有助於我們向目前被掠奪性利率濫用的人提供貸款。<p>Pana的靈感來自我擔任豐業銀行加勒比&amp; 中美洲數字工廠負責人期間，我看到了為西班牙裔市場建立數字銀行產品的力量。與此形成鮮明對比的是，我在一次美國之行中驚訝地發現，如果沒有社會安全號碼，我就必須去傳統的分行。經過無數次的簽名和數小時的等待，我終於能夠開立賬戶--然後遞給我一張ATM卡，而不是借記卡，這隻允許我提取現金，而不能進行購物。更加糟糕的是，我再也無法聯繫到銀行官員尋求支持。<p>由於這對我來說太過意外，我向朋友和家人核實，他們都有類似的經歷。我反覆聽到 \"缺乏信任\"、\"高額費用 \"和 \"文化差異 \"等字眼。<p>在這個系統中掙扎的不僅僅是終端客戶。僱主和賣家與生活在美國的1200萬沒有社會安全號碼的人進行交易時，不得不依賴繁瑣的紙質支票、現金或匯票，而且說真的，你不知道執行基本交易（如向國外匯款）有多複雜。<p>遇到這種破碎的情況使我意識到，一家新的創業公司將是解決這一問題的最佳選擇。我已經與一個瞭解西班牙市場的團隊合作，建立了數字銀行解決方案，解決了其中的一些問題，但只是針對大銀行；小機構往往缺乏規模、技術和影響力。然而，大銀行一開始就忽視了這一人群，因為他們有 \"更大的魚要釣\"--這是一個陷阱。<p>通過Pana，我們將WhatsApp等熟悉的應用程序的功能和社區建設方面應用到銀行領域。今天，Whatsapp在美國拉丁裔市場上很普遍--特別是在非正式的點對點金融交易方面--證明了當一種工具流行起來時，它很可能會成為整個僑民的規範。我們正在建立在拉丁裔文化中強烈嵌入的社會信任，以幫助實現個人財務目標。個人可以選擇與親密的朋友或具有類似需求的公共同齡人群體分享里程碑和慶祝成就。在一個群體中，用戶之間可以進行支付和請求支付。<p>如果這行得通，基於社會信任的銀行業務可能會破壞每年通過替代金融服務（匯票、支票兌現、發薪日貸款等）進行的3200億美元的交易，誰知道呢，也許最終會破壞整個銀行業！<p>拉美裔代表了增長最快的僑民群體 \n"
}