{
  "@type": "NewsArticle",
  "identifier": "2022--08--21--en--hackernews--HackerNews--NewsArticle--32537004",
  "url": "https://news.ycombinator.com/item?id=32537004",
  "headline": "Ask HN: Anyone else feel trapped in FANG? How did you get out?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN,<p>I’ve been working at a FANG for 2 years now and I feel like my career goals and interests are not aligned with where I’m at. Outside of my FANG I was a go-getter who loves learning new things and taking on hard problems. Inside my company I have tried over the past 2 years to propose different solutions to hard problems and I just get blown off.<p>I’m good at my job I already got promoted in 1 year and am moving up. I am making more money than I expected, but at work I’m not able to express myself creatively or do things outside the box. I just get assigned straightforward work from my manager that the product managers and “leadership” assign to our team with barely any input on the overall project or ability to propose new projects.<p>I feel like if I stay here I will just get stuck in a cycle of never accomplishing my goals but I’m scared to move teams or companies or build a startup because I have a good manager, a good comp and my job isn’t that stressful.<p>I could become more involved at work in building paper reading groups or other kinds of side projects to creatively express myself at work but I don’t want to be the person whose life revolves around their FANG.<p>Anyone else feel like this? What did you do?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "awsthrow1234",
    "url": "https://news.ycombinator.com/user?id=awsthrow1234"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32537004",
  "sameAs": "https://news.ycombinator.com/item?id=32537004",
  "dateCreated": "2022-08-21T03:52:18.539Z",
  "datePublished": "2022-08-21T02:52:50.000Z",
  "dateModified": "2022-08-21T03:52:18.539Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 12
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 8
    }
  ],
  "headline_zh-Hans": "Ask HN: 还有人觉得自己被困在FANG中吗？你是怎么出来的？\n",
  "headline_zh-Hant": "Ask HN: 還有人覺得自己被困在FANG中嗎？你是怎麼出來的？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hi HN,<p>我已经在一家FANG公司工作了两年，我觉得我的职业目标和兴趣与我所在的位置不一致。在我的方阵之外，我是一个喜欢学习新事物和承担困难问题的进取者。在我的公司里，我在过去的两年里试图为棘手的问题提出不同的解决方案，但我只是被轰走了。<p>我的工作很好，我已经在1年内得到了晋升，并且正在往上爬。我赚的钱比我预期的要多，但在工作中，我无法创造性地表达自己，也无法做一些超出常规的事情。我只是从我的经理那里得到了产品经理和 \"领导层 \"分配给我们团队的直接工作，几乎没有对整个项目提出任何意见，也没有能力提出新的项目。<p>我觉得如果我留在这里，我只会陷入一个永远无法完成目标的循环中，但我害怕转移团队或公司或建立一个创业公司，因为我有一个好经理，一个好的薪酬，我的工作也没有那么大压力。 <p>我可以在工作中更多地参与建立论文阅读小组或其他类型的副业项目，以便在工作中创造性地表达自己，但我不想成为一个生活围绕着他们的FANG的人。<p>还有人有这种感觉吗？你是怎么做的？\n",
  "description_zh-Hant": "Hi HN,<p>我已經在一家FANG公司工作了兩年，我覺得我的職業目標和興趣與我所在的位置不一致。在我的方陣之外，我是一個喜歡學習新事物和承擔困難問題的進取者。在我的公司裡，我在過去的兩年裡試圖為棘手的問題提出不同的解決方案，但我只是被轟走了。<p>我的工作很好，我已經在1年內得到了晉升，並且正在往上爬。我賺的錢比我預期的要多，但在工作中，我無法創造性地表達自己，也無法做一些超出常規的事情。我只是從我的經理那裡得到了產品經理和 \"領導層 \"分配給我們團隊的直接工作，幾乎沒有對整個項目提出任何意見，也沒有能力提出新的項目。<p>我覺得如果我留在這裡，我只會陷入一個永遠無法完成目標的循環中，但我害怕轉移團隊或公司或建立一個創業公司，因為我有一個好經理，一個好的薪酬，我的工作也沒有那麼大壓力。 <p>我可以在工作中更多地參與建立論文閱讀小組或其他類型的副業項目，以便在工作中創造性地表達自己，但我不想成為一個生活圍繞著他們的FANG的人。<p>還有人有這種感覺嗎？你是怎麼做的？\n"
}