{
  "@type": "NewsArticle",
  "identifier": "2022--05--01--en--askhn--HackerNews--NewsArticle--31221475",
  "url": "https://news.ycombinator.com/item?id=31221475",
  "headline": "How to Stay Focused at Work?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi everyone,<p>For context, I work as a design engineer on what I would normally consider interesting projects. Lately I’ve been having an increasingly difficult time focusing while at work and it’s been negatively affecting my performance. Luckily nobody has said anything yet but I fear that they will if I keep moving down this path. Typically I’ll come into work and immediately find myself wandering off task one way or another, then maybe do some work, then wander off again. Even with me blocking distracting sites like Reddit, I’ll end up on a Wikipedia or google maps tangent or something to distract myself. All told I normally only get a couple hours of real work done in a day. This week was especially bad with me doing maybe 5 hours of functional work in total, if that. I even spent time putting together a detailed to-do list for my current project with tasks broken into small items but that hasn’t helped. I also try to space exercise before, during and after the workday (but admittedly I don’t always do it).<p>Even though I can WFH whenever I want, I don’t work from home unless I have a good reason because if the office is bad for focus, my home is worse. To be fair, I live in a small apartment without a dedicated office space. I’ve bounced back and forth on why I am this way, whether it is too much freedom (very few real deadlines), my lack of confidence in the direction of the company, frustration when dealing with people from another office, burnout, the work just being too boring for me, or the fact that there are not many people currently at the office, and none with desks in my vicinity.<p>All that being said, today I was at my girlfriend’s apartment while she studied for her finals, and I figured I’d try to catch up on work while there. Surprisingly, I was effortlessly able to start working, even while still lying in bed! Additionally, I didn’t “feel” like the work was bullshit either, even though this past week I did feel that way. It makes me wonder if my problem stems from my mind not being in work mode while I am at work. How do you all keep your minds in a working mode, whether at home or at the office? Thanks in advance!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "theduemmer",
    "url": "https://news.ycombinator.com/user?id=theduemmer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31221475",
  "sameAs": "https://news.ycombinator.com/item?id=31221475",
  "dateCreated": "2022-05-01T03:11:28.555Z",
  "datePublished": "2022-05-01T02:12:28.000Z",
  "dateModified": "2022-05-01T03:11:28.555Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ]
}