{
  "@type": "NewsArticle",
  "identifier": "2022--05--01--en--askhn--HackerNews--NewsArticle--31223915",
  "url": "https://news.ycombinator.com/item?id=31223915",
  "headline": "Where to hire for short specific technical help?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Like many here I have ${dayjob}, side hustle, trying to learn new things, do life, and everything else.<p>After doing software for a long time, I'm finding that while I enjoy the technical challenge, learning _everything_ required to do it all isn't as fun as it used to be.<p>Particularly in the side hustles, I often come across something where I've got a &quot;good-enough-for-now&quot; solution, knowing very well I'm incurring technical debt.<p>At the same time I also am acutely aware that there any number of people out there that have solved that exactly problem, already encountered all the hard to learn lessons, and could replace my good-enough solution for an excellent one in the fraction of the time.<p>Where would you recommend I turn to to hire someone to solve small and specific problems?<p>Yes, I could ask on stack overflow or another forum, but I want to pay someone for their time to come and implement the solution.<p>Should I just put small projects on some freelancing sites? If yes, which ones? If not, where else could I look?<p>Here are a handful of some concrete examples I've come across in the last 6 months:<p>- finishing off a hacked together CI flow for a django app for minimal downtime<p>- Evaluating and finding the right html/js component to allow thousands separators in a text field<p>- Fine tuning twilio video performance and multiple streams<p>- Setting up a good developer workflow for doing nicer form layouts in django",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "phil-martin",
    "url": "https://news.ycombinator.com/user?id=phil-martin"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31223915",
  "sameAs": "https://news.ycombinator.com/item?id=31223915",
  "dateCreated": "2022-05-01T11:11:34.826Z",
  "datePublished": "2022-05-01T10:54:55.000Z",
  "dateModified": "2022-05-01T11:11:34.826Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}