{
  "@type": "NewsArticle",
  "identifier": "2022--03--14--en--besthn--HackerNews--NewsArticle--30672841",
  "url": "https://news.ycombinator.com/item?id=30672841",
  "headline": "Launch HN: Living Carbon (YC W20) – Trees that capture and store more carbon",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN! Maddie and Patrick here. We founded Living Carbon (<a href=\"https://www.livingcarbon.com\" rel=\"nofollow\">https://www.livingcarbon.com</a>), a biotech company developing trees that grow faster, capture more carbon, and produce more durable wood. Our mission is to help rebalance the planet's carbon cycle using the power of plants.<p>We released research results indicating that photosynthesis enhanced trees grow faster and capture more carbon compared to control seedlings [1, 2]. After multiple generations of vegetatively propagated tree seedlings studied in a controlled environment, our lead photosynthesis-enhanced poplar tree seedling showed a 53% increase in above ground biomass.<p>Data from our molecular, morphology, and physiology analyses indicate that our photosynthesis-enhancement design works as intended. We’re continuing to study these seedlings in field trials and pilot projects across the US.<p>Forest carbon drawdown is one of our greatest allies in the climate crisis, but the impact of forest carbon solutions has been constrained by land-use efficiency, suitability of land to support forest stands, the growth rate of trees, and the duration of carbon storage before it is released back into the atmosphere. There are many strategies to enhance carbon capture in plants, including nitrogen fixating microbes, resistance to disease and drought, salt tolerance, decomposition resistance, and photosynthesis enhancement. Our initial focus has been two-fold: (1) improve carbon capture in trees via more efficient photosynthesis, and (2) improve carbon storage through decay-resistant wood, which slows the release of carbon through decomposition resistance.<p>Our approach is to use an alternative metabolic bypass pathway that allows our seedlings to break down toxic byproducts of photosynthesis using less energy. Usually, waste products of photorespiration are exported from the chloroplast to multiple organelles for metabolic cycling. Our biotechnology enables the chloroplast to break down these waste products internally and turn them into energy-rich glucose and cellulose, thereby growing faster and capturing more CO₂ over time. This method can operate across many different species and doesn't require an intensive human re-engineering process.<p>This process is similar to the natural process that already exists in 15% of plants, called C4 carbon fixation, which have separately evolved special features to combat photorespiration and are more photosynthetically efficient and productive. Examples of C4 plants include corn, sorghum, and sugarcane. Our strategy achieves similar results to C4 carbon fixation in the remaining 85% of C3 plants, starting with trees.<p>To ensure this carbon is stored for longer, we are also developing a trait to naturally slow decay by increasing metal accumulation in plants. Our trees accumulate metals from the soil, making their wood less digestible to fungi and slowing the return of CO2 to the atmosphere. As a bonus, this makes our trees uniquely well suited to land with high heavy metal concentration. We’re targeting underutilized, abandoned mine land across the U.S.—areas where trees would otherwise not grow.<p>If we can increase the efficiency of photosynthesis by 30-40% and if we can also reduce the decomposition rate of wood, then we will have a biological method of active drawdown that avoids the conflicting incentives, high starting costs, and requirement for ongoing and intensive management seen in methods such as direct air capture.<p>Living Carbon got started when Maddie read a paper on improving photosynthesis in tobacco and thought that someone should try this in trees. After talking to the author of that paper and other experts in forest biotechnology, turns out it wasn't only possible but a very good idea.<p>We want to help ignite hope, in our current era of climate instability, that we can use the tools of biotechnology to empower our ecosystems and help plants do what they do best. We welcome your thoughts and discussion!<p>[1] <a href=\"https://www.biorxiv.org/content/10.1101/2022.02.16.480797v1\" rel=\"nofollow\">https://www.biorxiv.org/content/10.1101/2022.02.16.480797v1</a><p>[2] <a href=\"https://www.livingcarbon.com/post/photosynthesis-enhanced-trees-grow-faster-and-capture-more-carbon\" rel=\"nofollow\">https://www.livingcarbon.com/post/photosynthesis-enhanced-tr...</a>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "maddiehalla",
    "url": "https://news.ycombinator.com/user?id=maddiehalla"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30672841",
  "sameAs": "https://news.ycombinator.com/item?id=30672841",
  "dateCreated": "2022-03-14T19:25:21.194Z",
  "datePublished": "2022-03-14T14:28:58.000Z",
  "dateModified": "2022-03-14T19:25:21.194Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 251
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 184
    }
  ],
  "headline_zh-Hans": "启动HN：活碳（YC W20）--能捕获和储存更多碳的树木",
  "headline_zh-Hant": "啟動HN：活碳（YC W20）--能捕獲和儲存更多碳的樹木",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! Maddie and Patrick here. 我们创立了Living Carbon（<a href=\"https://www.livingcarbon.com\" rel=\"nofollow\">https://www.livingcarbon.com</a>），这是一家开发树木的生物技术公司，这些树木生长更快，捕获更多的碳，并生产更耐用的木材。我们的使命是利用植物的力量帮助重新平衡地球的碳循环。<p>我们发布的研究结果表明，与对照组幼苗相比，光合作用增强的树木生长更快，捕获更多的碳[1, 2]。在受控环境中研究了多代无性繁殖的树苗后，我们领先的光合作用增强的杨树苗显示地上生物量增加了53%。<p>我们的分子学、形态学和生理学分析数据表明，我们的光合作用增强设计如期进行。我们正在继续在美国各地的田间试验和试点项目中研究这些幼苗。<p>森林碳汲取是我们在气候危机中最大的盟友之一，但森林碳解决方案的影响一直受到土地利用效率、支持林分的土地适宜性、树木的生长速度以及碳释放回大气之前的储存时间的制约。有许多策略可以增强植物的碳捕获，包括固氮微生物、抗病和抗旱、耐盐、抗分解和光合作用的增强。我们最初的重点有两个方面。(1)通过更有效的光合作用提高树木的碳捕获量，以及(2)通过抗腐烂的木材提高碳储存量，通过抗腐烂减缓碳的释放。<p>我们的方法是使用一种替代的代谢旁路，使我们的幼苗使用更少的能量来分解光合作用的有毒副产品。通常，光合作用的废品会从叶绿体输出到多个细胞器中进行代谢循环。我们的生物技术使叶绿体能够在内部分解这些废品，并将其转化为富含能量的葡萄糖和纤维素，从而在一段时间内生长得更快，捕获更多的二氧化碳。这种方法可以在许多不同的物种中运行，并且不需要密集的人类重新设计过程。<p>这个过程类似于已经存在于15%的植物中的自然过程，称为C4碳固定，这些植物已经分别进化出对抗光呼吸的特殊功能，并且光合作用效率更高，产量更大。C4植物的例子包括玉米、高粱和甘蔗。我们的策略在其余85%的C3植物中实现了与C4碳固定类似的结果，首先是树木。<p>为了确保这些碳被储存得更久，我们还在开发一种特性，通过增加植物的金属积累来自然减缓腐烂。我们的树木从土壤中积累金属，使它们的木材不易被真菌消化，并减缓二氧化碳返回大气的速度。作为一种奖励，这使我们的树木独特地适合于重金属浓度高的土地。<p>如果我们能将光合作用的效率提高30-40%，如果我们也能降低木材的分解率，那么我们将拥有一种主动减排的生物方法，该方法避免了直接空气捕集等方法中出现的激励措施冲突、高启动成本以及对持续和密集管理的要求。 <p>Living Carbon是在Maddie读到一篇关于改善烟草光合作用的论文时开始的，她认为应该有人在树上尝试这样做。在与那篇论文的作者和其他森林生物技术专家交谈后，发现这不仅是可能的，而且是一个非常好的主意。<p>我们希望帮助点燃希望，在我们目前气候不稳定的时代，我们可以使用生物技术工具来增强我们的生态系统，并帮助植物做它们最擅长的事情。我们欢迎你的想法和讨论！<p>[1] <a href=\"https://www.biorxiv.org/content/10.1101/2022.02.16.480797v1\" rel=\"nofollow\">https://www.biorxiv.org/content/10.1101/2022.02.16.480797v1<p>[2] <a href=\"https://www.livingcarbon.com/post/photosynthesis-enhanced-trees-grow-faster-and-capture-more-carbon\" rel=\"nofollow\">https://www.livingcarbon.com/post/photosynthesis-enhanced-tr...</a>",
  "description_zh-Hant": "嗨，HN! Maddie and Patrick here. 我們創立了Living Carbon（<a href=\"https://www.livingcarbon.com\" rel=\"nofollow\">https://www.livingcarbon.com</a>），這是一家開發樹木的生物技術公司，這些樹木生長更快，捕獲更多的碳，並生產更耐用的木材。我們的使命是利用植物的力量幫助重新平衡地球的碳循環。<p>我們發佈的研究結果表明，與對照組幼苗相比，光合作用增強的樹木生長更快，捕獲更多的碳[1, 2]。在受控環境中研究了多代無性繁殖的樹苗後，我們領先的光合作用增強的楊樹苗顯示地上生物量增加了53%。<p>我們的分子學、形態學和生理學分析數據表明，我們的光合作用增強設計如期進行。我們正在繼續在美國各地的田間試驗和試點項目中研究這些幼苗。<p>森林碳汲取是我們在氣候危機中最大的盟友之一，但森林碳解決方案的影響一直受到土地利用效率、支持林分的土地適宜性、樹木的生長速度以及碳釋放回大氣之前的儲存時間的制約。有許多策略可以增強植物的碳捕獲，包括固氮微生物、抗病和抗旱、耐鹽、抗分解和光合作用的增強。我們最初的重點有兩個方面。(1)通過更有效的光合作用提高樹木的碳捕獲量，以及(2)通過抗腐爛的木材提高碳儲存量，通過抗腐爛減緩碳的釋放。<p>我們的方法是使用一種替代的代謝旁路，使我們的幼苗使用更少的能量來分解光合作用的有毒副產品。通常，光合作用的廢品會從葉綠體輸出到多個細胞器中進行代謝循環。我們的生物技術使葉綠體能夠在內部分解這些廢品，並將其轉化為富含能量的葡萄糖和纖維素，從而在一段時間內生長得更快，捕獲更多的二氧化碳。這種方法可以在許多不同的物種中運行，並且不需要密集的人類重新設計過程。<p>這個過程類似於已經存在於15%的植物中的自然過程，稱為C4碳固定，這些植物已經分別進化出對抗光呼吸的特殊功能，並且光合作用效率更高，產量更大。C4植物的例子包括玉米、高粱和甘蔗。我們的策略在其餘85%的C3植物中實現了與C4碳固定類似的結果，首先是樹木。<p>為了確保這些碳被儲存得更久，我們還在開發一種特性，通過增加植物的金屬積累來自然減緩腐爛。我們的樹木從土壤中積累金屬，使它們的木材不易被真菌消化，並減緩二氧化碳返回大氣的速度。作為一種獎勵，這使我們的樹木獨特地適合於重金屬濃度高的土地。<p>如果我們能將光合作用的效率提高30-40%，如果我們也能降低木材的分解率，那麼我們將擁有一種主動減排的生物方法，該方法避免了直接空氣捕集等方法中出現的激勵措施衝突、高啟動成本以及對持續和密集管理的要求。 <p>Living Carbon是在Maddie讀到一篇關於改善菸草光合作用的論文時開始的，她認為應該有人在樹上嘗試這樣做。在與那篇論文的作者和其他森林生物技術專家交談後，發現這不僅是可能的，而且是一個非常好的主意。<p>我們希望幫助點燃希望，在我們目前氣候不穩定的時代，我們可以使用生物技術工具來增強我們的生態系統，並幫助植物做它們最擅長的事情。我們歡迎你的想法和討論！<p>[1] <a href=\"https://www.biorxiv.org/content/10.1101/2022.02.16.480797v1\" rel=\"nofollow\">https://www.biorxiv.org/content/10.1101/2022.02.16.480797v1<p>[2] <a href=\"https://www.livingcarbon.com/post/photosynthesis-enhanced-trees-grow-faster-and-capture-more-carbon\" rel=\"nofollow\">https://www.livingcarbon.com/post/photosynthesis-enhanced-tr...</a>"
}