{
  "@type": "NewsArticle",
  "identifier": "2022--03--14--en--besthn--HackerNews--NewsArticle--30677471",
  "url": "https://news.ycombinator.com/item?id=30677471",
  "headline": "Ask HN: My Google account was hacked, Google says they can't help",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "My Google account was hacked, I was messaged by someone on Facebook and they demanded I give them money or they would post my private photos. They started posting my pictures and even sent them to my family and friends, dad included! They then changed all my passwords, restore email, phone number ect to their own email and number, so I can't do anything. They wiped my phone and my son's tablet completely, all my banking is gone, everything is gone. I'm now stuck in a foreign country away from my baby with no way to get money or access my email for my travel documents. I'm really scared and don't know what to do. Google says they can't do anything to help me! They can't kick him off or disable my account, I just have to be harassed and blackmailed, and goodness knows what else. I'm a single mum and I'm in a different country to my baby, please can someone help me? I just want to get back.<p>Does anyone know how I can recover and secure my Google account? I've tried everything that I can find/Google have told me to do.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lululouise",
    "url": "https://news.ycombinator.com/user?id=lululouise"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30677471",
  "sameAs": "https://news.ycombinator.com/item?id=30677471",
  "dateCreated": "2022-03-14T23:11:20.217Z",
  "datePublished": "2022-03-14T20:02:36.000Z",
  "dateModified": "2022-03-14T23:11:20.217Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 250
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 83
    }
  ],
  "headline_zh-Hans": "Ask HN: 我的谷歌账户被黑了，谷歌说他们帮不上忙",
  "headline_zh-Hant": "Ask HN: 我的谷歌賬戶被黑了，谷歌說他們幫不上忙",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的谷歌账户被黑了，有人在Facebook上给我发信息，他们要求我给他们钱，否则他们就会公布我的私人照片。他们开始张贴我的照片，甚至把它们发给我的家人和朋友，包括爸爸！他们把我的所有密码都改了。然后他们把我所有的密码、恢复的电子邮件、电话号码等都改成了他们自己的电子邮件和号码，所以我什么都不能做。他们把我的手机和我儿子的平板电脑完全抹掉了，我所有的银行业务都没了，一切都没了。我现在被困在一个远离我的孩子的外国，没有办法得到钱或访问我的电子邮件以获取我的旅行文件。我真的很害怕，不知道该怎么做。谷歌说他们不能做任何事情来帮助我! 他们不能把他踢走或禁用我的账户，我只能被骚扰和勒索，天知道还有什么。我是一个单身母亲，我和我的孩子在不同的国家，请谁能帮帮我？我只想回去。<p>有谁知道我怎样才能恢复和保护我的谷歌账户？我已经尝试了我能找到的/谷歌告诉我的所有方法。",
  "description_zh-Hant": "我的谷歌賬戶被黑了，有人在Facebook上給我發信息，他們要求我給他們錢，否則他們就會公佈我的私人照片。他們開始張貼我的照片，甚至把它們發給我的家人和朋友，包括爸爸！他們把我的所有密碼都改了。然後他們把我所有的密碼、恢復的電子郵件、電話號碼等都改成了他們自己的電子郵件和號碼，所以我什麼都不能做。他們把我的手機和我兒子的平板電腦完全抹掉了，我所有的銀行業務都沒了，一切都沒了。我現在被困在一個遠離我的孩子的外國，沒有辦法得到錢或訪問我的電子郵件以獲取我的旅行文件。我真的很害怕，不知道該怎麼做。谷歌說他們不能做任何事情來幫助我! 他們不能把他踢走或禁用我的賬戶，我只能被騷擾和勒索，天知道還有什麼。我是一個單身母親，我和我的孩子在不同的國家，請誰能幫幫我？我只想回去。<p>有誰知道我怎樣才能恢復和保護我的谷歌賬戶？我已經嘗試了我能找到的/谷歌告訴我的所有方法。"
}