{
  "@type": "NewsArticle",
  "identifier": "2022--03--11--en--besthn--HackerNews--NewsArticle--30632952",
  "url": "https://news.ycombinator.com/item?id=30632952",
  "headline": "We’re the founders of Substack, we just launched an iOS app. AUA",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi! This is Chris Best, Hamish McKenzie, and Jairaj Sethi, the founders of Substack, with Sachin Monga, the head of product. Yesterday, we launched an iOS app for Substack, so you can read all your Substack subscriptions in one place, with no distractions.<p>Readers have been tweeting at us for years now to ask when we’d have an app. We’ve long wanted one too, and we suddenly got the manpower to be able to build a good one when we acquired Sachin’s company Cocoon (W19) last year.<p>Soon after starting Substack, we found it easiest to explain what we do as “We make it simple to start a paid newsletter.” Even then, a Substack was more than just an email newsletter: it was also a blog, and it could host embedded video and audio, and people could leave comments and participate in discussion threads. But the term “newsletter” was useful shorthand because everyone kind of got what that meant. All along, though, we’ve been quietly building the tools for what we call “personal media empires,” encompassing different media formats (natively) and community discussion (which we intend to make better and better).<p>By a similar token, right from the start we’ve been intending for the company to do more than just provide subscription publishing tools. We’re excited by the vision of Substack becoming a network, where writers and readers benefit from being part of a larger ecosystem. For writers, it means they can be discovered by readers who might not otherwise have found them. For readers, it means being able to connect directly with writers and other readers and to explore a universe of great work.<p>The app is a key part of the network vision. Nothing changes in terms of writers and readers being in control. The writers still own their mailing lists, content, and IP and can take it all with them anytime they want. Anyone who signs up to a Substack through the app still goes on to that mailing list. And readers still get to choose what appears in their “inbox,” with the power to subscribe and unsubscribe from whatever they want (you can also add any RSS feed into the app via reader.substack.com). But now we’ll have more and better ways to surface recommendations from writers and readers, to show people’s profiles, and to deliver notifications inside and outside of the app.<p>This is just a start for the Substack app. We want to keep improving it, so please give us feedback and ask us the hard questions. What do you think we’re doing wrong? What could be better? What could be great? What might we not have thought of?<p>We’re here for the next couple hours. Ask us anything.<p><a href=\"https://on.substack.com/p/substackapp\" rel=\"nofollow\">https://on.substack.com/p/substackapp</a>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "internet_jockey",
    "url": "https://news.ycombinator.com/user?id=internet_jockey"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30632952",
  "sameAs": "https://news.ycombinator.com/item?id=30632952",
  "dateCreated": "2022-03-11T07:35:37.127Z",
  "datePublished": "2022-03-10T21:51:23.000Z",
  "dateModified": "2022-03-11T07:35:37.127Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 270
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 286
    }
  ],
  "headline_zh-Hans": "我们是Substack的创始人，我们刚刚推出了一个iOS应用程序。友联",
  "headline_zh-Hant": "我們是Substack的創始人，我們剛剛推出了一個iOS應用程序。友聯",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好！我是Substack的创始人Chris Best、Hamish McKenzie和Jairaj Sethi，以及产品负责人Sachin Monga。昨天，我们推出了Substack的iOS应用程序，这样你就可以在一个地方阅读所有的Substack订阅，而不会有任何干扰。<p>多年来，读者一直在推特上问我们什么时候有一个应用程序。我们也早就想有一个，去年我们收购了Sachin的公司Cocoon（W19）后，我们突然有了人力，能够建立一个好的应用程序。<p>在开始Substack后不久，我们发现最容易解释我们的工作是 \"我们让开始付费通讯变得简单\"。即使在那时，Substack也不仅仅是一份电子邮件通讯：它也是一个博客，它可以承载嵌入式视频和音频，人们可以留下评论并参与讨论。但 \"通讯 \"一词是有用的速记，因为每个人都知道这意味着什么。不过，一直以来，我们都在为我们所谓的 \"个人媒体帝国 \"默默地打造工具，包括不同的媒体格式（原生的）和社区讨论（我们打算让它变得越来越好）。<p>同样，从一开始，我们就打算让公司不仅仅是提供订阅发布工具。我们对Substack成为一个网络的愿景感到兴奋，在这个网络中，作家和读者可以从一个更大的生态系统中受益。对于作家来说，这意味着他们可以被那些可能无法找到他们的读者发现。对于读者来说，这意味着他们能够直接与作家和其他读者联系，并探索一个伟大的作品的世界。就作家和读者的控制权而言，没有任何变化。作家仍然拥有他们的邮件列表、内容和IP，并可以在任何时候将其全部带走。任何通过应用程序注册Substack的人仍然会加入该邮件列表。读者仍然可以选择他们的 \"收件箱 \"中出现的内容，并有权订阅和取消订阅任何他们想要的内容（你也可以通过reader.substack.com将任何RSS feed添加到应用程序中）。但现在，我们将有更多更好的方式来展示作家和读者的推荐，显示人们的个人资料，并在应用程序内外提供通知。我们希望继续改进它，所以请给我们反馈，并向我们提出困难的问题。你认为我们做错了什么？哪些地方可以做得更好？哪些地方可以做得很好？什么是我们可能没有想到的？<p>接下来的几个小时，我们都在这里。问我们任何问题。<p><a href=\"https://on.substack.com/p/substackapp\" rel=\"nofollow\">https://on.substack.com/p/substackapp</a>",
  "description_zh-Hant": "大家好！我是Substack的創始人Chris Best、Hamish McKenzie和Jairaj Sethi，以及產品負責人Sachin Monga。昨天，我們推出了Substack的iOS應用程序，這樣你就可以在一個地方閱讀所有的Substack訂閱，而不會有任何干擾。<p>多年來，讀者一直在推特上問我們什麼時候有一個應用程序。我們也早就想有一個，去年我們收購了Sachin的公司Cocoon（W19）後，我們突然有了人力，能夠建立一個好的應用程序。<p>在開始Substack後不久，我們發現最容易解釋我們的工作是 \"我們讓開始付費通訊變得簡單\"。即使在那時，Substack也不僅僅是一份電子郵件通訊：它也是一個博客，它可以承載嵌入式視頻和音頻，人們可以留下評論並參與討論。但 \"通訊 \"一詞是有用的速記，因為每個人都知道這意味著什麼。不過，一直以來，我們都在為我們所謂的 \"個人媒體帝國 \"默默地打造工具，包括不同的媒體格式（原生的）和社區討論（我們打算讓它變得越來越好）。<p>同樣，從一開始，我們就打算讓公司不僅僅是提供訂閱發佈工具。我們對Substack成為一個網絡的願景感到興奮，在這個網絡中，作家和讀者可以從一個更大的生態系統中受益。對於作家來說，這意味著他們可以被那些可能無法找到他們的讀者發現。對於讀者來說，這意味著他們能夠直接與作家和其他讀者聯繫，並探索一個偉大的作品的世界。就作家和讀者的控制權而言，沒有任何變化。作家仍然擁有他們的郵件列表、內容和IP，並可以在任何時候將其全部帶走。任何通過應用程序註冊Substack的人仍然會加入該郵件列表。讀者仍然可以選擇他們的 \"收件箱 \"中出現的內容，並有權訂閱和取消訂閱任何他們想要的內容（你也可以通過reader.substack.com將任何RSS feed添加到應用程序中）。但現在，我們將有更多更好的方式來展示作家和讀者的推薦，顯示人們的個人資料，並在應用程序內外提供通知。我們希望繼續改進它，所以請給我們反饋，並向我們提出困難的問題。你認為我們做錯了什麼？哪些地方可以做得更好？哪些地方可以做得很好？什麼是我們可能沒有想到的？<p>接下來的幾個小時，我們都在這裡。問我們任何問題。<p><a href=\"https://on.substack.com/p/substackapp\" rel=\"nofollow\">https://on.substack.com/p/substackapp</a>"
}