{
  "@type": "NewsArticle",
  "identifier": "2022--03--27--en--besthn--HackerNews--NewsArticle--30814248",
  "url": "https://news.ycombinator.com/item?id=30814248",
  "headline": "Ask HN: If you used to be socially awkward and shy, how did you improve?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Recently, I cannot help but notice how shy and socially awkward I might be at times, which is quite frustrating.<p>To be fair to myself, I am not awful in social situations in that depending on the context I can be seemingly confident and calm, especially when I am among people I know and the context is familiar.<p>When it comes to new people and places, everything changes dramatically. My voice changes, my posture changes, everything changes. I can start being awkward in all possible senses.<p>The discomfort gets to the point where I blush and this physical state of vulnerability and self-doubt of course makes things even worse :)<p>I understand that all of that relates to self-esteem and phychology in general therefore my question.<p>It's common to advise hitting on the gym, which I just started doing last week. Funnily, the gym is the place where I last noticed my awkward behavior :)<p>If you have managed to deal with that and improve in that regard, what is your success story?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "dondraper36",
    "url": "https://news.ycombinator.com/user?id=dondraper36"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30814248",
  "sameAs": "https://news.ycombinator.com/item?id=30814248",
  "dateCreated": "2022-03-27T02:13:13.087Z",
  "datePublished": "2022-03-26T18:49:22.000Z",
  "dateModified": "2022-03-27T02:13:13.087Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 272
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 295
    }
  ],
  "headline_zh-Hans": "Ask HN: 如果你过去在社交方面很笨拙和害羞，你是如何改善的？",
  "headline_zh-Hant": "Ask HN: 如果你過去在社交方面很笨拙和害羞，你是如何改善的？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "最近，我不禁注意到自己有时可能会很害羞，在社交场合很尴尬，这让人很沮丧。<p>对自己公平地说，我在社交场合并不可怕，因为根据上下文，我可以显得很自信和平静，特别是当我和我认识的人在一起，而且背景很熟悉时。<p>当涉及到新的人和地方时，一切都会发生巨大的变化。我的声音变了，我的姿势变了，一切都变了。我可以在所有可能的意义上开始变得笨拙。<p>这种不适会让我脸红，这种身体上的脆弱和自我怀疑的状态当然会让事情变得更糟:)<p>我明白所有这些都与自尊和一般的心理学有关，因此我的问题。有趣的是，健身房是我最后一次注意到我的尴尬行为的地方:)<p>如果你已经设法处理了这个问题，并在这方面有所改善，你的成功故事是什么？",
  "description_zh-Hant": "最近，我不禁注意到自己有時可能會很害羞，在社交場合很尷尬，這讓人很沮喪。<p>對自己公平地說，我在社交場合並不可怕，因為根據上下文，我可以顯得很自信和平靜，特別是當我和我認識的人在一起，而且背景很熟悉時。<p>當涉及到新的人和地方時，一切都會發生巨大的變化。我的聲音變了，我的姿勢變了，一切都變了。我可以在所有可能的意義上開始變得笨拙。<p>這種不適會讓我臉紅，這種身體上的脆弱和自我懷疑的狀態當然會讓事情變得更糟:)<p>我明白所有這些都與自尊和一般的心理學有關，因此我的問題。有趣的是，健身房是我最後一次注意到我的尷尬行為的地方:)<p>如果你已經設法處理了這個問題，並在這方面有所改善，你的成功故事是什麼？"
}