{
  "@type": "NewsArticle",
  "identifier": "2022--03--13--en--besthn--HackerNews--NewsArticle--30658886",
  "url": "https://news.ycombinator.com/item?id=30658886",
  "headline": "Tell HN: China Is Entering Lockdown",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Over the past two years there's been smaller regional outbreaks here and there, but they were quickly contained. This current outbreak started about a month ago with cases slowly starting to tick up. About two weeks ago it became clear to me that we would soon be entering lockdown as the omicron cases won't stop increasing, imported as well as local. Last Friday there were about a 1000 new daily cases nationally, higher than at the peak in 2020. Since there is no clear change in policy, and already a lot is being done, there is no reason to believe that infections won't keep increasing exponentially. Today, Sunday, daily new cases reached 2000-3000.<p>Schools, gym, parks, and most other public venues have closed. Education is being done online, and also adult education is shut down if it is offline.<p>WFH is pretty much non-existant in China, even after 2020, but from next week we'll work from home as will many offices.<p>When ordering on Meituan, some select goods are out of stock at some stores , like tomatoes, minced meat. Still, you can get it if you just search it from another store. My neighborhood seems perfectly normal and the supermarket has lots of stock though some beef is sold out. Several supermarkets on Meituan are closed but there's lots still open. I've got food for two months so no issues.<p>Still, I see this as a good thing because: (1) Hopefully WFH gains acceptance and becomes normalized (2) A new policy will emerge as it is already clear that you can't quarantine and hospitalize people for omicron when it is not dangerous. In fact what I'm worried about is having to be in quarantine hospital or hotel, that's it. There are officials talking about ending the 0-policy but no clear solution yet.<p>I expect this to last 3 months.<p>Edit: I'm in Shanghai. Types of lockdown vary between cities and even districts and sub-districts.  Here, you may get to stay at home for two days if you're a second degree contact; but if you didn't wear a mask it'll be 14 days. If you're a first degree contact it's quarantine hotel for 14. If you're infected I believe you go to a hospital. In Shenzhen, some communities that are under lockdown are not able to order groceries but only get the type of hotel/airplane food you get in quarantine. So I definitely want to have proper food, which is why I'll WFH for a long time, so as to not come into first or something cond degree contact.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "user_named",
    "url": "https://news.ycombinator.com/user?id=user_named"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30658886",
  "sameAs": "https://news.ycombinator.com/item?id=30658886",
  "dateCreated": "2022-03-13T21:09:19.063Z",
  "datePublished": "2022-03-13T07:34:49.000Z",
  "dateModified": "2022-03-13T21:09:19.063Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 254
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 246
    }
  ],
  "headline_zh-Hans": "告诉HN：中国正在进入封锁状态",
  "headline_zh-Hant": "告訴HN：中國正在進入封鎖狀態",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在过去两年中，这里和那里都有较小的区域性爆发，但它们很快就被控制住了。目前的疫情大约在一个月前开始，病例开始慢慢增加。大约两周前，我清楚地意识到，我们将很快进入封锁状态，因为进口和本地的Omicron病例不会停止增加。上周五，全国每天有大约1000个新病例，比2020年的高峰期还要高。由于政策没有明确的变化，而且已经做了很多工作，没有理由相信感染不会继续成倍增加。今天，星期天，每天的新病例达到2000-3000例。<p>学校、体育馆、公园和其他大多数公共场所已经关闭。教育正在网上进行，如果是线下的成人教育也被关闭了。<p>在中国，即使在2020年之后，妇产科也几乎不存在了，但从下周开始，我们将像许多办公室一样在家工作。<p>在美团上订购时，一些精选商品在一些商店缺货，如番茄、肉末。不过，如果你从其他商店搜索，还是可以得到的。我所在的街区看起来非常正常，超市有很多库存，尽管有些牛肉已经卖完了。美团上的几家超市都关门了，但有很多超市还在营业。我有两个月的食物，所以没有问题。<p>尽管如此，我认为这是一件好事，因为。(1)希望WFH获得接受并变得正常化 (2)新的政策将出现，因为已经很清楚，在没有危险的情况下，你不能因OMICRON而隔离和住院。事实上，我所担心的是必须在检疫医院或酒店，仅此而已。有官员在谈论结束0政策，但还没有明确的解决方案。<p>我预计这将持续3个月。<p>编辑：我是在上海。不同的城市，甚至不同的区和分区，封锁的类型也不同。 在这里，如果你是二级接触者，你可能会在家里呆两天；但如果你没有戴口罩，那将是14天。如果你是一级接触者，那就是14天的隔离旅馆。如果你被感染了，我相信你会去医院。在深圳，一些被封锁的社区不能订购杂货，只能得到你在隔离区得到的那种酒店/飞机食品。因此，我肯定要有适当的食物，这也是为什么我会在很长一段时间内做妇产科医生，以便不与第一类或其他公寓程度的人接触。",
  "description_zh-Hant": "在過去兩年中，這裡和那裡都有較小的區域性爆發，但它們很快就被控制住了。目前的疫情大約在一個月前開始，病例開始慢慢增加。大約兩週前，我清楚地意識到，我們將很快進入封鎖狀態，因為進口和本地的Omicron病例不會停止增加。上週五，全國每天有大約1000個新病例，比2020年的高峰期還要高。由於政策沒有明確的變化，而且已經做了很多工作，沒有理由相信感染不會繼續成倍增加。今天，星期天，每天的新病例達到2000-3000例。<p>學校、體育館、公園和其他大多數公共場所已經關閉。教育正在網上進行，如果是線下的成人教育也被關閉了。<p>在中國，即使在2020年之後，婦產科也幾乎不存在了，但從下週開始，我們將像許多辦公室一樣在家工作。<p>在美團上訂購時，一些精選商品在一些商店缺貨，如番茄、肉末。不過，如果你從其他商店搜索，還是可以得到的。我所在的街區看起來非常正常，超市有很多庫存，儘管有些牛肉已經賣完了。美團上的幾家超市都關門了，但有很多超市還在營業。我有兩個月的食物，所以沒有問題。<p>儘管如此，我認為這是一件好事，因為。(1)希望WFH獲得接受並變得正常化 (2)新的政策將出現，因為已經很清楚，在沒有危險的情況下，你不能因OMICRON而隔離和住院。事實上，我所擔心的是必須在檢疫醫院或酒店，僅此而已。有官員在談論結束0政策，但還沒有明確的解決方案。<p>我預計這將持續3個月。<p>編輯：我是在上海。不同的城市，甚至不同的區和分區，封鎖的類型也不同。 在這裡，如果你是二級接觸者，你可能會在家裡呆兩天；但如果你沒有戴口罩，那將是14天。如果你是一級接觸者，那就是14天的隔離旅館。如果你被感染了，我相信你會去醫院。在深圳，一些被封鎖的社區不能訂購雜貨，只能得到你在隔離區得到的那種酒店/飛機食品。因此，我肯定要有適當的食物，這也是為什麼我會在很長一段時間內做婦產科醫生，以便不與第一類或其他公寓程度的人接觸。"
}