{
  "@type": "NewsArticle",
  "identifier": "2022--03--04--en--besthn--HackerNews--NewsArticle--30542953",
  "url": "https://news.ycombinator.com/item?id=30542953",
  "headline": "Ask HN: Why do my online accounts keep getting banned?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN. I am at my wit's end so I'm asking here. In the last few years, nearly half of all my online accounts for a variety of different services have been either restricted or banned for no reason. I have no idea what I could possibly be doing &quot;wrong&quot; here so I'm asking HN for help.<p>* Lyft. Got a generic error when requesting a ride, which told me to contact support. I contacted support and they said my account was suspended due to violation of ToS with fradulent activity. I asked exactly what they think I did to violate ToS and they would not tell me. I've taken hundreds of 5-star rides, never comitted any fraud, I don't drive for Lyft or even know anyone who does. To this day I still don't know what I did &quot;wrong.&quot;<p>* Instagram. Signed up for an account a couple years ago. Followed some celebrities and friends. A week later when I try to login, it errors saying my account has been suspended with no reason and recourse for recovery. I made another account. Banned again after a couple of days. Now, whenever I try to make a new account, the SMS verification never passes. It is like they have blacklisted my IP address.<p>* Letgo. It's like Craiglist. I moved within San Francisco a few years ago and signed up for an account to get rid of some furniture that I would not be taking with me. Within a few days I couldn't login and support told me my account was banned due to fradulent activity. All I did was create a listing for a couch with some pictures! I hadn't even gotten responses to the post.<p>* Google. I tried logging in to an old account associated with some domains in Webmaster Tools. That's all I use this account for and I haven't logged in in years. I enter in the right password and am greeted with &quot;You’re trying to sign in on a device Google doesn’t recognize, and we don’t have enough information to verify that it’s you. For your protection, you can’t sign in here right now. Try again from a device or location where you’ve signed in before.&quot;. What am I supposed to do here? Last I used this account has at an old address (different IP) and on a computer that has since been retired (motherboard swapped out, OS reinstalled).<p>* Twitter. I created an account several years ago. After a week when I logged in it said my account was restricted and asked me to enter a phone number for SMS verification. I complied, and even after entering the correct code, it errored saying it cannot verify my identity. Haven't used Twitter since.<p>* Fidelity. This morning I tried to log in to my investment account and it says my account has been blocked &quot;for security reasons&quot; with no other information or explanation. It says I have to call Fidelity. Over the phone they asked me to supply a ton of documents over fax for identity verification and a record of all the devices I've ever used to sign into Fidelity. They won't even tell me why my account was blocked in the first place.<p>This is endlessly frustrating. There must be <i>something</i> unique about either me or my devices. I have a regular residental ISP in San Francisco, I'm not using Tor or VPNs, I use a vanilla Mac with Firefox. I use an adblocker (uBlock) but so does everyone else. I have a bog-standard Samsung phone running bog-standard unmodified Android.<p>Does HN know why my accounts keep getting banned? Especially for those who work on identity/trust and safety teams in Silicon Valley who have inside knowledge of how this works.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lopkeny12ko",
    "url": "https://news.ycombinator.com/user?id=lopkeny12ko"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30542953",
  "sameAs": "https://news.ycombinator.com/item?id=30542953",
  "dateCreated": "2022-03-04T13:49:57.183Z",
  "datePublished": "2022-03-03T16:19:43.000Z",
  "dateModified": "2022-03-04T13:49:57.183Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 251
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 200
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么我的在线账户总是被禁止？",
  "headline_zh-Hant": "Ask HN: 為什麼我的在線賬戶總是被禁止？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN。我已经无计可施了，所以我在这里问。在过去几年中，我在各种不同服务的所有在线账户中，有近一半无缘无故被限制或禁止。我不知道我在这里可能做错了什么，所以我向HN求助。<p>* Lyft。在请求搭车时得到了一个通用的错误，这让我联系支持。我联系了支持部门，他们说我的账户被暂停了，原因是我违反了ToS和欺诈性活动。我问他们到底认为我做了什么违反了ToS，他们不愿意告诉我。我已经乘坐过数百次五星级的交通工具，从未犯过任何欺诈行为，我不为Lyft开车，甚至不认识任何开车的人。直到今天，我仍然不知道我做错了什么。<p>* Instagram。几年前，我注册了一个账户。关注了一些名人和朋友。一周后，当我试图登录时，它出错了，说我的账户已被暂停，没有理由，也没有恢复的途径。我又开了一个账户。几天后又被禁了。现在，每当我试图创建一个新账户时，短信验证从未通过。就像他们把我的IP地址列入黑名单。<p>*Letgo。这就像Craiglist。几年前，我搬到了旧金山，并注册了一个账户，以处理一些我不打算带走的家具。没过几天，我就无法登录了，支持人员告诉我，我的账户因欺诈行为而被禁止使用。我所做的只是创建了一个带有一些图片的沙发清单！我甚至没有收到任何关于该清单的回复。我甚至没有收到对帖子的回复。<p>* Google。我试着登录了一个与网站管理员工具中的一些域名相关的旧账户。这是我使用这个账户的全部内容，而且我已经多年没有登录了。我输入了正确的密码，但得到的答复是&quot;你试图用谷歌不认可的设备登录，而且我们没有足够的信息来验证这是你。为了保护你，你现在不能在这里登录。请从您之前登录过的设备或地点再试一次。我在这里应该做什么？我最后一次使用这个账户是在一个旧地址（不同的IP）和一台已经退役的电脑上（换了主板，重新安装了操作系统）。<p>* Twitter。我几年前创建了一个账户。一周后，当我登录时，它说我的账户受到限制，要求我输入一个电话号码进行短信验证。我照做了，但即使输入了正确的代码，它还是出错了，说它无法验证我的身份。此后就没有再使用过Twitter。<p>* Fidelity。今天早上，我试图登录我的投资账户，它说我的账户已经被封锁了&quot;出于安全原因&quot;，没有其他信息或解释。它说我必须给富达公司打电话。Over the phone they asked me to supply a ton of documents over fax for identity verification and a record of all the devices I've ever used to sign into Fidelity. They won't even tell me why my account was blocked in the first place.<p>This is endlessly frustrating. 一定是我或我的设备有什么独特之处。我在旧金山有一个普通的住宅ISP，我没有使用Tor或VPN，我使用的是带Firefox的普通Mac。我使用一个广告拦截器（uBlock），但其他人也一样。我有一个普通标准的三星手机，运行普通标准的未修改的安卓系统。<p>HN知道为什么我的账户一直被禁止吗？特别是对于那些在硅谷的身份/信任和安全团队工作的人来说，他们对这种工作方式有内部了解。",
  "description_zh-Hant": "嗨，HN。我已經無計可施了，所以我在這裡問。在過去幾年中，我在各種不同服務的所有在線賬戶中，有近一半無緣無故被限制或禁止。我不知道我在這裡可能做錯了什麼，所以我向HN求助。<p>* Lyft。在請求搭車時得到了一個通用的錯誤，這讓我聯繫支持。我聯繫了支持部門，他們說我的賬戶被暫停了，原因是我違反了ToS和欺詐性活動。我問他們到底認為我做了什麼違反了ToS，他們不願意告訴我。我已經乘坐過數百次五星級的交通工具，從未犯過任何欺詐行為，我不為Lyft開車，甚至不認識任何開車的人。直到今天，我仍然不知道我做錯了什麼。<p>* Instagram。幾年前，我註冊了一個賬戶。關注了一些名人和朋友。一週後，當我試圖登錄時，它出錯了，說我的賬戶已被暫停，沒有理由，也沒有恢復的途徑。我又開了一個賬戶。幾天後又被禁了。現在，每當我試圖創建一個新賬戶時，短信驗證從未通過。就像他們把我的IP地址列入黑名單。<p>*Letgo。這就像Craiglist。幾年前，我搬到了舊金山，並註冊了一個賬戶，以處理一些我不打算帶走的傢俱。沒過幾天，我就無法登錄了，支持人員告訴我，我的賬戶因欺詐行為而被禁止使用。我所做的只是創建了一個帶有一些圖片的沙發清單！我甚至沒有收到任何關於該清單的回覆。我甚至沒有收到對帖子的回覆。<p>* Google。我試著登錄了一個與網站管理員工具中的一些域名相關的舊賬戶。這是我使用這個賬戶的全部內容，而且我已經多年沒有登錄了。我輸入了正確的密碼，但得到的答覆是&quot;你試圖用谷歌不認可的設備登錄，而且我們沒有足夠的信息來驗證這是你。為了保護你，你現在不能在這裡登錄。請從您之前登錄過的設備或地點再試一次。我在這裡應該做什麼？我最後一次使用這個賬戶是在一箇舊地址（不同的IP）和一臺已經退役的電腦上（換了主板，重新安裝了操作系統）。<p>* Twitter。我幾年前創建了一個賬戶。一週後，當我登錄時，它說我的賬戶受到限制，要求我輸入一個電話號碼進行短信驗證。我照做了，但即使輸入了正確的代碼，它還是出錯了，說它無法驗證我的身份。此後就沒有再使用過Twitter。<p>* Fidelity。今天早上，我試圖登錄我的投資賬戶，它說我的賬戶已經被封鎖了&quot;出於安全原因&quot;，沒有其他信息或解釋。它說我必須給富達公司打電話。Over the phone they asked me to supply a ton of documents over fax for identity verification and a record of all the devices I've ever used to sign into Fidelity. They won't even tell me why my account was blocked in the first place.<p>This is endlessly frustrating. 一定是我或我的設備有什麼獨特之處。我在舊金山有一個普通的住宅ISP，我沒有使用Tor或VPN，我使用的是帶Firefox的普通Mac。我使用一個廣告攔截器（uBlock），但其他人也一樣。我有一個普通標準的三星手機，運行普通標準的未修改的安卓系統。<p>HN知道為什麼我的賬戶一直被禁止嗎？特別是對於那些在硅谷的身份/信任和安全團隊工作的人來說，他們對這種工作方式有內部瞭解。"
}