{
  "@type": "NewsArticle",
  "identifier": "2022--04--06--en--besthn--HackerNews--NewsArticle--30928105",
  "url": "https://news.ycombinator.com/item?id=30928105",
  "headline": "Ask HN: I'm interested in so many disciplines, but what can I do with that?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "A couple of years back I started dabbling in the social sciences and humanities (my background is in ecology / evolutionary biology), and became interested in one discipline after another. From psychology to history of science to anthropology and sociology, to economics and politics, to philosophy and religious studies and cultural studies, etc.<p>I find it intrinsically motivating to move from ignorance slowly towards understanding. I love reading textbooks to learn basic concepts and looking through academic titles just to swim in their ideas.<p>While I loved university, I won't be able to handle the demands of formal schooling (especially not while raising a family). I also wouldn't want to do any advanced research degrees as I have no patience in studying a small set of problems (I tried it for science and it was horrendous).<p>While I have no issue just continuing to explore these subjects privately, I feel like something is missing. I feel like I want to do something more tangible with this breadth of interests, but I'm coming up empty in terms of ideas. I like writing and can imagine having some sort of blog, but that's seems so cliche?<p>Any suggestions? Perhaps examples of something others have done with their broad interests?<p>What does one do with an intellectual life other than swimming through intellectual content?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30928105",
  "sameAs": "https://news.ycombinator.com/item?id=30928105",
  "dateCreated": "2022-04-06T11:10:18.944Z",
  "datePublished": "2022-04-06T03:18:17.000Z",
  "dateModified": "2022-04-06T11:10:18.944Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 257
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 168
    }
  ],
  "headline_zh-Hans": "Ask HN: 我对这么多学科感兴趣，但我能用这些做什么？",
  "headline_zh-Hant": "Ask HN: 我對這麼多學科感興趣，但我能用這些做什麼？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几年前，我开始涉足社会科学和人文科学（我的背景是生态学/进化生物学），并对一个又一个学科感兴趣。从心理学到科学史，再到人类学和社会学，再到经济学和政治学，再到哲学和宗教研究以及文化研究，等等。<p>我发现从无知慢慢走向理解是一种内在的动力。我喜欢阅读教科书来学习基本概念，也喜欢翻阅学术名著，只为在他们的思想中畅游。<p>虽然我喜欢大学，但我将无法应对正规学校教育的要求（尤其是在养家糊口时）。我也不想做任何高级研究学位，因为我对研究一小部分问题没有耐心（我试着去研究科学，结果很糟糕）。<p>虽然我没有问题，只是继续私下探索这些主题，但我觉得缺少一些东西。我觉得我想用这种广泛的兴趣做一些更具体的事情，但我在想法方面却空空如也。我喜欢写作，可以想象拥有某种博客，但这似乎太老套了。 <p>有什么建议吗？也许可以举出一些别人利用其广泛兴趣所做的事情的例子？<p>除了在知识内容中游刃有余之外，一个人在知识生活中还能做些什么？",
  "description_zh-Hant": "幾年前，我開始涉足社會科學和人文科學（我的背景是生態學/進化生物學），並對一個又一個學科感興趣。從心理學到科學史，再到人類學和社會學，再到經濟學和政治學，再到哲學和宗教研究以及文化研究，等等。<p>我發現從無知慢慢走向理解是一種內在的動力。我喜歡閱讀教科書來學習基本概念，也喜歡翻閱學術名著，只為在他們的思想中暢遊。<p>雖然我喜歡大學，但我將無法應對正規學校教育的要求（尤其是在養家餬口時）。我也不想做任何高級研究學位，因為我對研究一小部分問題沒有耐心（我試著去研究科學，結果很糟糕）。<p>雖然我沒有問題，只是繼續私下探索這些主題，但我覺得缺少一些東西。我覺得我想用這種廣泛的興趣做一些更具體的事情，但我在想法方面卻空空如也。我喜歡寫作，可以想象擁有某種博客，但這似乎太老套了。 <p>有什麼建議嗎？也許可以舉出一些別人利用其廣泛興趣所做的事情的例子？<p>除了在知識內容中游刃有餘之外，一個人在知識生活中還能做些什麼？"
}