{
  "@type": "NewsArticle",
  "identifier": "2022--02--20--en--besthn--HackerNews--NewsArticle--30401241",
  "url": "https://news.ycombinator.com/item?id=30401241",
  "headline": "Tell HN: YouTube and how my wife lost 7 years of work",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I just wanted to share an experience as a warning to fellow users of hacker news and in the hope that somehow someway 7 years and countless hours can be recovered.<p>I've never posted anything like this, but this is the only place I have any hope of a human response after youtube deleted 700 videos created for internal training for our company. My wife started a company that helps people transition from colleges in their home country (for instance the IIT system in India) by translating their credit system into the American educational credit system.<p>She utilized a youtube channel with unlisted videos to explain to internal employees the nuances of difficult evaluation types, for instance how to determine for CEGEPs in Quebec the difference between upper secondary and post secondary. Another example would be how to award credits for MBBS programs from U.K modeled educational system (West Africa, India etc).<p>Youtube sent her 3 strikes in one week. On videos that were 4 years old, indicating cyber bullying. These videos were unlisted and literally contained only incredibly dense, rather boring videos covering the nooks and crannies of various educational systems and how they relate to each other. When she responded, she received an auto reply that stated you get a reply within 2 business days. No further response despite repeated requests within the system, then tweets, and finally submitting a new appeal form from scratch to which the reply was nothing can be done because too much time had passed.<p>This content was incredibly time intensive to create and was basically another job on top of her position as CEO. As a small company this was a devastating blow. Her work youtube account is now removed.<p>Personally the cynic in me speculates that google cleans out low hanging fruit, using metrics, and there was nothing in the content that triggered the bot at all, just a case of over 700 somewhat lengthy videos that were getting almost no traffic, and they get to delete them and hide behind the byzantine garbage fire that is their &quot;support&quot;.<p>If you work for the youtube division and can help, I'm begging you please send me a message or reply to this post, it seems this is the only way to rectify this kind of problem. If there is anyway to download the videos that is all we are asking for.<p>-jdh",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jdhendrickson",
    "url": "https://news.ycombinator.com/user?id=jdhendrickson"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30401241",
  "sameAs": "https://news.ycombinator.com/item?id=30401241",
  "dateCreated": "2022-02-20T00:36:16.575Z",
  "datePublished": "2022-02-19T22:45:05.000Z",
  "dateModified": "2022-02-20T00:36:16.575Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 265
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 100
    }
  ],
  "headline_zh-Hans": "告诉HN：YouTube和我妻子如何失去7年的工作",
  "headline_zh-Hant": "告訴HN：YouTube和我妻子如何失去7年的工作",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我只是想分享一个经验，作为对黑客新闻用户的警告，并希望以某种方式恢复7年和无数的时间。<p>我从来没有张贴过这样的东西，但这是我唯一有希望得到人类回应的地方，因为youtube删除了为我们公司内部培训创建的700个视频。我的妻子创办了一家公司，帮助人们从本国的大学（例如印度的IIT系统）过渡到美国的教育学分系统。<p>她利用一个youtube频道，用未列出的视频向内部员工解释困难的评估类型的细微差别，例如如何确定魁北克的CEGEPs在高中和中学后的区别。另一个例子是如何授予来自英国教育系统（西非、印度等）的MBBS课程的学分。<p>YouTube在一周内给她发了3个打击。这些视频都是4年前的，表明是网络欺凌。这些视频未被列入名单，而且只包含令人难以置信的密集、相当无聊的视频，涉及各种教育系统的角落和缝隙，以及它们之间的关系。当她回复时，她收到了一个自动回复，说你会在两个工作日内得到回复。尽管在系统内反复请求，然后发推特，最后从头提交了一份新的上诉表，但没有进一步的回应，答复是无能为力，因为时间太长了。<p>这些内容的制作非常耗时，基本上是她作为CEO之外的另一项工作。作为一家小公司，这是一个毁灭性的打击。<p>我这个愤世嫉俗的人猜测，谷歌会利用指标来清除低垂的果实，而且内容中根本没有触发机器人的内容，只是有700多个有点长的视频，几乎没有流量，他们就可以删除它们，躲在他们的&quot;支持&quot;这个繁琐的垃圾火堆后面。 <p>如果你在youtube部门工作并能提供帮助，我恳请你给我发信息或回复这个帖子，这似乎是纠正这种问题的唯一方法。如果有办法下载这些视频，这就是我们所要求的。<p>-jdh",
  "description_zh-Hant": "我只是想分享一個經驗，作為對黑客新聞用戶的警告，並希望以某種方式恢復7年和無數的時間。<p>我從來沒有張貼過這樣的東西，但這是我唯一有希望得到人類迴應的地方，因為youtube刪除了為我們公司內部培訓創建的700個視頻。我的妻子創辦了一家公司，幫助人們從本國的大學（例如印度的IIT系統）過渡到美國的教育學分系統。<p>她利用一個youtube頻道，用未列出的視頻向內部員工解釋困難的評估類型的細微差別，例如如何確定魁北克的CEGEPs在高中和中學後的區別。另一個例子是如何授予來自英國教育系統（西非、印度等）的MBBS課程的學分。<p>YouTube在一週內給她發了3個打擊。這些視頻都是4年前的，表明是網絡欺凌。這些視頻未被列入名單，而且只包含令人難以置信的密集、相當無聊的視頻，涉及各種教育系統的角落和縫隙，以及它們之間的關係。當她回覆時，她收到了一個自動回覆，說你會在兩個工作日內得到回覆。儘管在系統內反覆請求，然後發推特，最後從頭提交了一份新的上訴表，但沒有進一步的迴應，答覆是無能為力，因為時間太長了。<p>這些內容的製作非常耗時，基本上是她作為CEO之外的另一項工作。作為一家小公司，這是一個毀滅性的打擊。<p>我這個憤世嫉俗的人猜測，谷歌會利用指標來清除低垂的果實，而且內容中根本沒有觸發機器人的內容，只是有700多個有點長的視頻，幾乎沒有流量，他們就可以刪除它們，躲在他們的&quot;支持&quot;這個繁瑣的垃圾火堆後面。 <p>如果你在youtube部門工作並能提供幫助，我懇請你給我發信息或回覆這個帖子，這似乎是糾正這種問題的唯一方法。如果有辦法下載這些視頻，這就是我們所要求的。<p>-jdh"
}