{
  "@type": "NewsArticle",
  "identifier": "2022--04--14--en--besthn--HackerNews--NewsArticle--31028795",
  "url": "https://news.ycombinator.com/item?id=31028795",
  "headline": "Tell HN: Turned 44 today and I'm lost",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Been professionally developing since my teens. Was the first person in the history of my university who was both a fulltime student and full time employee. Exceeded in all expectations at every job. Became the founding CTO of a start-up, put my heart and soul into it, and we sold for low 8 figures. Started a second company with some of the same people but directions started to diverge and I left. I moved to a different state for another job. Became a freelancer for a while. One of the guys who was at both start-ups recruited me into his current company with a total comp far exceeding what I asked for. All mortgages, car notes, and credit cards are paid off and our investments are enough for our day-to-day. I’m really only working for the health insurance.<p>But I've never been more unhappy and lost.<p>I used to joke that I would be dead by the time I was 40 though stopped because The Wife hated hearing it but I do feel like I have no plan past this point. Being in pandemic lock down during this time hasn't helped. I told my therapist that I feel like I've hit my mid-life crisis, though not your typical one as I'm not going out and buying a muscle car to cruise high schools. I know I'm depressed and have been for the majority of my life. Been in therapy for a while and tried various pills (didn't help), TMS (somewhat helped), and thinking about trying Ketamine.<p>I feel like I've hit my zenith already and it's just a slow decline from here on out. I’ve been dreading this day because it’s a sad reminder of that.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "0414throwaway",
    "url": "https://news.ycombinator.com/user?id=0414throwaway"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31028795",
  "sameAs": "https://news.ycombinator.com/item?id=31028795",
  "dateCreated": "2022-04-14T20:43:04.878Z",
  "datePublished": "2022-04-14T16:04:55.000Z",
  "dateModified": "2022-04-14T20:43:04.878Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 251
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 350
    }
  ],
  "headline_zh-Hans": "告诉HN：今天44岁了，我很迷茫",
  "headline_zh-Hant": "告訴HN：今天44歲了，我很迷茫",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "从我十几岁开始就一直在进行专业的开发。是我大学历史上第一个既是全职学生又是全职员工的人。在每一份工作中都超越了所有的期望。成为一家初创公司的首席技术官，全身心投入，我们以低至8位数的价格出售。和一些相同的人开始了第二家公司，但方向开始出现分歧，我就离开了。我搬到另一个州去做另一份工作。有一段时间成了自由职业者。两次创业的其中一个人把我招进了他现在的公司，总薪酬远远超过我的要求。所有的抵押贷款、汽车票据和信用卡都已付清，我们的投资足以应付我们的日常开支。我真的只是为了健康保险而工作。<p>但我从未像现在这样不开心和失落。<p>我曾经开玩笑说，我在40岁时就会死掉，但因为妻子不喜欢听，所以我就停止了，但我确实感觉到我没有计划过这一点。在这段时间里，我被关在大流行病区，这对我没有帮助。我告诉我的治疗师，我觉得我已经遇到了中年危机，虽然不是你的典型危机，因为我不会出去买一辆肌肉车去巡游高中。我知道我有抑郁症，在我生命的大部分时间里都是如此。我已经接受了一段时间的治疗，并尝试了各种药片（没有帮助）、TMS（有点帮助），并考虑尝试Ketamine。<p>我觉得我已经达到了我的顶点，从这里开始只是缓慢下降。我一直在害怕这一天，因为它是一个可悲的提醒。",
  "description_zh-Hant": "從我十幾歲開始就一直在進行專業的開發。是我大學歷史上第一個既是全職學生又是全職員工的人。在每一份工作中都超越了所有的期望。成為一家初創公司的首席技術官，全身心投入，我們以低至8位數的價格出售。和一些相同的人開始了第二家公司，但方向開始出現分歧，我就離開了。我搬到另一個州去做另一份工作。有一段時間成了自由職業者。兩次創業的其中一個人把我招進了他現在的公司，總薪酬遠遠超過我的要求。所有的抵押貸款、汽車票據和信用卡都已付清，我們的投資足以應付我們的日常開支。我真的只是為了健康保險而工作。<p>但我從未像現在這樣不開心和失落。<p>我曾經開玩笑說，我在40歲時就會死掉，但因為妻子不喜歡聽，所以我就停止了，但我確實感覺到我沒有計劃過這一點。在這段時間裡，我被關在大流行病區，這對我沒有幫助。我告訴我的治療師，我覺得我已經遇到了中年危機，雖然不是你的典型危機，因為我不會出去買一輛肌肉車去巡遊高中。我知道我有抑鬱症，在我生命的大部分時間裡都是如此。我已經接受了一段時間的治療，並嘗試了各種藥片（沒有幫助）、TMS（有點幫助），並考慮嘗試Ketamine。<p>我覺得我已經達到了我的頂點，從這裡開始只是緩慢下降。我一直在害怕這一天，因為它是一個可悲的提醒。"
}