{
  "@type": "NewsArticle",
  "identifier": "2022--03--29--en--besthn--HackerNews--NewsArticle--30832589",
  "url": "https://news.ycombinator.com/item?id=30832589",
  "headline": "Launch HN: Andi (YC W22) – Q&A based, ad-free, anti-spam search engine",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, we're Angie and Jed, and we're building Andi (<a href=\"https://andisearch.com\" rel=\"nofollow\">https://andisearch.com</a>), a new type of search engine with an AI assistant that answers complex questions, and gives you tools to fight spam and ad tech.<p>There has been a lot of discussion on HN recently about how Google search is dying. If you do a Google search in a category like finance or health, the results are overwhelmed with spam, clickbait and ads. That's what we're working to fix.<p>For us, the problem is personal. I'm a programmer who also trained and worked as a journalist and built a media SaaS startup. I watched first-hand as the media industry not-so-slowly starved, my startup failed, and my friends lost jobs and businesses. Google took all the revenue as media turned to trash, and ad tech, clickbait and content marketing took over the Internet, and made using the web awful.<p>With Andi, we already apply spam blacklists server-side and we're adding tools to blacklist and report spam locally. Andi's free from ads and tracking. And it protects your privacy more than other search engines, because searches don't pass through browser history (they're encrypted POST requests). It's free and anonymous, and there are no usage limits. You don't need to register, or install an extension or app.<p>Andi is not just another copy of Google. The UX is radically different, like messaging with a smart friend who answers questions and sends you useful links. It shows results in a cleaner, more visual way (or you can change view to a simple list). You can preview content from the web safely using a proxied Reader View with no ads or clutter.<p>Our AI assistant uses a conversational interface to answer complex questions, explain topics, and find key information. We call these &quot;deep answers&quot;. It is a significant break-through, as you'll see if you try it out for yourself. Try something factual and current, like &quot;How many Ukrainian refugees will the US accept, and what humanitarian aid will it provide?&quot;, &quot;What were the demands of the cybercriminals who breached Nvidia?&quot;, or &quot;Why is elon musk considering creating a new social media platform?&quot;<p>We're doing much more here than GPT-based text generation. You've probably seen examples from GPT writing assistants that look impressive but make no sense. Large language models on their own generate plausible-sounding text that is often plain wrong or dangerous. That's because they predict the next word in a sequence based on training data. They have no understanding of factual correctness, or moral right or wrong. They're like human linguistic intuitive perception.<p>Our approach works more like humans do, combining large language models (both commercial and open source gpt-based models) with reasoning (directed logic and classifiers) and common sense (heuristics). We answer many questions using APIs or knowledge graphs, or quoting extracted text. When the question is appropriate for complex question answering, we use the new approach. It works by finding the best sources, and extracting the content with the relevant facts. We then combine GPT-based models with the results to compose a conversational answer that is also factually correct, presented alongside the full search results.<p>The way Andi searches is also different. We use classifiers and NLP to understand question intent, entities and topics, and predict the best sources for an answer. Then we query APIs and vertical searches directly, and retrieve content in real-time, before ranking and filtering the results. The content you see in search results is retrieved directly from each site in real-time.<p>When we can't find good results, we fall back as an agent to legacy web search (Google, Bing and others - about 50% of the time now). Andi does best with natural language queries. We've trained classifiers for content quality and spam detection, and blacklist and downrank known bad sources and copycat sites (for non-political content). You can disable these.<p>The stack is a serverless application hosted on AWS, using Lambda and Kubernetes, with inference moving to Sagemaker to improve speed. We use PyTorch, SpaCy, GPT-based models (GPT-2, GPT-J/NeoX and commercial providers) and HuggingFace, BERT-style transformers, plus AWS Lex for some initial intent routing. Classifiers are trained on custom-labeled public search data and content examples. We have a database of 30k+ top sites. We're building some custom vertical searches. Services are written in Python and Node. The front end is a Progressive Web App written in React.<p>Some fun features to try include recent events (&quot;Why was the James Webb telescope launched from French Guiana?&quot;), direct navigation (&quot;go hn google search dying&quot; and allow pop-ups), or question answering (&quot;what is the gdp per capita of china vs new zealand&quot;). You can also &quot;Change View&quot; on results between a visual feed, grid of cards, or simple list, or even like Hacker News or early Google. Also try View in Reader for a proxied ad-free way to read articles, including many behind paywalls like the NYT or Economist.<p>Andi is a fairly stable alpha and still experimental (it sometimes misunderstands or gets things wrong). We plan to have a freemium model with some paid features and API use. We're a small team with two full-time founders and some help from friends. We've been live for a few weeks, and we're iterating fast based on feedback. We'd love to hear what you think about search and how to fix it, and answer any questions you have about what we're making.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jedwhite",
    "url": "https://news.ycombinator.com/user?id=jedwhite"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30832589",
  "sameAs": "https://andisearch.com/",
  "dateCreated": "2022-03-29T10:38:36.232Z",
  "datePublished": "2022-03-28T16:52:50.000Z",
  "dateModified": "2022-03-29T10:38:36.232Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 250
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 118
    }
  ],
  "headline_zh-Hans": "推出HN：Andi (YC W22) - 基于问答、无广告、反垃圾邮件的搜索引擎",
  "headline_zh-Hant": "推出HN：Andi (YC W22) - 基於問答、無廣告、反垃圾郵件的搜索引擎",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，我们是Angie和Jed，我们正在建立Andi（<a href=\"https://andisearch.com\" rel=\"nofollow\">https://andisearch.com</a>），这是一个新型的搜索引擎，它有一个AI助手，可以回答复杂的问题，并为您提供打击垃圾邮件和广告技术的工具。<p>最近，HN上有很多关于谷歌搜索如何消亡的讨论。如果你在金融或健康等类别中进行谷歌搜索，结果会被垃圾邮件、点击广告和广告所淹没。这就是我们正在努力解决的问题。<p>对我们来说，这个问题是个人问题。我是一名程序员，也曾接受过记者培训和工作，并建立了一家媒体SaaS创业公司。我亲眼目睹了媒体行业不那么缓慢地饿死了，我的创业公司也失败了，我的朋友也失去了工作和生意。谷歌拿走了所有的收入，因为媒体变成了垃圾，广告技术、点击广告和内容营销接管了互联网，并使使用网络变得很糟糕。<p>通过Andi，我们已经在服务器端应用了垃圾邮件黑名单，我们正在增加工具，以在本地将垃圾邮件列入黑名单并报告。Andi不含广告和跟踪。而且它比其他搜索引擎更能保护你的隐私，因为搜索不会通过浏览器历史记录（它们是加密的POST请求）。它是免费的、匿名的，而且没有使用限制。你不需要注册，也不需要安装扩展程序或应用程序。<p>Andi不仅仅是谷歌的另一个副本。用户体验是完全不同的，就像和一个聪明的朋友聊天，他回答问题并向你发送有用的链接。它以一种更简洁、更直观的方式显示结果（或者你可以将视图改为简单的列表）。你可以使用一个没有广告或杂乱无章的代理读者视图，安全地预览来自网络的内容。<p>我们的人工智能助理使用对话界面来回答复杂的问题，解释主题，并找到关键信息。我们称这些为 \"深度回答\"。这是一个重大的突破，如果你自己尝试一下，你会发现。试试一些事实性的和当前的问题，比如&quot;美国将接受多少乌克兰难民，它将提供哪些人道主义援助？&quot;，&quot;入侵Nvidia的网络犯罪分子的要求是什么？&quot;，或者&quot;为什么Elon Musk正在考虑创建一个新的社交媒体平台？你可能已经看到了GPT写作助手的例子，这些例子看起来令人印象深刻，但毫无意义。大型语言模型本身就能生成听起来很有道理的文本，而这些文本往往是完全错误的或危险的。这是因为它们根据训练数据来预测一个序列中的下一个词。它们对事实的正确性，或道德上的正确或错误没有理解。他们就像人类的语言直观感知。<p>我们的方法更像人类，将大型语言模型（包括商业和基于gpt的开源模型）与推理（定向逻辑和分类器）和常识（启发式方法）相结合。我们使用API或知识图谱，或引用提取的文本来回答许多问题。当问题适合于复杂的问题回答时，我们使用新的方法。它的工作原理是寻找最佳来源，并提取具有相关事实的内容。然后我们将基于GPT的模型与结果结合起来，组成一个对话式的答案，这个答案也是符合事实的，与完整的搜索结果一起呈现。<p>Andi的搜索方式也是不同的。我们使用分类器和NLP来理解问题的意图、实体和主题，并预测答案的最佳来源。然后我们直接查询API和垂直搜索，并实时检索内容，然后对结果进行排名和过滤。你在搜索结果中看到的内容是直接从每个网站实时检索的。<p>当我们找不到好的结果时，我们作为代理退回到传统的网络搜索（谷歌、必应和其他--现在大约有50%的时间）。Andi对自然语言查询的效果最好。我们已经为内容质量和垃圾邮件检测训练了分类器，并将已知的不良来源和山寨网站（对于非政治性内容）列入黑名单和降级。你可以禁用这些。<p>该堆栈是一个托管在AWS上的无服务器应用程序，使用Lambda和Kubernetes，推理转移到Sagemaker以提高速度。我们使用PyTorch、SpaCy、基于GPT的模型（GPT-2、GPT-J/NeoX和商业供应商）和HuggingFace、BERT式转化器，加上AWS Lex用于一些初始意图路由。分类器是在自定义标记的公共搜索数据和内容实例上训练的。我们有一个包含30k+顶级网站的数据库。W",
  "description_zh-Hant": "嗨，HN，我們是Angie和Jed，我們正在建立Andi（<a href=\"https://andisearch.com\" rel=\"nofollow\">https://andisearch.com</a>），這是一個新型的搜索引擎，它有一個AI助手，可以回答複雜的問題，併為您提供打擊垃圾郵件和廣告技術的工具。<p>最近，HN上有很多關於谷歌搜索如何消亡的討論。如果你在金融或健康等類別中進行谷歌搜索，結果會被垃圾郵件、點擊廣告和廣告所淹沒。這就是我們正在努力解決的問題。<p>對我們來說，這個問題是個人問題。我是一名程序員，也曾接受過記者培訓和工作，並建立了一家媒體SaaS創業公司。我親眼目睹了媒體行業不那麼緩慢地餓死了，我的創業公司也失敗了，我的朋友也失去了工作和生意。谷歌拿走了所有的收入，因為媒體變成了垃圾，廣告技術、點擊廣告和內容營銷接管了互聯網，並使使用網絡變得很糟糕。<p>通過Andi，我們已經在服務器端應用了垃圾郵件黑名單，我們正在增加工具，以在本地將垃圾郵件列入黑名單並報告。Andi不含廣告和跟蹤。而且它比其他搜索引擎更能保護你的隱私，因為搜索不會通過瀏覽器歷史記錄（它們是加密的POST請求）。它是免費的、匿名的，而且沒有使用限制。你不需要註冊，也不需要安裝擴展程序或應用程序。<p>Andi不僅僅是谷歌的另一個副本。用戶體驗是完全不同的，就像和一個聰明的朋友聊天，他回答問題並向你發送有用的鏈接。它以一種更簡潔、更直觀的方式顯示結果（或者你可以將視圖改為簡單的列表）。你可以使用一個沒有廣告或雜亂無章的代理讀者視圖，安全地預覽來自網絡的內容。<p>我們的人工智能助理使用對話界面來回答覆雜的問題，解釋主題，並找到關鍵信息。我們稱這些為 \"深度回答\"。這是一個重大的突破，如果你自己嘗試一下，你會發現。試試一些事實性的和當前的問題，比如&quot;美國將接受多少烏克蘭難民，它將提供哪些人道主義援助？&quot;，&quot;入侵Nvidia的網絡犯罪分子的要求是什麼？&quot;，或者&quot;為什麼Elon Musk正在考慮創建一個新的社交媒體平臺？你可能已經看到了GPT寫作助手的例子，這些例子看起來令人印象深刻，但毫無意義。大型語言模型本身就能生成聽起來很有道理的文本，而這些文本往往是完全錯誤的或危險的。這是因為它們根據訓練數據來預測一個序列中的下一個詞。它們對事實的正確性，或道德上的正確或錯誤沒有理解。他們就像人類的語言直觀感知。<p>我們的方法更像人類，將大型語言模型（包括商業和基於gpt的開源模型）與推理（定向邏輯和分類器）和常識（啟發式方法）相結合。我們使用API或知識圖譜，或引用提取的文本來回答許多問題。當問題適合於複雜的問題回答時，我們使用新的方法。它的工作原理是尋找最佳來源，並提取具有相關事實的內容。然後我們將基於GPT的模型與結果結合起來，組成一個對話式的答案，這個答案也是符合事實的，與完整的搜索結果一起呈現。<p>Andi的搜索方式也是不同的。我們使用分類器和NLP來理解問題的意圖、實體和主題，並預測答案的最佳來源。然後我們直接查詢API和垂直搜索，並實時檢索內容，然後對結果進行排名和過濾。你在搜索結果中看到的內容是直接從每個網站實時檢索的。<p>當我們找不到好的結果時，我們作為代理退回到傳統的網絡搜索（谷歌、必應和其他--現在大約有50%的時間）。Andi對自然語言查詢的效果最好。我們已經為內容質量和垃圾郵件檢測訓練了分類器，並將已知的不良來源和山寨網站（對於非政治性內容）列入黑名單和降級。你可以禁用這些。<p>該堆棧是一個託管在AWS上的無服務器應用程序，使用Lambda和Kubernetes，推理轉移到Sagemaker以提高速度。我們使用PyTorch、SpaCy、基於GPT的模型（GPT-2、GPT-J/NeoX和商業供應商）和HuggingFace、BERT式轉化器，加上AWS Lex用於一些初始意圖路由。分類器是在自定義標記的公共搜索數據和內容實例上訓練的。我們有一個包含30k+頂級網站的數據庫。W"
}