{
  "@type": "NewsArticle",
  "identifier": "2022--08--02--en--besthn--HackerNews--NewsArticle--32317441",
  "url": "https://news.ycombinator.com/item?id=32317441",
  "headline": "Coding as a greybeard",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Interviewed Erik van Eykelen of releasewise.com, a (then) 51-year-old programmer and founder who had some interesting things to say about growing older in tech.<p>&quot;I'm 51 and I've been active in this industry since I was 14. I watched it grow from computers with 4k of memory to having a supercomputer in my pocket. I was learning in the age of Apple II and the Commodore PET. When I realized that I could create an explosion of data with just a few lines of code, I was hooked forever. It was such a magical thing. I found some other guys in my high school that were also into computers and we started meeting regularly on Fridays and Saturdays to... Well, to do some things that were, perhaps, not allowed. Since then, I've started three companies, and I don't think I could have found the same satisfaction in any other industry. I am mindful, these days, that I'm 51 because I know ageism is a thing in tech. There's a moment when you walk into a room and people think, 'Oh, he's a greybeard.' I don't have a beard, but you know what I mean. But when I start to talk about things and find solutions, that disappears. I can't change my age but I am in full control over what I do and what I read and how much time I carve out to write code. I can still see myself doing this when I'm 60, 70 years old. Even older. Because I want to keep doing meaningful things.&quot;",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jamesofthedrum",
    "url": "https://news.ycombinator.com/user?id=jamesofthedrum"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32317441",
  "sameAs": "https://news.ycombinator.com/item?id=32317441",
  "dateCreated": "2022-08-02T15:28:31.046Z",
  "datePublished": "2022-08-02T11:47:01.000Z",
  "dateModified": "2022-08-02T15:28:31.046Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 204
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 174
    }
  ],
  "headline_zh-Hans": "编码为灰胡子的人\n",
  "headline_zh-Hant": "編碼為灰鬍子的人\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "采访了releasewise.com的Erik van Eykelen，一位（当时）51岁的程序员和创始人，他对科技界的老年化有一些有趣的看法。<p>&quot;我今年51岁，从14岁开始就一直活跃在这个行业。我看着它从拥有4K内存的电脑发展到口袋里有一台超级计算机。我是在苹果II和Commodore PET的时代学习的。当我意识到我可以用几行代码创造一个爆炸性的数据时，我就永远迷上了。这真是一件神奇的事情。我在我的高中找到了一些同样喜欢电脑的人，我们开始在周五和周六定期聚会，以......。嗯，做一些可能不被允许的事情。从那时起，我已经创办了三家公司，我不认为我可以在任何其他行业找到同样的满足感。这些天来，我注意到我已经51岁了，因为我知道科技界存在着年龄歧视。有一个时刻，当你走进一个房间，人们会想，'哦，他是个灰胡子'。我没有胡子，但你知道我的意思。但当我开始谈论事情并找到解决方案时，这种感觉就消失了。我无法改变我的年龄，但我可以完全控制我所做的事情和阅读的内容，以及我挤出多少时间来写代码。我仍然可以看到自己在60岁、70岁的时候还在做这个工作。甚至更老。因为我想继续做有意义的事情。\n",
  "description_zh-Hant": "採訪了releasewise.com的Erik van Eykelen，一位（當時）51歲的程序員和創始人，他對科技界的老年化有一些有趣的看法。<p>&quot;我今年51歲，從14歲開始就一直活躍在這個行業。我看著它從擁有4K內存的電腦發展到口袋裡有一臺超級計算機。我是在蘋果II和Commodore PET的時代學習的。當我意識到我可以用幾行代碼創造一個爆炸性的數據時，我就永遠迷上了。這真是一件神奇的事情。我在我的高中找到了一些同樣喜歡電腦的人，我們開始在週五和週六定期聚會，以......。嗯，做一些可能不被允許的事情。從那時起，我已經創辦了三家公司，我不認為我可以在任何其他行業找到同樣的滿足感。這些天來，我注意到我已經51歲了，因為我知道科技界存在著年齡歧視。有一個時刻，當你走進一個房間，人們會想，'哦，他是個灰鬍子'。我沒有鬍子，但你知道我的意思。但當我開始談論事情並找到解決方案時，這種感覺就消失了。我無法改變我的年齡，但我可以完全控制我所做的事情和閱讀的內容，以及我擠出多少時間來寫代碼。我仍然可以看到自己在60歲、70歲的時候還在做這個工作。甚至更老。因為我想繼續做有意義的事情。\n"
}