{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--besthn--HackerNews--NewsArticle--31598978",
  "url": "https://news.ycombinator.com/item?id=31598978",
  "headline": "I'm Afraid We're Shutting Down",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So it’s with deep professional and personal sadness that I must announce my plans to shut down 70 Million Resources, Inc., the parent company of 70 Million Jobs (the 1st national, for-profit employment platform for people with criminal records) and Commissary Club (the first mobile social network for this population).<p>When I launched 70MR in 2016, I was motivated to build a company that could short circuit the pernicious cycles of recidivism in this country--cycles that destroy lives, tear apart families and decimate communities. I sought to disrupt the sleepy reentry industry by applying technology, focusing on data, employing an aggressive, accountable team, and moving with some urgency. And for the first time, approaching the challenge as a national, for-profit venture.<p>This approach, which I named “RaaS,” (Reentry as a Service), turned out to be wildly effective, and by the beginning of 2020, we were delivering on our mission of driving “double bottom line returns”: build a big, successful business and do massive social good. With the help of Y Combinator and nearly 1,500 investors, I assembled a team and got to work.<p>We succeeded in facilitating employment for thousands of deserving men and women and became operationally profitable.<p>However, the pandemic had other plans for us. When it hit in force in March 2020, companies made wholesale terminations of nearly all our people, and continued their halt in hiring for two years.<p>Our revenue dropped like a rock to almost nothing. I immediately responded by paring our expenses to the bone and began letting team members go. There was no opportunity to raise additional funding, so I began injecting my own money into the company—money I barely have—just to keep the lights on.<p>When the economy and job market began storming back, we were inundated with inbound requests for our services. Our perseverance seemed to be paying off. Except now we were hit with a new gut punch: “The Great Resignation.” Now our workers were reticent to come back to work. And if they did accept a job, they’d often leave after only a few days.<p>It became obvious that we lacked the resources to weather this new storm while hoping and praying the world would normalize soon. (It still hasn’t.)<p>Our coffers are empty. We’ve incurred a relatively small amount of debt (that I personally guaranteed) that I hope to negotiate down. All employees have been paid what they were owed (except for me). I will explore sale of assets we hold.<p>On a personal note, I can’t tell you how grateful and humbled I’ve been that many would entrust their  investment or business with me. For a person who’s done time in prison (me), it’s almost impossible to ask for someone’s trust. I have not yet forgiven myself for things I did which ultimately got me into trouble. But I will be eternally grateful to those that assisted me in my efforts to settle the score and win back my karma.<p>From the beginning I was blessed by an unbelievable team of smart, funny, passionate young people who shared my ambition to cause change. They stuck with me/us until the very end.<p>I’m most saddened by the millions of formerly incarcerated men and women who we won’t be able to help. These are some of the most sincere, honest, and heroic people I’ve ever met. It was my life’s honor to work with them.<p>I’m pretty sure I’ll continue my reentry work. Several prominent organizations have indicated their interests in me assuming a leadership role. I need to work, and I need to continue my work.<p>I’m so sorry for this outcome, despite the good we’ve done. I’m not sure we could have done anything differently or better, but ultimately, I take full responsibility. Needless to say, if you have any thoughts or suggestions, please don’t hesitate to reach out, here or at Richard@70MillionJobs.com.<p>This has been the greatest experience of my life; it couldn’t have happened without my getting a second chance.<p>Richard",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "RBBronson123",
    "url": "https://news.ycombinator.com/user?id=RBBronson123"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31598978",
  "sameAs": "https://news.ycombinator.com/item?id=31598978",
  "dateCreated": "2022-06-02T19:56:13.663Z",
  "datePublished": "2022-06-02T18:47:03.000Z",
  "dateModified": "2022-06-02T19:56:13.663Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 266
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 34
    }
  ],
  "headline_zh-Hans": "我担心我们会被关闭\n",
  "headline_zh-Hant": "我擔心我們會被關閉\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "因此，我必须怀着深深的职业和个人悲痛宣布我关闭七千万资源公司的计划，该公司是七千万工作（第一个为有犯罪记录的人提供的全国性营利性就业平台）和小卖部俱乐部（第一个针对这一人群的移动社交网络）的母公司。 <p>当我在2016年推出七千万资源公司时，我的动机是建立一个可以缩短这个国家的恶性累犯循环的公司--摧毁生命、拆散家庭和破坏社区的循环。我试图通过应用技术、关注数据、雇用一个积极的、负责任的团队，并以某种紧迫性来打乱沉睡的再就业行业。这种方法被我命名为 \"RaaS\"（重返社会服务），被证明是非常有效的，到2020年初，我们正在实现我们推动 \"双重底线回报 \"的使命：建立一个大的、成功的企业，并做大规模的社会公益。在Y Combinator和近1500名投资者的帮助下，我组建了一个团队并开始工作。<p>我们成功地为成千上万值得帮助的男人和女人提供了就业，并在运营上实现了盈利。<p>然而，大流行病对我们有其他计划。当它在2020年3月强势来袭时，公司大量解雇了我们几乎所有的员工，并在两年内继续停止招聘。<p>我们的收入像石头一样下降到几乎没有。我立即做出反应，将我们的开支缩减到最低限度，并开始让团队成员离职。没有机会筹集更多资金，所以我开始向公司注入自己的钱--我几乎没有钱--只是为了维持生计。<p>当经济和就业市场开始回升时，我们被大量要求提供服务的呼声淹没。我们的毅力似乎得到了回报。只是现在我们受到了新的打击。\"伟大的辞职\"。现在我们的工人不愿意回来工作了。<p>很明显，我们缺乏资源来抵御这场新的风暴，同时希望并祈祷世界能尽快恢复正常。(现在还没有。)<p>我们的库房是空的。我们已经产生了一笔相对较小的债务（我个人担保的），我希望能通过谈判减少债务。所有员工都得到了他们应得的报酬（除了我之外）。我将探讨出售我们持有的资产。<p>就个人而言，我无法告诉你，许多人将他们的投资或业务委托给我，我是多么感激和谦卑。对于一个在监狱里服过刑的人（我）来说，要想得到别人的信任几乎是不可能的。我还没有原谅自己所做的最终使我陷入困境的事情。但我将永远感谢那些协助我努力清算并赢回我的因果报应的人。<p>从一开始，我就受到了一个令人难以置信的团队的祝福，他们都是聪明、有趣、充满激情的年轻人，他们与我一样有引起变革的雄心。他们与我/我们一起坚持到了最后。<p>我最难过的是数百万曾经被监禁的男人和女人，我们将无法帮助他们。这些人是我见过的最真诚、最诚实、最英勇的人。能与他们一起工作是我一生的荣幸。<p>我很确定我会继续我的再就业工作。有几个著名的组织已经表示他们对我担任领导职务感兴趣。我需要工作，我需要继续我的工作。<p>我对这个结果感到非常遗憾，尽管我们已经做了很多好事。我不确定我们是否能以不同的方式或更好的方式行事，但最终，我承担全部责任。不用说，如果你有任何想法或建议，请不要犹豫，在这里或在Richard@70MillionJobs.com。<p>这是我生命中最伟大的经历；如果我没有得到第二次机会，它就不可能发生。<p>理查德\n",
  "description_zh-Hant": "因此，我必須懷著深深的職業和個人悲痛宣佈我關閉七千萬資源公司的計劃，該公司是七千萬工作（第一個為有犯罪記錄的人提供的全國性營利性就業平臺）和小賣部俱樂部（第一個針對這一人群的移動社交網絡）的母公司。 <p>當我在2016年推出七千萬資源公司時，我的動機是建立一個可以縮短這個國家的惡性累犯循環的公司--摧毀生命、拆散家庭和破壞社區的循環。我試圖通過應用技術、關注數據、僱用一個積極的、負責任的團隊，並以某種緊迫性來打亂沉睡的再就業行業。這種方法被我命名為 \"RaaS\"（重返社會服務），被證明是非常有效的，到2020年初，我們正在實現我們推動 \"雙重底線回報 \"的使命：建立一個大的、成功的企業，並做大規模的社會公益。在Y Combinator和近1500名投資者的幫助下，我組建了一個團隊並開始工作。<p>我們成功地為成千上萬值得幫助的男人和女人提供了就業，並在運營上實現了盈利。<p>然而，大流行病對我們有其他計劃。當它在2020年3月強勢來襲時，公司大量解僱了我們幾乎所有的員工，並在兩年內繼續停止招聘。<p>我們的收入像石頭一樣下降到幾乎沒有。我立即做出反應，將我們的開支縮減到最低限度，並開始讓團隊成員離職。沒有機會籌集更多資金，所以我開始向公司注入自己的錢--我幾乎沒有錢--只是為了維持生計。<p>當經濟和就業市場開始回升時，我們被大量要求提供服務的呼聲淹沒。我們的毅力似乎得到了回報。只是現在我們受到了新的打擊。\"偉大的辭職\"。現在我們的工人不願意回來工作了。<p>很明顯，我們缺乏資源來抵禦這場新的風暴，同時希望並祈禱世界能儘快恢復正常。(現在還沒有。)<p>我們的庫房是空的。我們已經產生了一筆相對較小的債務（我個人擔保的），我希望能通過談判減少債務。所有員工都得到了他們應得的報酬（除了我之外）。我將探討出售我們持有的資產。<p>就個人而言，我無法告訴你，許多人將他們的投資或業務委託給我，我是多麼感激和謙卑。對於一個在監獄裡服過刑的人（我）來說，要想得到別人的信任幾乎是不可能的。我還沒有原諒自己所做的最終使我陷入困境的事情。但我將永遠感謝那些協助我努力清算並贏回我的因果報應的人。<p>從一開始，我就受到了一個令人難以置信的團隊的祝福，他們都是聰明、有趣、充滿激情的年輕人，他們與我一樣有引起變革的雄心。他們與我/我們一起堅持到了最後。<p>我最難過的是數百萬曾經被監禁的男人和女人，我們將無法幫助他們。這些人是我見過的最真誠、最誠實、最英勇的人。能與他們一起工作是我一生的榮幸。<p>我很確定我會繼續我的再就業工作。有幾個著名的組織已經表示他們對我擔任領導職務感興趣。我需要工作，我需要繼續我的工作。<p>我對這個結果感到非常遺憾，儘管我們已經做了很多好事。我不確定我們是否能以不同的方式或更好的方式行事，但最終，我承擔全部責任。不用說，如果你有任何想法或建議，請不要猶豫，在這裡或在Richard@70MillionJobs.com。<p>這是我生命中最偉大的經歷；如果我沒有得到第二次機會，它就不可能發生。<p>理查德\n"
}