{
  "@type": "NewsArticle",
  "identifier": "2022--07--29--en--besthn--HackerNews--NewsArticle--32265223",
  "url": "https://news.ycombinator.com/item?id=32265223",
  "headline": "My newsletter is making $2k per month with 7k subscribers – AMA",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN!<p>Roughly two years ago when the pandemic had people shifting to a WFH environment, I started a twice-weekly newsletter called Workspaces that gives readers a behind the scenes tour of their favorite entrepreneurs, designers, developers, etc. new desk setups.<p>Growth has remained consistent week to week, relying on the featured guests Twitter presence to help spread the word.<p>I have featured 175 workspaces to date (70+ more in the backlog) and have grown the newsletter to 7,000 subscribers while maintaining a &gt;50% open rate.<p>I published the fist 117 editions of the newsletter without a sponsor. I had inbound requests but I was focused on growing the subscriber base as much as possible. With the new year, I shifted this focus slightly and began offering one sponsor slot per newsletter edition.<p>Since then, the newsletter has been sold out weekly and the price has risen from the initial $150 to $250, earning $2,000 per month from sponsorships.<p>I think it’s important to note that this was not an immediate cash cow… sending out 117 editions of a newsletter without receiving a dime can be draining. You have to truly enjoy the content you are putting out (I do!).<p>However, I think this shows that consistency rules and as long as you continue to show up, put out great content and iterate based on feedback you will continue to see your newsletter grow and ultimately the money will come.<p>Happy to answer any questions around newsletter growth, finding sponsors, etc!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "ryangilbert",
    "url": "https://news.ycombinator.com/user?id=ryangilbert"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32265223",
  "sameAs": "https://news.ycombinator.com/item?id=32265223",
  "dateCreated": "2022-07-29T07:55:54.151Z",
  "datePublished": "2022-07-28T14:57:27.000Z",
  "dateModified": "2022-07-29T07:55:54.151Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 322
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 190
    }
  ],
  "headline_zh-Hans": "我的新闻通讯每月赚取2千美元，有7千名订阅者 - AMA\n",
  "headline_zh-Hant": "我的新聞通訊每月賺取2千美元，有7千名訂閱者 - AMA\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN！<p>大约两年前，当人们纷纷转向WFH环境时，我开始了每周两次的通讯，名为Workspaces，为读者提供他们最喜欢的企业家、设计师、开发人员等新办公桌设置的幕后参观。 <p>每周的增长保持稳定，依靠特邀嘉宾的Twitter存在来帮助传播。<p>迄今为止，我已经介绍了175个工作空间（还有70多个在积压中），并将通讯的订阅者增加到7000人，同时保持50%的打开率。我有入站请求，但我专注于尽可能地扩大订阅者的数量。在新的一年里，我稍微改变了这个重点，开始为每期通讯提供一个赞助名额。<p>从那时起，每周的通讯都被抢购一空，价格也从最初的150美元上升到250美元，每月从赞助中赚取2000美元。<p>我认为有必要指出，这并不是一个即时的现金牛...在没有收到一分钱的情况下发送117期通讯是很消耗精力的。<p>但是，我认为这表明了一致性的规则，只要你继续出现，推出伟大的内容，并根据反馈进行迭代，你将继续看到你的通讯增长，最终钱会来。<p>很高兴回答任何有关通讯增长、寻找赞助商等问题\n",
  "description_zh-Hant": "嗨，HN！<p>大約兩年前，當人們紛紛轉向WFH環境時，我開始了每週兩次的通訊，名為Workspaces，為讀者提供他們最喜歡的企業家、設計師、開發人員等新辦公桌設置的幕後參觀。 <p>每週的增長保持穩定，依靠特邀嘉賓的Twitter存在來幫助傳播。<p>迄今為止，我已經介紹了175個工作空間（還有70多個在積壓中），並將通訊的訂閱者增加到7000人，同時保持50%的打開率。我有入站請求，但我專注於盡可能地擴大訂閱者的數量。在新的一年裡，我稍微改變了這個重點，開始為每期通訊提供一個贊助名額。<p>從那時起，每週的通訊都被搶購一空，價格也從最初的150美元上升到250美元，每月從贊助中賺取2000美元。<p>我認為有必要指出，這並不是一個即時的現金牛...在沒有收到一分錢的情況下發送117期通訊是很消耗精力的。<p>但是，我認為這表明了一致性的規則，只要你繼續出現，推出偉大的內容，並根據反饋進行迭代，你將繼續看到你的通訊增長，最終錢會來。<p>很高興回答任何有關通訊增長、尋找贊助商等問題\n"
}