{
  "@type": "NewsArticle",
  "identifier": "2022--07--22--en--besthn--HackerNews--NewsArticle--32194373",
  "url": "https://news.ycombinator.com/item?id=32194373",
  "headline": "Ask HN: PayPal dismissed my claim, saying I didn't provide evidence (yet I did)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi.<p>I apologize in advance, but it looks like it's my turn for social media big tech support.<p>I had a situation where OVH abused a PayPal authorization to charge me 1200€ for a &quot;private cloud&quot; credit I never asked. OVH refuses to refund me changing the reason for it every time, but well, that's another topic.<p>I filed a PayPal dispute, I added exchanges with OVH as evidence, where they constantly insist on me having this &quot;credit&quot; still available for me to use, and my insisting on not wanting it for any purpose (the 12€ I added were enough for my test) and not having ordered it.<p>Finally, PayPal ruled in favor of OVH claiming that I &quot;never provided documentation to prove this credit&quot;.<p>Not only I did (OVH messages), but nobody asked me for evidence at any point: I could have provided extra information/screenshots where it is shown. I am positive OVH was requested multiple times for documentation to support their claims, but that was never the case for me, not sure if that's normal.<p>Now I'm stuck with an absurd amount of credit on a cloud service I have no use for (and worse, it expires in a year), and apparently there's no UI option for me to contest this PayPal ruling. Phoning them I found no option to talk to a person.<p>Other than lawyering up and contacting consumer protection organisations, what else is there to do? Anyone at PayPal can give me a hint?<p>Thanks in advance.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "fer",
    "url": "https://news.ycombinator.com/user?id=fer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32194373",
  "sameAs": "https://news.ycombinator.com/item?id=32194373",
  "dateCreated": "2022-07-22T23:59:19.995Z",
  "datePublished": "2022-07-22T17:06:00.000Z",
  "dateModified": "2022-07-22T23:59:19.995Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 200
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 130
    }
  ],
  "headline_zh-Hans": "Ask HN: 贝宝驳回了我的主张，说我没有提供证据（然而我提供了）。\n",
  "headline_zh-Hant": "Ask HN: 貝寶駁回了我的主張，說我沒有提供證據（然而我提供了）。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>我提前道歉，但看起来轮到我的社会媒体大技术支持了。<p>我有一个情况，OVH滥用PayPal的授权，向我收取1200欧元的&quot;私有云&quot;信用，我从来没有问过。<p>我提出了一个PayPal争议，我增加了与OVH的交流作为证据，他们不断坚持我有这个&quot;信用&quot;仍然可以让我使用，而我坚持不想要它用于任何目的（我添加的12欧元足够我的测试），也没有订购它。 <p>最后，PayPal裁定支持OVH，声称我&quot;从未提供文件来证明这个信用&quot;。<p>不仅我提供了（OVH的信息），而且没有人在任何时候要求我提供证据：我可以提供额外的信息/截图，其中显示。我肯定OVH被多次要求提供文件以支持他们的主张，但对我来说从来没有这种情况，不知道这是否正常。<p>现在我被困在一个我没有用的云服务上的荒谬数额的信贷（更糟糕的是，它在一年内到期），显然没有UI选项让我对PayPal的这个裁决提出异议。<p>除了请律师和联系消费者保护组织之外，还有什么可以做的？有谁能在PayPal给我一个提示？<p>提前感谢。\n",
  "description_zh-Hant": "<p>我提前道歉，但看起來輪到我的社會媒體大技術支持了。<p>我有一個情況，OVH濫用PayPal的授權，向我收取1200歐元的&quot;私有云&quot;信用，我從來沒有問過。<p>我提出了一個PayPal爭議，我增加了與OVH的交流作為證據，他們不斷堅持我有這個&quot;信用&quot;仍然可以讓我使用，而我堅持不想要它用於任何目的（我添加的12歐元足夠我的測試），也沒有訂購它。 <p>最後，PayPal裁定支持OVH，聲稱我&quot;從未提供文件來證明這個信用&quot;。<p>不僅我提供了（OVH的信息），而且沒有人在任何時候要求我提供證據：我可以提供額外的信息/截圖，其中顯示。我肯定OVH被多次要求提供文件以支持他們的主張，但對我來說從來沒有這種情況，不知道這是否正常。<p>現在我被困在一個我沒有用的雲服務上的荒謬數額的信貸（更糟糕的是，它在一年內到期），顯然沒有UI選項讓我對PayPal的這個裁決提出異議。<p>除了請律師和聯繫消費者保護組織之外，還有什麼可以做的？有誰能在PayPal給我一個提示？<p>提前感謝。\n"
}