{
  "@type": "NewsArticle",
  "identifier": "2022--07--06--en--besthn--HackerNews--NewsArticle--32003266",
  "url": "https://news.ycombinator.com/item?id=32003266",
  "headline": "Ask HN: Why do I struggle to follow corporate meetings?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, I've just got out of a meeting and like almost every non-technical meeting I have next to no idea what the discussion was about.<p>I find a lot of non-technical meetings go something like this:<p>&quot;Hi guys, as you might be aware [Robert Smith] of the [communications department] has recently released his [quarterly review] of our ongoing [transformation strategy]. We've received a lot of positive feedback so far, but I wanted to give you all an opportunity to share your thoughts in this meeting. Would anyone like to go first?&quot;<p>Then about half of the team (normally the same people) will jump into the discussion and somehow seem to know what the hell is going on.<p>Meanwhile I'm there wondering who is this [Robert Smith] of the [communications department]? What is the [transformation strategy] and why does it need a [quarterly review]?<p>Occasionally someone will ask what the [transformation strategy] is, but typically it won't be answered in a way that helps me understand what's going on because even more names and departments will be dropped and the strategy itself will be described in such a vague way that it means nothing.<p>I guess a concrete example that comes to mind was from a place I worked previously where they would talk about their &quot;omnichannel&quot; strategy a lot. Whenever someone asked what &quot;omnichannel&quot; meant it was described in a way that seemed to mean nothing, &quot;a multichannel sales strategy&quot;, etc. About 6 months into the job I finally figured out we were just using it to refer to some extra functionality that we were working on that would allow customers to collect and return online orders from our regional stores. But this was never how it was referred to in corporate meetings.<p>Am I the only one who experiences this? I can't work out if there's a part of my brain that's missing that prevents me from understanding what's being discussed in these meetings or if this is a common experience. I'm very practically minded which probably doesn't help, but I worry I'm not making enough of an effort to understand what's happening in the business outside my personal bubble.<p>Does anyone struggle with this, or do you have any recommendations for people like me who do struggle to understand what's happening in corporate meetings?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kypro",
    "url": "https://news.ycombinator.com/user?id=kypro"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32003266",
  "sameAs": "https://news.ycombinator.com/item?id=32003266",
  "dateCreated": "2022-07-06T22:26:52.177Z",
  "datePublished": "2022-07-06T16:27:18.000Z",
  "dateModified": "2022-07-06T22:26:52.177Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 202
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 207
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么我对公司的会议感到费劲呢？\n",
  "headline_zh-Hant": "Ask HN: 為什麼我對公司的會議感到費勁呢？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，我刚刚从一个会议中出来，像几乎所有的非技术性会议一样，我几乎不知道讨论的内容。<p>我发现很多非技术性会议是这样的：<p>&quot;各位，你们可能知道[通信部门]的[Robert Smith]最近发布了他对我们正在进行的[转型战略]的[季度回顾]。到目前为止，我们已经收到了很多积极的反馈，但我想给大家一个机会，在这次会议上分享你们的想法。有谁想先说吗？&quot;<p>然后大约一半的团队（通常是同一批人）会跳到讨论中，并以某种方式似乎知道到底发生了什么。<p>同时我在那里想，这个[通信部门]的[罗伯特-史密斯]是谁？什么是[转型战略]，为什么需要进行[季度审查]？<p>偶尔有人会问什么是[转型战略]，但通常不会以帮助我理解发生了什么的方式来回答，因为更多的名字和部门会被放弃，而战略本身会被描述得如此模糊，毫无意义。<p>我想我想到的一个具体例子是来自我以前工作的地方，他们会经常谈论其&quot;全渠道&quot;战略。每当有人问及&quot;全渠道&quot;是什么意思时，他们的描述似乎毫无意义，&quot;多渠道销售策略&quot;，等等。工作6个月后，我终于明白，我们只是用它来指代我们正在开发的一些额外功能，这些功能将允许客户从我们的区域商店领取和退回在线订单。但在公司会议上，从来没有人这样说过。<p>我是唯一一个有这种经历的人吗？我不知道我的大脑是否有一部分缺失，使我无法理解这些会议上所讨论的内容，或者这是否是一种普遍的经历。我是一个非常务实的人，这可能没有帮助，但我担心我没有做出足够的努力去了解我个人的泡沫之外的企业所发生的事情。<p>是否有人为此而挣扎，或者你对像我这样的人有什么建议，他们确实在努力了解企业会议上发生的事情？\n",
  "description_zh-Hant": "嗨，HN，我剛剛從一個會議中出來，像幾乎所有的非技術性會議一樣，我幾乎不知道討論的內容。<p>我發現很多非技術性會議是這樣的：<p>&quot;各位，你們可能知道[通信部門]的[Robert Smith]最近發佈了他對我們正在進行的[轉型戰略]的[季度回顧]。到目前為止，我們已經收到了很多積極的反饋，但我想給大家一個機會，在這次會議上分享你們的想法。有誰想先說嗎？&quot;<p>然後大約一半的團隊（通常是同一批人）會跳到討論中，並以某種方式似乎知道到底發生了什麼。<p>同時我在那裡想，這個[通信部門]的[羅伯特-史密斯]是誰？什麼是[轉型戰略]，為什麼需要進行[季度審查]？<p>偶爾有人會問什麼是[轉型戰略]，但通常不會以幫助我理解發生了什麼的方式來回答，因為更多的名字和部門會被放棄，而戰略本身會被描述得如此模糊，毫無意義。<p>我想我想到的一個具體例子是來自我以前工作的地方，他們會經常談論其&quot;全渠道&quot;戰略。每當有人問及&quot;全渠道&quot;是什麼意思時，他們的描述似乎毫無意義，&quot;多渠道銷售策略&quot;，等等。工作6個月後，我終於明白，我們只是用它來指代我們正在開發的一些額外功能，這些功能將允許客戶從我們的區域商店領取和退回在線訂單。但在公司會議上，從來沒有人這樣說過。<p>我是唯一一個有這種經歷的人嗎？我不知道我的大腦是否有一部分缺失，使我無法理解這些會議上所討論的內容，或者這是否是一種普遍的經歷。我是一個非常務實的人，這可能沒有幫助，但我擔心我沒有做出足夠的努力去了解我個人的泡沫之外的企業所發生的事情。<p>是否有人為此而掙扎，或者你對像我這樣的人有什麼建議，他們確實在努力瞭解企業會議上發生的事情？\n"
}