{
  "@type": "NewsArticle",
  "identifier": "2022--08--25--en--askhn--HackerNews--NewsArticle--32594457",
  "url": "https://news.ycombinator.com/item?id=32594457",
  "headline": "I can’t be the first programmer with chronic neck and head tension",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Throwaway, for obvious reasons.<p>I’m a late 30’s year old male developer and I haven’t been able to sit in a chair for more than an hour over the past 2.5 years. Average height, less body fat than “normal”.<p>I can’t be the first programmer with chronic head, neck, and back tension. Does anyone know a doctor that specializes in treating office workers?<p>My docs hit a diagnostic wall and tapped out. At my last appointment my primary said: “If this is going to be fixed you’re going to need to figure out how to fix it yourself.” I’ve been trying to fix it myself for two and half years. If I could have I would have and I don’t know what I should do next.<p>My back, left pec, and neck are tense, stubbornly tense, so tense that two different doctors have suspected a spasticity disorder.  One, an osteopath in NYC, sent me in for a neurology screening, clear. The second, a sports doc in IL, was so concerned that he ordered a brain MRI, also clear.<p>This is the best way I can describe the symptoms: Imagine that you have a charlie horse in your leg. Now imagine that charlie horse never goes away. You’re reading, charlie horse. You’re working, charlie horse. You’re trying to sleep, charlie horse. Now imagine that the charlie horse isn’t in your leg, it’s centered somewhere between the base of your skull and your shoulders and the tension radiates up your neck to the top of your head. I’m in a constant state of red alert because if it. The top of my head hurts, my left eye hurts, my teeth feel like they’re being pulled together or apart. After a few days of tension it’ll start affecting my breathing.<p>None of the exercises or medications I’ve tried have been able to alleviate the tension (anxiety + muscle relaxant meds). It feels like it’s getting worse by the day.<p>Anyone been through this? Anyone know a doc?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "owcommamyspine",
    "url": "https://news.ycombinator.com/user?id=owcommamyspine"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32594457",
  "sameAs": "https://news.ycombinator.com/item?id=32594457",
  "dateCreated": "2022-08-25T15:28:48.898Z",
  "datePublished": "2022-08-25T14:54:17.000Z",
  "dateModified": "2022-08-25T15:28:48.898Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}