{
  "@type": "NewsArticle",
  "identifier": "2022--08--25--en--askhn--HackerNews--NewsArticle--32598679",
  "url": "https://news.ycombinator.com/item?id=32598679",
  "headline": "How to Become a Contract Programmer?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I recently left my job, and while I will likely find a full time thing in the next few months I've decided to be a bit more picky about where I work this time around. (The last place wasn't terrible, but I found after about a year and a half that I was just very very bored). In the mean time I've been thinking of supporting myself by doing some contract programming, however, I've just never done this before so I'm completely out of my depth. What I'm looking for is:<p>a) Any good guides or books that I can read on the subject?<p>b) Are there standard contract templates that people generally tend to use? I imagine I could afford an attorney for this, but I don't really have one on hand and being unemployed at the moment I'd tend towards saving money where I can.<p>c) Any advice on places to find contract work? I have some professional contacts that might have some things for me, which I would prefer, but I don't want to limit myself to just my own network.<p>d) Any advice on red flags and things to avoid?<p>e) How do people generally structure payment? I'm guessing hourly, but I imagine also there might be safe-guards in place for both the client and myself if the project ends up being much larger in scope than estimated? (I've admittedly not been great at estimating projects in the past)<p>f) Just any general advice on this really<p>FWIW if it's relevant, I have a very broad skillset. I'm 37 and have about 15 years of industry experience. My previous job I was a Principle Software Architect, and my work was very heavy on K8s and containerizing a legacy Java application, while also developing microservices in typescript and nodejs. I'm a full stack developer, so I can do both frontend (react mostly), server, database (most familiar with postgres, mongodb and redis). I also have previous experience in game development, so I'm familiar with Unity, C++, C#, and writing OpenGL shaders and OpenGL code (I've recently been learning vulkan).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cranjusmcb",
    "url": "https://news.ycombinator.com/user?id=cranjusmcb"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32598679",
  "sameAs": "https://news.ycombinator.com/item?id=32598679",
  "dateCreated": "2022-08-25T19:41:45.097Z",
  "datePublished": "2022-08-25T19:22:13.000Z",
  "dateModified": "2022-08-25T19:41:45.097Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}