{
  "@type": "NewsArticle",
  "identifier": "2022--03--09--en--myfeed--HackerNews--NewsArticle--30610656",
  "url": "https://news.ycombinator.com/item?id=30610656",
  "headline": "A Manifesto for Tech Interviewees",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We've all heard the tech industry's lament that there are not enough software engineers to meet demand but you wouldn't know it judging by some of the brain-dead hiring processes I come across routinely after 20 years as a software engineer. Typically experience in solving business problems with code gets lost in a fog of buzzword devops criteria in the initial stage interview before the candidate has had a chance to display any proficiency as a software developer. It's not that Agile isn't important but prioritising it above the ability to solve business problems is just plain wrong. So I have resolved to present all future interviewers with my own set of criteria before a minute of my time is wasted and I hope this may be of use to some of you who find yourself in a similar situation.<p>Hi &lt;interviewer name&gt;<p>I understand that I am applying for a Ruby developer role and I am happy to be interviewed based on my ability to solve business problems with Ruby. If your selection process prioritises other criteria, however, such as proficiency with:<p><pre><code>    - Agile methodology \n    - Continuous Integration/Delivery\n    - Containerisation (Docker, Kubernetes)  \n    - Deployment (AWS, Azure, GCP)\n    - Message queues\n    - Caching strategies\n</code></pre>\n... then I will not be applying for the role as I consider these to be skills which a developer should be given the chance to acquire on the job.<p>I am happy to participate in a single-stage code interview according to the following criteria:<p><pre><code>    - It shall not exceed 2 hours.\n    - No-one will be looking over my shoulder.\n    - The subject matter of the code test be representative of your business domain.\n    - No abstract algorithm quizzes.\n</code></pre>\nIf &quot;cultural fit&quot; is more important to you than my ability to solve business problems with code then let's not waste each other's time as I have found this to be a convenient smokescreen for ageism and other forms of discrimination. Otherwise, if your interview process can be conducted within these guidelines I think you will find that I have a lot of experience which could add value to your business.<p>Regards<p>&lt;name&gt;",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "cutler",
    "url": "https://news.ycombinator.com/user?id=cutler"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30610656",
  "sameAs": "https://news.ycombinator.com/item?id=30610656",
  "dateCreated": "2022-03-09T03:49:55.660Z",
  "datePublished": "2022-03-09T03:41:14.000Z",
  "dateModified": "2022-03-09T03:49:55.660Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}