{
  "@type": "NewsArticle",
  "identifier": "2022--05--01--en--myfeed--HackerNews--NewsArticle--31222521",
  "url": "https://news.ycombinator.com/item?id=31222521",
  "headline": "Tell HN: Ukraine war is just a proxy war between US and Russia",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "full disclosure: based on my previous comments, people think I am a troll or Putin propaganda, I don't care! Truth should be told anyway. I am a European and directly feeling the impact.<p>It is becoming obvious that war in Ukraine is a proxy war between US/west and Russia.<p>Who is suffering:<p>* Ukrainian people! millions of civilians! Some of whom might never see their homes again.<p>* Europeans (except politicians). I am feeling substantial price hikes, as an engineer with slightly above the market pay I can cope with it, imagine how it impacts others<p>* Other developing countries. Don't have a direct network in Africa, but pretty sure food security in some of African and Middle Eastern poor countries will be severely impacted. We are not talking about price increase, we are talking about people are starving and dying because no food!<p>* Russian civilians, in the form of sanctions. I don't think ordinary people deserve it.<p>* US civilians. Money which is sent to support war could be used to support people in the US, we all remember 2T$ spent by US government in Afghanistan which could go to citizen. US has awful medical support comparing to EU countries.<p>Who is benefiting:<p>* US government. by leasing weapons to make Ukraine more dependent in the long term. By creating Disinformation Governance Board which is basically censoring people with the excuse of fighting &quot;Russian propaganda&quot;<p>* Gun makers. Germany increased military spending to 100B$, others could also follow soon, take in mind NATO countries should have similar equipment, they can buy so much weapon mostly from US.<p>Who else?<p>Say whatever you want, but this war is provoked war and everyone is impacted negatively, except US government",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "tuyguntn",
    "url": "https://news.ycombinator.com/user?id=tuyguntn"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31222521",
  "sameAs": "https://news.ycombinator.com/item?id=31222521",
  "dateCreated": "2022-05-01T07:50:00.684Z",
  "datePublished": "2022-05-01T05:44:56.000Z",
  "dateModified": "2022-05-01T07:50:00.684Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}