{
  "@type": "NewsArticle",
  "identifier": "2022--03--10--en--showhn--HackerNews--NewsArticle--30625699",
  "url": "https://news.ycombinator.com/item?id=30625699",
  "headline": "Open-source project for service development directly in Kubernetes",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN. I recently started a project to make development with Kubernetes more approachable: Gefyra. The idea is that developers run their development workloads in a dedicated Kubernetes cluster (potentially local, or anywhere). Gefyra rolls out a development infrastructure locally by managing a local Docker setup connected to the cluster. That gives all the convenient tools (such as debugger, code hot reloading, aso.) into the hands of the developer while using advanced Kubernetes patterns (for example sidecars for OAuth handling).\nI even created a website already. The source is located here: <a href=\"https://github.com/Schille/gefyra\" rel=\"nofollow\">https://github.com/Schille/gefyra</a><p>I am looking for feedback on what development scenarios you would like to see supported in the future. What am I currently missing or what would be the most interesting use-case from your perspective?\nOf course it would be great if you had the motivation to try out Gefyra and let me know where in the setup process or documentation you may have gotten stuck or missed something in the documentation.<p>I hope that Kubernetes as a development platform would finally change the mindsets to create less monolithic applications and support the way of service-oriented thinking.<p>What do you think?",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "schille",
    "url": "https://news.ycombinator.com/user?id=schille"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30625699",
  "sameAs": "https://gefyra.dev/",
  "dateCreated": "2022-03-10T17:15:07.899Z",
  "datePublished": "2022-03-10T11:22:14.000Z",
  "dateModified": "2022-03-10T17:15:07.899Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}