{
  "@type": "NewsArticle",
  "identifier": "2022--02--27--en--myfeed--HackerNews--NewsArticle--30491798",
  "url": "https://news.ycombinator.com/item?id=30491798",
  "headline": "Show HN: Rebluff Poker, no limit hold'em for loose-aggressive players",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello, I'm uberf1sh, software engineer (I've previously worked for Amazon and Fortnite, though obviously none of the following as to do with my previous employers).<p>My cousin introduced me to online poker in 2008 and I loved it instantly, playing $2 cash games for fun and glory. Though I was initially pretty bad, I had a lot of fun playing. Indeed, in 2008 the game was really amazing because it was so chaotic and full of crazy plays, your blood was pumping before even sitting at the table. Fast forward I was able to make $1000 a day in Vegas, spending it all on sneakers, restaurants and some other unspeakable stuff (you know the drill, what happens in Vegas stays in Vegas).<p>5 years ago, things started to take a real bad turn for online poker. The game slowly but surely became incredibly boring. Most regular players started to all adopt a strategy called <i>tight-passive</i>. <i>Tight</i> means you play only the best starting hands and <i>passive</i> means you don't bet or raise from your own initiative, you let your opponent bet and raise on your behalf. The <i>tight</i> part isn't much of an issue for the fun because there is counter strategies (e.g. setting mines) that keeps thing sensational. However the <i>passive</i> component of that strategy is absolutely dreadful for the fun of the game.<p>Passive poker is simply an anti-game strategy. When it comes to games and sports in general, an anti-game strategy works as follows: you are not reaching for a win, but instead, you want to make the game so boring and frustrating, your opponents become crazy. Passive poker is definitely beatable, but while a passive player don't win much, he doesn't loose much as well. The player keeps its score close to zero and wait patiently that his opponents get crazy enough to make a mistake (while looting beginners).<p>In short, it kills the game entirely. Nowdays, online cash games (especially at lower stakes) are ridiculously passive. The biggest bluff you can expect to see on some tables will be for 3BB top (big blinds). You will never ever see a 3-barrel bluff with air anymore from a regular (unless you're playing <i>nose-bleed</i> stakes). You can't set mines either because they wont bet big enough to make it worth it and they will stop betting mostly after the flop. You can often see players literally not betting a dime on the flop, turn and river, even with monster hands. It hurts to see a player check on the river when he speaks last, only to discover they have the nuts - he wants to hurt you that's the point.<p>It's time for passive poker to go. So I've built Rebluff Poker. Rebluff Poker is the first gaming platform dedicated to loose-aggressive no limit hold'em. The game is in every bit the same, except, each and every player has to bet or raise to some extent on average, or gets to pay a significant penalty in the form of antes (up to 5BB per hand for a multi passive recidivist). For a decently aggressive player, it makes no difference.<p>The game is also much more fun for beginners. Playing loose-aggressive against beginners lead to a higher variance which means the beginners still win occasionally.<p>The game is not for real money yet. The plan is to raise money to get a gaming license from Kahnawake Gaming Commission (http://www.gamingcommission.ca/). If you know someone with the money and a knack for administrative stuff, please email me.<p>Well now, time to grab a drink all. Dealers, let's shuffle and deal.<p>https://rebluff.poker<p>https://discord.gg/TQxqxEpxbS<p>uberf1sh)at(rebluff.poker",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "uberf1sh",
    "url": "https://news.ycombinator.com/user?id=uberf1sh"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30491798",
  "sameAs": "https://news.ycombinator.com/item?id=30491798",
  "dateCreated": "2022-02-27T19:50:12.347Z",
  "datePublished": "2022-02-27T19:44:57.000Z",
  "dateModified": "2022-02-27T19:50:12.347Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Rebluff扑克，为宽松激进的玩家提供无限制的扑克。",
  "headline_zh-Hant": "Show HN: Rebluff撲克，為寬鬆激進的玩家提供無限制的撲克。",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，我是uberf1sh，软件工程师（我之前在亚马逊和《堡垒之夜》工作过，但显然以下内容与我之前的雇主无关）。<p>我的表弟在2008年向我介绍了在线扑克，我立刻就喜欢上了它，为了乐趣和荣耀而玩2美元的现金游戏。虽然我最初的表现很差，但我玩得很开心。的确，在2008年，这个游戏真的很神奇，因为它是如此混乱，充满了疯狂的游戏，你甚至在坐在桌子前就已经血脉喷张。Fast forward I was able to make $1000 a day in Vegas, spending it all on sneakers, restaurants and some other unspeakable stuff (you know the drill, what happens in Vegas stays in Vegas).<p>5 years ago, things started to take a real bad turn for online poker. The game slowly but surely became incredibly boring. Most regular players started to all adopt a strategy called <i>tight-passive</i>. <i>Tight</i> means you play only the best starting hands and <i>passive</i> means you don't bet or raise from your own initiative, you let your opponent bet and raise on your behalf. The <i>tight</i> part isn't much of an issue for the fun because there is counter strategies (e.g. setting mines) that keeps thing sensational. 然而，该策略中的<i>被动</i>部分对于游戏的乐趣来说绝对是可怕的。<p>被动扑克只是一种反游戏策略。当涉及到游戏和一般的运动时，反游戏策略的作用如下：你不是要达到胜利，而是要让游戏变得如此无聊和令人沮丧，你的对手变得疯狂。被动的扑克绝对是可以被打败的，但是虽然被动的玩家赢得不多，他也不会失去很多。玩家保持其分数接近零，并耐心等待他的对手疯狂到犯错（同时掠夺初学者）。<p>总之，它完全扼杀了游戏。现在，在线现金游戏（尤其是低赌注的）被动得令人发指。The biggest bluff you can expect to see on some tables will be for 3BB top (big blinds). You will never ever see a 3-barrel bluff with air anymore from a regular (unless you're playing <i>nose-bleed</i> stakes). 你也不能设置地雷，因为他们不会下足够大的赌注，而且他们在翻牌后大多会停止下注。你经常可以看到玩家在翻牌、转牌和河牌时真的不下注，即使是怪物手。看到玩家在河牌时过牌，当他最后发言时，才发现他们有坚果--他想伤害你，这才是重点。<p>现在是被动扑克的时候了。所以我建立了Rebluff Poker。Rebluff Poker是第一个致力于宽松攻击性无限制扑克的游戏平台。这个游戏在每一点上都是一样的，除了，每一个玩家都必须平均下注或加注到一定程度，否则就要以赌注的形式支付大量的罚款（对于一个多头被动的惯犯来说，每手高达5BB）。对于一个有攻击性的玩家来说，这没有什么区别。<p>这个游戏对初学者来说也更有趣。与初学者玩松散的攻击性游戏会导致更高的变数，这意味着初学者偶尔也会赢。<p>该游戏还不是真钱游戏。该计划是为了筹集资金以获得卡纳瓦克博彩委员会（http://www.gamingcommission.ca/）的博彩许可证。如果你认识的人有钱，而且擅长行政管理，请给我发邮件。<p>好了，现在是时候让大家喝上一杯了。经销商，让我们洗牌和发牌。<p>https://rebluff.poker<p>https://discord.gg/TQxqxEpxbS<p>uberf1sh)at(rebluff.poker)",
  "description_zh-Hant": "你好，我是uberf1sh，軟件工程師（我之前在亞馬遜和《堡壘之夜》工作過，但顯然以下內容與我之前的僱主無關）。<p>我的表弟在2008年向我介紹了在線撲克，我立刻就喜歡上了它，為了樂趣和榮耀而玩2美元的現金遊戲。雖然我最初的表現很差，但我玩得很開心。的確，在2008年，這個遊戲真的很神奇，因為它是如此混亂，充滿了瘋狂的遊戲，你甚至在坐在桌子前就已經血脈噴張。Fast forward I was able to make $1000 a day in Vegas, spending it all on sneakers, restaurants and some other unspeakable stuff (you know the drill, what happens in Vegas stays in Vegas).<p>5 years ago, things started to take a real bad turn for online poker. The game slowly but surely became incredibly boring. Most regular players started to all adopt a strategy called <i>tight-passive</i>. <i>Tight</i> means you play only the best starting hands and <i>passive</i> means you don't bet or raise from your own initiative, you let your opponent bet and raise on your behalf. The <i>tight</i> part isn't much of an issue for the fun because there is counter strategies (e.g. setting mines) that keeps thing sensational. 然而，該策略中的<i>被動</i>部分對於遊戲的樂趣來說絕對是可怕的。<p>被動撲克只是一種反遊戲策略。當涉及到遊戲和一般的運動時，反遊戲策略的作用如下：你不是要達到勝利，而是要讓遊戲變得如此無聊和令人沮喪，你的對手變得瘋狂。被動的撲克絕對是可以被打敗的，但是雖然被動的玩家贏得不多，他也不會失去很多。玩家保持其分數接近零，並耐心等待他的對手瘋狂到犯錯（同時掠奪初學者）。<p>總之，它完全扼殺了遊戲。現在，在線現金遊戲（尤其是低賭注的）被動得令人髮指。The biggest bluff you can expect to see on some tables will be for 3BB top (big blinds). You will never ever see a 3-barrel bluff with air anymore from a regular (unless you're playing <i>nose-bleed</i> stakes). 你也不能設置地雷，因為他們不會下足夠大的賭注，而且他們在翻牌後大多會停止下注。你經常可以看到玩家在翻牌、轉牌和河牌時真的不下注，即使是怪物手。看到玩家在河牌時過牌，當他最後發言時，才發現他們有堅果--他想傷害你，這才是重點。<p>現在是被動撲克的時候了。所以我建立了Rebluff Poker。Rebluff Poker是第一個致力於寬鬆攻擊性無限制撲克的遊戲平臺。這個遊戲在每一點上都是一樣的，除了，每一個玩家都必須平均下注或加註到一定程度，否則就要以賭注的形式支付大量的罰款（對於一個多頭被動的慣犯來說，每手高達5BB）。對於一個有攻擊性的玩家來說，這沒有什麼區別。<p>這個遊戲對初學者來說也更有趣。與初學者玩鬆散的攻擊性遊戲會導致更高的變數，這意味著初學者偶爾也會贏。<p>該遊戲還不是真錢遊戲。該計劃是為了籌集資金以獲得卡納瓦克博彩委員會（http://www.gamingcommission.ca/）的博彩許可證。如果你認識的人有錢，而且擅長行政管理，請給我發郵件。<p>好了，現在是時候讓大家喝上一杯了。經銷商，讓我們洗牌和發牌。<p>https://rebluff.poker<p>https://discord.gg/TQxqxEpxbS<p>uberf1sh)at(rebluff.poker)"
}