{
  "@type": "NewsArticle",
  "identifier": "2022--03--01--en--myfeed--HackerNews--NewsArticle--30515922",
  "url": "https://news.ycombinator.com/item?id=30515922",
  "headline": "Namecheap extends termination for customers from Russia",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Namecheap also makes exception for &quot;anti-regime media, protest resources&quot;. Full text:<p>Dear XXXXX,<p>We would like to make a correction to our policy of terminating services to customers in Russia — announced yesterday.<p>Firstly, we will make exceptions for all anti-regime media, protest resources, and any type of websites that are helping to end this war and regime — we will continue to welcome you using our services. Please accept our apologies for any disruption this caused, and we thank you for helping to fight against this tyranny.<p>The above also applies if you are no longer a resident of Russia and do not support the regime in any way.<p>Extending original termination date<p>For those who will still be affected by our decision to terminate Namecheap services to Russia, we are extending the termination date to three weeks from today. Please make sure you have moved your services to another provider by March 22, 2022.<p>If there are legitimate reasons that you may need more time, we will make exceptions if they are deemed reasonable.<p>Thank you for your understanding<p>We are thankful to everyone who supports Ukraine and the Ukrainian people. Civilians are being killed at this very moment by Russian forces, paid for directly or indirectly by the taxes of Russian citizens. We hope every person in Russia can understand this and recognize the horrible atrocities that are happening right now being committed by the Russian regime.<p>Please contact us if you need any further assistance.<p>Customer Support,\nNamecheap",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Ronsenshi",
    "url": "https://news.ycombinator.com/user?id=Ronsenshi"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30515922",
  "sameAs": "https://news.ycombinator.com/item?id=30515922",
  "dateCreated": "2022-03-01T16:16:30.937Z",
  "datePublished": "2022-03-01T16:11:25.000Z",
  "dateModified": "2022-03-01T16:16:30.937Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Namecheap延长了对俄罗斯客户的解约期",
  "headline_zh-Hant": "Namecheap延長了對俄羅斯客戶的解約期",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Namecheap还对&quot;反政府媒体、抗议资源&quot;做了例外处理。全文：<p>亲爱的XXXX，<p>我们想对我们昨天宣布的终止对俄罗斯客户的服务的政策进行更正。<p>首先，我们将对所有反政权的媒体、抗议资源和任何类型的帮助结束这场战争和政权的网站进行例外 - 我们将继续欢迎你使用我们的服务。<p>如果你不再是俄罗斯的居民，并且不以任何方式支持该政权，上述规定也适用。<p>延长原终止日期<p>对于那些仍将受到我们终止对俄罗斯的Namecheap服务决定影响的人，我们将把终止日期延长到从今天起的三周。请确保你在2022年3月22日之前将你的服务转移到另一个供应商。<p>如果有合法的理由，你可能需要更多的时间，如果他们被认为是合理的，我们将作出例外。<p>感谢您的理解<p>我们感谢每一个支持乌克兰和乌克兰人民的人。此刻，平民正在被俄罗斯军队杀害，他们直接或间接地由俄罗斯公民的税收来支付。我们希望俄罗斯的每一个人都能理解这一点，并认识到俄罗斯政权现在正在实施的可怕暴行。<p>如果你需要任何进一步的帮助，请与我们联系。<p>客户支持。\n淘宝网",
  "description_zh-Hant": "Namecheap還對&quot;反政府媒體、抗議資源&quot;做了例外處理。全文：<p>親愛的XXXX，<p>我們想對我們昨天宣佈的終止對俄羅斯客戶的服務的政策進行更正。<p>首先，我們將對所有反政權的媒體、抗議資源和任何類型的幫助結束這場戰爭和政權的網站進行例外 - 我們將繼續歡迎你使用我們的服務。<p>如果你不再是俄羅斯的居民，並且不以任何方式支持該政權，上述規定也適用。<p>延長原終止日期<p>對於那些仍將受到我們終止對俄羅斯的Namecheap服務決定影響的人，我們將把終止日期延長到從今天起的三週。請確保你在2022年3月22日之前將你的服務轉移到另一個供應商。<p>如果有合法的理由，你可能需要更多的時間，如果他們被認為是合理的，我們將作出例外。<p>感謝您的理解<p>我們感謝每一個支持烏克蘭和烏克蘭人民的人。此刻，平民正在被俄羅斯軍隊殺害，他們直接或間接地由俄羅斯公民的稅收來支付。我們希望俄羅斯的每一個人都能理解這一點，並認識到俄羅斯政權現在正在實施的可怕暴行。<p>如果你需要任何進一步的幫助，請與我們聯繫。<p>客戶支持。\n淘寶網"
}