{
  "@type": "NewsArticle",
  "identifier": "2022--04--04--en--myfeed--HackerNews--NewsArticle--30903830",
  "url": "https://news.ycombinator.com/item?id=30903830",
  "headline": "Why can't we kill Transcription? It wastes 30% of our working time",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "One day I was having a call with my client, and typing at the same time to note down the key points.\nBut my client, got frustrated with my typing noise and said, &quot;Can you please stop typing?&quot; I was so embarrassed that I can't even put it into words.\nSo, after the meeting, I went to Google and typed, &quot;Take meeting notes automatically&quot;. It suggested to me a few AI tools or you can say transcription tools. Well for people who don't know, transcription tools convert our meeting audio into text.\nI started using the best transcription tool in the market. But then I discovered something hilarious that blew my mind completely. We speak 5000+ words in just 30 minutes meeting, I spent another 25 minutes reading and making short notes out of that transcript.\nAfter a few meetings and wasting my time, I got more frustrated, called my co-founder and asked, &quot;Why can't we kill Transcription? It's wasting my 30% of working time.&quot; He said we could kill it if we could build an algo that calculates importance for every sentence we speak and put only those sentences as short notes which have a higher threshold.\nThat's it. It's been a few months, we developed our AI algo to kill Transcription once and for all. Now today 2000+ people stopped wasting time on transcription and use our meeting summarization tool. We call it, Instaminutes. It's our baby.<p>Have you been in the same situation with your meetings? Please share your story in the comment.<p>Please upvote it, if you think, we did something good for our startup community.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "akanand",
    "url": "https://news.ycombinator.com/user?id=akanand"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30903830",
  "sameAs": "https://news.ycombinator.com/item?id=30903830",
  "dateCreated": "2022-04-04T10:11:35.613Z",
  "datePublished": "2022-04-04T06:32:19.000Z",
  "dateModified": "2022-04-04T10:11:35.613Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "为什么我们不能扼杀转录？它浪费了我们30%的工作时间",
  "headline_zh-Hant": "為什麼我們不能扼殺轉錄？它浪費了我們30%的工作時間",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "有一天，我正在和我的客户进行通话，同时打字，记下关键点。\n但我的客户对我的打字噪音感到沮丧，说：&quot;你能不能别打字了？&quot; 我很尴尬，甚至无法用语言表达。\n所以，会议结束后，我去了谷歌，输入了&quot;自动做会议记录&quot;。它向我推荐了一些人工智能工具，或者你可以说是转录工具。对于不知道的人来说，转录工具将我们的会议音频转换成文本。\n我开始使用市场上最好的转录工具。但后来我发现了一些搞笑的事情，完全让我大跌眼镜。我们在短短30分钟的会议中讲了5000多个字，我又花了25分钟阅读并做了简短的记录。\n在开了几次会，浪费了我的时间之后，我更加沮丧了，打电话给我的联合创始人，问道：\"为什么我们不能取消转录？他说，如果我们能建立一个算法，计算我们所说的每一句话的重要性，并只把那些有较高门槛的句子作为简短的笔记，我们就能杀死它。\n就这样了。几个月过去了，我们开发了人工智能算法，一劳永逸地消灭了转录。现在，超过2000人不再在转录上浪费时间，而是使用我们的会议总结工具。我们称它为Instaminutes。它是我们的宝贝。<p>你在会议中也遇到过同样的情况吗？请在评论中分享你的故事。<p>如果你认为我们为我们的创业社区做了一件好事，请给它投票。",
  "description_zh-Hant": "有一天，我正在和我的客戶進行通話，同時打字，記下關鍵點。\n但我的客戶對我的打字噪音感到沮喪，說：&quot;你能不能別打字了？&quot; 我很尷尬，甚至無法用語言表達。\n所以，會議結束後，我去了谷歌，輸入了&quot;自動做會議記錄&quot;。它向我推薦了一些人工智能工具，或者你可以說是轉錄工具。對於不知道的人來說，轉錄工具將我們的會議音頻轉換成文本。\n我開始使用市場上最好的轉錄工具。但後來我發現了一些搞笑的事情，完全讓我大跌眼鏡。我們在短短30分鐘的會議中講了5000多個字，我又花了25分鐘閱讀並做了簡短的記錄。\n在開了幾次會，浪費了我的時間之後，我更加沮喪了，打電話給我的聯合創始人，問道：\"為什麼我們不能取消轉錄？他說，如果我們能建立一個算法，計算我們所說的每一句話的重要性，並只把那些有較高門檻的句子作為簡短的筆記，我們就能殺死它。\n就這樣了。幾個月過去了，我們開發了人工智能算法，一勞永逸地消滅了轉錄。現在，超過2000人不再在轉錄上浪費時間，而是使用我們的會議總結工具。我們稱它為Instaminutes。它是我們的寶貝。<p>你在會議中也遇到過同樣的情況嗎？請在評論中分享你的故事。<p>如果你認為我們為我們的創業社區做了一件好事，請給它投票。"
}