{
  "@type": "NewsArticle",
  "identifier": "2022--03--03--en--myfeed--HackerNews--NewsArticle--30535213",
  "url": "https://news.ycombinator.com/item?id=30535213",
  "headline": "Phoning from a Trolley Car in 1896",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Making phone calls from trolley cars on the New York and Brooklyn Bridge in 1896.<p>Some interesting experiments have recently been tried by Mr. Kingsley l. Martin, assistant engineer on the New York and Brooklyn Bridge, in the line of establishing telephonic communication between moving trains and between trains and the train dispatcher's and bridge offices.<p>The necessity of some adequate method of train\ncommunication and signaling in cases of fog or some emergency has been felt, but there have been difficulties in the way of establishing telephonic communication with moving trains that have prevented it from being put into practice.<p>Mr. Martin has overcome these difficulties and has succeeded in communicating with moving trains with the same facility as between fixed points.<p>The bridge is provided with a trolley wire for electrically lighting the trains. This wire, which was used in the telephone experiment, was connected with the train dispatcher's office and with the bridge offices, and upon the cars were placed arms provided with compound brushes which touched the trolley wire.<p>The circuit was completed through the car truck and track rail, the connection between the circuit wires and truck being completed by a brush resting on one of the car wheels.<p>The compound brush consisted of a number of brushes of brush copper fastened together with intermediate pieces of soft rubber. The brushes being electrically connected with each other and with the telephone wire, arranged in this way, unbroken conversations could be carried on while the trains moved along.<p>The electrical contact of the compound brush with the trolley wire was so perfect that the sliding of the brush on the wire produced no noticeable effect.<p>It is proposed to permanently equip the cars with telephones and to provide a suitable electric  conductor on the bridge in convenient position for contact with the brushes carried by the cars.<p>Scientific American article and engraving, April 4, 1896",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Txoko",
    "url": "https://news.ycombinator.com/user?id=Txoko"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30535213",
  "sameAs": "https://news.ycombinator.com/item?id=30535213",
  "dateCreated": "2022-03-03T00:35:29.011Z",
  "datePublished": "2022-03-02T23:53:43.000Z",
  "dateModified": "2022-03-03T00:35:29.011Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "1896年在无轨电车上打电话",
  "headline_zh-Hant": "1896年在無軌電車上打電話",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "1896年在纽约和布鲁克林大桥上用无轨电车打电话。<p>最近，纽约和布鲁克林大桥的助理工程师Kingsley l. Martin先生进行了一些有趣的实验，在行驶中的列车之间以及列车与列车调度室和桥梁办公室之间建立电话通讯。\n<p>人们已经感觉到在大雾或某些紧急情况下，有必要采取一些适当的火车通信和信号的方法，但在与行驶中的火车建立电话通信的方式上存在困难，使其无法付诸实施。<p>马丁先生已经克服了这些困难，并成功地与行驶中的火车进行通信，其设施与固定点之间相同。这条用于电话实验的电线与火车调度室和桥梁办公室相连，在车厢上放置了带有复合刷子的手臂，这些刷子与电车电线相接触。<p>电路通过汽车卡车和铁轨完成，电路线和卡车之间的连接由停留在一个汽车车轮上的刷子完成。<p>复合刷子由若干刷铜的刷子组成，用中间的软橡胶片固定在一起。这些刷子相互之间以及与电话线之间都有电连接，以这种方式排列，在列车行驶时可以进行不间断的通话。<p>复合刷与电车线的电接触非常完美，刷子在电线上的滑动不会产生明显的影响。<p>建议在汽车上永久配备电话，并在桥上提供一个合适的电导体，以便与汽车上的刷子接触。",
  "description_zh-Hant": "1896年在紐約和布魯克林大橋上用無軌電車打電話。<p>最近，紐約和布魯克林大橋的助理工程師Kingsley l. Martin先生進行了一些有趣的實驗，在行駛中的列車之間以及列車與列車調度室和橋樑辦公室之間建立電話通訊。\n<p>人們已經感覺到在大霧或某些緊急情況下，有必要採取一些適當的火車通信和信號的方法，但在與行駛中的火車建立電話通信的方式上存在困難，使其無法付諸實施。<p>馬丁先生已經克服了這些困難，併成功地與行駛中的火車進行通信，其設施與固定點之間相同。這條用於電話實驗的電線與火車調度室和橋樑辦公室相連，在車廂上放置了帶有複合刷子的手臂，這些刷子與電車電線相接觸。<p>電路通過汽車卡車和鐵軌完成，電路線和卡車之間的連接由停留在一個汽車車輪上的刷子完成。<p>複合刷子由若干刷銅的刷子組成，用中間的軟橡膠片固定在一起。這些刷子相互之間以及與電話線之間都有電連接，以這種方式排列，在列車行駛時可以進行不間斷的通話。<p>複合刷與電車線的電接觸非常完美，刷子在電線上的滑動不會產生明顯的影響。<p>建議在汽車上永久配備電話，並在橋上提供一個合適的電導體，以便與汽車上的刷子接觸。"
}