{
  "@type": "NewsArticle",
  "identifier": "2022--03--25--en--myfeed--HackerNews--NewsArticle--30807784",
  "url": "https://news.ycombinator.com/item?id=30807784",
  "headline": "Email from Twilio sounds like a compromised credentials email",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Received the below email from Twilio today. I don't remember ever using the 3rd party Twilioid app butand see no integration in my Twilio account. upon reading, they are recommending rotating all API keys, changing Twilio login passwords and even changing email passwords of accounts associated with Twilio and making sure that all attached phone numbers are correct.<p>They even recommend assessing our server security and closing open ports, running malware scans, etc.<p>Does anyone have any additional information on this situation? I would expect something like this after a big breach.  But not a 3rd party app simply shutting down.<p>===========<p>Ahoy!<p>You are receiving this email from Twilio because your account has an integration with Twilioid, a discontinued, third-party Android app not affiliated with Twilio.<p>What do you need to know?<p>Twilioid has discontinued its app and asked users to rotate their auth tokens.<p>What do you need to do?<p>We recommend you stop using Twilioid and take the following steps to protect your Twilio account:<p>Change all passwords associated with your Twilio account. You may also want to update the password for your e-mail provider.\nReset the Auth Token for your parent account and subaccounts.\nDelete existing API-keys and create new API-keys. \nEnable two-factor authentication (2FA) for all account users.\nVerify that any applications or Twilio integrations are running secure, up-to-date versions that are not in debug mode. This includes frameworks (like Wordpress) and administrative tools (like cPanel).\nCheck computers for malware and run anti-virus/anti-malware software.\nVerify user’s email addresses and change them if needed.\nMake sure that the caller ID used to sign up for the account hasn’t changed; this is the same number you enabled 2FA on. Change it if needed.\nSecure your website by closing ports, removing unnecessary files, and using up-to-date integrations.\nReview website permissions to ensure your authentication tokens aren’t stored in plain text and visible to the public.<p>Sincerely,<p>Team Twilio",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jjeaff",
    "url": "https://news.ycombinator.com/user?id=jjeaff"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30807784",
  "sameAs": "https://news.ycombinator.com/item?id=30807784",
  "dateCreated": "2022-03-25T23:10:23.008Z",
  "datePublished": "2022-03-25T22:55:39.000Z",
  "dateModified": "2022-03-25T23:10:23.008Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "来自Twilio的电子邮件听起来像一个被破坏的凭证电子邮件",
  "headline_zh-Hant": "來自Twilio的電子郵件聽起來像一個被破壞的憑證電子郵件",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "今天收到了来自Twilio的以下邮件。我不记得曾经使用过第三方Twilioid应用程序，但在我的Twilio账户中没有看到任何整合。经阅读，他们建议旋转所有API密钥，更改Twilio登录密码，甚至更改与Twilio相关账户的电子邮件密码，并确保所有附加的电话号码是正确的。<p>他们甚至建议评估我们的服务器安全，关闭开放端口，运行恶意软件扫描等。我希望在一个大的漏洞之后会出现这样的情况。 但不是一个第三方应用程序简单地关闭。<p>===========<p>Ahoy！<p>您收到来自Twilio的这封电子邮件，因为您的账户与Twilioid（一个已停产的第三方Android应用程序，与Twilio无关）集成。<p>您需要知道什么？ <p>Twilioid已停止使用其应用程序，并要求用户轮换其授权令牌。<p>您需要做什么？<p>我们建议您停止使用Twilioid，并采取以下步骤来保护您的Twilio帐户：<p>更改与您的Twilio帐户相关的所有密码。你可能还想更新你的电子邮件提供商的密码。\n为你的父账户和子账户重置Auth Token。\n删除现有的API-keys并创建新的API-keys。\n为所有账户用户启用双因素认证（2FA）。\n确认任何应用程序或Twilio集成正在运行安全的、最新的、不处于调试模式的版本。这包括框架（如Wordpress）和管理工具（如cPanel）。\n检查计算机是否有恶意软件，并运行反病毒/反恶意软件。\n核实用户的电子邮件地址，如有需要，可进行更改。\n确保用于注册账户的来电显示没有改变；这是你启用2FA的同一个号码。如果需要的话，请改变它。\n通过关闭端口，删除不必要的文件，并使用最新的集成来保护你的网站。\n审查网站权限，以确保你的认证令牌不会以纯文本形式存储并对公众可见。",
  "description_zh-Hant": "今天收到了來自Twilio的以下郵件。我不記得曾經使用過第三方Twilioid應用程序，但在我的Twilio賬戶中沒有看到任何整合。經閱讀，他們建議旋轉所有API密鑰，更改Twilio登錄密碼，甚至更改與Twilio相關賬戶的電子郵件密碼，並確保所有附加的電話號碼是正確的。<p>他們甚至建議評估我們的服務器安全，關閉開放端口，運行惡意軟件掃描等。我希望在一個大的漏洞之後會出現這樣的情況。 但不是一個第三方應用程序簡單地關閉。<p>===========<p>Ahoy！<p>您收到來自Twilio的這封電子郵件，因為您的賬戶與Twilioid（一個已停產的第三方Android應用程序，與Twilio無關）集成。<p>您需要知道什麼？ <p>Twilioid已停止使用其應用程序，並要求用戶輪換其授權令牌。<p>您需要做什麼？<p>我們建議您停止使用Twilioid，並採取以下步驟來保護您的Twilio帳戶：<p>更改與您的Twilio帳戶相關的所有密碼。你可能還想更新你的電子郵件提供商的密碼。\n為你的父賬戶和子賬戶重置Auth Token。\n刪除現有的API-keys並創建新的API-keys。\n為所有賬戶用戶啟用雙因素認證（2FA）。\n確認任何應用程序或Twilio集成正在運行安全的、最新的、不處於調試模式的版本。這包括框架（如Wordpress）和管理工具（如cPanel）。\n檢查計算機是否有惡意軟件，並運行反病毒/反惡意軟件。\n核實用戶的電子郵件地址，如有需要，可進行更改。\n確保用於註冊賬戶的來電顯示沒有改變；這是你啟用2FA的同一個號碼。如果需要的話，請改變它。\n通過關閉端口，刪除不必要的文件，並使用最新的集成來保護你的網站。\n審查網站權限，以確保你的認證令牌不會以純文本形式存儲並對公眾可見。"
}