{
  "@type": "NewsArticle",
  "identifier": "2022--02--24--en--myfeed--HackerNews--NewsArticle--30460049",
  "url": "https://news.ycombinator.com/item?id=30460049",
  "headline": "Show HN: A Network of Knowledge Feeds",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi Everyone,<p>I wanted to talk to this community about a particular story from my experience to see how the community feels. I have noticed that I have a lot of educated friends from top universities in my country who are having problems finding work due to a lack of experience, which has brought me to a conclusion that diplomas and CVs are not really good at conveying the knowledge someone has.<p>A friend of mine who is already working on his own company told me that he had trouble finding people to work for him, so I thought about an idea that I am currently incorporating into my app. Perhaps we could make it much easier for you to show your knowledge to companies, as easy as show and tell. A network of live knowledge feeds that constantly keep updating over time showing how someone has evolved.<p>If you know something, put it on full display for everyone to see, show something you have made and explain how you made something so that everyone can understand. If you are good at something, you probably won’t have a hard time explaining it to others, and other people could perhaps learn something by simply following your feed.<p>Educational Institutions have curriculums that aren’t really adaptable, but if we rely on people expressing their unique knowledge to the world, we can create countless combinations of curriculums that will be much more adaptable for the problems we have to face today.<p>I will be trying this approach with some friends over the coming days. My friends are looking for graphic designers, software engineers and music producers. They have established brands and are going to ask people who want to work with them to submit something they made and explain how they did it for everyone to see.<p>You are welcome to join us at EWS (<a href=\"https://edify.ws/club/10\" rel=\"nofollow\">https://edify.ws/club/10</a>). If this sounds like a good idea, maybe we can kick off a challenge that you can share with your friends to #ShowWhatYouKnow. If you have a company, are looking for employees, maybe you can ask people to show something they made and explain how they made it to see whether someone has the knowledge required to work for you.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "iedufy",
    "url": "https://news.ycombinator.com/user?id=iedufy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30460049",
  "sameAs": "https://edify.ws/club/10",
  "dateCreated": "2022-02-24T20:50:00.954Z",
  "datePublished": "2022-02-24T20:46:03.000Z",
  "dateModified": "2022-02-24T20:50:00.954Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 一个知识馈送网络",
  "headline_zh-Hant": "Show HN: 一個知識饋送網絡",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>我想和这个社区谈谈我经历的一个特殊故事，看看社区的感受。我注意到，我有很多来自我国顶尖大学的受过教育的朋友，由于缺乏经验而在找工作方面遇到了问题，这让我得出一个结论：文凭和简历其实并不能很好地传达一个人所拥有的知识。<p>我的一个已经在自己的公司工作的朋友告诉我，他在寻找为他工作的人方面遇到了困难，所以我想到了一个想法，目前我正在将其纳入我的应用程序。也许我们可以让你更容易向公司展示你的知识，就像展示和讲述一样简单。<p>如果你知道什么，把它完全展示给大家看，展示你做的东西，解释你是如何做的，让大家都能理解。如果你擅长某件事情，你可能不难向别人解释，其他人也许可以通过简单地关注你的信息学到一些东西。<p>教育机构的课程并不具有真正的适应性，但如果我们依靠人们向世界表达他们独特的知识，我们可以创造无数的课程组合，对我们今天必须面对的问题有更大的适应性。<p>未来几天，我将与一些朋友尝试这种方法。我的朋友正在寻找平面设计师、软件工程师和音乐制作人。他们有成熟的品牌，并准备要求想与他们合作的人提交他们制作的东西，并解释他们是如何做到的，让大家看看。<p>欢迎你在EWS（<a href=\"https://edify.ws/club/10\" rel=\"nofollow\">https://edify.ws/club/10</a>）加入我们。如果这听起来是个好主意，也许我们可以启动一个挑战，你可以与你的朋友分享#ShowWhatYouKnow。如果你有一个公司，正在寻找员工，也许你可以要求人们展示他们制作的东西，并解释他们是如何制作的，看看某人是否有为你工作所需的知识。",
  "description_zh-Hant": "大家好，<p>我想和這個社區談談我經歷的一個特殊故事，看看社區的感受。我注意到，我有很多來自我國頂尖大學的受過教育的朋友，由於缺乏經驗而在找工作方面遇到了問題，這讓我得出一個結論：文憑和簡歷其實並不能很好地傳達一個人所擁有的知識。<p>我的一個已經在自己的公司工作的朋友告訴我，他在尋找為他工作的人方面遇到了困難，所以我想到了一個想法，目前我正在將其納入我的應用程序。也許我們可以讓你更容易向公司展示你的知識，就像展示和講述一樣簡單。<p>如果你知道什麼，把它完全展示給大家看，展示你做的東西，解釋你是如何做的，讓大家都能理解。如果你擅長某件事情，你可能不難向別人解釋，其他人也許可以通過簡單地關注你的信息學到一些東西。<p>教育機構的課程並不具有真正的適應性，但如果我們依靠人們向世界表達他們獨特的知識，我們可以創造無數的課程組合，對我們今天必須面對的問題有更大的適應性。<p>未來幾天，我將與一些朋友嘗試這種方法。我的朋友正在尋找平面設計師、軟件工程師和音樂製作人。他們有成熟的品牌，並準備要求想與他們合作的人提交他們製作的東西，並解釋他們是如何做到的，讓大家看看。<p>歡迎你在EWS（<a href=\"https://edify.ws/club/10\" rel=\"nofollow\">https://edify.ws/club/10</a>）加入我們。如果這聽起來是個好主意，也許我們可以啟動一個挑戰，你可以與你的朋友分享#ShowWhatYouKnow。如果你有一個公司，正在尋找員工，也許你可以要求人們展示他們製作的東西，並解釋他們是如何製作的，看看某人是否有為你工作所需的知識。"
}