{
  "@type": "NewsArticle",
  "identifier": "2022--03--22--en--myfeed--HackerNews--NewsArticle--30760900",
  "url": "https://news.ycombinator.com/item?id=30760900",
  "headline": "Low-code app platform that saved us $50k+ in dev costs",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "For almost a year I've been using this low-code platform to build, test, and launch our app. I can't imagine the time it would have taken us if we had tried to make what we did in house. Not to mention the dev costs we would have had if we outsourced the build.<p>There's a lot of other low-code platforms out there, so here is the pros/cons of using draftbit.com<p>Pros:\n- Once learned, the interface is straightforward and can be navigated quickly\n- The community is growing daily and the majority of easy-to-medium difficulty questions are already answered within it. If you have a more niche, challenging question...\n- Then, you'll find that the community as well as the Draftbit Admin are quick to reply and help\n- Great for if you are looking to create a product that is just past the MVP stage, all the way to a full-blown product\n- Ability to export the React Native code and work on it outside of DB<p>Cons:\n- They are a newer company so you'll find some features they are still working on building out.\n- You have to be cognizant of bugs on their end at times. These are generally fixed quickly but it happens more often than I would like.\n- If you need a more complex feature, you will need to learn how to code in JS or React Native. This is the case for most/all low-code platforms, but still wanted to put this out there",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "cdykema",
    "url": "https://news.ycombinator.com/user?id=cdykema"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30760900",
  "sameAs": "https://news.ycombinator.com/item?id=30760900",
  "dateCreated": "2022-03-22T00:35:51.982Z",
  "datePublished": "2022-03-21T23:06:58.000Z",
  "dateModified": "2022-03-22T00:35:51.982Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "低代码应用程序平台，为我们节省了5万多美元的开发成本",
  "headline_zh-Hant": "低代碼應用程序平臺，為我們節省了5萬多美元的開發成本",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "近一年来，我一直在使用这个低代码平台来构建、测试和发布我们的应用程序。我无法想象，如果我们试图在公司内部制作我们所做的东西，会花费多少时间。更不用说如果我们将构建工作外包出去，我们的开发成本就更高了。<p>外面有很多其他的低代码平台，所以这里是使用 draftbit.com 的优点/缺点<p>优点。\n- 一旦学会，界面就很简单，可以快速浏览。\n- 社区每天都在增长，大部分简单到中等难度的问题都已经在其中得到了解答。如果你有一个更小众、更具挑战性的问题...\n- 那么，你会发现社区以及Draftbit管理员都会快速回复并提供帮助。\n- 如果你想创建一个刚过MVP阶段的产品，一直到一个完整的产品，都是很好的选择。\n- 能够导出React Native代码，并在DB之外进行工作<p>缺点。\n- 他们是一家较新的公司，所以你会发现有些功能他们仍在努力建立。\n- 你必须认识到，他们有时会出现错误。这些问题一般都能很快得到解决，但发生的频率比我想的要高。\n- 如果你需要一个更复杂的功能，你将需要学习如何用JS或React Native编码。这是大多数/所有低代码平台的情况，但还是想把这个问题说出来。",
  "description_zh-Hant": "近一年來，我一直在使用這個低代碼平臺來構建、測試和發佈我們的應用程序。我無法想象，如果我們試圖在公司內部製作我們所做的東西，會花費多少時間。更不用說如果我們將構建工作外包出去，我們的開發成本就更高了。<p>外面有很多其他的低代碼平臺，所以這裡是使用 draftbit.com 的優點/缺點<p>優點。\n- 一旦學會，界面就很簡單，可以快速瀏覽。\n- 社區每天都在增長，大部分簡單到中等難度的問題都已經在其中得到了解答。如果你有一個更小眾、更具挑戰性的問題...\n- 那麼，你會發現社區以及Draftbit管理員都會快速回復並提供幫助。\n- 如果你想創建一個剛過MVP階段的產品，一直到一個完整的產品，都是很好的選擇。\n- 能夠導出React Native代碼，並在DB之外進行工作<p>缺點。\n- 他們是一家較新的公司，所以你會發現有些功能他們仍在努力建立。\n- 你必須認識到，他們有時會出現錯誤。這些問題一般都能很快得到解決，但發生的頻率比我想的要高。\n- 如果你需要一個更復雜的功能，你將需要學習如何用JS或React Native編碼。這是大多數/所有低代碼平臺的情況，但還是想把這個問題說出來。"
}