{
  "@type": "NewsArticle",
  "identifier": "2022--04--12--en--myfeed--HackerNews--NewsArticle--30997123",
  "url": "https://news.ycombinator.com/item?id=30997123",
  "headline": "Bill.com Quietly Decided to Divert Customer Funds To Unwanted Bank Accounts",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Just received a very strange email from Bill.com:<p>--<p>Hello,<p>We wanted to let you know that as of March 21st, 2022 we enabled a new feature called Bill.com balance for your account. We apologize for not communicating this ahead of time which is our standard practice.<p>This new Bill.com balance capability enables you to pre-fund your Bill.com account, store funds for payment flexibility, and enable faster payment delivery times with no additional fees.<p>It’s important to note that this change means that as of March 21st all payments received through Bill.com are automatically routed to your Bill.com balance instead of your connected bank accounts. As long as Bill.com balance is activated, the funds will continue to be routed this way.<p>To withdraw funds from your Bill.com balance:<p>From the Overview section of your Bill.com account, select Manage Balance\nIn the Manage Balance section, select the three dots, then select Withdraw Money\nEnter the amount you want to withdraw in the Amount field, choose which connected account you want to withdraw the money to, and select the Withdraw button\nWithdrawals initiated by 5pm pacific time will lead to funds being available next business day by 10am pacific time\nOnce you’ve withdrawn all funds from your Bill.com balance, you can also choose to turn the feature off.<p>To turn Bill.com balance off:<p>In your Bill.com account, select Settings, then select Bank &amp; Payment Accounts, then select Bill.com balance\nSelect the Turn off button\nQuestions? Learn more about Bill.com balance or contact us by clicking HERE. We’re here to help.<p>Thank you,\nThe Bill.com Team<p>--<p>This seems genuinely crazy. Like without warning, without prior opt-in authorization, a company that's responsible for vast amounts of business to business payments, made the call that it was OK to, just, not actually send money onwards to their customers? Not as a feature they enabled, or even something that's a little aggressively pitched, they just silently did it.<p>So a customer of yours decides to send you money, and they thought they'd sent it to you, but instead it never got to you, your payment intermediary just held it in some kind of new payments account they decided to assign in your name without even getting your permission. And without telling you.<p>After receiving this email I just went into my Bill.com account where I discovered a six figure balance that they just decided not to give me and didn't tell me about (even now, this email doesn't say <i>that</i>. I had to go look) and I certainly never gave them permission to do that. Even when looking at this balance, the button to withdraw money is hidden.<p>Like they aren't making it clear they unilaterally decided to keep enough money for me to buy a house in a quasi-bank account I never opened and don't fucking want. And I have customers that paid me that I assumed had not paid me who had. I have an A/R person emailing client statements asking them for overdue payment when they actually did pay me last month.<p>It's absolutely appalling, I'm sort of speechless. Wondering if anyone else experienced this or has any personal knowledge of what's going on and what severely misguided executive decided this was OK.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "CPLX",
    "url": "https://news.ycombinator.com/user?id=CPLX"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30997123",
  "sameAs": "https://news.ycombinator.com/item?id=30997123",
  "dateCreated": "2022-04-12T02:26:00.090Z",
  "datePublished": "2022-04-12T00:35:51.000Z",
  "dateModified": "2022-04-12T02:26:00.090Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 14
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Bill.com悄悄决定将客户资金转移到不需要的银行账户上",
  "headline_zh-Hant": "Bill.com悄悄決定將客戶資金轉移到不需要的銀行賬戶上",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "刚刚收到一封来自Bill.com的非常奇怪的电子邮件：<p>--<p>你好，<p>我们想让你知道，从2022年3月21日起，我们为你的账户启用了一项名为Bill.com余额的新功能。<p>这项新的Bill.com余额功能使您能够预先为您的Bill.com账户提供资金，储存资金以提高支付的灵活性，并在没有额外费用的情况下实现更快的支付交付。<p>需要注意的是，这一变化意味着从3月21日起，所有通过Bill.com收到的付款将自动转到您的Bill.com余额而不是您连接的银行账户。只要Bill.com余额被激活，资金将继续以这种方式被输送。<p>要从Bill.com余额中提取资金：<p>在Bill.com账户的 \"概览 \"部分，选择管理余额。\n在管理余额部分，选择三个点，然后选择提款。\n在 \"金额 \"栏中输入您要提取的金额，选择您要提取的连接账户，然后选择 \"提取 \"按钮。\n太平洋时间下午5点前启动的提款，将导致资金在太平洋时间上午10点前的下一个工作日可用。\n一旦您从Bill.com余额中提取了所有资金，您也可以选择关闭该功能。<p>要关闭Bill.com余额：<p>在您的Bill.com账户中，选择设置，然后选择银行和支付账户，然后选择Bill.com余额\n选择 \"关闭 \"按钮\n有问题吗？了解有关Bill.com余额的更多信息，或点击这里联系我们。我们在这里提供帮助。<p>谢谢你。\nThe Bill.com Team<p>--<p>这似乎真的很疯狂。就像在没有警告，没有事先选择授权的情况下，一个负责大量企业对企业付款的公司，打电话说可以，只是，实际上不向他们的客户发送钱？<p>因此，你的一个客户决定给你寄钱，他们认为他们已经把钱寄给了你，但实际上钱从来没有到过你那里，你的支付中介机构只是把钱放在他们决定以你的名义指定的某种新的支付账户中，甚至没有得到你的许可。<p>收到这封邮件后，我进入我的Bill.com账户，在那里我发现了一个六位数的余额，他们只是决定不给我，也没有告诉我（即使现在，这封邮件没有说<i>那个</i>。我不得不去看），我当然没有给他们允许这样做。即使在看这个余额时，取钱的按钮也是隐藏的。<p>就像他们没有说清楚，他们单方面决定把足够我买房子的钱放在一个我从未开过也他妈的不想要的准银行账户里。我有一些客户，我以为他们没有付给我钱，但他们却付给了我。我有一个A/R人员给客户报表发电子邮件，要求他们支付逾期付款，而实际上他们上个月确实付给了我。<p>这绝对是令人震惊的，我有点无语。我想知道是否有其他人经历过这种情况，或者对发生的事情有任何个人的了解，以及是哪个被严重误导的主管决定这样做的。",
  "description_zh-Hant": "剛剛收到一封來自Bill.com的非常奇怪的電子郵件：<p>--<p>你好，<p>我們想讓你知道，從2022年3月21日起，我們為你的賬戶啟用了一項名為Bill.com餘額的新功能。<p>這項新的Bill.com餘額功能使您能夠預先為您的Bill.com賬戶提供資金，儲存資金以提高支付的靈活性，並在沒有額外費用的情況下實現更快的支付交付。<p>需要注意的是，這一變化意味著從3月21日起，所有通過Bill.com收到的付款將自動轉到您的Bill.com餘額而不是您連接的銀行賬戶。只要Bill.com餘額被激活，資金將繼續以這種方式被輸送。<p>要從Bill.com餘額中提取資金：<p>在Bill.com賬戶的 \"概覽 \"部分，選擇管理餘額。\n在管理餘額部分，選擇三個點，然後選擇提款。\n在 \"金額 \"欄中輸入您要提取的金額，選擇您要提取的連接賬戶，然後選擇 \"提取 \"按鈕。\n太平洋時間下午5點前啟動的提款，將導致資金在太平洋時間上午10點前的下一個工作日可用。\n一旦您從Bill.com餘額中提取了所有資金，您也可以選擇關閉該功能。<p>要關閉Bill.com餘額：<p>在您的Bill.com賬戶中，選擇設置，然後選擇銀行和支付賬戶，然後選擇Bill.com餘額\n選擇 \"關閉 \"按鈕\n有問題嗎？瞭解有關Bill.com餘額的更多信息，或點擊這裡聯繫我們。我們在這裡提供幫助。<p>謝謝你。\nThe Bill.com Team<p>--<p>這似乎真的很瘋狂。就像在沒有警告，沒有事先選擇授權的情況下，一個負責大量企業對企業付款的公司，打電話說可以，只是，實際上不向他們的客戶發送錢？<p>因此，你的一個客戶決定給你寄錢，他們認為他們已經把錢寄給了你，但實際上錢從來沒有到過你那裡，你的支付中介機構只是把錢放在他們決定以你的名義指定的某種新的支付賬戶中，甚至沒有得到你的許可。<p>收到這封郵件後，我進入我的Bill.com賬戶，在那裡我發現了一個六位數的餘額，他們只是決定不給我，也沒有告訴我（即使現在，這封郵件沒有說<i>那個</i>。我不得不去看），我當然沒有給他們允許這樣做。即使在看這個餘額時，取錢的按鈕也是隱藏的。<p>就像他們沒有說清楚，他們單方面決定把足夠我買房子的錢放在一個我從未開過也他媽的不想要的準銀行賬戶裡。我有一些客戶，我以為他們沒有付給我錢，但他們卻付給了我。我有一個A/R人員給客戶報表發電子郵件，要求他們支付逾期付款，而實際上他們上個月確實付給了我。<p>這絕對是令人震驚的，我有點無語。我想知道是否有其他人經歷過這種情況，或者對發生的事情有任何個人的瞭解，以及是哪個被嚴重誤導的主管決定這樣做的。"
}