{
  "@type": "NewsArticle",
  "identifier": "2022--03--07--en--myfeed--HackerNews--NewsArticle--30589489",
  "url": "https://news.ycombinator.com/item?id=30589489",
  "headline": "Help: FBI criminally charged me with $6MM loss for hotlinking. I didn't do it",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Throwaway for obvious reasons.<p>I’ll try to be as concise as possible. Some details have been changed to protect myself.<p>I used to operate a website that hotlinked to an asset from $company’s S3 bucket. When $company was made aware of my doing from the FBI, the FBI asked them to calculate the loss amount. They did this by looking at IPs that hit the bucket over a span of 1 month, and the IPs that logged into $company’s service. The number of IPs that they didn’t recognize (about 25,000), multiplied by some multiplier, came out to about $6MM.<p>The problem: I know how many people I had on my website that hit that asset. It was in the hundreds, not the thousands, definitely not tens of thousands. I know this because my site required a subscription and I know how many subscribers I had. There were (and still are!) hundreds of sites that hotlink to $company’s S3 bucket today, causing them loss, that are free and easily accessible. I can show this.<p>When I told my lawyer that this couldn’t possibly have been calculated correctly, he said that I’m pretty SOL in arguing this loss amount. He’s not technical so I don’t know if he really understands. Regardless, I’m in the process of discharging him because he’s failed me multiple times in this case so far.<p>This reeks of all sorts of wrong. $company is an organization known to probably 95% of HNers, they’re a technical organization, and they could not have possibly made the calculation in good faith.<p>If anyone has any advice, I’d appreciate it. I’ll be checking this thread closely, but I can also be reached by email at hotlinking@protonmail[.]com.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "your_username",
    "url": "https://news.ycombinator.com/user?id=your_username"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30589489",
  "sameAs": "https://news.ycombinator.com/item?id=30589489",
  "dateCreated": "2022-03-07T16:46:57.880Z",
  "datePublished": "2022-03-07T16:10:33.000Z",
  "dateModified": "2022-03-07T16:46:57.880Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 10
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "帮助。联邦调查局刑事指控我因热链而损失600万美元。我没有这样做",
  "headline_zh-Hant": "幫助。聯邦調查局刑事指控我因熱鏈而損失600萬美元。我沒有這樣做",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "扔掉的原因显而易见。<p>我将尽可能地简明扼要。为了保护我自己，一些细节已经被改变了。<p>我曾经经营过一个网站，它的热链接是来自$公司的S3桶的资产。当$公司从FBI那里得知我的行为后，FBI要求他们计算损失金额。他们是通过查看1个月内击中该桶的IP，以及登录$公司服务的IP来计算的。他们没有识别的IP数量（大约25000个），乘以一些乘数，得出大约600万美元。<p>问题是：我知道我的网站上有多少人击中了该资产。那是几百人，不是几千人，绝对不是几万人。我知道这一点是因为我的网站需要订阅，我知道我有多少订阅者。今天有（现在仍然有！）数百个网站热链接到$公司的S3桶，给他们造成了损失，这些网站是免费的，很容易访问。我可以证明这一点。<p>当我告诉我的律师，这不可能是正确的计算，他说，我在争论这个损失数额时是很SOL的。他不是技术人员，所以我不知道他是否真的理解。不管怎么说，我正在解除他的职务，因为到目前为止，他在这个案件中多次让我失望。<p>这充满了各种错误的味道。公司是一个可能有95%的HNers都知道的组织，他们是一个技术组织，他们不可能真诚地进行计算。<p>如果有人有任何建议，我将非常感激。我会密切关注这个话题，但也可以通过电子邮件联系我：hotlinking@protonmail[.]com。",
  "description_zh-Hant": "扔掉的原因顯而易見。<p>我將盡可能地簡明扼要。為了保護我自己，一些細節已經被改變了。<p>我曾經經營過一個網站，它的熱鏈接是來自$公司的S3桶的資產。當$公司從FBI那裡得知我的行為後，FBI要求他們計算損失金額。他們是通過查看1個月內擊中該桶的IP，以及登錄$公司服務的IP來計算的。他們沒有識別的IP數量（大約25000個），乘以一些乘數，得出大約600萬美元。<p>問題是：我知道我的網站上有多少人擊中了該資產。那是幾百人，不是幾千人，絕對不是幾萬人。我知道這一點是因為我的網站需要訂閱，我知道我有多少訂閱者。今天有（現在仍然有！）數百個網站熱鏈接到$公司的S3桶，給他們造成了損失，這些網站是免費的，很容易訪問。我可以證明這一點。<p>當我告訴我的律師，這不可能是正確的計算，他說，我在爭論這個損失數額時是很SOL的。他不是技術人員，所以我不知道他是否真的理解。不管怎麼說，我正在解除他的職務，因為到目前為止，他在這個案件中多次讓我失望。<p>這充滿了各種錯誤的味道。公司是一個可能有95%的HNers都知道的組織，他們是一個技術組織，他們不可能真誠地進行計算。<p>如果有人有任何建議，我將非常感激。我會密切關注這個話題，但也可以通過電子郵件聯繫我：hotlinking@protonmail[.]com。"
}