{
  "@type": "NewsArticle",
  "identifier": "2022--03--11--en--myfeed--HackerNews--NewsArticle--30640295",
  "url": "https://news.ycombinator.com/item?id=30640295",
  "headline": "Launch HN: Stock Unlock (YC W22) – Investment Education for Everyone",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi there HN! My name is Jake Ruth, and together with Nick Puljic and Daniel Pronk we are building Stock Unlock (<a href=\"https://stockunlock.com/\" rel=\"nofollow\">https://stockunlock.com/</a>), a web app that provides investment education and analysis tools. It’s great to meet you all… and speaking of “meeting”, Nick and I only met Daniel in real life a couple weeks ago even though we have been working on this for over a year… but more to come on that later in the post :)<p>As retail investors we noticed that many retail products have some combo of the following shortcomings: high paywalls, tricky to navigate web design, oversimplification of investing principles, and misaligned incentives that push users to trade more—instead of giving them adequate education to manage a successful portfolio. They are very non noob friendly.<p>Further, I am personally very “triggered” by the lack of financial education myself and friends were not given growing up. I am fortunate to be a software engineer, but it really hurts me to see a lot of close friends, and even family get bit by the financial system since they are not educated by it. And it’s not our fault. Much of America and the world falls into this bucket, which was exasperated by a deflationary financial brokerage environment that led to trading apps which would allow anyone to trade stocks in minutes from their pocket (for free!). Honestly, that’s great. Access to markets is important. However, many people are following a similar story line, you get easy access to trading for low costs/free, you probably started in the bull market from the covid flash crash, made some money if you’re lucky, but have since fallen into the red/realized how clueless we all are for what investing actually is.<p>I remember so clearly a few years ago looking at a Yahoo Finance page and feeling overwhelmed by price ratios, reported financials, stock prices cross stocks, analysts, different news articles from the same publishers saying the opposite headlines… It honestly felt impossible to learn. Especially since my family/close friends aren’t into finance or investing.<p>Then one day, sitting on my bed in NYC hiding from COVID in 2020, I stumbled upon Daniel’s Youtube account. I do not follow celebs, I don’t know famous people, I don’t twitter, but there was something about Daniel and the investment education content he put out that immediately had me captivated and drawn to his account. He is well spoken and presents investing and financial analysis in a way that I actually could understand, and it blew my mind. I proceeded to feverishly ingest his Youtube content for months.<p>I began to notice a pattern in Daniel’s videos, he would sometimes use third party sites to show investment graphs, but he would often open an excel sheet with 3-5 stocks in it (columns), and then fill in rows for financial metrics. I will quote Daniel “I spend about 5-8 hours a week making these spreadsheets, it takes a lot of time but it’s worth it”. So I’m an engineer sitting here watching this and I think… I could definitely write a program to do this. And better yet, I could give it to Daniel as a thank you for all the great work he puts into Youtube.<p>So on a weekend I whip up this program to automate his spreadsheet creation and give it to Daniel… I mean I tried to, but Daniel didn’t answer my Youtube comment! GASP!!!! Ok… so, I found his instagram, but still no luck. I was honestly pretty pissed, like this dude is so smart how could he not recognize that I can save him 5-8 hours a week if he used my program to automate his spreadsheet creation.<p>Well, another 2 months go by. Every week I iterated on the program more, started ranting to my co-worker at the time Nick (we were at Oscar Health together), and kept pinging Daniel shamelessly across multiple social channels. FINALLY he answered me… we ended up hopping on a zoom call, which itself went for 2-3 hours, a beer was cracked… the rest is well, history!<p>I was able to pretty easily write a Python script to hit a financial data API (Alpha Vantage at the time), and Daniel, Nick, and myself all saw a vision for us to create a software platform that actually taught users how to invest, without oversimplifying the process, and at a price that didn’t break the bank.<p>The moment at which this turned from a side project to a company, was when I shared my program with Daniel Pronk’s investing discord community and people basically freaked out.  “This is the best thing ever”, “can you make it generate _this_?”, “how can I pay you for this”... I basically took the classic “push back chair from desk” moment and knew it was time to take this full time. Thankfully, Nick was also on board! We had a founding team of 3, and at the time the project was called “Stonk Reporter” (I’m still a bit salty we didn’t keep this name). After a long 4 month beta/pilot with around 200 users from Daniel’s discord, we launched Stock Unlock on December 11th 2021. Jake and Nick met Daniel for the first time a couple weeks ago, until then it was a fully remote co-founder relationship!<p>Today we provide a modern/easy-to-use web app which has data visualization tools for financials, and contextual, inline education. Sites like Investopedia are good for term lookup, but the education isn't given at the time the investor needs it. Typically you get confused, search the internet, and land there—we show it to you in place. For users who already know the ropes, our graphing tools allow users to compare 70+ financial metrics across as many stocks as they want. These tools either don't exist or are part of extremely pricey programs like Bloomberg Terminal (no retail investor can afford that). We have existing investors using Stock Unlock who say they save 80-90% of their time on company analysis with our tools.<p>Our current business model is that we give everyone a 7 day free trial, no credit card/totally free to try the site. We ask for email, but you can give a fake email if you want and we don’t verify it/anything like that. After the 7 day free trial we are priced at $6.99 per month / $74.99 per year (USD, prices will vary for Euro/Canada).<p>We build the consumer web app layer and get our financial data from another startup called Finnhub. We are “serverless” using AWS for all our backend infrastructure. We use Cognito for user auth, Api Gateway &amp; Lambda (Python) for the API, Dynamo &amp; Postgres for data store, S3/CloudFront/Route 53 for static hosting. The frontend is all ReactJS with special help from Material UI for our designed components/us not needing to write tons of CSS (yay), and recharts for the lib to help draw pretty graphs. There are also a ton of fun technical challenges that we solve, currency conversion/alignment for the 122,000 global stocks we support has been hairy/filled with edge cases, also data staleness for prices/market caps is another area of complexity. Not to mention building around a 3rd party HTTPS/JSON api and caching those endpoints/storing some data internally is a fun juggle!<p>Your feedback/your stories about any of the above or this space in general would be amazing. I look forward to interacting with everyone in the comments, we embrace constructive feedback and feel fortunate knowing that you will hold us to your highest standards.<p>If you do decide to try our application, please let us know your thoughts! We launched with a pretty raw MVP and are adding features to the site weekly, with no end in sight. Cheers!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "hippofluff",
    "url": "https://news.ycombinator.com/user?id=hippofluff"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30640295",
  "sameAs": "https://news.ycombinator.com/item?id=30640295",
  "dateCreated": "2022-03-11T14:35:51.209Z",
  "datePublished": "2022-03-11T14:26:55.000Z",
  "dateModified": "2022-03-11T14:35:51.209Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "启动HN：股票解锁 (YC W22) - 每个人的投资教育",
  "headline_zh-Hant": "啟動HN：股票解鎖 (YC W22) - 每個人的投資教育",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，HN! 我的名字是Jake Ruth，我们和Nick Puljic和Daniel Pronk一起正在建立Stock Unlock（<a href=\"https://stockunlock.com/\" rel=\"nofollow\">https://stockunlock.com/</a>），一个提供投资教育和分析工具的网络应用。很高兴认识大家......说到 \"认识\"，尼克和我几周前才在现实生活中认识了丹尼尔，尽管我们已经为此工作了一年多......但在文章后面会有更多的内容：）<p>作为零售投资者，我们注意到，许多零售产品有以下一些组合的缺点：高额报酬墙，棘手的网页设计，过度简化的投资原则，以及错位的激励，促使用户进行更多交易，而不是给他们足够的教育来管理一个成功的投资组合。<p>此外，我个人对自己和朋友在成长过程中缺乏金融教育而感到非常 \"受刺激\"。我很幸运地成为了一名软件工程师，但看到很多亲密的朋友，甚至是家人被金融系统咬伤，我真的很伤心，因为他们没有接受过教育。而且这不是我们的错。美国和世界的大部分地区都属于这个范畴，通货紧缩的金融经纪环境加剧了这种情况，导致交易应用程序的出现，使任何人都可以在几分钟内从他们的口袋里交易股票（免费的！）。说实话，这很好。进入市场的机会是很重要的。然而，许多人都在遵循一个类似的故事线，你以低成本/免费的方式轻松获得交易，你可能从觊觎闪崩的牛市开始，如果你幸运的话，赚了一些钱，但此后陷入红海/意识到我们都对投资的实际意义毫无所知。 <p>我清楚地记得，几年前，我看着雅虎财经的页面，对价格比率、报告的财务状况、股票价格、分析师、同一出版商的不同新闻文章说相反的标题感到不知所措。尤其是我的家人/亲密的朋友并不喜欢金融或投资。<p>然后有一天，我坐在纽约的床上，躲避2020年的COVID，我偶然发现了丹尼尔的Youtube账户。我不关注名人，不认识名人，也不发微博，但丹尼尔和他发布的投资教育内容有一点让我立刻被吸引，并被他的账户所吸引。他口才很好，以我真正能理解的方式介绍投资和金融分析，这让我大开眼界。<p>我开始注意到丹尼尔视频中的一个模式，他有时会使用第三方网站来展示投资图表，但他经常会打开一个EXCEL表格，里面有3-5只股票（列），然后在行中填写财务指标。我将引用丹尼尔的话：\"我每周花大约5-8个小时制作这些电子表格，这需要大量的时间，但这是值得的\"。所以，我是一个工程师，坐在这里看这个，我想......我肯定可以写一个程序来做这个。更好的是，我可以把它送给丹尼尔，作为对他在Youtube上所有伟大工作的感谢。<p>于是在一个周末，我编写了这个程序，使他的电子表格制作自动化，并把它送给了丹尼尔......我的意思是我试过了，但丹尼尔没有回答我在Youtube上的评论! GASP!!!! 好吧......所以，我找到了他的Instagram，但还是没有收获。说实话，我很生气，这家伙这么聪明，怎么会不知道我可以为他每周节省5-8个小时，如果他用我的程序来自动创建电子表格的话。<p>好吧，又过了两个月。每周我都对程序进行更多的迭代，开始向我当时的同事尼克（我们一起在奥斯卡健康公司工作）咆哮，并不断在多个社交渠道向丹尼尔发出无耻的信息。最后，他回答了我......我们最后跳上了一个放大的电话，这本身就持续了2-3个小时，啤酒也喝光了......剩下的就是历史了！<p>我能够很容易地写一个Python脚本，来连接一个金融数据API（当时是Alpha Vantage），而丹尼尔、尼克和我都看到了一个愿景，即创建一个真正教用户如何投资的软件平台，不过度简化过程，而且价格不会打破银行。 <p>当我与丹尼尔-普朗克的投资对话社区分享我的程序时，人们基本上都惊呆了，这是一个从副业变成公司的时刻。 \"这是最好的方法",
  "description_zh-Hant": "大家好，HN! 我的名字是Jake Ruth，我們和Nick Puljic和Daniel Pronk一起正在建立Stock Unlock（<a href=\"https://stockunlock.com/\" rel=\"nofollow\">https://stockunlock.com/</a>），一個提供投資教育和分析工具的網絡應用。很高興認識大家......說到 \"認識\"，尼克和我幾周前才在現實生活中認識了丹尼爾，儘管我們已經為此工作了一年多......但在文章後面會有更多的內容：）<p>作為零售投資者，我們注意到，許多零售產品有以下一些組合的缺點：高額報酬牆，棘手的網頁設計，過度簡化的投資原則，以及錯位的激勵，促使用戶進行更多交易，而不是給他們足夠的教育來管理一個成功的投資組合。<p>此外，我個人對自己和朋友在成長過程中缺乏金融教育而感到非常 \"受刺激\"。我很幸運地成為了一名軟件工程師，但看到很多親密的朋友，甚至是家人被金融系統咬傷，我真的很傷心，因為他們沒有接受過教育。而且這不是我們的錯。美國和世界的大部分地區都屬於這個範疇，通貨緊縮的金融經紀環境加劇了這種情況，導致交易應用程序的出現，使任何人都可以在幾分鐘內從他們的口袋裡交易股票（免費的！）。說實話，這很好。進入市場的機會是很重要的。然而，許多人都在遵循一個類似的故事線，你以低成本/免費的方式輕鬆獲得交易，你可能從覬覦閃崩的牛市開始，如果你幸運的話，賺了一些錢，但此後陷入紅海/意識到我們都對投資的實際意義毫無所知。 <p>我清楚地記得，幾年前，我看著雅虎財經的頁面，對價格比率、報告的財務狀況、股票價格、分析師、同一出版商的不同新聞文章說相反的標題感到不知所措。尤其是我的家人/親密的朋友並不喜歡金融或投資。<p>然後有一天，我坐在紐約的床上，躲避2020年的COVID，我偶然發現了丹尼爾的Youtube賬戶。我不關注名人，不認識名人，也不發微博，但丹尼爾和他發佈的投資教育內容有一點讓我立刻被吸引，並被他的賬戶所吸引。他口才很好，以我真正能理解的方式介紹投資和金融分析，這讓我大開眼界。<p>我開始注意到丹尼爾視頻中的一個模式，他有時會使用第三方網站來展示投資圖表，但他經常會打開一個EXCEL表格，裡面有3-5只股票（列），然後在行中填寫財務指標。我將引用丹尼爾的話：\"我每週花大約5-8個小時製作這些電子表格，這需要大量的時間，但這是值得的\"。所以，我是一個工程師，坐在這裡看這個，我想......我肯定可以寫一個程序來做這個。更好的是，我可以把它送給丹尼爾，作為對他在Youtube上所有偉大工作的感謝。<p>於是在一個週末，我編寫了這個程序，使他的電子表格製作自動化，並把它送給了丹尼爾......我的意思是我試過了，但丹尼爾沒有回答我在Youtube上的評論! GASP!!!! 好吧......所以，我找到了他的Instagram，但還是沒有收穫。說實話，我很生氣，這傢伙這麼聰明，怎麼會不知道我可以為他每週節省5-8個小時，如果他用我的程序來自動創建電子表格的話。<p>好吧，又過了兩個月。每週我都對程序進行更多的迭代，開始向我當時的同事尼克（我們一起在奧斯卡健康公司工作）咆哮，並不斷在多個社交渠道向丹尼爾發出無恥的信息。最後，他回答了我......我們最後跳上了一個放大的電話，這本身就持續了2-3個小時，啤酒也喝光了......剩下的就是歷史了！<p>我能夠很容易地寫一個Python腳本，來連接一個金融數據API（當時是Alpha Vantage），而丹尼爾、尼克和我都看到了一個願景，即創建一個真正教用戶如何投資的軟件平臺，不過度簡化過程，而且價格不會打破銀行。 <p>當我與丹尼爾-普朗克的投資對話社區分享我的程序時，人們基本上都驚呆了，這是一個從副業變成公司的時刻。 \"這是最好的方法"
}