{
  "@type": "NewsArticle",
  "identifier": "2022--04--10--en--myfeed--HackerNews--NewsArticle--30973675",
  "url": "https://news.ycombinator.com/item?id=30973675",
  "headline": "Tell HN: Fridays free at my new company",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I’ve switched jobs recently. I have been working at my new place for around 4 months. Company is 100% remote. Managers of all the tech department areas were doing some sort of “socializing events” on Fridays for their teams since the pandemic started; basically: coffee session in the morning, share your lunch at midday and games and chatting on the afternoon. These were all optional, but I felt somehow obliged to attend at least one or two of them every Friday. All of this, of course with the goal of: work life balance, keeping us social and mentally healthy, etc. Last week, the CEO decided to give us Fridays free. He said, “well, what’s better for your well being? A Friday full of rituals or a Friday entirely for yourselves? If you want to hangout with colleagues on your free Friday, you still can do it!” And so, I don’t work anymore on Fridays (salary unaffected).<p>P.S. everything is true, except the part about having Fridays free.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "tkiolp4",
    "url": "https://news.ycombinator.com/user?id=tkiolp4"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30973675",
  "sameAs": "https://news.ycombinator.com/item?id=30973675",
  "dateCreated": "2022-04-10T03:12:44.084Z",
  "datePublished": "2022-04-10T01:23:19.000Z",
  "dateModified": "2022-04-10T03:12:44.084Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "告诉HN：在我的新公司，周五是免费的",
  "headline_zh-Hant": "告訴HN：在我的新公司，週五是免費的",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我最近换了工作。我已经在新的地方工作了大约4个月。公司是100%的远程。自从大流行开始后，所有技术部门的经理都在周五为他们的团队做一些 \"社交活动\"；基本上是：上午喝咖啡，中午分享午餐，下午玩游戏和聊天。这些都是可有可无的，但我觉得自己有义务每周五至少参加其中的一到两次。所有这些，当然是为了：平衡工作生活，保持我们的社交和心理健康等。上周，首席执行官决定让我们周五自由活动。他说：\"好吧，什么对你的健康更好？一个充满仪式感的星期五还是一个完全属于你们自己的星期五？如果你们想在自由的星期五和同事们一起玩，你们仍然可以这样做！\" 于是，我在周五不再工作了（工资不受影响）。<p>P.S. 一切都是真的，除了关于周五自由的部分。",
  "description_zh-Hant": "我最近換了工作。我已經在新的地方工作了大約4個月。公司是100%的遠程。自從大流行開始後，所有技術部門的經理都在週五為他們的團隊做一些 \"社交活動\"；基本上是：上午喝咖啡，中午分享午餐，下午玩遊戲和聊天。這些都是可有可無的，但我覺得自己有義務每週五至少參加其中的一到兩次。所有這些，當然是為了：平衡工作生活，保持我們的社交和心理健康等。上週，首席執行官決定讓我們週五自由活動。他說：\"好吧，什麼對你的健康更好？一個充滿儀式感的星期五還是一個完全屬於你們自己的星期五？如果你們想在自由的星期五和同事們一起玩，你們仍然可以這樣做！\" 於是，我在週五不再工作了（工資不受影響）。<p>P.S. 一切都是真的，除了關於週五自由的部分。"
}