{
  "@type": "NewsArticle",
  "identifier": "2022--02--25--en--myfeed--HackerNews--NewsArticle--30472727",
  "url": "https://news.ycombinator.com/item?id=30472727",
  "headline": "Microsoft Hiring",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Microsoft Hiring\nBill Gates (about as Goyish as anybody can be) advertised for 2 new board members for Microsoft Europe. 5000 candidates show up at the job screening. They are assembled in a large room. Among them is Maurice Cohen, a French Jew, a small, bearded, bespeckled man. Bill Gates thanks the candidates for coming but asks all those who are not familiar with the JAVA programming language to leave; 2000 people rise and leave the room. Maurice Cohen says to himself, &quot;I do not know this language but what have I got to lose if I stay? I'll give it a try&quot;.<p>Bill Gates then asks all those who have no experience of managing teams of more than 100 people to leave. Another 2000 people go. Maurice Cohen says to himself, &quot;I have never managed anybody but myself but what have I got to lose if I stay? What can happen to me?&quot;<p>Then Bill Gates asks all candidates who do not have outstanding academic qualifications to rise and leave; 500 people remove themselves. Maurice Cohen says to himself, &quot;I left school at 15 but what have I got to lose if I stay? So he stays in the room.\nLastly, Bill Gates asks all of the candidates who do not speak the Serbo-Croatian language to rise and leave; 498 people rise and leave the room. Maurice Cohen says himself, &quot;I do not speak Serbo-Croatian but what the hell! Have I got anything to lose?&quot;<p>He finds himself alone with one other candidate. Everyone else has gone. Bill Gates joins them and says: &quot;Apparently you are the only two candidates who know JAVA, have managed large teams of employees, have advanced PhD degrees, and who can speak Serbo-Croatian. I'd like to hear you converse with one another in Serbo-Croatian.&quot;\nCalmly Maurice turns to the other candidate and says to him: &quot;Baruch ata Adonaï.&quot;\nThe other candidate answers: &quot;Elohénu melech ha'olam.&quot;<p>Both get the Board positions.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Txoko",
    "url": "https://news.ycombinator.com/user?id=Txoko"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30472727",
  "sameAs": "https://news.ycombinator.com/item?id=30472727",
  "dateCreated": "2022-02-25T21:49:52.070Z",
  "datePublished": "2022-02-25T21:45:02.000Z",
  "dateModified": "2022-02-25T21:49:52.070Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "微软招聘",
  "headline_zh-Hant": "微軟招聘",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "微软招聘\n比尔-盖茨（就像任何人都能做到的那样戈伊人）为微软欧洲公司招聘两名新的董事会成员。5000名候选人出现在招聘会上。他们被召集到一个大房间里。其中有一个法国犹太人莫里斯-科恩（Maurice Cohen），一个身材矮小、满脸胡须、长满斑点的人。比尔-盖茨感谢应聘者的到来，但要求所有不熟悉JAVA编程语言的人离开；2000人起身离开房间。莫里斯-科恩自言自语道：\"我不懂这种语言，但如果我留下来又有什么损失？<p>比尔-盖茨接着要求所有没有管理100人以上团队经验的人离开。又有2000人离开。莫里斯-科恩对自己说：&quot;我从来没有管理过任何人，只有我自己，但如果我留下来，我有什么损失？<p>然后比尔-盖茨要求所有没有杰出学历的候选人起身离开；500人离开。莫里斯-科恩对自己说，&quot;我15岁就离开了学校，但如果我留下来会有什么损失？所以他留在了房间里。\n最后，比尔-盖茨要求所有不会说塞尔维亚-克罗地亚语的候选人起身离开；498人起身离开房间。莫里斯-科恩自己说，&quot;我不会说塞尔维亚-克罗地亚语，但这又有什么用呢！我有什么损失吗？我有什么可失去的吗？<p>他发现自己和另外一个候选人在一起。其他人都已经走了。比尔-盖茨加入了他们，并说：&quot;显然你们是唯一两个懂得JAVA，管理过大型员工团队，拥有高级博士学位，并能说塞尔维亚-克罗地亚语的候选人。我想听听你们用塞尔维亚-克罗地亚语相互交谈的声音。\n莫里斯平静地转向另一位候选人，对他说：&quot;Baruch ata Adonaï.&quot。\n另一位候选人回答：&quot;Elohénu melech ha'olam.&quot;<p>两人都得到了董事会的职位。",
  "description_zh-Hant": "微軟招聘\n比爾-蓋茨（就像任何人都能做到的那樣戈伊人）為微軟歐洲公司招聘兩名新的董事會成員。5000名候選人出現在招聘會上。他們被召集到一個大房間裡。其中有一個法國猶太人莫里斯-科恩（Maurice Cohen），一個身材矮小、滿臉鬍鬚、長滿斑點的人。比爾-蓋茨感謝應聘者的到來，但要求所有不熟悉JAVA編程語言的人離開；2000人起身離開房間。莫里斯-科恩自言自語道：\"我不懂這種語言，但如果我留下來又有什麼損失？<p>比爾-蓋茨接著要求所有沒有管理100人以上團隊經驗的人離開。又有2000人離開。莫里斯-科恩對自己說：&quot;我從來沒有管理過任何人，只有我自己，但如果我留下來，我有什麼損失？<p>然後比爾-蓋茨要求所有沒有傑出學歷的候選人起身離開；500人離開。莫里斯-科恩對自己說，&quot;我15歲就離開了學校，但如果我留下來會有什麼損失？所以他留在了房間裡。\n最後，比爾-蓋茨要求所有不會說塞爾維亞-克羅地亞語的候選人起身離開；498人起身離開房間。莫里斯-科恩自己說，&quot;我不會說塞爾維亞-克羅地亞語，但這又有什麼用呢！我有什麼損失嗎？我有什麼可失去的嗎？<p>他發現自己和另外一個候選人在一起。其他人都已經走了。比爾-蓋茨加入了他們，並說：&quot;顯然你們是唯一兩個懂得JAVA，管理過大型員工團隊，擁有高級博士學位，並能說塞爾維亞-克羅地亞語的候選人。我想聽聽你們用塞爾維亞-克羅地亞語相互交談的聲音。\n莫里斯平靜地轉向另一位候選人，對他說：&quot;Baruch ata Adonaï.&quot。\n另一位候選人回答：&quot;Elohénu melech ha'olam.&quot;<p>兩人都得到了董事會的職位。"
}