{
  "@type": "NewsArticle",
  "identifier": "2022--03--23--en--myfeed--HackerNews--NewsArticle--30774351",
  "url": "https://news.ycombinator.com/item?id=30774351",
  "headline": "Tell HN: Confessions of a Prideful Junior Programmer",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I don't have 25 years of experience in the industry. So I don't have a lot of advice to give but I can share something with the community.<p>Here are biggest delusions I overcame,  throughout my 7 year career.<p>1. Shared Hosting(Cpanel) is not beneath me.<p>Seduced by Hype Driven development, I wanted to pad my resume by learning the latest technologies. \nWhy would I host my site on shared hosting? No real programmer would use phpmyadmin, my project would have 1M users on day one, I needed a bare metal VPS. \nThe irony is that I ended up recreating a buggy, half baked version of CPanel.<p>2. PHP is beneath me.<p>I was ashamed to tell people I use php. On reddit, youtube and HN real programmers used Haskell and React. Everything should be a bloated javascript SPA, with an overly complex toolchain.  Since the average joe without formal training could figure out how to FTP files and have a site running, I needed to be different. I was too good for PHP.<p>3. Wordpress is  beneath me.<p>I was afraid that people would &quot;view source&quot; on my project, see that it's built with Wordpress. I thought they would silently judge me.  I wasted months upon months, re-inventing the wheel, I could have delivered a working product in a matter of weeks.<p>All this to say.<p>I might never build a  product that reaches 100k active users. I might never make it on top of Hacker News, I might never get featured on TechCrunch and it's okay.<p>I don't have to be the best programmer in the world. It's okay to build little programs and apps for small businesses, with a simple database and a simple front-end.<p>I might never work for a MicroMetaGooAppleZon, it's okay too<p>I might never break into 6 figures and it's okay too.<p>This was the best realization I made.<p>Life is good once I figured that out.<p>Thanks for reading.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "kbrannigan",
    "url": "https://news.ycombinator.com/user?id=kbrannigan"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30774351",
  "sameAs": "https://news.ycombinator.com/item?id=30774351",
  "dateCreated": "2022-03-23T03:11:01.280Z",
  "datePublished": "2022-03-23T02:57:09.000Z",
  "dateModified": "2022-03-23T03:11:01.280Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "告诉HN：一个骄傲的初级程序员的自白",
  "headline_zh-Hant": "告訴HN：一個驕傲的初級程序員的自白",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在这个行业没有25年的经验。所以我没有太多的建议，但我可以与社区分享一些东西。<p>在我7年的职业生涯中，我克服的最大的错觉是：<p>1. 共享主机（Cpanel）不在我之下。<p>受炒作驱动的发展的影响，我想通过学习最新的技术来填补我的简历。\n我为什么要把我的网站放在共享主机上？没有真正的程序员会使用phpmyadmin，我的项目在第一天就会有100万用户，我需要一个裸机VPS。\n讽刺的是，我最后重新制作了一个有问题的、半生不熟的CPanel版本。<p>2.PHP在我之下。<p>我很羞于告诉别人我使用php。在reddit、youtube和HN，真正的程序员使用Haskell和React。一切都应该是一个臃肿的javascript SPA，有一个过于复杂的工具链。 由于没有经过正式培训的普通人也能搞清楚如何使用FTP文件并运行一个网站，我需要与众不同。<p>3.Wordpress在我之下。<p>我担心人们会在我的项目上查看源代码，看到它是用Wordpress构建的。我以为他们会默默地评价我。 我浪费了好几个月的时间，重新发明了轮子，我本可以在几周内交付一个可以使用的产品。<p>所有这些都是为了说明。<p>我可能永远不会建立一个能达到10万活跃用户的产品。我可能永远不会登上Hacker News的榜首，我可能永远不会被TechCrunch报道，这都没关系。<p>我不必成为世界上最好的程序员。<p>我可能永远不会为MicroMetaGooAppleZon工作，这也没关系<p>我可能永远不会突破6位数，这也没关系。<p>这是我最好的领悟。<p>一旦我想通了，生活就会很美好。<p>谢谢阅读。",
  "description_zh-Hant": "我在這個行業沒有25年的經驗。所以我沒有太多的建議，但我可以與社區分享一些東西。<p>在我7年的職業生涯中，我克服的最大的錯覺是：<p>1. 共享主機（Cpanel）不在我之下。<p>受炒作驅動的發展的影響，我想通過學習最新的技術來填補我的簡歷。\n我為什麼要把我的網站放在共享主機上？沒有真正的程序員會使用phpmyadmin，我的項目在第一天就會有100萬用戶，我需要一個裸機VPS。\n諷刺的是，我最後重新制作了一個有問題的、半生不熟的CPanel版本。<p>2.PHP在我之下。<p>我很羞於告訴別人我使用php。在reddit、youtube和HN，真正的程序員使用Haskell和React。一切都應該是一個臃腫的javascript SPA，有一個過於複雜的工具鏈。 由於沒有經過正式培訓的普通人也能搞清楚如何使用FTP文件並運行一個網站，我需要與眾不同。<p>3.Wordpress在我之下。<p>我擔心人們會在我的項目上查看源代碼，看到它是用Wordpress構建的。我以為他們會默默地評價我。 我浪費了好幾個月的時間，重新發明了輪子，我本可以在幾周內交付一個可以使用的產品。<p>所有這些都是為了說明。<p>我可能永遠不會建立一個能達到10萬活躍用戶的產品。我可能永遠不會登上Hacker News的榜首，我可能永遠不會被TechCrunch報道，這都沒關係。<p>我不必成為世界上最好的程序員。<p>我可能永遠不會為MicroMetaGooAppleZon工作，這也沒關係<p>我可能永遠不會突破6位數，這也沒關係。<p>這是我最好的領悟。<p>一旦我想通了，生活就會很美好。<p>謝謝閱讀。"
}