{
  "@type": "NewsArticle",
  "identifier": "2022--03--17--en--myfeed--HackerNews--NewsArticle--30706407",
  "url": "https://news.ycombinator.com/item?id=30706407",
  "headline": "Tell HN: Stripe Took Our $159k",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We created a marketplace called bringshopper.com where we bring shoppers to newly started businesses. We had a call with their sales team and as they suggested we used Stripe Standard Connect and direct charges. When we bring shoppers successfully we charged higher application fees to cover our costs and there was no upfront costs\nWe even built feature to cover negative balances of connected accounts by cutting their ad budget<p>And one day Stripe blocked our account, and disabled all our connected accounts and said they WILL NOT RELEASE OUR FUNDS AND WILL USE TO REFUND ALL CUSTOMERS. Now there are multiple things: 1) They didn't refund anyone as we are a platform account we have no charges under us to refund 2) They didn't release funds either<p>They TOOK OUR FUNDS, $159k to be exact They can't refund customers of all connected accounts and use our funds as they advertise in stripe.com/connect/pricing that Stripe Standard Connect is not responsible for losses, disputes, refunds of connected accounts<p>There is no charges to be refunded or disputed and they simply took our funds<p>How is this even legal? Anyone had similar experience or anyone can help? Our company is struggling here due to this<p>Our account id is acct_1K7t9JC4s1I9dR5f<p>Updates:\nEdwin reached out in other thread I shared saying they can't support our business but still didn't say anything about release of our funds<p>I want to know when will we receive our money",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "neginshopper",
    "url": "https://news.ycombinator.com/user?id=neginshopper"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30706407",
  "sameAs": "https://news.ycombinator.com/item?id=30706407",
  "dateCreated": "2022-03-17T02:06:12.342Z",
  "datePublished": "2022-03-17T01:23:20.000Z",
  "dateModified": "2022-03-17T02:06:12.342Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 19
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 12
    }
  ],
  "headline_zh-Hans": "告诉HN：Stripe拿走了我们的15.9万美元",
  "headline_zh-Hant": "告訴HN：Stripe拿走了我們的15.9萬美元",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们创建了一个名为bringshopper.com的市场，在这里我们将购物者带到新创办的企业。我们与他们的销售团队进行了通话，按照他们的建议，我们使用了Stripe标准连接和直接收费。当我们成功带来购物者时，我们收取更高的申请费以支付我们的成本，而且没有任何前期费用。\n我们甚至建立了一个功能，通过削减他们的广告预算来弥补连接账户的负余额<p>有一天，Stripe封锁了我们的账户，并禁用了我们所有的连接账户，并说他们不会释放我们的资金，并将用于退还所有客户。现在有多件事情。1）他们没有给任何人退款，因为我们是一个平台账户，我们没有任何费用可退。2）他们也没有释放资金<p>他们拿走了我们的资金，确切地说，是15.9万美元。他们不能给所有连接账户的客户退款并使用我们的资金，因为他们在stripe.com/connect/pricing中宣传，Stripe Standard Connect不负责连接账户的损失、争议和退款<p>没有任何费用可退或争议，他们只是拿走我们的资金<p>这怎么可能合法？有没有人有过类似的经历，或者有人可以帮助？我们的公司正因为这个而陷入困境<p>我们的账户ID是acct_1K7t9JC4s1I9dR5f<p>更新。\n埃德温在我分享的其他主题中表示，他们不能支持我们的业务，但仍然没有说任何关于释放我们的资金<p>我想知道我们什么时候能收到我们的钱。",
  "description_zh-Hant": "我們創建了一個名為bringshopper.com的市場，在這裡我們將購物者帶到新創辦的企業。我們與他們的銷售團隊進行了通話，按照他們的建議，我們使用了Stripe標準連接和直接收費。當我們成功帶來購物者時，我們收取更高的申請費以支付我們的成本，而且沒有任何前期費用。\n我們甚至建立了一個功能，通過削減他們的廣告預算來彌補連接賬戶的負餘額<p>有一天，Stripe封鎖了我們的賬戶，並禁用了我們所有的連接賬戶，並說他們不會釋放我們的資金，並將用於退還所有客戶。現在有多件事情。1）他們沒有給任何人退款，因為我們是一個平臺賬戶，我們沒有任何費用可退。2）他們也沒有釋放資金<p>他們拿走了我們的資金，確切地說，是15.9萬美元。他們不能給所有連接賬戶的客戶退款並使用我們的資金，因為他們在stripe.com/connect/pricing中宣傳，Stripe Standard Connect不負責連接賬戶的損失、爭議和退款<p>沒有任何費用可退或爭議，他們只是拿走我們的資金<p>這怎麼可能合法？有沒有人有過類似的經歷，或者有人可以幫助？我們的公司正因為這個而陷入困境<p>我們的賬戶ID是acct_1K7t9JC4s1I9dR5f<p>更新。\n埃德溫在我分享的其他主題中表示，他們不能支持我們的業務，但仍然沒有說任何關於釋放我們的資金<p>我想知道我們什麼時候能收到我們的錢。"
}