{
  "@type": "NewsArticle",
  "identifier": "2022--03--16--en--myfeed--HackerNews--NewsArticle--30700700",
  "url": "https://news.ycombinator.com/item?id=30700700",
  "headline": "Tell HN: Amazon's book search is gamed, keyword-stuffed, and inaccurate",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "In short: horrible.<p>I know this won't be new to most of you, but I wanted to share an anecdote (and a rant!)<p>I have a friend who has brain cancer. I went to Amazon searching for books on the subject and I typed ‘brain cancer’ in the search (books) field. What did I find?<p><i>Amazon UK</i><p>As you scroll down page 1 of the search results, you find examples of “brain cancer notebook” or “brain cancer journal”. Empty notebooks with nothing to do with the subject.<p><i>Amazon US</i><p>Same search term. The search results were even worse. The “no content” ranked even higher on the first page of search page.<p>Here is a screenshot of the search results for Amazon UK and US: https://i.postimg.cc/JRDkSGRK/amazon-book-search.jpg<p>Try an Amazon book search for “Ukraine war” on Amazon UK and US and already the search results are populated with “Ukraine war” blank notebooks seizing the opportunity to profit from war (these blank notebooks are not donating to charities, they are simply seizing on keyword searches).<p>The reason so many of these &quot;no content&quot; notebooks pollute the books category is because of Amazon’s Kindle Direct Publishing (KDP) service: a print-on-demand service. It has opened the flood gates to “low content” or “no content” journals and notebooks which allows &quot;creators&quot; publish hundreds of notebook titles. These are simply empty, lined or blank print-on-demand notebooks. Amazon includes these in book search results rather than confine these items to it’s own search category. You can find hundreds of YouTube videos on how to publish “no content” notebooks via KDP and how to game Amazon search results to rank higher.<p>I know Amazon simply doesn’t care, but I had to rant. I might be overreacting by the results I saw and I won’t be offended if you say so :-)",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "vanilla-almond",
    "url": "https://news.ycombinator.com/user?id=vanilla-almond"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30700700",
  "sameAs": "https://news.ycombinator.com/item?id=30700700",
  "dateCreated": "2022-03-16T18:35:42.634Z",
  "datePublished": "2022-03-16T16:16:45.000Z",
  "dateModified": "2022-03-16T18:35:42.634Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 114
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 78
    }
  ],
  "headline_zh-Hans": "告诉HN：亚马逊的图书搜索是有漏洞的，关键词充斥，而且不准确",
  "headline_zh-Hant": "告訴HN：亞馬遜的圖書搜索是有漏洞的，關鍵詞充斥，而且不準確",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "In short: horrible.<p>I know this won't be new to most of you, but I wanted to share an anecdote (and a rant!)<p>I have a friend who has brain cancer. I went to Amazon searching for books on the subject and I typed ‘brain cancer’ in the search (books) field. What did I find?<p><i>Amazon UK</i><p>As you scroll down page 1 of the search results, you find examples of “brain cancer notebook” or “brain cancer journal”. 与该主题无关的空笔记本。<p><i>亚马逊美国</i><p>同样的搜索词。The search results were even worse. 没有内容 \"在搜索页的第一页排名甚至更高。<p>这是亚马逊英国和美国的搜索结果的截图：https://i.postimg.cc/JRDkSGRK/amazon-book-search。 jpg<p>尝试在亚马逊英国和美国的图书搜索 \"乌克兰战争\"，搜索结果中已经出现了 \"乌克兰战争 \"的空白笔记本，抓住了从战争中获利的机会（这些空白笔记本没有捐赠给慈善机构，他们只是抓住了关键词搜索）。<p>之所以有这么多的&quot;无内容&quot;笔记本污染图书类别，是因为亚马逊的Kindle Direct Publishing（KDP）服务：一种按需印刷服务。它为 \"低内容 \"或 \"无内容 \"的日记本和笔记本打开了闸门，允许创作者出版数百种笔记本。这些只是空的、有衬里的或空白的按需打印的笔记本。亚马逊将这些东西列入图书搜索结果，而不是将这些东西限制在它自己的搜索类别中。你可以在YouTube上找到数百个关于如何通过KDP出版 \"无内容 \"笔记本的视频，以及如何玩弄亚马逊搜索结果以获得更高的排名。<p>我知道亚马逊根本不在乎，但我不得不咆哮。我看到的结果可能是我反应过度了，如果你这么说，我不会生气的:-)",
  "description_zh-Hant": "In short: horrible.<p>I know this won't be new to most of you, but I wanted to share an anecdote (and a rant!)<p>I have a friend who has brain cancer. I went to Amazon searching for books on the subject and I typed ‘brain cancer’ in the search (books) field. What did I find?<p><i>Amazon UK</i><p>As you scroll down page 1 of the search results, you find examples of “brain cancer notebook” or “brain cancer journal”. 與該主題無關的空筆記本。<p><i>亞馬遜美國</i><p>同樣的搜索詞。The search results were even worse. 沒有內容 \"在搜索頁的第一頁排名甚至更高。<p>這是亞馬遜英國和美國的搜索結果的截圖：https://i.postimg.cc/JRDkSGRK/amazon-book-search。 jpg<p>嘗試在亞馬遜英國和美國的圖書搜索 \"烏克蘭戰爭\"，搜索結果中已經出現了 \"烏克蘭戰爭 \"的空白筆記本，抓住了從戰爭中獲利的機會（這些空白筆記本沒有捐贈給慈善機構，他們只是抓住了關鍵詞搜索）。<p>之所以有這麼多的&quot;無內容&quot;筆記本汙染圖書類別，是因為亞馬遜的Kindle Direct Publishing（KDP）服務：一種按需印刷服務。它為 \"低內容 \"或 \"無內容 \"的日記本和筆記本打開了閘門，允許創作者出版數百種筆記本。這些只是空的、有襯裡的或空白的按需打印的筆記本。亞馬遜將這些東西列入圖書搜索結果，而不是將這些東西限制在它自己的搜索類別中。你可以在YouTube上找到數百個關於如何通過KDP出版 \"無內容 \"筆記本的視頻，以及如何玩弄亞馬遜搜索結果以獲得更高的排名。<p>我知道亞馬遜根本不在乎，但我不得不咆哮。我看到的結果可能是我反應過度了，如果你這麼說，我不會生氣的:-)"
}