{
  "@type": "NewsArticle",
  "identifier": "2022--03--09--en--myfeed--HackerNews--NewsArticle--30610392",
  "url": "https://news.ycombinator.com/item?id=30610392",
  "headline": "What's Next for Rideshare",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello Hacker News! We’re Rudy &amp; Roby we are the founders of FURE (https://fure.cab/). We are full-stack rideshare advertising agency that provides real-time data on free rides, for feedback on ads shown while enroute. A new solution for advertisers to analyze live feedback of ads from 10 riders to 1 billion riders in 10 seconds.<p>Since its inception, the rideshare industry has become a problem for two primary groups. First, the security one of its primary stakeholder – the rider. The rider at all financial levels has become a victim of surge pricing, in-cab assaults, long waits, and the lack of standardized protection for the community. Second is the welfare of the human capital involved– the driver. The driver became a number, to the cost of being assaulted by a rider, to  market fuel costs and the cost of not having benefits to service by choice, or voice.<p>Today, people and media are constantly talking about the problems facing our industry. We believe the industry wasn’t built for the way it stands now, and the public will move to the best available option. And what we’re building is a new future of rideshare without the drama and complexities of the old. But build on new systems and services that benefits the public in ways that’s long term for every community to provide for its families and neighbors. A better future so we can move more, travel there, and be here.<p>The idea is simple, give the riders the options like to - pay or ride fure, identify their ride, and access to security. The same idea is applied to our drivers, give them the options to choose their status, their benefits, and their right to provide for their families. These aren’t just ideas but the fabric of who we are, our culture to support you, us, and everyone to create their futures. So, we built the features and benefits that helps both riders and drivers move them along the way.<p>Features born out of necessity.\nIdentification - CABeacon™ | Our dashboard display riders and the public can clearly see in any weather; have it wave to you by remote control or track &amp; match the PIN code in a sea of cars. (Industry 1st)<p>Security - CABvue™ | Our eyes on the road and in the cab, to help keep the peace and entertain your friends while you’re getting there. (Industry 1st)<p>Benefits born out of necessity.\n-Compensation - Cash or Crypto \n-Indie or Employee | Take home 90% or 80% of the fare or get paid based on your vehicle. \n-Opt In or Out – Health, Insurance, and Maintenance Plans\n__<p>How our toy works\nJust like any other rideshare user experience, pick a pickup and drop off, select a payment – fure ride or pay, picked fure ride, watch your chariot arrive, confirm and id each other, buckle up, and watch a few ads and answer the questions at the end of each one, once the ride is over, exit, leave a comment or tip and that’s it or try again. Note: If it didn’t work the second time, the third time is a charm.<p>Want to make toys\nBuilding the future is something you want to do, we’re here ready with a mission from home or from a remote office or here at HQ. Apply when you’re ready, we are. resume@fure.cab<p>How we got here\nCyan Banister put out a tweet to Reno, we took a massive chance to fly during a pandemic, meet her and pitch, and landed an offer from her on the spot.\n__<p>Rudy Ferraz – founder/biz dev, deaf family man, who likes cars, tech, dance, music, and the stars.\nlinkedin.com/in/rudyferraz, Rudyferraz.com, @rudyferraz<p>Roby Devassy – founder/tech, family man who likes tech, sports and quiet time.\nlinkedin.com/in/robertdevassy<p>https://fure.cab/\nDriver Wait list -http://bit.ly/FUREDriversSignupWaitList\nRiders Wait list -http://bit.ly/FURERidersWaitList\nYCombinator - https://www.startupschool.org/users/A5GA-06GE9h4Qw\nTwitter - https://twitter.com/furecab\nAngel - https://angel.co/company/fure-cab (RUV info DM us)\nr/ - https://www.reddit.com/r/fure_rideshare/\nCrunchBase - https://www.crunchbase.com/organization/fure",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "redstarpa",
    "url": "https://news.ycombinator.com/user?id=redstarpa"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30610392",
  "sameAs": "https://news.ycombinator.com/item?id=30610392",
  "dateCreated": "2022-03-09T03:01:59.732Z",
  "datePublished": "2022-03-09T02:52:31.000Z",
  "dateModified": "2022-03-09T03:01:59.732Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "共享汽车的下一步是什么",
  "headline_zh-Hant": "共享汽車的下一步是什麼",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，Hacker News! 我们是Rudy &amp; Roby我们是FURE（https://fure.cab/）的创始人。我们是全栈式骑行广告机构，提供免费骑行的实时数据，用于反馈途中显示的广告。为广告商提供一个新的解决方案，在10秒内分析从10名骑手到10亿名骑手的广告实时反馈。<p>自成立以来，骑行共享行业已经成为两个主要群体的问题。首先，其主要利益相关者的安全之一--骑手。各个经济层面的骑手已经成为激增定价、车内攻击、长时间等待和缺乏标准化的社会保护的受害者。其次是所涉及的人力资本--司机的福利。司机成了一个数字，到被乘客攻击的成本，到市场燃料成本和没有选择服务的好处，或声音的成本。<p>今天，人们和媒体不断谈论我们行业面临的问题。我们相信，这个行业不是为现在的方式而建立的，公众将转向最佳的可用选择。而我们正在建立的是一个新的共享汽车的未来，没有旧的戏剧性和复杂性。但建立在新的系统和服务上，使公众受益的方式，是每个社区为其家庭和邻居提供的长期的。一个更好的未来，使我们能够移动更多，在那里旅行，并在这里。<p>这个想法很简单，给乘客提供选择，如 - 支付或乘坐fure，识别他们的旅程，并获得安全。同样的想法也适用于我们的司机，让他们选择他们的身份、他们的福利和他们供养家庭的权利。这些不只是想法，而是我们的结构，我们的文化是支持你、我们和每个人创造他们的未来。因此，我们建立了一些功能和好处，帮助骑手和司机沿途前进。<p>功能诞生于必要之处。\n识别 - CABeacon™ | 我们的仪表板显示，骑手和公众在任何天气下都可以清楚地看到；通过远程控制或跟踪&amp向你招手；在茫茫车海中匹配PIN码。(行业第一)<p>安全 - CABvue™ | 我们在路上和驾驶室里的眼睛，帮助保持和平，并在你到达目的地时娱乐你的朋友。(行业第一)<p>因需要而产生的福利。\n-报酬 -现金或加密货币 \n独立或雇员 -将车费的90%或80%带回家，或根据你的车辆获得报酬。\n-选择加入或退出 - 健康、保险和维修计划\n<<p>我们的玩具如何运作\n               注意：如果第二次没有成功，第三次就会成功。<p>想做玩具\n建设未来是你想做的事情，我们在这里准备好了任务，从家里或远程办公室或在总部这里。resume@fure.cab<p>我们是如何来到这里的？\n赛恩-班尼斯特向里诺发出了一条推特，我们抓住了一个巨大的机会，在大流行期间飞行，与她见面并进行推介，并当场获得了她的邀请。\n<p>鲁迪-费拉兹（Rudy Ferraz）--创始人/企业发展，聋哑人家庭，喜欢汽车、技术、舞蹈、音乐和明星。\nlinkedin.com/in/rudyferraz, Rudyferraz.com, @rudyferraz<p>Roby Devassy - 创始人/技术，家庭主妇，喜欢技术、运动和安静的时间。\nlinkedin.com/in/robertdevassy<p>https://fure.cab/\n司机候补名单 -http://bit.ly/FUREDriversSignupWaitList\n骑手等候名单 -http://bit.ly/FURERidersWaitList\nYCombinator - https://www.startupschool.org/users/A5GA-06GE9h4Qw\n推特 - https://twitter.com/furecab\nAngel - https://angel.co/company/fure-cab (RUV信息DM us)\nr/ - https://www.reddit.com/r/fure_rideshare/\nCrunchBase - https://www.crunchbase.com/organization/fure",
  "description_zh-Hant": "你好，Hacker News! 我們是Rudy &amp; Roby我們是FURE（https://fure.cab/）的創始人。我們是全棧式騎行廣告機構，提供免費騎行的實時數據，用於反饋途中顯示的廣告。為廣告商提供一個新的解決方案，在10秒內分析從10名騎手到10億名騎手的廣告實時反饋。<p>自成立以來，騎行共享行業已經成為兩個主要群體的問題。首先，其主要利益相關者的安全之一--騎手。各個經濟層面的騎手已經成為激增定價、車內攻擊、長時間等待和缺乏標準化的社會保護的受害者。其次是所涉及的人力資本--司機的福利。司機成了一個數字，到被乘客攻擊的成本，到市場燃料成本和沒有選擇服務的好處，或聲音的成本。<p>今天，人們和媒體不斷談論我們行業面臨的問題。我們相信，這個行業不是為現在的方式而建立的，公眾將轉向最佳的可用選擇。而我們正在建立的是一個新的共享汽車的未來，沒有舊的戲劇性和複雜性。但建立在新的系統和服務上，使公眾受益的方式，是每個社區為其家庭和鄰居提供的長期的。一個更好的未來，使我們能夠移動更多，在那裡旅行，並在這裡。<p>這個想法很簡單，給乘客提供選擇，如 - 支付或乘坐fure，識別他們的旅程，並獲得安全。同樣的想法也適用於我們的司機，讓他們選擇他們的身份、他們的福利和他們供養家庭的權利。這些不只是想法，而是我們的結構，我們的文化是支持你、我們和每個人創造他們的未來。因此，我們建立了一些功能和好處，幫助騎手和司機沿途前進。<p>功能誕生於必要之處。\n識別 - CABeacon™ | 我們的儀表板顯示，騎手和公眾在任何天氣下都可以清楚地看到；通過遠程控制或跟蹤&amp向你招手；在茫茫車海中匹配PIN碼。(行業第一)<p>安全 - CABvue™ | 我們在路上和駕駛室裡的眼睛，幫助保持和平，並在你到達目的地時娛樂你的朋友。(行業第一)<p>因需要而產生的福利。\n-報酬 -現金或加密貨幣 \n獨立或僱員 -將車費的90%或80%帶回家，或根據你的車輛獲得報酬。\n-選擇加入或退出 - 健康、保險和維修計劃\n<<p>我們的玩具如何運作\n               注意：如果第二次沒有成功，第三次就會成功。<p>想做玩具\n建設未來是你想做的事情，我們在這裡準備好了任務，從家裡或遠程辦公室或在總部這裡。resume@fure.cab<p>我們是如何來到這裡的？\n賽恩-班尼斯特向裡諾發出了一條推特，我們抓住了一個巨大的機會，在大流行期間飛行，與她見面並進行推介，並當場獲得了她的邀請。\n<p>魯迪-費拉茲（Rudy Ferraz）--創始人/企業發展，聾啞人家庭，喜歡汽車、技術、舞蹈、音樂和明星。\nlinkedin.com/in/rudyferraz, Rudyferraz.com, @rudyferraz<p>Roby Devassy - 創始人/技術，家庭主婦，喜歡技術、運動和安靜的時間。\nlinkedin.com/in/robertdevassy<p>https://fure.cab/\n司機候補名單 -http://bit.ly/FUREDriversSignupWaitList\n騎手等候名單 -http://bit.ly/FURERidersWaitList\nYCombinator - https://www.startupschool.org/users/A5GA-06GE9h4Qw\n推特 - https://twitter.com/furecab\nAngel - https://angel.co/company/fure-cab (RUV信息DM us)\nr/ - https://www.reddit.com/r/fure_rideshare/\nCrunchBase - https://www.crunchbase.com/organization/fure"
}