{
  "@type": "NewsArticle",
  "identifier": "2022--04--09--en--myfeed--HackerNews--NewsArticle--30968817",
  "url": "https://news.ycombinator.com/item?id=30968817",
  "headline": "Found it now, or wait until being more experienced",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey everyone, I believe I'm in a unique situation, and therefore I feel the need for sharing my backstory.\nTL;DR: Should I jump ship to launch an idea of mine, or wait until I saw more?\nI'm relatively young, nearing the end of my teenage years. I've been working as a full-stack software developer for more than a year, where I've learned an incredible amount owing to the excellent internal mentoring. I'm also attending my high school &quot;on the side&quot;, and simultaneously also have a decent income. Currently I'm living in a noname place with little to no IT industry/startup ecosystem. Yet, as I'll be attending university, I'll also move close to a major tech hub in 1.5 years.\nOn the other hand, I participated in a half-year program aimed at my age group, which had the goal of familiarizing my generation with entrepreneurship and startups. We worked out many details of a promising idea (I'm aware - who doesn't say that their idea is promising?), and based on the validation we've done, the business might have legs.\nOur/my obvious choice was to abandon the idea, yet there are voices attempting to convince me to continue working on it, as it can give me a competitive edge on the future, especially if we gain some traction. On the flip side, I'd prefer playing the &quot;long-game&quot; and waiting 3-4 years.\nCons:\n- If 11 out of 12 startups fail on average, odds are already bad. Besides, there are also other factors. I'm rather inexperienced (~1 year), many are discriminating me negatively due to age. Finding good co-founders locally is also challenging.\n- I'm better off gaining some experience first (3-5 years), and then starting something at a tech hub. Significantly bigger talent pool, more support, tons of capital, enormous community.\n- Sure, I won't have this particular idea, but I might have new ones, and even if I don't, as a technical co-founder I'll have the opportunity to choose from other ideas craving for a technical person.\n- If I pursued the idea right now, I'm well aware that I wouldn't stop at 30-40h/week. Owing to this, my workload would increase, leading to the negligence of my other responsibilities (social life, studies).\n- Currently I'm saving for university, which means that I'll be able to afford better universities than I normally would access to.\n- I have plenty of opportunities while maintaining the status quo and working. Eg. getting involved in &quot;research&quot; at a university, participating in the local ecosystem, pitching at competitions just for the sake of practice.<p>Pros:\n- Even if the idea fails, I'll learn an incredible amount, which gives me a competitive edge and will also increase my chances of succeeding later.\n- I'll find reasons later too why I should not pursue something on my own, and it won't get easier (family, living, loans).\n- My age will give me a competitive edge as I'll be often judged based on my future potential.\n- I have a &quot;safety net&quot; that can catch me when failing/falling.\n- I'll have plenty of time to work during my life.\nMany other arguments were rather ambiguous and emotional, and were based on the fact that the other people were older and allegedly had more experience, which ought to have compensated for the lack of rational reasoning. Being an aspiring rationalist, this is as big of a red flag as it could be, still, I'm also open to hearing that I'm being overly rational.\nI'm advocating for delaying launching something on my own, still, I'm trying to be as open-minded as possible. The question is: would you maintain the status quo with some extras, or jump without and figure out how to open the parachute while falling. New perspectives and arguments are welcome too! ;)\nI've also thought about involving two or three co-founders to launch the product, while I keeping an advisory position for significantly less equity (think of 5-10%). This doesn't appear viable, hence I'm curious about other such alternatives.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "bagelowl",
    "url": "https://news.ycombinator.com/user?id=bagelowl"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30968817",
  "sameAs": "https://news.ycombinator.com/item?id=30968817",
  "dateCreated": "2022-04-09T15:45:03.935Z",
  "datePublished": "2022-04-09T15:22:09.000Z",
  "dateModified": "2022-04-09T15:45:03.935Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "现在找到了，还是等到更有经验的时候再找吧",
  "headline_zh-Hant": "現在找到了，還是等到更有經驗的時候再找吧",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，我相信我的情况很特殊，因此我觉得有必要分享我的背景故事。\nTL;DR：我是应该跳槽来推出我的一个想法，还是等到我看到更多的东西？\n我比较年轻，接近青少年时期的尾声。我已经做了一年多的全栈软件开发人员，由于有优秀的内部指导，我在那里学到了很多东西。我还在上我的高中，同时也有一份体面的收入。目前，我住在一个几乎没有IT行业/初创企业生态系统的非著名地方。然而，由于我将上大学，我也将在1.5年内搬到一个主要的科技中心附近。\n另一方面，我参加了一个针对我这个年龄段的半年期项目，其目的是让我们这一代人熟悉创业和初创企业。我们为一个有前途的想法制定了许多细节（我知道--谁不说自己的想法有前途呢？），根据我们所做的验证，这个业务可能有腿。\n我们/我的明显选择是放弃这个想法，然而有一些声音试图说服我继续努力，因为它可以给我带来未来的竞争优势，特别是如果我们获得一些牵引力。从另一个角度看，我更喜欢玩 \"长期游戏\"，等待3-4年。\n弊端。\n- 如果12家创业公司中平均有11家失败，那么几率已经很低了。此外，还有其他因素。我的经验不足（1年），许多人因为年龄而对我有偏见。在当地找到好的联合创始人也是一个挑战。\n- 我最好先积累一些经验（3-5年），然后在一个技术中心开始工作。巨大的人才库，更多的支持，大量的资金，巨大的社区。\n- 当然，我不会有这个特定的想法，但我可能会有新的想法，即使我没有，作为一个技术联合创始人，我将有机会从其他渴望得到技术人员的想法中选择。\n- 如果我现在追求这个想法，我很清楚，我不会停留在30-40小时/周。因此，我的工作量会增加，导致我忽略了其他的责任（社会生活、学习）。\n- 目前，我正在为大学存钱，这意味着我将能够负担得起比我通常情况下能进入的更好的大学。\n- 在保持现状和工作的同时，我有很多机会。例如，参与大学的&quot;研究&quot;，参与当地的生态系统，在比赛中投球，只是为了练习。<p>优点。\n- 即使这个想法失败了，我也会学到很多东西，这让我有了竞争优势，也会增加我以后成功的机会。\n- 我以后也会找到理由，为什么我不应该自己去追求一些东西，而且这不会变得更容易（家庭、生活、贷款）。\n- 我的年龄会给我带来竞争优势，因为人们经常会根据我未来的潜力来判断我。\n- 我有一个&quot;安全网&quot;，可以在失败/跌倒时抓住我。\n- 在我的一生中，我将有足够的时间来工作。\n其他许多论点都相当含糊和情绪化，而且是基于这样一个事实，即其他人年龄更大，据称有更多的经验，这应该可以弥补理性推理的不足。作为一个有抱负的理性主义者，这是一个尽可能大的红旗，尽管如此，我也愿意听到我过于理性的说法。\n我主张推迟推出我自己的东西，仍然，我试图尽可能地保持开放的心态。问题是：你会用一些额外的东西来维持现状，还是在没有的情况下跳下去，并在下落时想办法打开降落伞。我们也欢迎新的观点和争论！;)\n我也想过让两三个联合创始人参与推出产品，而我保留一个顾问职位，但股权要少得多（考虑5-10％）。这似乎并不可行，因此我对其他此类替代方案感到好奇。",
  "description_zh-Hant": "大家好，我相信我的情況很特殊，因此我覺得有必要分享我的背景故事。\nTL;DR：我是應該跳槽來推出我的一個想法，還是等到我看到更多的東西？\n我比較年輕，接近青少年時期的尾聲。我已經做了一年多的全棧軟件開發人員，由於有優秀的內部指導，我在那裡學到了很多東西。我還在上我的高中，同時也有一份體面的收入。目前，我住在一個幾乎沒有IT行業/初創企業生態系統的非著名地方。然而，由於我將上大學，我也將在1.5年內搬到一個主要的科技中心附近。\n另一方面，我參加了一個針對我這個年齡段的半年期項目，其目的是讓我們這一代人熟悉創業和初創企業。我們為一個有前途的想法制定了許多細節（我知道--誰不說自己的想法有前途呢？），根據我們所做的驗證，這個業務可能有腿。\n我們/我的明顯選擇是放棄這個想法，然而有一些聲音試圖說服我繼續努力，因為它可以給我帶來未來的競爭優勢，特別是如果我們獲得一些牽引力。從另一個角度看，我更喜歡玩 \"長期遊戲\"，等待3-4年。\n弊端。\n- 如果12家創業公司中平均有11家失敗，那麼幾率已經很低了。此外，還有其他因素。我的經驗不足（1年），許多人因為年齡而對我有偏見。在當地找到好的聯合創始人也是一個挑戰。\n- 我最好先積累一些經驗（3-5年），然後在一個技術中心開始工作。巨大的人才庫，更多的支持，大量的資金，巨大的社區。\n- 當然，我不會有這個特定的想法，但我可能會有新的想法，即使我沒有，作為一個技術聯合創始人，我將有機會從其他渴望得到技術人員的想法中選擇。\n- 如果我現在追求這個想法，我很清楚，我不會停留在30-40小時/周。因此，我的工作量會增加，導致我忽略了其他的責任（社會生活、學習）。\n- 目前，我正在為大學存錢，這意味著我將能夠負擔得起比我通常情況下能進入的更好的大學。\n- 在保持現狀和工作的同時，我有很多機會。例如，參與大學的&quot;研究&quot;，參與當地的生態系統，在比賽中投球，只是為了練習。<p>優點。\n- 即使這個想法失敗了，我也會學到很多東西，這讓我有了競爭優勢，也會增加我以後成功的機會。\n- 我以後也會找到理由，為什麼我不應該自己去追求一些東西，而且這不會變得更容易（家庭、生活、貸款）。\n- 我的年齡會給我帶來競爭優勢，因為人們經常會根據我未來的潛力來判斷我。\n- 我有一個&quot;安全網&quot;，可以在失敗/跌倒時抓住我。\n- 在我的一生中，我將有足夠的時間來工作。\n其他許多論點都相當含糊和情緒化，而且是基於這樣一個事實，即其他人年齡更大，據稱有更多的經驗，這應該可以彌補理性推理的不足。作為一個有抱負的理性主義者，這是一個儘可能大的紅旗，儘管如此，我也願意聽到我過於理性的說法。\n我主張推遲推出我自己的東西，仍然，我試圖儘可能地保持開放的心態。問題是：你會用一些額外的東西來維持現狀，還是在沒有的情況下跳下去，並在下落時想辦法打開降落傘。我們也歡迎新的觀點和爭論！;)\n我也想過讓兩三個聯合創始人參與推出產品，而我保留一個顧問職位，但股權要少得多（考慮5-10％）。這似乎並不可行，因此我對其他此類替代方案感到好奇。"
}