{
  "@type": "NewsArticle",
  "identifier": "2022--03--21--en--myfeed--HackerNews--NewsArticle--30758436",
  "url": "https://news.ycombinator.com/item?id=30758436",
  "headline": "Tell HN: Don't Leak Infinite Value",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "In these trying times where everyone reads the tea leaves for the next big thing, it is tempting to leak sources of value wherever they may be, the more valuable, the better: this is a mistake.<p>There are many reasons why people are excited to leak as much value as they can get their hands on, but I want to concentrate on just one: the tax implications.<p>At the London School of Economics, I learned to analyze annual financial reports, as well as balance sheets.  Balance sheets by companies include assets both tangible and intangible.  A company's IP portfolio, for example, is considered an intangible asset.<p>When someone books value, they owe taxes on it.  This can be deferred for some time, there are actually historical examples of valuable insights that did not receive any market valuation until hundreds of years after their authors' deaths.<p>Da Vinci's helicopter is such an example:<p>https://commons.wikimedia.org/wiki/File:Leonardo_da_Vinci_helicopter.jpg<p>Imagine if he had been forced to pay taxes on it as soon as he committed the idea to paper!  A single helicopter costs an average of about a million dollars today, and in 2019, the global helicopter market size was over 48 billion U.S. dollars. Da Vinci's lifetime earnings were 3.75m or so.  If he had been forced to pay a reasonable tax on his invention (for example if it had been leaked), such as 30% or 40% he would have been in debtor's prison for his entire life.<p>There would be no Mona Lisa.<p>There would be no Sistine Chapel.<p>There would be no Last Supper.<p>He probably wouldn't have even gotten a last supper.<p>These days helicopters are on my mind because helicopter motors are one of Ukraine's largest exports, and a key reason for Russia to want to conquer them.<p>As I think of all that value, the one thing that is on my mind is:<p>-&gt; Don't leak value.<p>It can mean life or death for someone the world can look back on 400 years later.  Not everyone has to be Da Vinci.  You can also be famous as a sponsor, like the Medici.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "logicallee",
    "url": "https://news.ycombinator.com/user?id=logicallee"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30758436",
  "sameAs": "https://news.ycombinator.com/item?id=30758436",
  "dateCreated": "2022-03-21T19:49:50.409Z",
  "datePublished": "2022-03-21T19:14:06.000Z",
  "dateModified": "2022-03-21T19:49:50.409Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "告诉HN：不要泄露无限的价值",
  "headline_zh-Hant": "告訴HN：不要洩露無限的價值",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在这个人人都在阅读下一个大事件的茶叶的艰难时期，人们很想泄露价值来源，无论它们在哪里，价值越大越好：这是一个错误。<p>人们兴奋地泄露他们能够得到的价值的原因有很多，但我只想专注于一个原因：税收影响。<p>在伦敦经济学院，我学会分析年度财务报告，以及资产负债表。 公司的资产负债表包括有形和无形的资产。 例如，一个公司的知识产权组合被认为是一种无形资产。<p>当有人记账的时候，他们就会欠税。 这可以推迟一段时间，实际上有一些有价值的见解的历史例子，直到作者死后数百年才得到任何市场估值。<p>达芬奇的直升机就是这样一个例子：<p>https://commons.wikimedia.org/wiki/File:Leonardo_da_Vinci_helicopter.jpg<p>想象一下，如果他一把想法写在纸上，就被迫为它纳税！ 今天，一架直升机的平均成本约为一百万美元，2019年，全球直升机市场规模超过480亿美元。达芬奇一生的收入是375万左右。 如果他被迫为他的发明支付合理的税款（例如，如果它被泄露了），如30%或40%，他将在债务人监狱中度过一生。<p>就没有蒙娜丽莎。<p>就没有西斯廷教堂。<p>就没有最后的晚餐。<p>他可能连最后的晚餐都没有了。 <p>这些天，直升机在我的脑海里，因为直升机马达是乌克兰最大的出口产品之一，也是俄罗斯想要征服他们的一个重要原因。<p>当我想到所有这些价值时，我脑海里的一件事是：<p>-&gt; 不要泄漏价值。<p>对于世界在400年后可以回顾的人，它可能意味着生命或死亡。 不是每个人都必须成为达芬奇。 你也可以像美第奇家族那样，以赞助商的身份出名。",
  "description_zh-Hant": "在這個人人都在閱讀下一個大事件的茶葉的艱難時期，人們很想洩露價值來源，無論它們在哪裡，價值越大越好：這是一個錯誤。<p>人們興奮地洩露他們能夠得到的價值的原因有很多，但我只想專注於一個原因：稅收影響。<p>在倫敦經濟學院，我學會分析年度財務報告，以及資產負債表。 公司的資產負債表包括有形和無形的資產。 例如，一個公司的知識產權組合被認為是一種無形資產。<p>當有人記賬的時候，他們就會欠稅。 這可以推遲一段時間，實際上有一些有價值的見解的歷史例子，直到作者死後數百年才得到任何市場估值。<p>達芬奇的直升機就是這樣一個例子：<p>https://commons.wikimedia.org/wiki/File:Leonardo_da_Vinci_helicopter.jpg<p>想象一下，如果他一把想法寫在紙上，就被迫為它納稅！ 今天，一架直升機的平均成本約為一百萬美元，2019年，全球直升機市場規模超過480億美元。達芬奇一生的收入是375萬左右。 如果他被迫為他的發明支付合理的稅款（例如，如果它被洩露了），如30%或40%，他將在債務人監獄中度過一生。<p>就沒有蒙娜麗莎。<p>就沒有西斯廷教堂。<p>就沒有最後的晚餐。<p>他可能連最後的晚餐都沒有了。 <p>這些天，直升機在我的腦海裡，因為直升機馬達是烏克蘭最大的出口產品之一，也是俄羅斯想要征服他們的一個重要原因。<p>當我想到所有這些價值時，我腦海裡的一件事是：<p>-&gt; 不要洩漏價值。<p>對於世界在400年後可以回顧的人，它可能意味著生命或死亡。 不是每個人都必須成為達芬奇。 你也可以像美第奇家族那樣，以贊助商的身份出名。"
}