{
  "@type": "NewsArticle",
  "identifier": "2022--04--06--en--myfeed--HackerNews--NewsArticle--30936488",
  "url": "https://news.ycombinator.com/item?id=30936488",
  "headline": "Show HN: Squads – Social Trading for Web3",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "hey hey! I'm the co-founder of squads -- a product that makes it easy to see what your friends and top investors are doing in web3.<p>This product was developed out my own frustration trying to get more involved in web3. One of the greatest challenges in the crypto space is figuring out where to start. For some of us, we're lucky to have a friend who can serve as a guide, and we wanted to build a product that would make introducing your friends to crypto a more inviting experience.<p>There is so much alpha and information living on Twitter + Discord, but the problem is finding the signal from the noise. With Squads, you don't have to sift through all of the noise -- you can see what the best players in the space are doing the moment they do it.<p>In fact, we have pre-seeded the product with a squad of a16z investors, BAYC holders, and a group of well known twitter profiles so you can get a taste of what the squad structure is like.<p>With this product, you don't have to sit in hundreds of discords and become inundated with notifications. Instead, you can follow who you think is interesting, and see a feed of their activity all in one place.<p>Some quick product highlights: \n- Social layer for web3 -- create a squad and share the invite link with your friends or anyone else. We took inspiration from discord for the invitation flow, try it out!<p>- Web3 Feed: see what activity is taking place in any of your squads, or from individual wallets that you follow<p>- Profile Page: Showcase all of your digital assets, and your performance, all in one place<p>- Social Graph: Follow your friends or favorite people on the blockchain<p>- Search: Search for any wallet address or ens domain<p>- Returns: See how profitable an individual is in flipping tokens or NFTs",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "tayloradler",
    "url": "https://news.ycombinator.com/user?id=tayloradler"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30936488",
  "sameAs": "https://beta.squads.xyz",
  "dateCreated": "2022-04-06T19:50:09.089Z",
  "datePublished": "2022-04-06T19:31:02.000Z",
  "dateModified": "2022-04-06T19:50:09.089Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "Show HN: 小队--Web3的社会交易",
  "headline_zh-Hant": "Show HN: 小隊--Web3的社會交易",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿嘿！我是squads的联合创始人。我是squads的联合创始人 -- 这个产品可以让你很容易地看到你的朋友和顶级投资者在web3中做什么。<p>这个产品的开发是出于我自己试图更多地参与web3的挫折感。在加密货币领域，最大的挑战之一是弄清楚从哪里开始。对于我们中的一些人来说，我们很幸运，有一个朋友可以作为向导，我们想建立一个产品，使你的朋友介绍加密货币成为一个更有吸引力的经验。<p>在Twitter + Discord上有这么多的阿尔法和信息，但问题是在噪音中找到信号。有了Squads，你不必筛选所有的噪音--你可以看到该领域最好的玩家在做什么。<p>事实上，我们已经在产品中预先加入了一个由a16z投资者、BAYC持有人和一群知名的twitter简介组成的小队，所以你可以尝到小队结构是什么样的。相反，你可以关注你认为有趣的人，并在一个地方看到他们的活动信息。<p>一些快速的产品亮点。\n- Web3的社交层--创建一个小队，并与你的朋友或其他人分享邀请链接。我们从discord的邀请流程中获得了灵感，试试吧！<p>- Web3馈送：查看你的任何团队或你关注的个人钱包正在进行的活动<p>- 简介页面。展示你所有的数字资产，以及你的表现，都在一个地方<p>- 社交图表。在区块链上关注你的朋友或喜欢的人<p>- 搜索。搜索任何钱包地址或sens域名<p>- 回报。查看个人在炒作代币或NFT方面的获利情况",
  "description_zh-Hant": "嘿嘿！我是squads的聯合創始人。我是squads的聯合創始人 -- 這個產品可以讓你很容易地看到你的朋友和頂級投資者在web3中做什麼。<p>這個產品的開發是出於我自己試圖更多地參與web3的挫折感。在加密貨幣領域，最大的挑戰之一是弄清楚從哪裡開始。對於我們中的一些人來說，我們很幸運，有一個朋友可以作為嚮導，我們想建立一個產品，使你的朋友介紹加密貨幣成為一個更有吸引力的經驗。<p>在Twitter + Discord上有這麼多的阿爾法和信息，但問題是在噪音中找到信號。有了Squads，你不必篩選所有的噪音--你可以看到該領域最好的玩家在做什麼。<p>事實上，我們已經在產品中預先加入了一個由a16z投資者、BAYC持有人和一群知名的twitter簡介組成的小隊，所以你可以嚐到小隊結構是什麼樣的。相反，你可以關注你認為有趣的人，並在一個地方看到他們的活動信息。<p>一些快速的產品亮點。\n- Web3的社交層--創建一個小隊，並與你的朋友或其他人分享邀請鏈接。我們從discord的邀請流程中獲得了靈感，試試吧！<p>- Web3饋送：查看你的任何團隊或你關注的個人錢包正在進行的活動<p>- 簡介頁面。展示你所有的數字資產，以及你的表現，都在一個地方<p>- 社交圖表。在區塊鏈上關注你的朋友或喜歡的人<p>- 搜索。搜索任何錢包地址或sens域名<p>- 回報。查看個人在炒作代幣或NFT方面的獲利情況"
}