{
  "@type": "NewsArticle",
  "identifier": "2022--03--08--en--myfeed--HackerNews--NewsArticle--30598947",
  "url": "https://news.ycombinator.com/item?id=30598947",
  "headline": "I'm a full stack developer and I can't workout how to package my experience",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've got a lot of experience in a lot of different types of development. (I regularly write in Python, JavaScript and C#, and sometimes in Kotlin, Swift, PHP etc... I have never run a big Kafka/Hadoop cluster or some high performance system in akka/erlang. Or writen enough lisp). I'm pro relational database, less so no-sql unless a good fit. I like JSON fields. Prefer redis to speed things up.<p>I've built huge web platforms and worked in almost every frontend framework. Plus about 10 years on and off Unity experience.<p>I run a small agency on my own and get on well with a number of clients.<p>However, it's immensely difficult to get a handle on it all, a lot of the projects I do are &quot;difficult&quot; ie require a range of skillsets that I'd struggle to find a single developer to cover all the bases.<p>I can't work out, what if anything, if I was to try to become &quot;more sensible&quot; what I would restrict myself to in order to stop streching myself so thinnly across so many different technologies and enviroments.<p>My first job for 4-5 years was managing teams of 10-20 as a Technical Project Manager, and I moved into seriously delivering the technology over the last 10.<p>I feel like the answer is to provide a much bulkier up front process (planning / design / ux) in order to grow the value of the work I do, but I've kind of specialised myself in doing the development work as quickly and cost effectively as possible. Obivously that means sometimes there are problems, but in general, as I've delivered so quickly, I'm still about 10x under market rate. And I don't feel it's my world to do design/ux.<p>I have regardly been involved in RapidStarts. ie 2 day hackathons where I delvier a working protype ready for presentation to CEO/CTO level people, and have generally shone in these situations.<p>Working like this is breaking me though, so I'd like to sensibly move to something else or start doing things differently.<p>Perhaps it is just working in a job or working as a day rate contractor? Or selling my business/skills differently.<p>If I was to get a job, what role should I aim for?<p>Any thoughts appreicated!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "chrisbarry",
    "url": "https://news.ycombinator.com/user?id=chrisbarry"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30598947",
  "sameAs": "https://news.ycombinator.com/item?id=30598947",
  "dateCreated": "2022-03-08T12:14:58.464Z",
  "datePublished": "2022-03-08T11:56:37.000Z",
  "dateModified": "2022-03-08T12:14:58.464Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "我是一个全栈开发人员，我不能锻炼如何包装我的经验",
  "headline_zh-Hant": "我是一個全棧開發人員，我不能鍛鍊如何包裝我的經驗",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在很多不同类型的发展中都有很多经验。(我经常用Python、JavaScript和C#写作，有时也用Kotlin、Swift、PHP等。我从来没有在akka/erlang中运行过一个大的Kafka/Hadoop集群或一些高性能的系统。或者写够lisp）。我支持关系型数据库，不那么支持no-sql，除非是很适合。我喜欢JSON字段。<p>我已经建立了巨大的网络平台，并在几乎所有的前端框架中工作。<p>我自己经营着一家小公司，并与许多客户相处融洽。<p>然而，要掌握这一切是非常困难的，我做的许多项目都是&quot;困难&quot;，即需要一系列的技能，我很难找到一个单一的开发人员来覆盖所有的基础。 <p>我想不出来，如果我想变得更理智的话，我应该把自己限制在什么范围内，以避免在这么多不同的技术和环境中把自己搞得如此单薄。 <p>我的第一份工作是作为技术项目经理管理10-20人的团队，而在过去的10年里，我开始认真地交付技术。<p>我觉得答案是提供更多的前期流程（规划/设计/用户体验），以提高我所做工作的价值，但我已经有点专门做开发工作，尽可能快地和成本效益。显然，这意味着有时会出现问题，但总的来说，由于我交付的速度很快，我仍然比市场价格低10倍左右。<p>我曾参与过RapidStarts，即为期2天的黑客活动，在这些活动中，我为CEO/CTO级别的人准备了一个工作原型，并在这些情况下大放异彩。<p>但这样的工作方式让我崩溃，所以我想理智地转到其他方面，或开始做不同的事情。<p>如果我找到一份工作，我应该以什么角色为目标？<p>任何想法都值得赞赏！</p> <p>如果我找到一份工作，我应该以什么角色为目标？",
  "description_zh-Hant": "我在很多不同類型的發展中都有很多經驗。(我經常用Python、JavaScript和C#寫作，有時也用Kotlin、Swift、PHP等。我從來沒有在akka/erlang中運行過一個大的Kafka/Hadoop集群或一些高性能的系統。或者寫夠lisp）。我支持關係型數據庫，不那麼支持no-sql，除非是很適合。我喜歡JSON字段。<p>我已經建立了巨大的網絡平臺，並在幾乎所有的前端框架中工作。<p>我自己經營著一家小公司，並與許多客戶相處融洽。<p>然而，要掌握這一切是非常困難的，我做的許多項目都是&quot;困難&quot;，即需要一系列的技能，我很難找到一個單一的開發人員來覆蓋所有的基礎。 <p>我想不出來，如果我想變得更理智的話，我應該把自己限制在什麼範圍內，以避免在這麼多不同的技術和環境中把自己搞得如此單薄。 <p>我的第一份工作是作為技術項目經理管理10-20人的團隊，而在過去的10年裡，我開始認真地交付技術。<p>我覺得答案是提供更多的前期流程（規劃/設計/用戶體驗），以提高我所做工作的價值，但我已經有點專門做開發工作，儘可能快地和成本效益。顯然，這意味著有時會出現問題，但總的來說，由於我交付的速度很快，我仍然比市場價格低10倍左右。<p>我曾參與過RapidStarts，即為期2天的黑客活動，在這些活動中，我為CEO/CTO級別的人準備了一個工作原型，並在這些情況下大放異彩。<p>但這樣的工作方式讓我崩潰，所以我想理智地轉到其他方面，或開始做不同的事情。<p>如果我找到一份工作，我應該以什麼角色為目標？<p>任何想法都值得讚賞！</p> <p>如果我找到一份工作，我應該以什麼角色為目標？"
}