{
  "@type": "NewsArticle",
  "identifier": "2022--03--06--en--myfeed--HackerNews--NewsArticle--30581119",
  "url": "https://news.ycombinator.com/item?id=30581119",
  "headline": "Why Satellite links will become Ukraine’s primary weapon",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Not everyone knows where Ukraine is or how big it is. Geographically it’s wedged between Poland to its North West and the Black Sea to the South. Russia is on its Eastern flank. \nAnd Ukraine is big. Were it a US State it would rank number 3, just behind Texas but well ahead of California.<p>The Soviet Union has tried invading a similar sized country before and retreated in defeat 10 years later. Afghanistan shares a common border with Russia and crossing the border in 1979 was probably the only easy part of that protracted war. That invasion did have a pretext though: supporting Afghanistan’s Communist puppet regime. This conflict has no pretext: it’s simply a land-grab.<p>With a land mass of this size, the invader can close-down local TV, internet, phone lines and mobile masts but can’t control the vast majority of the country or what’s in the sky hundreds of miles above; and for most of Ukraine, satellite communication is the only means of exchanging information. Battlefield communications use a combination of localised and satellite links as these are the most resilient, but 40-odd years on from Afghanistan, locals can now have access to the same resilient comms.<p>That’s a game changer because now voice, video, text and pics can all be uploaded by just about anyone in the battlefield with an ease unprecedented in any war; and as with any satellite communication it’s almost impossible to detect at ground level, giving a distinct advantage to the locals.<p>If Russians remain Ukraine-wide, they’re going to have major challenges on at least two fronts: managing so large a country as an occupying force and winning the hearts and minds of the remaining Ukrainians. There’s also the none too trivial matter of paying for it all as financial sanctions begin to bite. This time around it’s the hearts and minds issue that will take centre stage as Ukraine has the digital means to refute any spinning of any Ukraine related content that the Russians may put out.<p>If the Russians stay, the skill base of young Ukrainians in particular is going to be decisive in foreshortening the occupation. They’re very tech savvy, talented creatively and they’ll be bursting to throw the Russians out. They won’t be using hand grenades or Molotov cocktails; instead, they’ll be blogging, posting and hacking. Their targets will be Ukrainian infrastructure that Russians now control, military communications of the old school type (much easier to hack) and Russians on the ground who are wondering why they’re there. They’ll be the target of one of the most intensive reverse propaganda campaigns ever mounted and it will all be done via satellite.<p>The invasion may have been started by boots and tanks on the ground, but it will be ended by young Ukrainians fingers and keyboards connected together far above the sky.<p>@DewhurstLeslie",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "LeslieDewhurst",
    "url": "https://news.ycombinator.com/user?id=LeslieDewhurst"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30581119",
  "sameAs": "https://news.ycombinator.com/item?id=30581119",
  "dateCreated": "2022-03-06T20:49:56.155Z",
  "datePublished": "2022-03-06T20:48:31.000Z",
  "dateModified": "2022-03-06T20:49:56.155Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "为什么卫星链接将成为乌克兰的主要武器",
  "headline_zh-Hant": "為什麼衛星鏈接將成為烏克蘭的主要武器",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "不是每个人都知道乌克兰在哪里，或者它有多大。在地理上，它被夹在西北边的波兰和南边的黑海之间。俄罗斯在其东侧。\n而且乌克兰很大。如果它是美国的一个州，它将排名第三，仅次于德克萨斯州，但远远超过加利福尼亚州。<p>苏联曾经试图入侵一个类似规模的国家，并在10年后败退。阿富汗与俄罗斯有共同的边界，1979年跨越边界可能是那场旷日持久的战争中唯一容易的部分。但那次入侵确实有一个借口：支持阿富汗的共产主义傀儡政权。这场冲突没有任何借口：它只是一场土地掠夺。<p>在这么大的土地上，入侵者可以关闭当地的电视、互联网、电话线和移动信号塔，但无法控制全国绝大多数地区，也无法控制数百英里外的天空；对于乌克兰大部分地区来说，卫星通信是交换信息的唯一途径。战场通信使用本地和卫星链接的组合，因为这些链接是最有弹性的，但从阿富汗到现在40多年了，当地人现在可以获得同样有弹性的通信。<p>这是一个游戏规则的改变，因为现在语音、视频、文本和图片都可以由战场上的任何人上传，其轻松程度在任何战争中都是前所未有的；而且与任何卫星通信一样，在地面上几乎不可能被发现，给当地人带来明显优势。 <p>如果俄罗斯人继续留在乌克兰全境，他们将在至少两个方面面临重大挑战：作为占领军管理这么大一个国家，以及赢得剩余乌克兰人的心。此外，随着金融制裁的开始，还有一个不小的问题，那就是支付这一切。这一次，人心问题将占据中心位置，因为乌克兰有数字手段来驳斥俄罗斯人可能发布的任何与乌克兰有关的内容。<p>如果俄罗斯人留下来，特别是乌克兰年轻人的技能基础将对缩短占领期起到决定性作用。他们非常精通技术，具有创造性的才能，他们会急于把俄罗斯人赶出去。他们不会使用手榴弹或燃烧弹；相反，他们会写博客、发帖和黑客攻击。他们的目标将是俄罗斯人现在控制的乌克兰基础设施、老式的军事通信（更容易被黑）以及在当地想知道他们为什么在那里的俄罗斯人。他们将成为有史以来最密集的反向宣传活动之一的目标，而这一切都将通过卫星完成。<p>入侵可能是由地面上的靴子和坦克开始的，但它将由年轻的乌克兰人的手指和键盘连接起来在天空之上结束。",
  "description_zh-Hant": "不是每個人都知道烏克蘭在哪裡，或者它有多大。在地理上，它被夾在西北邊的波蘭和南邊的黑海之間。俄羅斯在其東側。\n而且烏克蘭很大。如果它是美國的一個州，它將排名第三，僅次於德克薩斯州，但遠遠超過加利福尼亞州。<p>蘇聯曾經試圖入侵一個類似規模的國家，並在10年後敗退。阿富汗與俄羅斯有共同的邊界，1979年跨越邊界可能是那場曠日持久的戰爭中唯一容易的部分。但那次入侵確實有一個藉口：支持阿富汗的共產主義傀儡政權。這場衝突沒有任何藉口：它只是一場土地掠奪。<p>在這麼大的土地上，入侵者可以關閉當地的電視、互聯網、電話線和移動信號塔，但無法控制全國絕大多數地區，也無法控制數百英里外的天空；對於烏克蘭大部分地區來說，衛星通信是交換信息的唯一途徑。戰場通信使用本地和衛星鏈接的組合，因為這些鏈接是最有彈性的，但從阿富汗到現在40多年了，當地人現在可以獲得同樣有彈性的通信。<p>這是一個遊戲規則的改變，因為現在語音、視頻、文本和圖片都可以由戰場上的任何人上傳，其輕鬆程度在任何戰爭中都是前所未有的；而且與任何衛星通信一樣，在地面上幾乎不可能被發現，給當地人帶來明顯優勢。 <p>如果俄羅斯人繼續留在烏克蘭全境，他們將在至少兩個方面面臨重大挑戰：作為佔領軍管理這麼大一個國家，以及贏得剩餘烏克蘭人的心。此外，隨著金融制裁的開始，還有一個不小的問題，那就是支付這一切。這一次，人心問題將佔據中心位置，因為烏克蘭有數字手段來駁斥俄羅斯人可能發佈的任何與烏克蘭有關的內容。<p>如果俄羅斯人留下來，特別是烏克蘭年輕人的技能基礎將對縮短佔領期起到決定性作用。他們非常精通技術，具有創造性的才能，他們會急於把俄羅斯人趕出去。他們不會使用手榴彈或燃燒彈；相反，他們會寫博客、發帖和黑客攻擊。他們的目標將是俄羅斯人現在控制的烏克蘭基礎設施、老式的軍事通信（更容易被黑）以及在當地想知道他們為什麼在那裡的俄羅斯人。他們將成為有史以來最密集的反向宣傳活動之一的目標，而這一切都將通過衛星完成。<p>入侵可能是由地面上的靴子和坦克開始的，但它將由年輕的烏克蘭人的手指和鍵盤連接起來在天空之上結束。"
}