{
  "@type": "NewsArticle",
  "identifier": "2022--02--21--en--myfeed--HackerNews--NewsArticle--30415547",
  "url": "https://news.ycombinator.com/item?id=30415547",
  "headline": "If you aren’t becoming a SWE you are probably waisting your time",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "It has been discussed on here before but if you aren’t making every attempt possible to become a software engineer, the amount of money and work/life balance you are forfeiting is going to far outweigh any other opportunity you’re pursuing.<p>If you’re in college, there is a good chance you should switch majors or at least figure out how to increase your chances of landing a dev job. (Maybe something like BIT?)<p>As someone who attempted to become a SWE for a few years now and failed miserably I have to say it is gut wrenching to see most people around me making absurds amount of money while I’m still stuck in the learning phase. But I hope that will chance soon.<p>If you can live knowing you have the opportunity to easily make well over 6 figures and work from anywhere but decide to do something else, power to you. I genuinely hope that in 10 years you have that same mentality but there’s a good chance you won’t.<p>TLDR: investing the majority of your time and money into becoming a software engineer provides the greatest return on money and work/life balance by an almost unfathomable margin.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "TerntUpAcademy",
    "url": "https://news.ycombinator.com/user?id=TerntUpAcademy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30415547",
  "sameAs": "https://news.ycombinator.com/item?id=30415547",
  "dateCreated": "2022-02-21T13:31:26.151Z",
  "datePublished": "2022-02-21T13:16:24.000Z",
  "dateModified": "2022-02-21T13:31:26.151Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "如果你不成为一名SWE，你可能在浪费时间。",
  "headline_zh-Hant": "如果你不成為一名SWE，你可能在浪費時間。",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这一点以前在这里已经讨论过了，但是如果你没有尽一切努力成为一名软件工程师，你所放弃的金钱和工作/生活的平衡将远远超过你所追求的任何其他机会。<p>如果你在大学里，你很有可能应该转换专业，或者至少弄清楚如何增加你找到一份开发工作的机会。(也许是像BIT那样的东西？)<p>作为一个试图成为一名SWE的人，我不得不说，看到我周围的大多数人都赚了很多钱，而我却还停留在学习阶段，这让我很伤心。<p>如果你知道自己有机会轻松赚取超过6位数的收入，并在任何地方工作，但却决定做其他事情，那么你就有能力了。我真心希望10年后你也有这样的心态，但很有可能你不会。<p>TLDR：将你的大部分时间和金钱投资于成为一名软件工程师，可以提供最大的金钱回报和工作/生活平衡，其幅度几乎不可估量。",
  "description_zh-Hant": "這一點以前在這裡已經討論過了，但是如果你沒有盡一切努力成為一名軟件工程師，你所放棄的金錢和工作/生活的平衡將遠遠超過你所追求的任何其他機會。<p>如果你在大學裡，你很有可能應該轉換專業，或者至少弄清楚如何增加你找到一份開發工作的機會。(也許是像BIT那樣的東西？)<p>作為一個試圖成為一名SWE的人，我不得不說，看到我周圍的大多數人都賺了很多錢，而我卻還停留在學習階段，這讓我很傷心。<p>如果你知道自己有機會輕鬆賺取超過6位數的收入，並在任何地方工作，但卻決定做其他事情，那麼你就有能力了。我真心希望10年後你也有這樣的心態，但很有可能你不會。<p>TLDR：將你的大部分時間和金錢投資於成為一名軟件工程師，可以提供最大的金錢回報和工作/生活平衡，其幅度幾乎不可估量。"
}