{
  "@type": "NewsArticle",
  "identifier": "2022--03--02--en--myfeed--HackerNews--NewsArticle--30528463",
  "url": "https://news.ycombinator.com/item?id=30528463",
  "headline": "Launch HN: Evry Health (YC W18) – Better health insurance for companies",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello Hacker News! Mark, Jay and I are the cofounders of Evry Health (<a href=\"https://evryhealth.com\" rel=\"nofollow\">https://evryhealth.com</a>). We are a full-stack health insurance company that reduces premiums by up to 20% for companies while improving the health and wellness of their employees.<p>People and media constantly talk about the problems in our healthcare system: prices are too high; premiums are rising faster than household income; health outcomes are lower than the rest of the developed world; mental health coverage is inadequate; and the lack of transparency and accessibility creates confusion for us all. All these are real problems, but they’re symptoms rather than root causes.<p>We believe the root cause is that the U.S. system is rife with misaligned incentives. For example, the fee-for-service structure incentivizes overuse and volume-based billing, rather than health. Thirty-five cents of every dollar spent goes to clinical waste, unnecessary services, administrative bloat, or fraud. (We could give footnotes, but doubt anyone needs convincing.)<p>We’re building Evry to realign incentives for mutual benefit. Our primary plan is an EPO (Exclusive Provider Organization), which is like an HMO, except you don’t have to choose a primary care physician and you don’t need a referral to see a specialist. We have no deductibles, almost no copays, and benefits that exceed the best plans from legacy insurers.   \nWe pay most doctors and hospitals based on patient outcomes, not fee-for-service. Telehealth is available for free 24/7. Members receive a customized care plan that provides additional resources and offers cash incentives on a debit card. All this is to remove barriers to care and improve the health of each member at no additional cost.<p>On top of that, we reduce premiums by up to 20% for employers. We can do this because we are a software company that owns an insurance carrier. We automate roughly half the tasks involved with claims, care coordination, underwriting and back-office operations.\nWe aggregate data from disparate sources (claims, clinical, pharma, lab, and wellness data) to make superior decisions and aid patients. Our technology helps members identify and treat conditions earlier and more effectively. We also have a much better user experience—a single portal to access telehealth, care concierge, claims data, wellness plan, doctor lookup, rewards card, etc.<p>The industry is still fundamentally basing prices on 1960s approaches to accounting (ChargeMaster pricing). 1980s tech and accounting &quot;advanced&quot; the dialog to Diagnostic Resource Group pricing. But insurers and hospitals alike are saddled with this decades old technology and pricing that obscures transparency, adds cost, and isn't tied to patient outcomes. There are software businesses that focus on translating ChargeMaster to DRG to the more recent idea of Reference-based pricing. That is not the way to use technology to improve health care! We’re going much deeper.<p>The caveat is that so far, we only provide coverage to businesses with 100+ employees in  Texas. We launched in our first market of Dallas Fort-Worth. That’s our beachhead, and we’re working on expanding into new states and markets  (It takes a long time to get something like Evry off the ground—there are large barriers to entry). Since half of Americans get health coverage through their employer, we’re focused on companies to maximize impact.<p>We've built insurance, healthcare and fintech companies before.  I founded the insurer that invented per-mile auto insurance (&quot;Drive Less, Pay Less&quot;) and reduced premiums up to 50%.  Mark (CFO) is a healthcare actuary with 30 years’ experience ranging from Aetna to Managing Director in Big 4 consulting. Jay (COO) is a fintech veteran who started in healthcare working with large hospital systems.  What inspired us to start Evry was that we lost friends and family to the terrible dysfunction in the healthcare system. We felt we had the skill sets needed to do something about the problems, and ultimately decided we had to.<p>There is a lack of innovation in this space, and many things being tried—shifts to direct contracting, direct primary care, self-funded programs for individuals and SMBs—do not address the root problems. They are temporary price-oriented solutions. These are a form of moving the ball between cups—prices are better because coverage is impaired in hidden ways that the average person doesn’t discover until it’s too late.<p>There’s also a strong debate, of course, about governmental reforms to U.S. health care. Many support Medicare For All (MFA) for good reasons. However, MFA on its own may not be enough to address clinical variation and some of the other root problems in the system. In any case, in the absence of government action, we believe private sector innovation can address some of our shared problems. We’d be happy to discuss this, and the details of what we’re doing, in the comments below. We’d also like to hear about your own ideas!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "aquaphile",
    "url": "https://news.ycombinator.com/user?id=aquaphile"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30528463",
  "sameAs": "https://www.evryhealth.com/",
  "dateCreated": "2022-03-02T15:43:08.793Z",
  "datePublished": "2022-03-02T15:33:56.000Z",
  "dateModified": "2022-03-02T15:43:08.793Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "启动HN：Evry Health（YC W18）--为公司提供更好的健康保险",
  "headline_zh-Hant": "啟動HN：Evry Health（YC W18）--為公司提供更好的健康保險",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，Hacker News! 马克、杰伊和我是Evry Health（<a href=\"https://evryhealth.com\" rel=\"nofollow\">https://evryhealth.com</a>）的联合创始人。<p>人们和媒体不断谈论我们的医疗保健系统存在的问题：价格太高；保费上涨速度超过家庭收入；健康结果低于其他发达国家；心理健康保障不足；缺乏透明度和可及性给我们所有人带来了困惑。所有这些都是真正的问题，但它们是症状而不是根本原因。<p>我们认为根本原因是美国的系统充斥着错位的激励。例如，收费服务结构激励了过度使用和基于数量的计费，而不是健康。每花费一美元，就有35美分用于临床浪费、不必要的服务、行政膨胀或欺诈。(我们可以给出脚注，但估计没有人需要说服。<p>我们正在建立Evry，以重新调整激励机制，实现互利。我们的主要计划是一个EPO（独家供应商组织），这就像一个HMO，除了你不需要选择一个主治医生，你也不需要转诊去看专家。我们没有免赔额，几乎没有共付额，而且福利超过传统保险公司的最佳计划。  \n我们根据病人的结果向大多数医生和医院付款，而不是按服务收费。远程医疗是24/7免费提供的。会员收到一个定制的护理计划，提供额外的资源，并在借记卡上提供现金奖励。所有这些都是为了消除护理障碍，在不增加费用的情况下改善每个会员的健康状况。<p>除此之外，我们还为雇主减少高达20%的保费。我们可以做到这一点，因为我们是一家拥有保险公司的软件公司。我们将涉及索赔、护理协调、核保和后台操作的大约一半任务自动化。\n我们从不同的来源（索赔、临床、制药、实验室和健康数据）汇总数据，以做出卓越的决策并帮助患者。我们的技术帮助会员更早、更有效地识别和治疗疾病。我们还有更好的用户体验--一个单一的门户，可以访问远程医疗、护理管家、索赔数据、健康计划、医生查询、奖励卡等。<p>该行业仍然从根本上以1960年代的会计方法为基础定价（ChargeMaster定价）。20世纪80年代的技术和会计&quot;推进&quot; 诊断资源组定价的对话。但是，保险公司和医院都被这种几十年前的技术和定价所困扰，它掩盖了透明度，增加了成本，而且与病人的结果不相干。有一些软件企业专注于将ChargeMaster到DRG再到最近的Reference-based定价的想法。这不是使用技术来改善医疗服务的方法！我们要做得更深入。我们要做得更深入。<p>需要注意的是，到目前为止，我们只为德克萨斯州拥有100名以上员工的企业提供保险。我们在我们的第一个市场达拉斯堡-沃斯推出。这是我们的滩头阵地，我们正在努力扩展到新的州和市场（像Evry这样的东西需要很长时间才能落地--有很大的进入壁垒）。由于一半的美国人通过他们的雇主获得医疗保险，我们专注于公司，以最大限度地扩大影响。<p>我们以前曾建立过保险、医疗保健和金融技术公司。 我创办的保险公司发明了按里程计算的汽车保险（&quot;少开车，少付费&quot;），并将保费降低了50%。 马克（首席财务官）是一位拥有30年经验的医疗精算师，从安泰保险到四大咨询公司的常务董事。Jay（首席运营官）是一位金融技术专家，在医疗保健领域开始与大型医院系统合作。 激发我们创办Evry的原因是，我们的朋友和家人死于医疗系统的可怕功能障碍。我们觉得我们拥有解决这些问题所需的技能，并最终决定我们必须这样做。<p>在这个领域缺乏创新，许多正在尝试的事情--转向直接签约、直接初级保健、个人和中小企业的自费项目--并没有解决根本问题。它们是临时性的以价格为导向的解决方案。这些都是在杯子之间移动球的一种形式--价格更好，因为覆盖面以隐蔽的方式受损，而普通人直到发现时已经太晚了。<p>当然，关于美国医疗保健的政府改革也有激烈的辩论。许多人支持 \"全民医疗保险\"（MFA），理由很充分。然而，MFA本身可能不足以解决临床差异和系统中的其他一些根本问题。在任何情况下，在没有政府行动的情况下，我们相信私营部门的创新可以解决我们的一些共同问题。我们很乐意讨论这个问题，以及我们正在做的事情的细节。",
  "description_zh-Hant": "你好，Hacker News! 馬克、傑伊和我是Evry Health（<a href=\"https://evryhealth.com\" rel=\"nofollow\">https://evryhealth.com</a>）的聯合創始人。<p>人們和媒體不斷談論我們的醫療保健系統存在的問題：價格太高；保費上漲速度超過家庭收入；健康結果低於其他發達國家；心理健康保障不足；缺乏透明度和可及性給我們所有人帶來了困惑。所有這些都是真正的問題，但它們是症狀而不是根本原因。<p>我們認為根本原因是美國的系統充斥著錯位的激勵。例如，收費服務結構激勵了過度使用和基於數量的計費，而不是健康。每花費一美元，就有35美分用於臨床浪費、不必要的服務、行政膨脹或欺詐。(我們可以給出腳註，但估計沒有人需要說服。<p>我們正在建立Evry，以重新調整激勵機制，實現互利。我們的主要計劃是一個EPO（獨家供應商組織），這就像一個HMO，除了你不需要選擇一個主治醫生，你也不需要轉診去看專家。我們沒有免賠額，幾乎沒有共付額，而且福利超過傳統保險公司的最佳計劃。  \n我們根據病人的結果向大多數醫生和醫院付款，而不是按服務收費。遠程醫療是24/7免費提供的。會員收到一個定製的護理計劃，提供額外的資源，並在借記卡上提供現金獎勵。所有這些都是為了消除護理障礙，在不增加費用的情況下改善每個會員的健康狀況。<p>除此之外，我們還為僱主減少高達20%的保費。我們可以做到這一點，因為我們是一家擁有保險公司的軟件公司。我們將涉及索賠、護理協調、核保和後臺操作的大約一半任務自動化。\n我們從不同的來源（索賠、臨床、製藥、實驗室和健康數據）彙總數據，以做出卓越的決策並幫助患者。我們的技術幫助會員更早、更有效地識別和治療疾病。我們還有更好的用戶體驗--一個單一的門戶，可以訪問遠程醫療、護理管家、索賠數據、健康計劃、醫生查詢、獎勵卡等。<p>該行業仍然從根本上以1960年代的會計方法為基礎定價（ChargeMaster定價）。20世紀80年代的技術和會計&quot;推進&quot; 診斷資源組定價的對話。但是，保險公司和醫院都被這種幾十年前的技術和定價所困擾，它掩蓋了透明度，增加了成本，而且與病人的結果不相干。有一些軟件企業專注於將ChargeMaster到DRG再到最近的Reference-based定價的想法。這不是使用技術來改善醫療服務的方法！我們要做得更深入。我們要做得更深入。<p>需要注意的是，到目前為止，我們只為德克薩斯州擁有100名以上員工的企業提供保險。我們在我們的第一個市場達拉斯堡-沃斯推出。這是我們的灘頭陣地，我們正在努力擴展到新的州和市場（像Evry這樣的東西需要很長時間才能落地--有很大的進入壁壘）。由於一半的美國人通過他們的僱主獲得醫療保險，我們專注於公司，以最大限度地擴大影響。<p>我們以前曾建立過保險、醫療保健和金融技術公司。 我創辦的保險公司發明了按里程計算的汽車保險（&quot;少開車，少付費&quot;），並將保費降低了50%。 馬克（首席財務官）是一位擁有30年經驗的醫療精算師，從安泰保險到四大諮詢公司的常務董事。Jay（首席運營官）是一位金融技術專家，在醫療保健領域開始與大型醫院系統合作。 激發我們創辦Evry的原因是，我們的朋友和家人死於醫療系統的可怕功能障礙。我們覺得我們擁有解決這些問題所需的技能，並最終決定我們必須這樣做。<p>在這個領域缺乏創新，許多正在嘗試的事情--轉向直接簽約、直接初級保健、個人和中小企業的自費項目--並沒有解決根本問題。它們是臨時性的以價格為導向的解決方案。這些都是在杯子之間移動球的一種形式--價格更好，因為覆蓋面以隱蔽的方式受損，而普通人直到發現時已經太晚了。<p>當然，關於美國醫療保健的政府改革也有激烈的辯論。許多人支持 \"全民醫療保險\"（MFA），理由很充分。然而，MFA本身可能不足以解決臨床差異和系統中的其他一些根本問題。在任何情況下，在沒有政府行動的情況下，我們相信私營部門的創新可以解決我們的一些共同問題。我們很樂意討論這個問題，以及我們正在做的事情的細節。"
}