{
  "@type": "NewsArticle",
  "identifier": "2022--03--25--en--myfeed--HackerNews--NewsArticle--30806360",
  "url": "https://news.ycombinator.com/item?id=30806360",
  "headline": "Ukraine Evidence: open data and information verification project for Ukraine",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Many of us have been watching the horrifying developments in Ukraine over the past month and are wondering if and how we can help. Many are donating money to humanitarian causes but some are also wondering: can we help in a more scalable way through our tech skills?<p>There is a major problem with getting accurate information about what is happening on the ground in Ukraine. In the world of the internet and smartphones, there is an abundance of video, image and text accounts coming out but they are overwhelming, unstructured and contain a significant number of fakes. This leads to proliferation of misinformation, confusion and the ability of malicious actors to spread their own fake narratives, prolonging the conflict and causing additional damage.<p>Here is a prominent example (as of March 25). The city of Mariupol is surrounded by Russian forces with hundreds of thousands of civilians trapped inside. The city is heavily bombed and people live in basements for weeks. There are reports of hundreds or even thousands of civilian deaths and of a major humanitarian crisis with the lack of clean water, food and medicine. There is an account of the situation from two journalists, who have recently escaped the city: [1], [2]. They report Russian soldiers being responsible for the situation and provide videos and photos. There are also accounts from pro-government Russian media about Mariupol, for example: [3], [4]. They report Ukrainian soldiers not letting civilians leave the city and providing videos, photos and possibly witness accounts.<p>Can we apply skills in big data, analytics and machine learning to help?<p>We believe we can use the power of:\n- thousands of people to collect, label and connect pieces of evidence\n- dozens of ML groups to run their ML algorithms to establish truthfulness\n- data experts to systematize and make evidence widely available and searchable<p>This can help:\n- more people around the world to be better informed instead of only following sources from one information bubble they happen to be in\n- governments to better understand casualties and damage\n- volunteers on the ground to coordinate their efforts more effectively\n- people who lost touch with relatives and friends in the conflict zone to find more about them through image search\n- the world to document and preserve information about the big historic event\n… and in many more ways, which we can’t think of ourselves right now.<p>Here is the link with more details about the project: https://bit.ly/ukraine-evidence.<p>We are looking for the project leader and 1st ring team members (see the last section of the document for details). Reach out to ukraine.evidence@gmail.com if you are interested and share the document with others who might be.<p>[1] https://apnews.com/article/russia-ukraine-europe-edf7240a9d990e7e3e32f82ca351dede<p>[2] https://meduza.global.ssl.fastly.net/feature/2022/03/21/mstislav-chernov-i-evgeniy-maloletka-ostalis-edinstvennymi-zhurnalistami-v-mariupole-i-pokazali-miru-obstrelyannyy-roddom<p>[3] https://russian.rt.com/russia/article/980673-bezhency-mariupol-yaroslavl-istorii<p>[4] https://t.me/margaritasimonyan/10764",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "mikpanko",
    "url": "https://news.ycombinator.com/user?id=mikpanko"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30806360",
  "sameAs": "https://news.ycombinator.com/item?id=30806360",
  "dateCreated": "2022-03-25T20:31:13.662Z",
  "datePublished": "2022-03-25T19:46:47.000Z",
  "dateModified": "2022-03-25T20:31:13.662Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "乌克兰的证据：乌克兰的开放数据和信息核查项目",
  "headline_zh-Hant": "烏克蘭的證據：烏克蘭的開放數據和信息核查項目",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在过去的一个月里，我们中的许多人一直在关注乌克兰可怕的事态发展，并想知道我们是否可以提供帮助以及如何提供帮助。许多人正在向人道主义事业捐款，但有些人也在想：我们能否通过我们的技术技能，以一种更可扩展的方式提供帮助？<p>在获取有关乌克兰当地发生的情况的准确信息方面，存在一个重大问题。在互联网和智能手机的世界里，有大量的视频、图像和文字描述出现，但它们是压倒性的、非结构化的，并且包含大量的假货。这导致了错误信息的扩散、混乱和恶意行为者传播他们自己的虚假叙述的能力，延长了冲突并造成了额外的损害。<p>这里有一个突出的例子（截至3月25日）。马里乌波尔市被俄罗斯军队包围，数十万平民被困在里面。该市遭到严重轰炸，人们在地下室生活了几个星期。有报告称，有数百甚至数千名平民死亡，并且由于缺乏清洁的水、食物和药品，出现了重大的人道主义危机。最近逃离该市的两名记者对这一情况进行了描述。[1], [2]. 他们报告说俄罗斯士兵对这种情况负责，并提供了视频和照片。亲政府的俄罗斯媒体也有关于马里乌波尔的叙述，例如。[3], [4]. 他们报告说，乌克兰士兵不让平民离开城市，并提供了视频、照片和可能的证人陈述。<p>我们可以应用大数据、分析和机器学习方面的技能来帮助吗？\n- 数以千计的人收集、标记和连接各种证据\n- 几十个ML小组运行他们的ML算法来确定真实性\n- 数据专家将证据系统化，并使其广泛可用和可搜索<p>这可以帮助。\n- 世界各地更多的人能够更好地了解情况，而不是只关注他们碰巧处于的一个信息泡沫中的来源。\n- 政府更好地了解伤亡和损失\n- 在当地的志愿者更有效地协调他们的工作\n- 与冲突地区的亲戚和朋友失去联系的人可以通过图像搜索找到更多关于他们的信息\n- 全世界都在记录和保存有关这一重大历史事件的信息\n......以及更多我们现在无法想到的方式。<p>以下是有关该项目更多细节的链接：https://bit.ly/ukraine-evidence。<p>我们正在寻找项目负责人和第一环的团队成员（详见文件的最后一节）。如果你有兴趣，请联系ukraine.evidence@gmail.com，并与其他可能感兴趣的人分享该文件。<p>[1] https://apnews.com/article/russia-ukraine-europe-edf7240a9d990e7e3e32f82ca351dede<p>[2] https://meduza.global.ssl.fastly.net/feature/2022/03/21/mstislav-chernov-i-evgeniy-maloletka-ostalis-edinstvennymi-zhurnalistami-v-mariupole-i-pokazali-miru-obstrelyannyy-roddom<p>[3] https://russian.rt.com/russia/article/980673-bezhency-mariupol-yaroslavl-istorii<p>[4] https://t.me/margaritasimonyan/10764",
  "description_zh-Hant": "在過去的一個月裡，我們中的許多人一直在關注烏克蘭可怕的事態發展，並想知道我們是否可以提供幫助以及如何提供幫助。許多人正在向人道主義事業捐款，但有些人也在想：我們能否通過我們的技術技能，以一種更可擴展的方式提供幫助？<p>在獲取有關烏克蘭當地發生的情況的準確信息方面，存在一個重大問題。在互聯網和智能手機的世界裡，有大量的視頻、圖像和文字描述出現，但它們是壓倒性的、非結構化的，並且包含大量的假貨。這導致了錯誤信息的擴散、混亂和惡意行為者傳播他們自己的虛假敘述的能力，延長了衝突並造成了額外的損害。<p>這裡有一個突出的例子（截至3月25日）。馬裡烏波爾市被俄羅斯軍隊包圍，數十萬平民被困在裡面。該市遭到嚴重轟炸，人們在地下室生活了幾個星期。有報告稱，有數百甚至數千名平民死亡，並且由於缺乏清潔的水、食物和藥品，出現了重大的人道主義危機。最近逃離該市的兩名記者對這一情況進行了描述。[1], [2]. 他們報告說俄羅斯士兵對這種情況負責，並提供了視頻和照片。親政府的俄羅斯媒體也有關於馬裡烏波爾的敘述，例如。[3], [4]. 他們報告說，烏克蘭士兵不讓平民離開城市，並提供了視頻、照片和可能的證人陳述。<p>我們可以應用大數據、分析和機器學習方面的技能來幫助嗎？\n- 數以千計的人收集、標記和連接各種證據\n- 幾十個ML小組運行他們的ML算法來確定真實性\n- 數據專家將證據系統化，並使其廣泛可用和可搜索<p>這可以幫助。\n- 世界各地更多的人能夠更好地瞭解情況，而不是隻關注他們碰巧處於的一個信息泡沫中的來源。\n- 政府更好地瞭解傷亡和損失\n- 在當地的志願者更有效地協調他們的工作\n- 與衝突地區的親戚和朋友失去聯繫的人可以通過圖像搜索找到更多關於他們的信息\n- 全世界都在記錄和保存有關這一重大歷史事件的信息\n......以及更多我們現在無法想到的方式。<p>以下是有關該項目更多細節的鏈接：https://bit.ly/ukraine-evidence。<p>我們正在尋找項目負責人和第一環的團隊成員（詳見文件的最後一節）。如果你有興趣，請聯繫ukraine.evidence@gmail.com，並與其他可能感興趣的人分享該文件。<p>[1] https://apnews.com/article/russia-ukraine-europe-edf7240a9d990e7e3e32f82ca351dede<p>[2] https://meduza.global.ssl.fastly.net/feature/2022/03/21/mstislav-chernov-i-evgeniy-maloletka-ostalis-edinstvennymi-zhurnalistami-v-mariupole-i-pokazali-miru-obstrelyannyy-roddom<p>[3] https://russian.rt.com/russia/article/980673-bezhency-mariupol-yaroslavl-istorii<p>[4] https://t.me/margaritasimonyan/10764"
}