{
  "@type": "NewsArticle",
  "identifier": "2022--03--04--en--myfeed--HackerNews--NewsArticle--30552091",
  "url": "https://news.ycombinator.com/item?id=30552091",
  "headline": "HN call for help: Thousand of IT specialists flee Russia as job market collapses",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello hn.<p>I believe that situation on Russian IT market is not being represented 100% clear right now in the Europe and US.<p>Yesterday I had to emergently evacuate my family from Moscow on a flight to Dubai, leaving behind my apartment, car and my whole life. Every single one of the people I know in IT considers doing the same, or is already in the process (I have 12+ years of networking in this industry, this is fully subjective, but should be representative evnough - I talked to more than 50 people I know directly). Out of my close friends 50% have either already left, or purchasing tickets as you read that.<p>Every single person I know has either full blown panic attacks, averages 2hr of sleep per night, or has extreme anxiety. Four close friends whom I met through IT are hiding from bombs in Kiev and Sumy. Every single one is shocked by decisions made by authoritative Russian government with no care for peoples lives, either in Ukraine or in Russia itself. As you read this, laws are being arranged to set criminal charges even for things like acknowledging the war.<p>My whole investment portfolio got frozen in the St. Pete stock exchange for indefinite period and little hope to get them back. On February 27 I was lucky to quickly get a $10k loan in rubles and purchase already expensive dollars to mitigate the risks, right before inflation skyrocketed to %20+. Most people are not that lucky, and banks have tightened any loans. My salary has already devalued by 50% after one week of war.<p>If anyone can provide any help, Russian IT community needs it. Please reach in comments below by providing your contacts and type of help you can offer, I will do my best to connect you with Russian-speaking communities on Telegram: three of them are communities of developers with 10k+ people in each of them.<p>_Any_ help with remote work or relocation offers to UAE, Georgia, Turkey, Serbia would be immense.<p>You can also reach me directly on 224.0.0.25@gmail.com<p>Hacker news, this is a crisis of extreme proportions. Please, we need your help.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "smugglerFlynn",
    "url": "https://news.ycombinator.com/user?id=smugglerFlynn"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30552091",
  "sameAs": "https://news.ycombinator.com/item?id=30552091",
  "dateCreated": "2022-03-04T08:34:29.872Z",
  "datePublished": "2022-03-04T08:26:32.000Z",
  "dateModified": "2022-03-04T08:34:29.872Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "HN呼吁帮助。就业市场崩溃，数千名IT专家逃离俄罗斯",
  "headline_zh-Hant": "HN呼籲幫助。就業市場崩潰，數千名IT專家逃離俄羅斯",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好！<p>我认为，俄罗斯IT市场的情况现在在欧洲和美国并没有得到100%的明确体现。<p>昨天，我不得不紧急从莫斯科撤走我的家人，乘坐飞机前往迪拜，留下了我的公寓、汽车和我的全部生活。我认识的每一个IT行业的人都在考虑做同样的事情，或者已经在这个过程中了（我在这个行业有12年以上的人脉，这完全是主观臆断，但应该有足够的代表性--我和50多个我认识的人直接谈过）。在我的亲密朋友中，有50%的人要么已经离开，要么在你读到这段话时正在购买机票。<p>我认识的每个人都有全面的恐慌症，平均每晚睡2小时，或者有极端的焦虑。我通过IT行业认识的四个亲密朋友正在基辅和苏梅躲避炸弹。每一个人都对俄罗斯权威政府做出的决定感到震惊，无论是在乌克兰还是在俄罗斯本身，他们都不关心人民的生命。当你读到这篇文章时，法律正在安排，甚至为承认战争这样的事情设置刑事指控。<p>我的整个投资组合在圣彼得证券交易所被无限期冻结，几乎没有希望拿回来。2月27日，我很幸运地迅速获得了1万美元的卢布贷款，并在通货膨胀率飙升到20%以上之前购买了已经很贵的美元来减轻风险。大多数人没有那么幸运，银行已经收紧了任何贷款。我的工资在开战一周后已经贬值了50%。<p>如果有人能提供任何帮助，俄罗斯IT界需要它。请在下面的评论中提供你的联系人和你能提供的帮助类型，我会尽力将你与Telegram上的俄语社区联系起来：其中三个是开发人员社区，每个社区都有1万多人。<p>_任何帮助远程工作或搬迁到阿联酋、格鲁吉亚、土耳其、塞尔维亚将是巨大的。<p>你也可以直接联系我，224.0.0.25@gmail.com<p>黑客新闻，这是一个极端规模的危机。拜托，我们需要你的帮助。",
  "description_zh-Hant": "你好！<p>我認為，俄羅斯IT市場的情況現在在歐洲和美國並沒有得到100%的明確體現。<p>昨天，我不得不緊急從莫斯科撤走我的家人，乘坐飛機前往迪拜，留下了我的公寓、汽車和我的全部生活。我認識的每一個IT行業的人都在考慮做同樣的事情，或者已經在這個過程中了（我在這個行業有12年以上的人脈，這完全是主觀臆斷，但應該有足夠的代表性--我和50多個我認識的人直接談過）。在我的親密朋友中，有50%的人要麼已經離開，要麼在你讀到這段話時正在購買機票。<p>我認識的每個人都有全面的恐慌症，平均每晚睡2小時，或者有極端的焦慮。我通過IT行業認識的四個親密朋友正在基輔和蘇梅躲避炸彈。每一個人都對俄羅斯權威政府做出的決定感到震驚，無論是在烏克蘭還是在俄羅斯本身，他們都不關心人民的生命。當你讀到這篇文章時，法律正在安排，甚至為承認戰爭這樣的事情設置刑事指控。<p>我的整個投資組合在聖彼得證券交易所被無限期凍結，幾乎沒有希望拿回來。2月27日，我很幸運地迅速獲得了1萬美元的盧布貸款，並在通貨膨脹率飆升到20%以上之前購買了已經很貴的美元來減輕風險。大多數人沒有那麼幸運，銀行已經收緊了任何貸款。我的工資在開戰一週後已經貶值了50%。<p>如果有人能提供任何幫助，俄羅斯IT界需要它。請在下面的評論中提供你的聯繫人和你能提供的幫助類型，我會盡力將你與Telegram上的俄語社區聯繫起來：其中三個是開發人員社區，每個社區都有1萬多人。<p>_任何幫助遠程工作或搬遷到阿聯酋、格魯吉亞、土耳其、塞爾維亞將是巨大的。<p>你也可以直接聯繫我，224.0.0.25@gmail.com<p>黑客新聞，這是一個極端規模的危機。拜託，我們需要你的幫助。"
}