{
  "@type": "NewsArticle",
  "identifier": "2022--02--23--en--myfeed--HackerNews--NewsArticle--30437822",
  "url": "https://news.ycombinator.com/item?id=30437822",
  "headline": "Lets Put a Dent on the Universe",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN! My name is Haruna Oseni currently a student at Houston Community College, also working as a freelance Software Engineer and part time programming tutor @HCC (Javascript , python etc.), I am more of a generalist engineer (front end, now playing around with backend, done some data science and more), I enjoy being uncomfortable and tackling hard projects which I have no idea how to even begin then learning what I need to get the job done, I am currently working on an app (startup), watch, the goal is to basically enable users experience more during a video call. I will be graduating from HCC may 18. Writing software is an obsession at this point, I'm very interested in consumer product, fintech(payment), logistics software etc. After graduation to be honest guys, I want to find like minded individuals/team whose dream is to build an insanely successful company, or looking for a cofounder or a team member, hell, just little help on their startup. If that resonates with you, shoot me an email (harunaoseni23@gmail.com), lets change the world (seriously, I will literally relocate after graduation without seconds thoughts if anyone here resonates with this)!! sorry for the long text guys.... here's my hub of git, cheers --&gt; https://github.com/harunaOseni",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "HarunaOseni",
    "url": "https://news.ycombinator.com/user?id=HarunaOseni"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30437822",
  "sameAs": "https://news.ycombinator.com/item?id=30437822",
  "dateCreated": "2022-02-23T05:10:23.234Z",
  "datePublished": "2022-02-23T04:55:22.000Z",
  "dateModified": "2022-02-23T05:10:23.234Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "让我们在宇宙中留下一个凹痕",
  "headline_zh-Hant": "讓我們在宇宙中留下一個凹痕",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN! 我叫Haruna Oseni，目前是休斯顿社区学院的一名学生，同时也是一名自由软件工程师和兼职编程导师@HCC（Javascript，python等），我更像是一名通才工程师（前端，现在在玩后端，做过一些数据科学等），我喜欢不自在，喜欢处理一些我甚至不知道如何开始的困难项目，然后学习我需要完成的工作，我目前在做一个应用程序（创业公司），手表，目标是让用户在视频通话中体验更多。我将于5月18日从HCC毕业。在这一点上，编写软件是一种痴迷，我对消费产品、金融技术（支付）、物流软件等非常感兴趣。说实话，毕业后，我想找到志同道合的人/团队，他们的梦想是建立一个非常成功的公司，或寻找一个联合创始人或团队成员，地狱，只是在他们的创业公司的小帮助。如果你对此有共鸣，请给我发邮件（harunaoseni23@gmail.com），让我们改变世界（说真的，如果这里有人对此有共鸣，我真的会在毕业后毫不犹豫地搬迁）！！对不起，文字太长了，伙计们....，这是我的git中心，谢谢 --&gt; https://github.com/harunaOseni",
  "description_zh-Hant": "你好，HN! 我叫Haruna Oseni，目前是休斯頓社區學院的一名學生，同時也是一名自由軟件工程師和兼職編程導師@HCC（Javascript，python等），我更像是一名通才工程師（前端，現在在玩後端，做過一些數據科學等），我喜歡不自在，喜歡處理一些我甚至不知道如何開始的困難項目，然後學習我需要完成的工作，我目前在做一個應用程序（創業公司），手錶，目標是讓用戶在視頻通話中體驗更多。我將於5月18日從HCC畢業。在這一點上，編寫軟件是一種痴迷，我對消費產品、金融技術（支付）、物流軟件等非常感興趣。說實話，畢業後，我想找到志同道合的人/團隊，他們的夢想是建立一個非常成功的公司，或尋找一個聯合創始人或團隊成員，地獄，只是在他們的創業公司的小幫助。如果你對此有共鳴，請給我發郵件（harunaoseni23@gmail.com），讓我們改變世界（說真的，如果這裡有人對此有共鳴，我真的會在畢業後毫不猶豫地搬遷）！！對不起，文字太長了，夥計們....，這是我的git中心，謝謝 --&gt; https://github.com/harunaOseni"
}