{
  "@type": "NewsArticle",
  "identifier": "2022--03--05--en--myfeed--HackerNews--NewsArticle--30572536",
  "url": "https://news.ycombinator.com/item?id=30572536",
  "headline": "Dear President Putin, from a Czech-American Software Architect",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "President Putin, I’m a Czech-American born from Czechoslovakian refugees that fled before Prague Spring. I hold citizenship in both Czechia and America. On behalf of my generation from both nations, I want us to learn from our shared history and bring prosperity to the future generations of our great nations. Only technology will save us, if we allow it.<p>I love my American and Slavic cultures. Both have room for improvement. Even though I grew up in America, I still lived with poverty, a homeless father, a broken home, and all the stresses that come to from being a man, husband, and father. I work hard to not repeat the mistakes of my fathers. It’s not easy.<p>I turned 34 at the end of February. Reading about the recent events in Eastern Europe broke my dreams to be a part of the future of Europe. I have goals to live in Europe half the year each year with my wife and 3 children (who also have Czechia and American citizenship). We want to partake of our Slavic heritage and bring prosperity to it.<p>Considering how Covid has changed the world, I’ve doing exceptionally well. I recently celebrated my 12 year wedding anniversary. I purchased my first home in fall of last year. Living in the digital age has allowed me to move to the upper middle class and be home with my family during the entire journey. Even before the pandemic I was working 100% remote as a business owner and software architect. The fortune I have in these unusual times has allowed my wife to choose to stay home to teach and raise our 3 children.<p>Even with the current problems in both America and Europe,  my wife and I still want 3 more children. We want our children to live in a future where they can live peacefully and freely between both of their homelands. We can make the future generations of our nations mutual prosperous, President Putin. My experience and expertise are freely available. We can start making a future we all want, today.<p>Please join in this message: https://www.youtube.com/watch?v=lDu6SQjiZ-I",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "TbobbyZ",
    "url": "https://news.ycombinator.com/user?id=TbobbyZ"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30572536",
  "sameAs": "https://news.ycombinator.com/item?id=30572536",
  "dateCreated": "2022-03-05T22:29:31.725Z",
  "datePublished": "2022-03-05T22:21:09.000Z",
  "dateModified": "2022-03-05T22:29:31.725Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "亲爱的普京总统，来自一位捷克裔美国软件架构师的信息",
  "headline_zh-Hant": "親愛的普京總統，來自一位捷克裔美國軟件架構師的信息",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "普京总统，我是一个捷克裔美国人，出生在布拉格之春前逃离的捷克斯洛伐克难民中。我在捷克和美国都拥有公民身份。我代表这两个国家的我这一代人，希望我们从我们共同的历史中学习，为我们伟大国家的后代带来繁荣。只有技术才能拯救我们，如果我们允许的话。<p>我爱我的美国和斯拉夫文化。两者都有改进的余地。尽管我在美国长大，但我仍然生活在贫困之中，有一个无家可归的父亲，一个破碎的家，以及作为一个男人、丈夫和父亲所带来的所有压力。我努力工作，不重复我父亲们的错误。这并不容易。<p>二月底我刚满34岁。阅读东欧最近发生的事件打破了我成为欧洲未来一部分的梦想。我的目标是与我的妻子和3个孩子（他们也有捷克和美国国籍）每年有一半时间住在欧洲。我们想分享我们的斯拉夫遗产，并为其带来繁荣。<p>考虑到Covid是如何改变世界的，我已经做得特别好。我最近庆祝了我的结婚12周年。我在去年秋天购买了我的第一个家。生活在数字时代使我能够进入中上阶层，并在整个旅程中与家人在一起。甚至在大流行病之前，我就作为企业主和软件架构师100%远程工作。在这个不寻常的时代，我所拥有的财富让我的妻子选择留在家里教书并抚养我们的3个孩子。<p>即使在美国和欧洲目前的问题下，我和我的妻子仍然希望再有3个孩子。我们希望我们的孩子能生活在一个可以在两个故乡之间和平、自由地生活的未来。我们可以使我们国家的未来世代相互繁荣，普京总统。我的经验和专业知识是免费提供的。我们可以开始创造一个我们都想要的未来，今天。<p>请加入这个信息：https://www.youtube.com/watch?v=lDu6SQjiZ-I",
  "description_zh-Hant": "普京總統，我是一個捷克裔美國人，出生在布拉格之春前逃離的捷克斯洛伐克難民中。我在捷克和美國都擁有公民身份。我代表這兩個國家的我這一代人，希望我們從我們共同的歷史中學習，為我們偉大國家的後代帶來繁榮。只有技術才能拯救我們，如果我們允許的話。<p>我愛我的美國和斯拉夫文化。兩者都有改進的餘地。儘管我在美國長大，但我仍然生活在貧困之中，有一個無家可歸的父親，一個破碎的家，以及作為一個男人、丈夫和父親所帶來的所有壓力。我努力工作，不重複我父親們的錯誤。這並不容易。<p>二月底我剛滿34歲。閱讀東歐最近發生的事件打破了我成為歐洲未來一部分的夢想。我的目標是與我的妻子和3個孩子（他們也有捷克和美國國籍）每年有一半時間住在歐洲。我們想分享我們的斯拉夫遺產，併為其帶來繁榮。<p>考慮到Covid是如何改變世界的，我已經做得特別好。我最近慶祝了我的結婚12週年。我在去年秋天購買了我的第一個家。生活在數字時代使我能夠進入中上階層，並在整個旅程中與家人在一起。甚至在大流行病之前，我就作為企業主和軟件架構師100%遠程工作。在這個不尋常的時代，我所擁有的財富讓我的妻子選擇留在家裡教書並撫養我們的3個孩子。<p>即使在美國和歐洲目前的問題下，我和我的妻子仍然希望再有3個孩子。我們希望我們的孩子能生活在一個可以在兩個故鄉之間和平、自由地生活的未來。我們可以使我們國家的未來世代相互繁榮，普京總統。我的經驗和專業知識是免費提供的。我們可以開始創造一個我們都想要的未來，今天。<p>請加入這個信息：https://www.youtube.com/watch?v=lDu6SQjiZ-I"
}