{
  "@type": "NewsArticle",
  "identifier": "2022--03--20--en--myfeed--HackerNews--NewsArticle--30745237",
  "url": "https://news.ycombinator.com/item?id=30745237",
  "headline": "Show HN: A photo sharing app that isn't trying to be a TikTok clone",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We launched Pidgeon a few weeks ago, and since then we've had a chance to fix a lot of bugs and upgrade the usability a significant amount.<p>The app is made just for photo sharing. No videos, no NFTs, just pictures, comments, and chats. Each post is ranked like on reddit - a combination of the user upvote/downvotes and the amount of time passed since the post's creation.<p>We're also trying to stay away from ads, and instead adopt a freemium model. The main reason for this is because people are a lot more concerned with privacy these days, and if we aren't serving ads, then the user knows that we don't have an incentive to steal their data.<p>There's already a small community of about 1500 on the app, with a lot of them being professional photographers. So the photos going up look really nice (at least in my opinion). But we don't just want to be a community of people who consider themselves photographers - that's a mistake that other platforms like Flickr and VSCO make. To become widespread, you need to make your platform simple to use for the casual person; only catering to professionals will necessarily keep your community smaller than it otherwise would be.<p>Users have been asking for a desktop client, and while we don't have one yet, we do plan to add it - and it won't take us as long as IG to do it, and neither will it be an afterthought where the UX is intentionally made poor so that you're pushed to use the app instead. But we want to polish the mobile app first before we get there, and there's still a lot of work to do since it's super early days.<p>If you want to try it out, here's the link:<p>https://play.google.com/store/apps/details?id=app.pidgeon.pidgeon<p>https://apps.apple.com/us/app/pidgeon-simple-photo-sharing/id1605784768<p>And please do provide any feedback you have on the app! It really does help us make it better.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "Fnalsk",
    "url": "https://news.ycombinator.com/user?id=Fnalsk"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30745237",
  "sameAs": "https://news.ycombinator.com/item?id=30745237",
  "dateCreated": "2022-03-20T18:34:48.607Z",
  "datePublished": "2022-03-20T18:28:59.000Z",
  "dateModified": "2022-03-20T18:34:48.607Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Show HN: 一个并不试图成为TikTok克隆的照片分享应用",
  "headline_zh-Hant": "Show HN: 一個並不試圖成為TikTok克隆的照片分享應用",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们在几周前推出了Pidgeon，从那时起，我们有机会修复了很多错误，并对可用性进行了大量的升级。没有视频，没有NFT，只有图片、评论和聊天。每篇帖子的排名就像在reddit上一样--由用户的上调/下调以及帖子创建后的时间组合而成。<p>我们还试图远离广告，而采用免费模式。主要原因是现在人们更关注隐私，如果我们不提供广告，那么用户就知道我们没有动机窃取他们的数据。<p>在这个应用程序上已经有一个大约1500人的小社区，其中很多人是专业摄影师。所以上去的照片看起来非常漂亮（至少在我看来）。但我们并不只是想成为一个自认为是摄影师的社区--这是Flickr和VSCO等其他平台犯的一个错误。<p>用户一直在要求有一个桌面客户端，虽然我们还没有，但我们确实计划添加它--而且我们不会像IG那样花很长时间去做，也不会在事后才想到，故意把用户体验搞得很差，让你不得不使用应用程序。但是，我们希望在实现这一目标之前，先打磨好移动应用程序，而且还有很多工作要做，因为现在是超级早期。<p>如果你想尝试一下，这里有一个链接：<p>https://play.google.com/store/apps/details?id=app.pidgeon.pidgeon<p>https://apps.apple.com/us/app/pidgeon-simple-photo-sharing/id1605784768<p>而且请提供你对该应用程序的任何反馈！这确实有助于我们使其变得更好。这确实有助于我们把它做得更好。",
  "description_zh-Hant": "我們在幾周前推出了Pidgeon，從那時起，我們有機會修復了很多錯誤，並對可用性進行了大量的升級。沒有視頻，沒有NFT，只有圖片、評論和聊天。每篇帖子的排名就像在reddit上一樣--由用戶的上調/下調以及帖子創建後的時間組合而成。<p>我們還試圖遠離廣告，而採用免費模式。主要原因是現在人們更關注隱私，如果我們不提供廣告，那麼用戶就知道我們沒有動機竊取他們的數據。<p>在這個應用程序上已經有一個大約1500人的小社區，其中很多人是專業攝影師。所以上去的照片看起來非常漂亮（至少在我看來）。但我們並不只是想成為一個自認為是攝影師的社區--這是Flickr和VSCO等其他平臺犯的一個錯誤。<p>用戶一直在要求有一個桌面客戶端，雖然我們還沒有，但我們確實計劃添加它--而且我們不會像IG那樣花很長時間去做，也不會在事後才想到，故意把用戶體驗搞得很差，讓你不得不使用應用程序。但是，我們希望在實現這一目標之前，先打磨好移動應用程序，而且還有很多工作要做，因為現在是超級早期。<p>如果你想嘗試一下，這裡有一個鏈接：<p>https://play.google.com/store/apps/details?id=app.pidgeon.pidgeon<p>https://apps.apple.com/us/app/pidgeon-simple-photo-sharing/id1605784768<p>而且請提供你對該應用程序的任何反饋！這確實有助於我們使其變得更好。這確實有助於我們把它做得更好。"
}