{
  "@type": "NewsArticle",
  "identifier": "2022--04--08--en--myfeed--HackerNews--NewsArticle--30955404",
  "url": "https://news.ycombinator.com/item?id=30955404",
  "headline": "Second Factor Authentication",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This is a comment I've added to this post on dev.to https://dev.to/kevincox/maybe-passwords-are-the-future-4gdl I think it may be interested to Hacker News readers.<p>I don't think that passwords are needed at all. The reason they exists is to verify that you are you. There are better way of doing it. But I yet to see good solution.<p>The problem the password solve is that you say once that you're you and then again you verify that you're you. But password are solution that are create very long ago, when there were no other way of authentications.<p>I think that 2FA solution where 2nd A is the only A is the way to go. But it need to way better automated so it have better UX.<p>I was once thinking about Personal OAuth solution, where user browser act as OAuth provider that can verify that she is she. Or something like LastPass but that will allow to register to the service, not only store passwords.<p>All those password managers are just a patch/hack on broken system with password. It would be easier to just remove all password and start a better way of user authentication.<p>Solving password problem is great way to start a new Startup around the idea. Having app on a phone that act as OAuth with single button sign in like with physical Token would be really great idea for a startup that will get rid of passwords. Since with 2FA you actually don't need that 1st step with password. The app will only work similar to LastPass, Physical token and Authenticator App.<p>The flow can work like this:<p>* You login on a website with email or username only<p>* Request is send to the service<p>* Popup show up on your phone (that can be restricted with PIN, like Bank mobile app of someone want better security)<p>* User tap the button<p>* Service authenticate the user on the site<p>To resister to a website:<p>* You type username or email and QR Code show up on the screen<p>* You scan the code with the app<p>* And you only need one password for the Service. This can be called 2ndFA Second Factor Authentication.<p>The normal process of registration with password and email will only happen with The Service.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jcubic",
    "url": "https://news.ycombinator.com/user?id=jcubic"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30955404",
  "sameAs": "https://news.ycombinator.com/item?id=30955404",
  "dateCreated": "2022-04-08T11:28:27.514Z",
  "datePublished": "2022-04-08T10:45:31.000Z",
  "dateModified": "2022-04-08T11:28:27.514Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "第二因素认证",
  "headline_zh-Hant": "第二因素認證",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这是我在dev.to https://dev.to/kevincox/maybe-passwords-are-the-future-4gdl 这个帖子上添加的评论，我想它可能会让Hacker News的读者感兴趣。<p>我认为根本不需要密码。它们存在的原因是为了验证你是你。有更好的方法可以做到这一点。<p>密码解决的问题是，你说一次你是你，然后再次验证你是你。但密码是很久以前创造的解决方案，当时还没有其他的认证方式。<p>我认为2FA解决方案，即第二个A是唯一的A是要走的路。<p>我曾经考虑过个人OAuth解决方案，即用户浏览器作为OAuth提供者，可以验证她是她。或者像LastPass那样，允许用户注册服务，而不仅仅是存储密码。<p>所有这些密码管理器都只是对破损的密码系统的一个补丁/黑客。<p>解决密码问题是围绕这个想法启动新的创业公司的好方法。在手机上安装应用程序，作为OAuth的单键登录，就像使用物理令牌一样，将是一个真正伟大的创业公司的想法，将摆脱密码。因为有了2FA，你实际上就不需要第一步的密码了。该应用程序将只与LastPass、物理令牌和Authenticator应用程序类似。 <p>流程可以是这样的：<p>* 你只用电子邮件或用户名登录网站<p>* 请求被发送给服务<p>* 弹出窗口显示在你的手机上（可以用密码限制，就像某人想要更好的安全性的银行手机应用程序）<p>* 用户点击按钮<p>* 服务在网站上验证用户<p> 要重新注册一个网站。 <p>* 你输入用户名或电子邮件，屏幕上显示QR码<p>* 你用应用程序扫描代码<p>* 你只需要一个密码就可以使用该服务。这可以被称为2ndFA第二因素认证。<p>使用密码和电子邮件的正常注册过程将只发生在该服务。",
  "description_zh-Hant": "這是我在dev.to https://dev.to/kevincox/maybe-passwords-are-the-future-4gdl 這個帖子上添加的評論，我想它可能會讓Hacker News的讀者感興趣。<p>我認為根本不需要密碼。它們存在的原因是為了驗證你是你。有更好的方法可以做到這一點。<p>密碼解決的問題是，你說一次你是你，然後再次驗證你是你。但密碼是很久以前創造的解決方案，當時還沒有其他的認證方式。<p>我認為2FA解決方案，即第二個A是唯一的A是要走的路。<p>我曾經考慮過個人OAuth解決方案，即用戶瀏覽器作為OAuth提供者，可以驗證她是她。或者像LastPass那樣，允許用戶註冊服務，而不僅僅是存儲密碼。<p>所有這些密碼管理器都只是對破損的密碼系統的一個補丁/黑客。<p>解決密碼問題是圍繞這個想法啟動新的創業公司的好方法。在手機上安裝應用程序，作為OAuth的單鍵登錄，就像使用物理令牌一樣，將是一個真正偉大的創業公司的想法，將擺脫密碼。因為有了2FA，你實際上就不需要第一步的密碼了。該應用程序將只與LastPass、物理令牌和Authenticator應用程序類似。 <p>流程可以是這樣的：<p>* 你只用電子郵件或用戶名登錄網站<p>* 請求被髮送給服務<p>* 彈出窗口顯示在你的手機上（可以用密碼限制，就像某人想要更好的安全性的銀行手機應用程序）<p>* 用戶點擊按鈕<p>* 服務在網站上驗證用戶<p> 要重新註冊一個網站。 <p>* 你輸入用戶名或電子郵件，屏幕上顯示QR碼<p>* 你用應用程序掃描代碼<p>* 你只需要一個密碼就可以使用該服務。這可以被稱為2ndFA第二因素認證。<p>使用密碼和電子郵件的正常註冊過程將只發生在該服務。"
}