{
  "@type": "NewsArticle",
  "identifier": "2022--03--04--en--myfeed--HackerNews--NewsArticle--30558020",
  "url": "https://news.ycombinator.com/item?id=30558020",
  "headline": "Show HN: Mailwitness – Digital Signatures over Email",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN,\nI'm Marek Dopiera and I wanted to share the digital signature solution which I made with my software house. Your feedback would be much appreciated.<p>We've just launched it - it's a service for signing documents over e-mail - <a href=\"https://mailwitness.com\" rel=\"nofollow\">https://mailwitness.com</a>. It still has some rough edges, but hopefully it is useful already.<p>To sign a PDF with somebody, you e-mail them the PDF and put sign@mailwitness.com in CC. If they agree, they need to forward it to sign@mailwitness.com. When they do, you all get your document signed. You can generate PDFs from e-mail, too for convenience.<p>We made this to raise the safety bar of agreements made via e-mail. Via anecdotal evidence, we know that if people do not use services like DocuSign or HelloSign, they consider an e-mail conversation as proof or they print, sign and scan documents. I think we're offering more safety and convenience, because we're preventing the documents from alteration, forging fakes and backdating (by using OpenTimestamp, which essentially constructs a Merkle tree and puts its root into a Bitcoin transaction).<p>I'm hoping that our service becomes useful also because it doesn't require any sign-up (just one confirmation e-mail for Ts&amp;Cs), it's free (in the basic model) and doesn't require the extra cognitive load on learning a web app or a mobile app.<p>You may argue, that one can create a fake e-mail account and use that. That's a valid point, but the reality proves that verification via e-mail is enough for lots of people (vide the agreements over e-mail or DocuSign or HelloSign). In the future we may create paid options, which would include extra identity verification. Even without that extra option, things are not as bad, though: if you use your work e-mail, it's usually your employer who verified your identity.<p>Another question you might have is spoofing. If your e-mail has a valid DKIM signature (which is the case for most major e-mail providers), we'll accept your message. If it doesn't we'll send you a message to verify that you can also receive e-mail.<p>For data safety, we have designed the service such that we discard the documents as soon as we process an e-mail (usually a low number of seconds).<p>Finally, there is legal safety. We operate under the EU law, which qualifies us as a &quot;Trust service provider&quot; and puts requirements on our service. What we do, qualifies as an &quot;Advanced Digital Signature&quot; and according to the EU law, cannot be denied legal effect based on the grounds that it is digital.<p>Monetization path is unclear yet - I want to see if this catches on and if yes, how people are going to use it. Some options include extra services like using your own certificate rather than ours or identity verification.<p>I would really love to hear your feedback - especially for what reasons you would not use it.<p>Thank you",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "siersciu",
    "url": "https://news.ycombinator.com/user?id=siersciu"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30558020",
  "sameAs": "https://mailwitness.com",
  "dateCreated": "2022-03-04T18:11:38.979Z",
  "datePublished": "2022-03-04T17:56:01.000Z",
  "dateModified": "2022-03-04T18:11:38.979Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Mailwitness - 通过电子邮件进行数字签名",
  "headline_zh-Hant": "Show HN: Mailwitness - 通過電子郵件進行數字簽名",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN。\n我是Marek Dopiera，我想分享我和我的软件公司做的数字签名解决方案。<p>我们刚刚推出了它 - 这是一个通过电子邮件签署文件的服务 - <a href=\"https://mailwitness.com\" rel=\"nofollow\">https://mailwitness.com</a>。它仍然有一些粗糙的边缘，但希望它已经很有用了。<p>要与某人签署一个PDF，你把PDF发到他们的邮箱里，并把sign@mailwitness.com。如果他们同意，他们需要将其转发给sign@mailwitness.com。当他们这样做时，你们都得到了你们的文件签名。为方便起见，你也可以从电子邮件中生成PDF。<p>我们这样做是为了提高通过电子邮件达成协议的安全标准。通过传闻，我们知道，如果人们不使用DocuSign或HelloSign这样的服务，他们会把电子邮件对话视为证据，或者打印、签署和扫描文件。我认为我们正在提供更多的安全和便利，因为我们正在防止文件被篡改、伪造和倒退（通过使用OpenTimestamp，它本质上构建了一个Merkle树，并将其根放到比特币交易中）。 <p>我希望我们的服务变得有用，因为它不需要任何注册（只有一封确认Ts&amp;Cs的电子邮件），它是免费的（在基本模式下），并且不需要学习网络应用或移动应用的额外认知负荷。这是一个有效的观点，但现实证明，对很多人来说，通过电子邮件验证已经足够了（参见通过电子邮件或DocuSign或HelloSign的协议）。在未来，我们可能会创建付费选项，这将包括额外的身份验证。即使没有这个额外的选项，事情也没有那么糟糕：如果你使用你的工作电子邮件，通常是你的雇主验证你的身份。<p>你可能有的另一个问题是欺骗。如果你的电子邮件有一个有效的DKIM签名（大多数主要的电子邮件供应商都是这种情况），我们会接受你的信息。如果它没有，我们会给你发送一个信息，以验证你也能接收电子邮件。<p>为了数据安全，我们设计了这样的服务，即我们一处理完电子邮件就会丢弃文件（通常是很低的秒数）。<p>最后，还有法律安全。我们在欧盟法律下运作，这使我们有资格成为 \"信任服务提供商\"，并对我们的服务提出要求。我们所做的，符合&quot;高级数字签名&quot;的条件，并且根据欧盟法律，不能因为它是数字的而被剥夺法律效力。<p>货币化路径还不清楚--我想看看这是否会流行，如果是，人们将如何使用它。一些选项包括额外的服务，如使用你自己的证书而不是我们的，或身份验证。<p>我真的很想听到你的反馈 - 特别是你出于什么原因不使用它。",
  "description_zh-Hant": "你好，HN。\n我是Marek Dopiera，我想分享我和我的軟件公司做的數字簽名解決方案。<p>我們剛剛推出了它 - 這是一個通過電子郵件簽署文件的服務 - <a href=\"https://mailwitness.com\" rel=\"nofollow\">https://mailwitness.com</a>。它仍然有一些粗糙的邊緣，但希望它已經很有用了。<p>要與某人簽署一個PDF，你把PDF發到他們的郵箱裡，並把sign@mailwitness.com。如果他們同意，他們需要將其轉發給sign@mailwitness.com。當他們這樣做時，你們都得到了你們的文件簽名。為方便起見，你也可以從電子郵件中生成PDF。<p>我們這樣做是為了提高通過電子郵件達成協議的安全標準。通過傳聞，我們知道，如果人們不使用DocuSign或HelloSign這樣的服務，他們會把電子郵件對話視為證據，或者打印、簽署和掃描文件。我認為我們正在提供更多的安全和便利，因為我們正在防止文件被篡改、偽造和倒退（通過使用OpenTimestamp，它本質上構建了一個Merkle樹，並將其根放到比特幣交易中）。 <p>我希望我們的服務變得有用，因為它不需要任何註冊（只有一封確認Ts&amp;Cs的電子郵件），它是免費的（在基本模式下），並且不需要學習網絡應用或移動應用的額外認知負荷。這是一個有效的觀點，但現實證明，對很多人來說，通過電子郵件驗證已經足夠了（參見通過電子郵件或DocuSign或HelloSign的協議）。在未來，我們可能會創建付費選項，這將包括額外的身份驗證。即使沒有這個額外的選項，事情也沒有那麼糟糕：如果你使用你的工作電子郵件，通常是你的僱主驗證你的身份。<p>你可能有的另一個問題是欺騙。如果你的電子郵件有一個有效的DKIM簽名（大多數主要的電子郵件供應商都是這種情況），我們會接受你的信息。如果它沒有，我們會給你發送一個信息，以驗證你也能接收電子郵件。<p>為了數據安全，我們設計了這樣的服務，即我們一處理完電子郵件就會丟棄文件（通常是很低的秒數）。<p>最後，還有法律安全。我們在歐盟法律下運作，這使我們有資格成為 \"信任服務提供商\"，並對我們的服務提出要求。我們所做的，符合&quot;高級數字簽名&quot;的條件，並且根據歐盟法律，不能因為它是數字的而被剝奪法律效力。<p>貨幣化路徑還不清楚--我想看看這是否會流行，如果是，人們將如何使用它。一些選項包括額外的服務，如使用你自己的證書而不是我們的，或身份驗證。<p>我真的很想聽到你的反饋 - 特別是你出於什麼原因不使用它。"
}