{
  "@type": "NewsArticle",
  "identifier": "2022--03--25--en--myfeed--HackerNews--NewsArticle--30804169",
  "url": "https://news.ycombinator.com/item?id=30804169",
  "headline": "Launch HN: Azuki (YC W22) – All-you-can-read manga subscription",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey there, we’re Abbas, Evan, Adela, Krystyn, and Ken from Azuki (<a href=\"https://www.azuki.co/\" rel=\"nofollow\">https://www.azuki.co/</a>). We’re a subscription service for reading digital manga (Japanese comics) on Web, iOS, and Android. With Azuki you can easily read official translations of the latest chapters or dive into our back catalog of hit manga and hidden gems.<p>We’re in a golden age of manga. More and more series are getting translated and released in English, but publishers still can’t keep up with fan demand. Print shortages due to Covid and the long production pipeline of print books mean that lots of series take months or years to get official releases in English. And believe it or not, print sales still dwarf ebook sales for English manga!<p>We are huge manga fans and wanted a way to easily access lots of new manga without filling up our bookshelves, paying for thousands of individual ebooks, or resorting to piracy. That last one is important, since manga piracy is still rampant, and we wanted to make it as easy as possible to support creators by reading official releases. Most of us worked together at Crunchyroll (the anime streaming service) where we learned a lot about how to grow a subscription product and an associated fan community. Evan also worked for many years as an anime/manga journalist and podcaster, and Adela had experience in manga localization.<p>All that led to Azuki. For a single subscription fee ($4.99/month), we offer unlimited access to high-quality official translations of new chapters from more than 20 ongoing series including EDENS ZERO, The Seven Deadly Sins: Four Knights of the Apocalypse, and The Yakuza’s Guide to Babysitting. Most new chapters are available in English at the same time as they go on sale in Japan! The subscription also includes a huge back catalog, with hit series like Attack on Titan and Fairy Tail, and acclaimed indie manga like Pop Life and Children of Mu-Town.<p>All of this is available to read in our apps on Web, iOS, and Android, with series progress and reading lists shared across the apps. Fans love us compared to other manga reader options because of the easy access to the latest chapters (no need to buy individual ebooks for each one), our diverse catalog featuring series from six different publishers, and our dedication to presenting manga pages in the highest possible quality.<p>By the way, there are over 150 currently running manga magazines in Japan, with each usually releasing either weekly or monthly. Each magazine serializes anywhere from five to over 30 series on a chapter-by-chapter basis. That‘s a huge amount of comics, and only a fraction of it makes its way to English-speaking markets right now. We need more!<p>The most popular and visible genres of manga are action and fantasy adventure (things like EDENS ZERO and Four Knights of the Apocalypse), but there are a lot of fans looking for other genres, especially romance (A Sign of Affection) and comedy (Grand Blue Dreaming). We were a little surprised by how popular some of those series ended up being!<p>Our customers primarily use us to read new manga chapters released simultaneously with Japan, known as “simulpubs” in the manga industry. But we also offer community features to let fans talk about their favorites, in comment threads and in our official Discord. It’s been really cool meeting these fans and watching a community grow up around the service.<p>In terms of our business model, we charge a monthly subscription. We pay out royalties to publishers based on how much each user reads of each series, and keep the remainder to pay for our operations.<p>We’d love for you to give Azuki a try! Most series have the first few chapters available for free (with ads), and there’s a 30-day free trial so you can try our Premium membership before you pay anything. We seriously appreciate any feedback you have about the service and how we can improve, and we look forward to talking manga in the comments. Thank you!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "BasouKazuma",
    "url": "https://news.ycombinator.com/user?id=BasouKazuma"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30804169",
  "sameAs": "https://news.ycombinator.com/item?id=30804169",
  "dateCreated": "2022-03-25T16:47:26.662Z",
  "datePublished": "2022-03-25T16:31:46.000Z",
  "dateModified": "2022-03-25T16:47:26.662Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 16
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 6
    }
  ],
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      },
      "@version": 1.1
    }
  ],
  "description_zh-Hans": "嗨，我们是Azuki（<a href=\"https://www.azuki.co/\" rel=\"nofollow\">https://www.azuki.co/</a>）的Abbas、Evan、Adela、Krystyn和Ken。我们是一个在网络、iOS和Android上阅读数字漫画（日本漫画）的订阅服务。通过Azuki，你可以轻松地阅读最新章节的官方翻译，或深入了解我们的热门漫画和隐藏的珍品的后备目录。越来越多的系列作品被翻译成英文并发行，但出版商仍然无法跟上粉丝的需求。由于Covid造成的印刷短缺和印刷书籍的漫长生产管道，意味着很多系列需要几个月或几年的时间才能获得正式的英文版本。不管你信不信，印刷品的销售量仍然使英文漫画的电子书销售量相形见绌！<p>我们是巨大的漫画迷，希望有一种方法可以轻松获得大量的新漫画，而不需要填满我们的书架，支付成千上万的独立电子书，或诉诸于盗版。最后一条很重要，因为漫画的盗版仍然很猖獗，我们希望通过阅读官方发布的漫画，尽可能方便地支持创作者。我们中的大多数人都曾在Crunchyroll（动漫流媒体服务）工作，在那里我们学到了很多关于如何发展订阅产品和相关粉丝社区的知识。埃文还做了多年的动漫记者和播音员，阿德拉有漫画本地化的经验。只需支付一笔订阅费（4.99美元/月），我们就可以无限制地访问20多个正在进行的系列的高质量官方翻译的新章节，包括《EDENS ZERO》、《七宗罪》。天启四骑士》和《山口组的保姆指南》。大多数新章节的英文版本在日本上市的同时就可以看到! 订阅还包括一个巨大的回溯目录，包括《攻壳机动队》和《精灵宝可梦》等热门系列，以及《流行生活》和《穆镇的孩子》等广受好评的独立漫画。<p>所有这些都可以在我们的网络、iOS和Android应用程序中阅读，系列进度和阅读列表在各应用程序中共享。与其他漫画阅读器相比，粉丝们喜欢我们，因为我们可以很容易地获得最新的章节（不需要为每个章节购买单独的电子书），我们的目录包括来自六个不同出版商的系列，以及我们致力于以尽可能高的质量呈现漫画页面。<p>顺便说一下，目前在日本有超过150本漫画杂志，每个杂志通常每周或每月发布。每本杂志以章节为单位连载5至30多个系列。这是一个巨大的漫画量，而现在只有一小部分能进入英语市场。我们需要更多！<p>最受欢迎和可见的漫画类型是动作和幻想冒险（像《EDENS ZERO》和《天启四骑士》），但也有很多粉丝在寻找其他类型的作品，特别是浪漫（《A Sign of Affection》）和喜剧（《大蓝梦》）。我们对其中一些系列最终的受欢迎程度感到有点惊讶！<p>我们的客户主要使用我们来阅读与日本同步发布的新漫画章节，在漫画行业被称为 \"simulpubs\"。但我们也提供社区功能，让粉丝在评论线程和我们的官方Discord中谈论他们的最爱。遇到这些粉丝，看着社区围绕着服务成长，真的很酷。<p>就我们的商业模式而言，我们按月收费。我们根据每个用户对每个系列的阅读量向出版商支付版税，并保留剩余部分以支付我们的运营费用。<p>我们很希望你能给Azuki一个尝试! 大多数系列的前几章都是免费的（有广告），而且有30天的免费试用期，你可以在支付任何费用之前尝试我们的高级会员。我们非常感谢你对服务的任何反馈，以及我们可以如何改进，我们期待着在评论中谈论漫画。谢谢你！\"。",
  "description_zh-Hant": "嗨，我們是Azuki（<a href=\"https://www.azuki.co/\" rel=\"nofollow\">https://www.azuki.co/</a>）的Abbas、Evan、Adela、Krystyn和Ken。我們是一個在網絡、iOS和Android上閱讀數字漫畫（日本漫畫）的訂閱服務。通過Azuki，你可以輕鬆地閱讀最新章節的官方翻譯，或深入瞭解我們的熱門漫畫和隱藏的珍品的後備目錄。越來越多的系列作品被翻譯成英文併發行，但出版商仍然無法跟上粉絲的需求。由於Covid造成的印刷短缺和印刷書籍的漫長生產管道，意味著很多系列需要幾個月或幾年的時間才能獲得正式的英文版本。不管你信不信，印刷品的銷售量仍然使英文漫畫的電子書銷售量相形見絀！<p>我們是巨大的漫畫迷，希望有一種方法可以輕鬆獲得大量的新漫畫，而不需要填滿我們的書架，支付成千上萬的獨立電子書，或訴諸於盜版。最後一條很重要，因為漫畫的盜版仍然很猖獗，我們希望通過閱讀官方發佈的漫畫，儘可能方便地支持創作者。我們中的大多數人都曾在Crunchyroll（動漫流媒體服務）工作，在那裡我們學到了很多關於如何發展訂閱產品和相關粉絲社區的知識。埃文還做了多年的動漫記者和播音員，阿德拉有漫畫本地化的經驗。只需支付一筆訂閱費（4.99美元/月），我們就可以無限制地訪問20多個正在進行的系列的高質量官方翻譯的新章節，包括《EDENS ZERO》、《七宗罪》。天啟四騎士》和《山口組的保姆指南》。大多數新章節的英文版本在日本上市的同時就可以看到! 訂閱還包括一個巨大的回溯目錄，包括《攻殼機動隊》和《精靈寶可夢》等熱門系列，以及《流行生活》和《穆鎮的孩子》等廣受好評的獨立漫畫。<p>所有這些都可以在我們的網絡、iOS和Android應用程序中閱讀，系列進度和閱讀列表在各應用程序中共享。與其他漫畫閱讀器相比，粉絲們喜歡我們，因為我們可以很容易地獲得最新的章節（不需要為每個章節購買單獨的電子書），我們的目錄包括來自六個不同出版商的系列，以及我們致力於以儘可能高的質量呈現漫畫頁面。<p>順便說一下，目前在日本有超過150本漫畫雜誌，每個雜誌通常每週或每月發佈。每本雜誌以章節為單位連載5至30多個系列。這是一個巨大的漫畫量，而現在只有一小部分能進入英語市場。我們需要更多！<p>最受歡迎和可見的漫畫類型是動作和幻想冒險（像《EDENS ZERO》和《天啟四騎士》），但也有很多粉絲在尋找其他類型的作品，特別是浪漫（《A Sign of Affection》）和喜劇（《大藍夢》）。我們對其中一些系列最終的受歡迎程度感到有點驚訝！<p>我們的客戶主要使用我們來閱讀與日本同步發佈的新漫畫章節，在漫畫行業被稱為 \"simulpubs\"。但我們也提供社區功能，讓粉絲在評論線程和我們的官方Discord中談論他們的最愛。遇到這些粉絲，看著社區圍繞著服務成長，真的很酷。<p>就我們的商業模式而言，我們按月收費。我們根據每個用戶對每個系列的閱讀量向出版商支付版稅，並保留剩餘部分以支付我們的運營費用。<p>我們很希望你能給Azuki一個嘗試! 大多數系列的前幾章都是免費的（有廣告），而且有30天的免費試用期，你可以在支付任何費用之前嘗試我們的高級會員。我們非常感謝你對服務的任何反饋，以及我們可以如何改進，我們期待著在評論中談論漫畫。謝謝你！\"。"
}