{
  "@type": "NewsArticle",
  "identifier": "2022--04--10--en--myfeed--HackerNews--NewsArticle--30981095",
  "url": "https://news.ycombinator.com/item?id=30981095",
  "headline": "Why Tech will quit writing history for the next few years",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Not everyone will remember the 70’s Energy Crisis  when the real price of oil trebled - yes, trebled! - in less than three years. For Europeans, memories will include rostered blackouts, greatly reduced travel and clunky Tech that needed back-up power.. For North Americans, the abiding memory will be the 55 mph speed limit.<p>Fast forward half a decade and we’re there again, but this time in slightly better shape. The US is virtually self sufficient in oil and Europe has a more integrated and cleaner energy supply using LNG. That’s Russian LNG and as one trader suggested: “There’s nothing else like it out there.”  Hence the current crisis.<p>The other big difference between the two crises is the growth of Tech to become global, social and held in the palm of one’s hand. Getting tangible stuff out of the ground may be an integral part of American history, but it’s capital intensive, requires long pay-back times and is, we’re told, not good for the environment.<p>In these carbon sensitive times, Tech is emission-lite and has the credentials that at least placate environmental activists. The top 10 Tech companies account for 50% of the Fortune 500’s capitalisation, but only 5% of its emissions. Pretty stunning, that.<p>But energy self sufficiency is now the focus of Europe and the US and much as they would like to surf the low emissionTech wave, for the next few years the tangible stuff that comes out of the ground or Nuclear power plant is going be where investment will focus.<p>This means that Tech investments will need to demonstrate their worth far more quickly than anyone was expecting. Investors too, will be much more fussy about what’s on offer. The new Tech they’ll be looking for will help get more Black Gold out of the ground or manage its use. Personal Energy Apps will probably become  the next hot Tech products.<p>Other Techs such as Health-AI, Health Tech, FinTech and Tech Apps in general will still obtain finance and grow but gone will be those wild valuations from the era when Tech wrote the History of the world.<p>For bros on either side of the Pond in their local coffee house, sipping their 17-ingredient Frappuccinos and swapping their latest Wordle challenges; “Zuck Bucks” gossip and other Tech ephemera will become increasingly irrelevant.<p>In the next few years, energy exploration and management will resume its natural role in world History because for the foreseeable, we need barrels of oil and litres of LPG more than we need Tech.<p>@DewhurstLeslie",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "LeslieDewhurst",
    "url": "https://news.ycombinator.com/user?id=LeslieDewhurst"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30981095",
  "sameAs": "https://news.ycombinator.com/item?id=30981095",
  "dateCreated": "2022-04-10T21:28:19.672Z",
  "datePublished": "2022-04-10T19:59:12.000Z",
  "dateModified": "2022-04-10T21:28:19.672Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "为什么科技部将在未来几年内放弃书写历史",
  "headline_zh-Hant": "為什麼科技部將在未來幾年內放棄書寫歷史",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "不是每个人都会记得70年代的能源危机，当时石油的实际价格在不到三年的时间里翻了三倍--是的，翻了三倍! - 在不到三年的时间里翻了三倍。对于欧洲人来说，他们的记忆包括轮流停电，大大减少旅行和需要备用电源的笨重技术。对于北美人来说，持久的记忆将是55英里/小时的速度限制。<p>快进五年，我们又到了那里，但这次情况稍好。美国在石油方面几乎自给自足，而欧洲有一个使用液化天然气的更综合、更清洁的能源供应。这就是俄罗斯的液化天然气，正如一位交易员所言：\"没有什么比这更重要的了。\"  因此，目前的危机。<p>两次危机之间的另一个很大的区别是科技的发展成为全球性的、社会性的，并被握在手掌中。把有形的东西从地里弄出来可能是美国历史不可分割的一部分，但它是资本密集型的，需要很长的回报时间，而且我们被告知对环境不利。<p>在这个对碳敏感的时代，科技是低排放的，而且至少有资格安抚环保活动家。前10家科技公司占《财富》500强资本的50%，但只占其排放量的5%。<p>但是，能源自给自足现在是欧洲和美国的重点，尽管他们很想在低排放的科技浪潮中冲浪，但在未来几年里，从地下或核电站出来的有形物质将是投资的重点。投资者也将对所提供的东西更加挑剔。他们寻找的新技术将有助于从地下获得更多的黑金或管理其使用。个人能源应用可能会成为下一个热门科技产品。<p>其他科技，如健康人工智能、健康科技、金融科技和一般的科技应用仍将获得融资和增长，但科技书写世界历史的时代的那些疯狂估值将不复存在。 <p>对于池塘两岸的兄弟们来说，他们在当地的咖啡馆里喝着17种成分的星冰乐，交流着他们最新的Wordle挑战；\"Zuck Bucks \"的八卦和其他科技史料将变得越来越不重要。<p>在未来几年，能源勘探和管理将恢复其在世界历史上的自然角色，因为在可预见的范围内，我们需要桶装石油和升装液化气，而不是需要科技。",
  "description_zh-Hant": "不是每個人都會記得70年代的能源危機，當時石油的實際價格在不到三年的時間裡翻了三倍--是的，翻了三倍! - 在不到三年的時間裡翻了三倍。對於歐洲人來說，他們的記憶包括輪流停電，大大減少旅行和需要備用電源的笨重技術。對於北美人來說，持久的記憶將是55英里/小時的速度限制。<p>快進五年，我們又到了那裡，但這次情況稍好。美國在石油方面幾乎自給自足，而歐洲有一個使用液化天然氣的更綜合、更清潔的能源供應。這就是俄羅斯的液化天然氣，正如一位交易員所言：\"沒有什麼比這更重要的了。\"  因此，目前的危機。<p>兩次危機之間的另一個很大的區別是科技的發展成為全球性的、社會性的，並被握在手掌中。把有形的東西從地裡弄出來可能是美國曆史不可分割的一部分，但它是資本密集型的，需要很長的回報時間，而且我們被告知對環境不利。<p>在這個對碳敏感的時代，科技是低排放的，而且至少有資格安撫環保活動家。前10家科技公司佔《財富》500強資本的50%，但只佔其排放量的5%。<p>但是，能源自給自足現在是歐洲和美國的重點，儘管他們很想在低排放的科技浪潮中衝浪，但在未來幾年裡，從地下或核電站出來的有形物質將是投資的重點。投資者也將對所提供的東西更加挑剔。他們尋找的新技術將有助於從地下獲得更多的黑金或管理其使用。個人能源應用可能會成為下一個熱門科技產品。<p>其他科技，如健康人工智能、健康科技、金融科技和一般的科技應用仍將獲得融資和增長，但科技書寫世界歷史的時代的那些瘋狂估值將不復存在。 <p>對於池塘兩岸的兄弟們來說，他們在當地的咖啡館裡喝著17種成分的星冰樂，交流著他們最新的Wordle挑戰；\"Zuck Bucks \"的八卦和其他科技史料將變得越來越不重要。<p>在未來幾年，能源勘探和管理將恢復其在世界歷史上的自然角色，因為在可預見的範圍內，我們需要桶裝石油和升裝液化氣，而不是需要科技。"
}