{
  "@type": "NewsArticle",
  "identifier": "2022--02--23--en--myfeed--HackerNews--NewsArticle--30440363",
  "url": "https://news.ycombinator.com/item?id=30440363",
  "headline": "Tell HN: Unlimited Vacation” Policies. Why I still like them",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Unlimited Vacation paid time off (PTO) policies in the US have started getting a lot of well deserved criticism, with many adept observers calling it a scam<p>This is due to the following reasons:<p>1. Workers often experience pressure to never use the unlimited vacation policy.<p>2. The managers might not approve the vacation time, the manager’s opinion of what is a normal amount of vacation is arbitrary and can be low.<p>3. In companies with a specific number of days of vacation, this amount of time accrues in a balance for the employee and is paid out to the employee if the employee never uses it when they leave the company. Companies with “Unlimited” time have no balance, and so nothing is paid out, hence why its seen as a ploy and scam.<p>The reason I like PTO is because I do take the risk of leveraging it and am content with that.<p>1. I’ve seen managers try to guilt employees into the idea that 10 days unlimited vacation as the max, or other arbitrary numbers around there based on their own experience. (If you are not aware, the US has no norm or legally required amount of vacation time. Many workers have zero paid vacation.) In a developed nation like Germany, the statutory minimum is 24 working days a year, however, it’s common practice that companies offer 30 days as a standard for all employees. As American Exceptionally is baselessly ingrained into many people’s minds, my US Unlimited Vacation policy competes with developed nations.<p>2. Set your goals and meet them. In many jobs the software engineers and team is empowered to make their own goals, and are judged on how well they met them. Time in the office and presence doesn’t matter. I like Doubling down on that theory and observation.<p>3. In companies with other PTO policies which can be paid out in cash when the employee leaves, the vacation time accrues slowly, where eventually the employee winds up with a decent amount of vacation time. Even the aforementioned German system has a 6 month time period before the full benefits kick in. This is worse for me than an unlimited paid time off policy. Accruing PTO can eventually begin to benefit employees of a company several years into their tenure, because the amount they have and can take can begins exceeding 15, 20, 25 days. As I leave companies with a year or two, I get reset every time. No matter what the compensation is, it would impact my work life balance. Whereas actually using an Unlimited Vacation policy would not, after setting development goals and meeting them with integrity.<p>&quot;25-30 days is arbitrary too, why stop there&quot; you might ask. I mostly just want to keep up with my girlfriends from developed nations who also have that much time off.<p>A perspective.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "vmception",
    "url": "https://news.ycombinator.com/user?id=vmception"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30440363",
  "sameAs": "https://news.ycombinator.com/item?id=30440363",
  "dateCreated": "2022-02-23T12:48:41.625Z",
  "datePublished": "2022-02-23T12:43:06.000Z",
  "dateModified": "2022-02-23T12:48:41.625Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "告诉HN：\"无限假期 \"政策。为什么我仍然喜欢它们",
  "headline_zh-Hant": "告訴HN：\"無限假期 \"政策。為什麼我仍然喜歡它們",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "美国的无限假期带薪休假（PTO）政策已经开始受到很多当之无愧的批评，许多精明的观察家称其为骗局<p>这是因为以下原因：<p>1.工人们经常遇到压力，永远不会使用无限假期政策。工人们经常会遇到压力，永远不会使用无限制的假期政策。<p>2.经理们可能不会批准休假时间，经理们对什么是正常的假期的看法是任意的，而且可能很低。<p>3.在有特定假期天数的公司，这些时间累积在员工的余额中，如果员工在离开公司时从未使用过这些时间，就会支付给员工。有 \"无限 \"时间的公司没有余额，因此没有任何支付，因此它被视为一种策略和骗局。<p>我喜欢PTO的原因是我确实承担了利用它的风险，并对此感到满意。我看到经理们试图让员工相信，10天无限制的假期是最大的，或者根据他们自己的经验，在这附近有其他任意的数字。(如果你不知道，美国没有规范或法律要求的休假时间。许多工人的带薪假期为零）。在像德国这样的发达国家，法定的最低限度是一年24个工作日，然而，通常的做法是，公司提供30天作为所有员工的标准。由于美国的例外情况毫无根据地扎根于许多人的脑海中，我的美国无限假期政策与发达国家竞争。<p>2.设定你的目标并实现它们。在许多工作中，软件工程师和团队被授权制定自己的目标，并根据他们达到目标的程度来评判。在办公室的时间和存在感并不重要。我喜欢Doubling down这个理论和观察。<p>3.在有其他PTO政策的公司，当员工离开时可以用现金支付，假期时间会慢慢累积，最终员工会有相当数量的假期时间。即使是前面提到的德国系统，也有6个月的时间才开始享受全部福利。这对我来说比无限带薪休假政策更糟糕。累积的PTO最终可以在一个公司的员工任职几年后开始受益，因为他们拥有的和可以采取的数量可以开始超过15、20、25天。当我离开公司一两年后，我每次都会被重置。无论补偿是什么，它都会影响我的工作生活平衡。而真正使用无限假期政策则不会，在设定发展目标并完整地达到这些目标之后。<p>&quot;25-30天也是任意的，为什么停在那里&quot;你可能会问。我主要是想跟上我那些来自发达国家的女朋友，她们也有这么多的假期。<p>一个观点。",
  "description_zh-Hant": "美國的無限假期帶薪休假（PTO）政策已經開始受到很多當之無愧的批評，許多精明的觀察家稱其為騙局<p>這是因為以下原因：<p>1.工人們經常遇到壓力，永遠不會使用無限假期政策。工人們經常會遇到壓力，永遠不會使用無限制的假期政策。<p>2.經理們可能不會批准休假時間，經理們對什麼是正常的假期的看法是任意的，而且可能很低。<p>3.在有特定假期天數的公司，這些時間累積在員工的餘額中，如果員工在離開公司時從未使用過這些時間，就會支付給員工。有 \"無限 \"時間的公司沒有餘額，因此沒有任何支付，因此它被視為一種策略和騙局。<p>我喜歡PTO的原因是我確實承擔了利用它的風險，並對此感到滿意。我看到經理們試圖讓員工相信，10天無限制的假期是最大的，或者根據他們自己的經驗，在這附近有其他任意的數字。(如果你不知道，美國沒有規範或法律要求的休假時間。許多工人的帶薪假期為零）。在像德國這樣的發達國家，法定的最低限度是一年24個工作日，然而，通常的做法是，公司提供30天作為所有員工的標準。由於美國的例外情況毫無根據地紮根於許多人的腦海中，我的美國無限假期政策與發達國家競爭。<p>2.設定你的目標並實現它們。在許多工作中，軟件工程師和團隊被授權制定自己的目標，並根據他們達到目標的程度來評判。在辦公室的時間和存在感並不重要。我喜歡Doubling down這個理論和觀察。<p>3.在有其他PTO政策的公司，當員工離開時可以用現金支付，假期時間會慢慢累積，最終員工會有相當數量的假期時間。即使是前面提到的德國系統，也有6個月的時間才開始享受全部福利。這對我來說比無限帶薪休假政策更糟糕。累積的PTO最終可以在一個公司的員工任職幾年後開始受益，因為他們擁有的和可以採取的數量可以開始超過15、20、25天。當我離開公司一兩年後，我每次都會被重置。無論補償是什麼，它都會影響我的工作生活平衡。而真正使用無限假期政策則不會，在設定發展目標並完整地達到這些目標之後。<p>&quot;25-30天也是任意的，為什麼停在那裡&quot;你可能會問。我主要是想跟上我那些來自發達國家的女朋友，她們也有這麼多的假期。<p>一個觀點。"
}