{
  "@type": "NewsArticle",
  "identifier": "2022--03--01--en--myfeed--HackerNews--NewsArticle--30514190",
  "url": "https://news.ycombinator.com/item?id=30514190",
  "headline": "Launch HN: Onboard (YC W22) – Automate and streamline customer onboarding",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, Jeff Epstein &amp; Will Stevenson here – we’re the founders of <a href=\"https://Onboard.io\" rel=\"nofollow\">https://Onboard.io</a> (YC W22). We make software for companies looking to manage, automate and streamline their customer onboarding and implementation at scale.<p>In the B2B world, many things usually need to be configured or approved before customers can actually use their new software. It’s critical that this process go well—lack of momentum right after a purchase is a primary cause of customer churn. We experienced this at a previous company (Ambassador: acq in 2018) and ended up cobbling together several systems, none of which specialized in onboarding, to give our customers a better experience. Although it was far from optimal, it reduced churn by over 50%.<p>Later, Will did consulting work with SaaS companies and saw what a mess customer onboarding was at otherwise high-functioning startups. When he witnessed a startup doing $100M in revenue using spreadsheets to manage onboarding, it was the straw that broke the camel’s back. We decided to build a better way.<p>Most likely, your sales team promised the client they can get onboarded in record time, but the reality is that it will take much longer.<p>Current approaches are lacking in 4 major areas: (1) Lack of automation slows everything down and makes things inconsistent across teams; (2) buyers lack visibility &amp; collaboration into what needs to be accomplished and when; (3) reminders and updates are often manual emails, wasting time while siloed in email outside the view of critical stakeholders; (4) there isn't an easy way to manage onboarding teams, clients and process for scale.<p>Most companies run all this using templates, which are rigid and hard to scale. When a new customer signs up, an onboarding specialist selects the closest template, then they read about this customer’s requirements and customize the template for them. Templates need to be kept in sync manually because the same tasks are duplicated between them. Often teams download them directly and forget to use the latest version. Worse, templates lead to an awful customer experience because there’s no way to coordinate and manage the process.<p>Various products solve some of this, but you have to cobble them together. Our company is built specifically to solve this problem.<p>Onboard automatically creates custom launch plans by enabling companies to have a single Task Repository, where each task is tagged to a specific customer attribute, plan choice, or use case. We connect these tasks to data learned in the sales process (can pull directly from your CRM) to automatically create a launch plan based on what you need to start using your new software.  We provide visibility to the client with link access to view tasks, assignments and quick discussions (via stream) outside of email and in one place for all stakeholders to see. As the plan proceeds and tasks are completed, we send notifications to appropriate parties. Instead of emailing Excel files, there’s a transparent collaborative process.<p>We’re a SaaS and there is pricing on 2 vectors: platform fee and then per-user (internal users only; external users, i.e. users at your customers, are free).<p>We would love to hear about your (or your company) facing these challenges as a buyer implementing new software OR as a seller (how your company manages clients being onboarded on your software or service business).<p>We have a 14-day trial and if you are interested in trying out the product, feel free to sign up (cc required) or email us at HN@onboard.io and we’ll see what we can do ;)",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jeffepp",
    "url": "https://news.ycombinator.com/user?id=jeffepp"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30514190",
  "sameAs": "https://onboard.io/",
  "dateCreated": "2022-03-01T14:10:29.498Z",
  "datePublished": "2022-03-01T14:00:12.000Z",
  "dateModified": "2022-03-01T14:10:29.498Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Launch HN: Onboard (YC W22) - 自动化和简化客户的入职流程",
  "headline_zh-Hant": "Launch HN: Onboard (YC W22) - 自動化和簡化客戶的入職流程",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hi HN, Jeff Epstein &amp; Will Stevenson here - we're the founders of <a href=\"https://Onboard.io\" rel=\"nofollow\">https://Onboard.io</a> (YC W22) 。我们为希望大规模管理、自动化和简化客户入职和实施的公司制作软件。<p>在B2B世界中，在客户实际使用其新软件之前，通常需要对许多东西进行配置或批准。这一过程的顺利进行至关重要--购买后缺乏动力是导致客户流失的主要原因之一。我们在以前的公司（大使：2018年收购）经历过这种情况，最后拼凑了几个系统，其中没有一个是专门用于入职培训的，以便给我们的客户提供更好的体验。<p>后来，Will在SaaS公司做咨询工作，看到在其他高功能的初创公司中，客户入职是多么混乱。当他看到一家收入达1亿美元的初创公司使用电子表格来管理入职，这就是压垮骆驼的那根稻草。<p>很可能，你的销售团队向客户承诺他们可以在创纪录的时间内入职，但实际情况是需要更长的时间。<p>目前的方法在4个主要方面存在不足。(1)缺乏自动化使一切都变得缓慢，并使各团队的工作不一致；(2)买家缺乏可见性和amp；对需要完成的工作和时间进行协作；(3)提醒和更新往往是手动电子邮件，在关键利益相关者的视野之外，被孤立在电子邮件中，浪费了时间；(4)没有一个简单的方法来管理入职团队、客户和流程的规模。<p>大多数公司使用模板运行这一切，这很僵化，难以扩展。当一个新客户注册时，入职专家会选择最接近的模板，然后他们会阅读这个客户的要求，并为他们定制模板。模板需要手动保持同步，因为相同的任务在它们之间是重复的。通常情况下，团队直接下载它们，而忘记使用最新的版本。更糟糕的是，模板导致了糟糕的客户体验，因为没有办法协调和管理这个过程。<p>各种产品解决了其中的一些问题，但你必须把它们拼凑起来。<p>Onboard通过使公司拥有一个单一的任务库来自动创建自定义的启动计划，其中每个任务都被标记为特定的客户属性、计划选择或用例。我们将这些任务与销售过程中了解到的数据联系起来（可以直接从您的CRM中提取），根据您开始使用新软件的需要，自动创建一个启动计划。 我们为客户提供可见性，让他们在电子邮件之外，在一个地方查看任务、任务分配和快速讨论（通过流），让所有利益相关者看到。随着计划的进行和任务的完成，我们会向有关方面发送通知。<p>我们是一个SaaS，有两个方面的定价：平台费和每个用户（仅限内部用户；外部用户，即你的客户的用户，是免费的）。 <p>我们希望听到您（或您的公司）作为买方实施新软件或作为卖方面临的这些挑战（您的公司如何管理客户加入您的软件或服务业务）。<p>我们有14天的试用期，如果您有兴趣尝试该产品，请随时注册（需要抄送）或向我们发送电子邮件：HN@onboard.io，我们将看看我们能做什么；)",
  "description_zh-Hant": "Hi HN, Jeff Epstein &amp; Will Stevenson here - we're the founders of <a href=\"https://Onboard.io\" rel=\"nofollow\">https://Onboard.io</a> (YC W22) 。我們為希望大規模管理、自動化和簡化客戶入職和實施的公司製作軟件。<p>在B2B世界中，在客戶實際使用其新軟件之前，通常需要對許多東西進行配置或批准。這一過程的順利進行至關重要--購買後缺乏動力是導致客戶流失的主要原因之一。我們在以前的公司（大使：2018年收購）經歷過這種情況，最後拼湊了幾個系統，其中沒有一個是專門用於入職培訓的，以便給我們的客戶提供更好的體驗。<p>後來，Will在SaaS公司做諮詢工作，看到在其他高功能的初創公司中，客戶入職是多麼混亂。當他看到一家收入達1億美元的初創公司使用電子表格來管理入職，這就是壓垮駱駝的那根稻草。<p>很可能，你的銷售團隊向客戶承諾他們可以在創紀錄的時間內入職，但實際情況是需要更長的時間。<p>目前的方法在4個主要方面存在不足。(1)缺乏自動化使一切都變得緩慢，並使各團隊的工作不一致；(2)買家缺乏可見性和amp；對需要完成的工作和時間進行協作；(3)提醒和更新往往是手動電子郵件，在關鍵利益相關者的視野之外，被孤立在電子郵件中，浪費了時間；(4)沒有一個簡單的方法來管理入職團隊、客戶和流程的規模。<p>大多數公司使用模板運行這一切，這很僵化，難以擴展。當一個新客戶註冊時，入職專家會選擇最接近的模板，然後他們會閱讀這個客戶的要求，併為他們定製模板。模板需要手動保持同步，因為相同的任務在它們之間是重複的。通常情況下，團隊直接下載它們，而忘記使用最新的版本。更糟糕的是，模板導致了糟糕的客戶體驗，因為沒有辦法協調和管理這個過程。<p>各種產品解決了其中的一些問題，但你必須把它們拼湊起來。<p>Onboard通過使公司擁有一個單一的任務庫來自動創建自定義的啟動計劃，其中每個任務都被標記為特定的客戶屬性、計劃選擇或用例。我們將這些任務與銷售過程中瞭解到的數據聯繫起來（可以直接從您的CRM中提取），根據您開始使用新軟件的需要，自動創建一個啟動計劃。 我們為客戶提供可見性，讓他們在電子郵件之外，在一個地方查看任務、任務分配和快速討論（通過流），讓所有利益相關者看到。隨著計劃的進行和任務的完成，我們會向有關方面發送通知。<p>我們是一個SaaS，有兩個方面的定價：平臺費和每個用戶（僅限內部用戶；外部用戶，即你的客戶的用戶，是免費的）。 <p>我們希望聽到您（或您的公司）作為買方實施新軟件或作為賣方面臨的這些挑戰（您的公司如何管理客戶加入您的軟件或服務業務）。<p>我們有14天的試用期，如果您有興趣嘗試該產品，請隨時註冊（需要抄送）或向我們發送電子郵件：HN@onboard.io，我們將看看我們能做什麼；)"
}