{
  "@type": "NewsArticle",
  "identifier": "2022--03--06--en--myfeed--HackerNews--NewsArticle--30576132",
  "url": "https://news.ycombinator.com/item?id=30576132",
  "headline": "Self-Determination for Cities can avert wars and crises in Ukraine, elsewhere",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Before modern nation-states, we had empires and cities. Empires would simply conquer cities top-down. (I don't agree we didn't have nation-states before. The Bible for example describes the 12 tribes of Israel being united, as well as lots of other nation-states around them: Midian had cities, Philistines had the pentapolis, etc.)<p>But imagine if each neighborhood could pay for a free market of police agencies. The police agency would train local people to learn local laws and enforce them. If the agency and its tactics were too brutal or too ineffective, the neighborhood would simply give next year's tonract to their competitors.<p>I think the same approach should be done with cities choosing the countries bottom-up. The UN could simply extend self-determination to cities and regions, allowing e.g. Lugano in Switzerland to join Italy if they felt it was in their best interests. Or Hong Kong could choose to secede from Mainland China. Then we wouldn't have these stupid wars. Most wars start because some separatists (or armed opposition to the central government) seize a chance for their cities to leave the larger polity or federation. (Perhaps demographics changed, or there is a constitutional crisis, or another war.) Kurds, Basques, Catalonians, etc. are all looking for such an opportunity. If the UN recognized the self-determination of cities, then any armed gangs would just be arrested as criminals, by the city's own police, since the city can simply vote democratically, there is no need for violence.<p>Instead, the revolution is usually nipped in the bud by violent arrests (e.g. in Catalonia by Spain, or Hong Kong by China) but once in a while, a larger country helps these separatists because of ethnic ties, or because of geopolitical interests (e.g. to keep the host country destabilized and weak). So you get a protracted war for many years, while the civilian population faces a humanitarian crisis. We have seen such things in Yemen, Syria. Rather than meeting up and holding diplomatic talks (like Iran and Saudis are finally doing) the two countries just keep throwing weapons at the region from both sides.<p>In Ukraine, this is like a matreshka doll[1] of this exact phenomenon on several levels:<p><pre><code>  1. Donetsk vs Ukraine  (to combat Donetsk distancing from Ukraine, but Donetsk is armed by Russia endlessly)\n\n  2. Ukraine vs Russia  (to combat Ukraine's distancing from Russia, will be armed by US+EU endlessly)\n\n  3. Russia vs West    (to combat Russia's naked imperialism distancing from Western Democracy, crippling sanctions)\n\n  4. West vs East       (Russia+China+India+Pakistan+Belarus+Kazakhstan etc.) build their own SWIFT, exit US hegemony\n</code></pre>\nIn each n+1 escalation, the same dynamics occur: the very use of force by a stronger power, to leverage its current dominance in the conflict, results in an even stronger power entering the conflict on the other side, and ultimately the severing of so much work of unification that was done in years prior.<p>[1] Yes I realize the matreshka is a Russian symbol not Ukrainian.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "EGreg",
    "url": "https://news.ycombinator.com/user?id=EGreg"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30576132",
  "sameAs": "https://news.ycombinator.com/item?id=30576132",
  "dateCreated": "2022-03-06T09:09:51.874Z",
  "datePublished": "2022-03-06T09:02:37.000Z",
  "dateModified": "2022-03-06T09:09:51.874Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "城市自决可以避免乌克兰和其他地方的战争和危机",
  "headline_zh-Hant": "城市自決可以避免烏克蘭和其他地方的戰爭和危機",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在现代民族国家之前，我们有帝国和城市。帝国只是自上而下地征服城市。(我不同意我们以前没有民族国家。例如，《圣经》描述了以色列12个部落的联合，以及他们周围的许多其他民族国家。米甸人有城市，非利士人有五角大楼，等等。<p>但是，想象一下，如果每个社区都能支付警察机构的自由市场。警察机构将培训当地人学习当地的法律并执行这些法律。如果该机构和它的策略太过残酷或太过无效，居民区会直接把明年的吨位给他们的竞争对手。<p>我认为同样的方法应该由城市自下而上地选择国家。联合国可以简单地将自决权扩展到城市和地区，允许瑞士的卢加诺加入意大利，如果他们认为这符合他们的最佳利益。或者香港可以选择从中国大陆分离出来。这样我们就不会有这些愚蠢的战争了。大多数战争的起因是一些分离主义者（或对中央政府的武装反对派）抓住了他们的城市离开大政体或联邦的机会。(也许人口结构发生了变化，或者出现了宪法危机，或者发生了另一场战争）。库尔德人、巴斯克人、加泰罗尼亚人等都在寻找这样一个机会。如果联合国承认城市的自决权，那么任何武装帮派都会被城市自己的警察当作罪犯逮捕，因为城市可以简单地进行民主投票，没有必要使用暴力。 相反，革命通常会被暴力逮捕扼杀在萌芽状态（例如西班牙在加泰罗尼亚，中国在香港），但偶尔也会有一个大国因为民族关系或地缘政治利益（例如保持东道国的稳定和软弱）而帮助这些分离主义者。因此，你会得到一场持续多年的战争，而平民百姓则面临着人道主义危机。我们已经在也门、叙利亚看到了这样的事情。这两个国家不是开会和举行外交会谈（就像伊朗和沙特最终在做的那样），而是不断地从双方向该地区投掷武器。<p>在乌克兰，这就像一个马特莱什卡娃娃[1]，在几个层面上出现了这种确切的现象：<p><pre><code> 1. 顿涅茨克对乌克兰（打击顿涅茨克与乌克兰的距离，但顿涅茨克却被俄罗斯无休止地武装起来）。\n\n  2. 乌克兰对俄罗斯（为了打击乌克兰与俄罗斯的距离，将由美国+欧盟无休止地武装）。\n\n  3. 俄罗斯对西方（打击俄罗斯与西方民主国家的赤裸裸的帝国主义的距离，削弱制裁）。\n\n  4. 西方对东方（俄罗斯+中国+印度+巴基斯坦+白俄罗斯+哈萨克斯坦等）建立自己的SWIFT，退出美国的霸权主义\n</code></pre>\n在每一次n+1的升级中，都会出现同样的动态：一个更强大的国家使用武力，利用其在冲突中的现有优势，导致另一方更强大的国家进入冲突，并最终切断之前几年所做的大量统一工作。<p>[1] 是的，我知道马特雷什卡是一个俄罗斯符号，而不是乌克兰。",
  "description_zh-Hant": "在現代民族國家之前，我們有帝國和城市。帝國只是自上而下地征服城市。(我不同意我們以前沒有民族國家。例如，《聖經》描述了以色列12個部落的聯合，以及他們周圍的許多其他民族國家。米甸人有城市，非利士人有五角大樓，等等。<p>但是，想象一下，如果每個社區都能支付警察機構的自由市場。警察機構將培訓當地人學習當地的法律並執行這些法律。如果該機構和它的策略太過殘酷或太過無效，居民區會直接把明年的噸位給他們的競爭對手。<p>我認為同樣的方法應該由城市自下而上地選擇國家。聯合國可以簡單地將自決權擴展到城市和地區，允許瑞士的盧加諾加入意大利，如果他們認為這符合他們的最佳利益。或者香港可以選擇從中國大陸分離出來。這樣我們就不會有這些愚蠢的戰爭了。大多數戰爭的起因是一些分離主義者（或對中央政府的武裝反對派）抓住了他們的城市離開大政體或聯邦的機會。(也許人口結構發生了變化，或者出現了憲法危機，或者發生了另一場戰爭）。庫爾德人、巴斯克人、加泰羅尼亞人等都在尋找這樣一個機會。如果聯合國承認城市的自決權，那麼任何武裝幫派都會被城市自己的警察當作罪犯逮捕，因為城市可以簡單地進行民主投票，沒有必要使用暴力。 相反，革命通常會被暴力逮捕扼殺在萌芽狀態（例如西班牙在加泰羅尼亞，中國在香港），但偶爾也會有一個大國因為民族關係或地緣政治利益（例如保持東道國的穩定和軟弱）而幫助這些分離主義者。因此，你會得到一場持續多年的戰爭，而平民百姓則面臨著人道主義危機。我們已經在也門、敘利亞看到了這樣的事情。這兩個國家不是開會和舉行外交會談（就像伊朗和沙特最終在做的那樣），而是不斷地從雙方向該地區投擲武器。<p>在烏克蘭，這就像一個馬特萊什卡娃娃[1]，在幾個層面上出現了這種確切的現象：<p><pre><code> 1. 頓涅茨克對烏克蘭（打擊頓涅茨克與烏克蘭的距離，但頓涅茨克卻被俄羅斯無休止地武裝起來）。\n\n  2. 烏克蘭對俄羅斯（為了打擊烏克蘭與俄羅斯的距離，將由美國+歐盟無休止地武裝）。\n\n  3. 俄羅斯對西方（打擊俄羅斯與西方民主國家的赤裸裸的帝國主義的距離，削弱制裁）。\n\n  4. 西方對東方（俄羅斯+中國+印度+巴基斯坦+白俄羅斯+哈薩克斯坦等）建立自己的SWIFT，退出美國的霸權主義\n</code></pre>\n在每一次n+1的升級中，都會出現同樣的動態：一個更強大的國家使用武力，利用其在衝突中的現有優勢，導致另一方更強大的國家進入衝突，並最終切斷之前幾年所做的大量統一工作。<p>[1] 是的，我知道馬特雷什卡是一個俄羅斯符號，而不是烏克蘭。"
}