{
  "@type": "NewsArticle",
  "identifier": "2022--03--17--en--myfeed--HackerNews--NewsArticle--30708530",
  "url": "https://news.ycombinator.com/item?id=30708530",
  "headline": "Please tell me about data breaches",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello -<p>I’m a reporter for a news station in Washington state, working on a story about data breaches. I am hoping to connect with anyone who has something to say on this topic!<p>I’ve read many insightful threads/comments and it’s clear there are many experts on this website. My reporting is focused mainly on WA’s data breach law, and breaches impacting Washingtonians… but breaches seemingly don’t observe borders, so this doesn’t limit the scope of sources I’m looking for.<p>Some specific things I’d love to talk about: \n// Any info which hasn’t been widely reported a data breach, particularly on late notifications or cover ups by data controllers \n// Any personal anecdotes/stories/etc. about a data breach\n// The relationship between legal data broking and the illicit data market \n// The role of offensive cybersecurity (and more broadly the surveillance/intelligence apparatus) in making private info vulnerable\n// Data breach notification laws – specifically WA state’s and others which are similar. Do they meaningfully protect people? Do companies etc. follow this law – particularly notification timeline requirements? \n// Any proactive measures/laws/etc. which might better protect people from privacy violations and data breaches\n// Holes in the mainstream narrative about data breaches (e.g. the perpetrators are located in whichever country the US considers the enemy)\n// Common misconceptions to avoid in reporting on this topic, reading or source recommendations, philosophical insight, etc. etc. etc. (aka anything you find interesting and are willing to share with me)<p>Feel free to email me at gkt two six (at) cornell (dot) edu.\n(remove spaces and replace two six with 26). \nFrom there I can share my protonmail/signal/phone number. Or you can leave a comment here if preferred. If you’d prefer to speak “off the record” – either initially or always – that is cool with me and will be 100% honored.<p>Thank you so much, and I hope you all are having a great day!\n- Gracie",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "gracie_k_t",
    "url": "https://news.ycombinator.com/user?id=gracie_k_t"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30708530",
  "sameAs": "https://news.ycombinator.com/item?id=30708530",
  "dateCreated": "2022-03-17T09:29:41.651Z",
  "datePublished": "2022-03-17T07:30:53.000Z",
  "dateModified": "2022-03-17T09:29:41.651Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "请告诉我有关数据泄露的情况",
  "headline_zh-Hant": "請告訴我有關數據洩露的情況",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好--<p>我是华盛顿州一家新闻台的记者，正在撰写一篇关于数据泄露的报道。我希望能与任何在这个话题上有话要说的人建立联系！<p>我读了很多有见地的主题/评论，很明显，这个网站上有很多专家。我的报告主要集中在西澳大利亚州的数据泄露法，以及影响华盛顿州的泄露事件......但泄露事件似乎不受国界限制，所以这并不限制我所寻找的来源的范围。\n// 任何没有被广泛报道的数据泄露信息，特别是关于数据控制者的延迟通知或掩盖的信息。\n// 任何关于数据泄露的个人轶事/故事/等等。\n// 合法数据经纪和非法数据市场之间的关系 \n// 进攻性网络安全（以及更广泛的监视/情报机构）在使私人信息变得脆弱方面的作用。\n// 数据泄露通知法--特别是西澳州的法律和其他类似的法律。它们能有效地保护人们吗？公司等是否遵守这一法律--特别是通知时限要求？\n// 任何可能更好地保护人们免受隐私侵犯和数据泄露的积极措施/法律/等。\n// 关于数据泄露的主流说法中的漏洞（例如，肇事者位于美国认为是敌人的哪个国家）。\n// 在报道这一主题时应避免的常见误解，阅读或资料来源建议，哲学见解，等等等等。(<p>请随时给我发电子邮件：gkt two six (at) cornell (dot) edu。\n(去掉空格，用26替换2个6）。\n从那里我可以分享我的质子邮件/信号/电话号码。如果愿意的话，你也可以在这里留下评论。如果你喜欢 \"不公开 \"发言--无论是最初还是一直--那对我来说都是很酷的，而且我将100%地予以尊重。<p>非常感谢你，我希望你们都有一个美好的一天\n- 格雷西",
  "description_zh-Hant": "你好--<p>我是華盛頓州一家新聞臺的記者，正在撰寫一篇關於數據洩露的報道。我希望能與任何在這個話題上有話要說的人建立聯繫！<p>我讀了很多有見地的主題/評論，很明顯，這個網站上有很多專家。我的報告主要集中在西澳大利亞州的數據洩露法，以及影響華盛頓州的洩露事件......但洩露事件似乎不受國界限制，所以這並不限制我所尋找的來源的範圍。\n// 任何沒有被廣泛報道的數據洩露信息，特別是關於數據控制者的延遲通知或掩蓋的信息。\n// 任何關於數據洩露的個人軼事/故事/等等。\n// 合法數據經紀和非法數據市場之間的關係 \n// 進攻性網絡安全（以及更廣泛的監視/情報機構）在使私人信息變得脆弱方面的作用。\n// 數據洩露通知法--特別是西澳州的法律和其他類似的法律。它們能有效地保護人們嗎？公司等是否遵守這一法律--特別是通知時限要求？\n// 任何可能更好地保護人們免受隱私侵犯和數據洩露的積極措施/法律/等。\n// 關於數據洩露的主流說法中的漏洞（例如，肇事者位於美國認為是敵人的哪個國家）。\n// 在報道這一主題時應避免的常見誤解，閱讀或資料來源建議，哲學見解，等等等等。(<p>請隨時給我發電子郵件：gkt two six (at) cornell (dot) edu。\n(去掉空格，用26替換2個6）。\n從那裡我可以分享我的質子郵件/信號/電話號碼。如果願意的話，你也可以在這裡留下評論。如果你喜歡 \"不公開 \"發言--無論是最初還是一直--那對我來說都是很酷的，而且我將100%地予以尊重。<p>非常感謝你，我希望你們都有一個美好的一天\n- 格雷西"
}