{
  "@type": "NewsArticle",
  "identifier": "2022--03--16--en--myfeed--HackerNews--NewsArticle--30700770",
  "url": "https://news.ycombinator.com/item?id=30700770",
  "headline": "Launch HN: PropelAuth (YC W22) – End-to-end auth service for B2B products",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN! I’m Andrew Israel, an engineer and the founder of PropelAuth (<a href=\"https://www.propelauth.com\" rel=\"nofollow\">https://www.propelauth.com</a>). PropelAuth provides end-to-end managed user authentication and lets your users manage their own accounts and teams.<p>We have a special focus on B2B features that make it easy for an end user to sign up, create and manage their own organization in your product, invite their co-workers, and so on. This includes roles within the organization (RBAC). We provide frontend and backend libraries where organizations are a first class concept, and we host UIs on your domain to manage the rest.<p>We didn't start out with this focus. PropelAuth actually started out of a chess side project I was working on. As side projects go, I started by focusing on the core product and fun aspects of it. Things like user authentication felt like a distraction from the things I wanted to work on.<p>I’ve set up auth at different jobs and for friends' companies in the past, and I never felt like any tool nailed it. The experience I wanted was “all aspects of auth are taken care of for me, UIs included” and then to have minimal libraries to check if users were logged in or not. The MVP of PropelAuth was a set of basic UIs that we hosted on our customers domain, some admin tools, and a few frontend/backend libraries.<p>We were also dogfooding ourselves—and because we sell to businesses, we built out some B2B specific features: creating organizations, inviting coworkers, roles/RBAC, and the UIs for all that. When talking with early customers, those turned out to be the features that got the strongest reactions. B2B founders were looking for that, and existing auth tools didn’t have these features or didn’t have them in an easy to implement way. So that’s been our focus ever since.<p>The product today acts similarly to a self-contained auth microservice that you can configure. It has simple UIs like signup and login and then more advanced ones like security pages (with 2fa enrollment) and organization management (with roles support).<p>The frontend libraries request short lived tokens for your users that your backends can verify. It also exposes APIs to fetch user and organization information.<p>We have a free plan, and charge $0.02 per monthly active user for the next plan up.<p>We’d love to hear any feedback you have! If you want to try out the product, you can sign up on our website at <a href=\"https://www.propelauth.com\" rel=\"nofollow\">https://www.propelauth.com</a>. You can check out our docs at <a href=\"https://docs.propelauth.com/\" rel=\"nofollow\">https://docs.propelauth.com/</a> and there are guides at <a href=\"https://www.propelauth.com/blog-categories/guide\" rel=\"nofollow\">https://www.propelauth.com/blog-categories/guide</a>. Thanks!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "aisrael",
    "url": "https://news.ycombinator.com/user?id=aisrael"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30700770",
  "sameAs": "https://news.ycombinator.com/item?id=30700770",
  "dateCreated": "2022-03-16T18:35:42.643Z",
  "datePublished": "2022-03-16T16:21:37.000Z",
  "dateModified": "2022-03-16T18:35:42.643Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 28
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 19
    }
  ],
  "headline_zh-Hans": "启动HN：PropelAuth (YC W22) - B2B产品的端到端认证服务",
  "headline_zh-Hant": "啟動HN：PropelAuth (YC W22) - B2B產品的端到端認證服務",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! 我是安德鲁-伊斯雷尔，一名工程师和PropelAuth（<a href=\"https://www.propelauth.com\" rel=\"nofollow\">https://www.propelauth.com</a>）的创始人。PropelAuth提供端到端管理的用户认证，并让您的用户管理自己的账户和团队。<p>我们特别关注B2B功能，使最终用户能够轻松地在您的产品中注册、创建和管理自己的组织，邀请他们的同事，等等。这包括组织内的角色（RBAC）。我们提供前端和后端库，其中组织是一个一流的概念，我们在你的域上托管UI来管理其余部分。PropelAuth实际上是从我正在进行的一个国际象棋副业项目开始的。作为副业，我一开始就把重点放在核心产品和它的乐趣方面。我过去在不同的工作岗位和朋友的公司设置过认证，我从来没有感觉到有任何工具可以做到这一点。我想要的体验是 \"认证的所有方面都为我解决了，包括用户界面\"，然后用最小的库来检查用户是否登录了。PropelAuth的MVP是一套基本的UI，我们托管在客户的域名上，一些管理工具，以及一些前端/后端库。<p>我们也在为自己打气--因为我们卖给企业，我们建立了一些B2B的具体功能：创建组织，邀请同事，角色/RBAC，以及所有这些的UI。当与早期客户交谈时，这些功能被证明是反应最强烈的。B2B的创始人正在寻找这些功能，而现有的授权工具没有这些功能，或者没有以一种容易实现的方式拥有这些功能。<p>今天的产品类似于一个独立的认证微服务，你可以进行配置。它有简单的UI，如注册和登录，然后是更高级的UI，如安全页面（有2fa注册）和组织管理（有角色支持）。<p>前端库为你的用户请求短期的令牌，你的后端可以验证。<p>我们有一个免费计划，并对下一个计划的每个月活跃用户收取0.02美元。If you want to try out the product, you can sign up on our website at <a href=\"https://www.propelauth.com\" rel=\"nofollow\">https://www.propelauth.com</a>. 您可以在<a href=\"https://docs.propelauth.com/\" rel=\"nofollow\">https://docs.propelauth.com/</a>上查看我们的文档，在<a href=\"https://www.propelauth.com/blog-categories/guide\" rel=\"nofollow\">https://www.propelauth.com/blog-categories/guide</a>上也有指南。谢谢!",
  "description_zh-Hant": "嗨，HN! 我是安德魯-伊斯雷爾，一名工程師和PropelAuth（<a href=\"https://www.propelauth.com\" rel=\"nofollow\">https://www.propelauth.com</a>）的創始人。PropelAuth提供端到端管理的用戶認證，並讓您的用戶管理自己的賬戶和團隊。<p>我們特別關注B2B功能，使最終用戶能夠輕鬆地在您的產品中註冊、創建和管理自己的組織，邀請他們的同事，等等。這包括組織內的角色（RBAC）。我們提供前端和後端庫，其中組織是一個一流的概念，我們在你的域上託管UI來管理其餘部分。PropelAuth實際上是從我正在進行的一個國際象棋副業項目開始的。作為副業，我一開始就把重點放在核心產品和它的樂趣方面。我過去在不同的工作崗位和朋友的公司設置過認證，我從來沒有感覺到有任何工具可以做到這一點。我想要的體驗是 \"認證的所有方面都為我解決了，包括用戶界面\"，然後用最小的庫來檢查用戶是否登錄了。PropelAuth的MVP是一套基本的UI，我們託管在客戶的域名上，一些管理工具，以及一些前端/後端庫。<p>我們也在為自己打氣--因為我們賣給企業，我們建立了一些B2B的具體功能：創建組織，邀請同事，角色/RBAC，以及所有這些的UI。當與早期客戶交談時，這些功能被證明是反應最強烈的。B2B的創始人正在尋找這些功能，而現有的授權工具沒有這些功能，或者沒有以一種容易實現的方式擁有這些功能。<p>今天的產品類似於一個獨立的認證微服務，你可以進行配置。它有簡單的UI，如註冊和登錄，然後是更高級的UI，如安全頁面（有2fa註冊）和組織管理（有角色支持）。<p>前端庫為你的用戶請求短期的令牌，你的後端可以驗證。<p>我們有一個免費計劃，並對下一個計劃的每個月活躍用戶收取0.02美元。If you want to try out the product, you can sign up on our website at <a href=\"https://www.propelauth.com\" rel=\"nofollow\">https://www.propelauth.com</a>. 您可以在<a href=\"https://docs.propelauth.com/\" rel=\"nofollow\">https://docs.propelauth.com/</a>上查看我們的文檔，在<a href=\"https://www.propelauth.com/blog-categories/guide\" rel=\"nofollow\">https://www.propelauth.com/blog-categories/guide</a>上也有指南。謝謝!"
}