{
  "@type": "NewsArticle",
  "identifier": "2022--03--18--en--myfeed--HackerNews--NewsArticle--30719093",
  "url": "https://news.ycombinator.com/item?id=30719093",
  "headline": "Why is this flagged dang?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "https://news.ycombinator.com/item?id=30664767<p>Seriously.<p>Not sure what the flaw is in the HN algorithm that allows such things.  In this particular thread I went way out of my way to provide mathematical support and detailed analysis for the issue I suggested should be discussed.  And yet, as is often the case with certain subjects, the mob descends and cancels all possibility of a potentially eye-opening discussion.<p>Now, I know just how difficult it is to moderate a public forum.  I did it myself going back to the wild USENET days.  Not faulting you or anyone at HN on this at all.<p>I just want to raise the question because, well, it sometimes seems that a monoculture is the only thing that is acceptable here.  Not to draw a parallel, but the world is seeing just exactly how damaging it can be when people are not allowed to even mention anything that does not align with the approved culture (Putin's Russia).  Not a fair comparison?  Why was my post flagged then?<p>I don't have the right to be, well, right, on everything I say or think.  Of course I don't.  Nobody does.  And yet, nobody should have the right to cancel what I have to say provided it isn't an incitement to violence or utterly abusive to others.<p>In this particular example, what I put on the table is a perfectly reasonable engineering/scientific discussion that can be quantified.  Math and physics.<p>Instead, what comes back is the equivalent of religious belief and ganging-on of like-minded people to effectively silence and cancel that with which they disagree.  It is, to use the term, deplorable at best and down-right dangerous at the extremes.  It is odd this happens today, when the history of science has so many examples of brilliant minds that were silenced for daring to not fall in line with what was deemed to be &quot;the truth&quot;.<p>Progress isn't made this way.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "robomartin",
    "url": "https://news.ycombinator.com/user?id=robomartin"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30719093",
  "sameAs": "https://news.ycombinator.com/item?id=30719093",
  "dateCreated": "2022-03-18T06:12:33.610Z",
  "datePublished": "2022-03-18T05:46:09.000Z",
  "dateModified": "2022-03-18T06:12:33.610Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "为什么这被标记为当？",
  "headline_zh-Hant": "為什麼這被標記為當？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "https://news.ycombinator.com/item?id=30664767<p>说真的。<p>不知道HN算法的缺陷是什么，允许这样的事情发生。 在这个特定的主题中，我不遗余力地为我建议应该讨论的问题提供数学支持和详细分析。 然而，正如某些主题经常发生的情况一样，暴徒们的到来，取消了所有潜在的令人大开眼界的讨论的可能性。<p>现在，我知道主持一个公共论坛是多么困难。 我自己也是这样做的，可以追溯到疯狂的USENET时代。 我不是在责怪你或HN的任何人。<p>我只是想提出这个问题，因为，有时似乎单一文化是这里唯一可以接受的东西。 不是要做一个比较，但世界正在看到，当人们甚至不被允许提及任何与被认可的文化不一致的东西时（普京的俄罗斯），会有多么大的破坏性。 这不是一个公平的比较？ 那为什么我的帖子被标记了？<p>我没有权利在我说的或想的每件事上都是正确的。 我当然没有。 没有人有。 然而，没有人应该有权取消我说的话，只要它不是煽动暴力或完全虐待他人。<p>在这个特定的例子中，我放在桌子上的是一个完全合理的工程/科学讨论，可以被量化。 数学和物理学。<p>相反，回来的是相当于宗教信仰和志同道合的人拉帮结派，有效地压制和取消他们不同意的东西。 用一句话来说，这在最好的情况下是可悲的，在极端的情况下则是彻头彻尾的危险。 奇怪的是，这种情况发生在今天，因为科学史上有那么多杰出的思想家因为敢于不与被认为是真理的东西保持一致而被沉默。",
  "description_zh-Hant": "https://news.ycombinator.com/item?id=30664767<p>說真的。<p>不知道HN算法的缺陷是什麼，允許這樣的事情發生。 在這個特定的主題中，我不遺餘力地為我建議應該討論的問題提供數學支持和詳細分析。 然而，正如某些主題經常發生的情況一樣，暴徒們的到來，取消了所有潛在的令人大開眼界的討論的可能性。<p>現在，我知道主持一個公共論壇是多麼困難。 我自己也是這樣做的，可以追溯到瘋狂的USENET時代。 我不是在責怪你或HN的任何人。<p>我只是想提出這個問題，因為，有時似乎單一文化是這裡唯一可以接受的東西。 不是要做一個比較，但世界正在看到，當人們甚至不被允許提及任何與被認可的文化不一致的東西時（普京的俄羅斯），會有多麼大的破壞性。 這不是一個公平的比較？ 那為什麼我的帖子被標記了？<p>我沒有權利在我說的或想的每件事上都是正確的。 我當然沒有。 沒有人有。 然而，沒有人應該有權取消我說的話，只要它不是煽動暴力或完全虐待他人。<p>在這個特定的例子中，我放在桌子上的是一個完全合理的工程/科學討論，可以被量化。 數學和物理學。<p>相反，回來的是相當於宗教信仰和志同道合的人拉幫結派，有效地壓制和取消他們不同意的東西。 用一句話來說，這在最好的情況下是可悲的，在極端的情況下則是徹頭徹尾的危險。 奇怪的是，這種情況發生在今天，因為科學史上有那麼多傑出的思想家因為敢於不與被認為是真理的東西保持一致而被沉默。"
}