{
  "@type": "NewsArticle",
  "identifier": "2022--03--21--en--myfeed--HackerNews--NewsArticle--30750151",
  "url": "https://news.ycombinator.com/item?id=30750151",
  "headline": "Don't give up your High Pressure Sodium Lamps",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I live in the country and have one yard light. It's on a timer and goes until 2 or 3 a.m. It used to be mercury discharge but years ago was switched to HP sodium (70 watt) which is far more efficient and also gives a very pleasant light for nighttime illumination. Sure, it has low CRI factor but it provides the light I need to accomplish any chores that need doing at night, like feeding my outdoor wood furnace, while not making the area seem like it's daytime. The old mercury light did not provide any more illumination but used 150 watts of electricity. More importantly the light was way too harsh and daylight-like, just inappropriate for a night light. I might even switch to a 50-watt HPS bulb as the light is that efficient. The bulbs last for many years and are not expensive.<p>Driving on streets that are lighted with full spectrum LED lamps are similarly harsh and, in my opinion, unsettling. I guess it depends on what night lighting is for, to see what needs to be seen or see those things in daylight-quality illumination, with all its advantages and faults.<p>I just hope people consider all the angles before rushing into LED street lighting.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "beekeeperfred",
    "url": "https://news.ycombinator.com/user?id=beekeeperfred"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30750151",
  "sameAs": "https://news.ycombinator.com/item?id=30750151",
  "dateCreated": "2022-03-21T05:49:55.169Z",
  "datePublished": "2022-03-21T04:10:12.000Z",
  "dateModified": "2022-03-21T05:49:55.169Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "不要放弃你的高压钠灯",
  "headline_zh-Hant": "不要放棄你的高壓鈉燈",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我住在乡下，有一个院子的灯。它曾经是汞放电灯，但几年前改用HP钠灯（70瓦），效率高得多，也为夜间照明提供了非常愉快的光线。当然，它的CRI系数很低，但它提供了我所需要的光线，以完成任何需要在晚上做的家务，如喂养我的户外木炉，同时不会使该地区看起来像在白天。旧的水银灯没有提供任何更多的照明，但却使用了150瓦的电力。更重要的是，光线太刺眼了，像日光一样，实在不适合做夜灯。我甚至可能改用50瓦的HPS灯泡，因为这种灯的效率很高。<p>在用全光谱LED灯照明的街道上开车，也同样刺眼，在我看来，让人不安。我想这取决于夜间照明的目的，是看清需要看清的东西，还是在日光质量的照明下看清这些东西，它有所有的优点和缺点。<p>我只是希望人们在匆忙进入LED街道照明之前考虑所有的角度。",
  "description_zh-Hant": "我住在鄉下，有一個院子的燈。它曾經是汞放電燈，但幾年前改用HP鈉燈（70瓦），效率高得多，也為夜間照明提供了非常愉快的光線。當然，它的CRI係數很低，但它提供了我所需要的光線，以完成任何需要在晚上做的家務，如餵養我的戶外木爐，同時不會使該地區看起來像在白天。舊的水銀燈沒有提供任何更多的照明，但卻使用了150瓦的電力。更重要的是，光線太刺眼了，像日光一樣，實在不適合做夜燈。我甚至可能改用50瓦的HPS燈泡，因為這種燈的效率很高。<p>在用全光譜LED燈照明的街道上開車，也同樣刺眼，在我看來，讓人不安。我想這取決於夜間照明的目的，是看清需要看清的東西，還是在日光質量的照明下看清這些東西，它有所有的優點和缺點。<p>我只是希望人們在匆忙進入LED街道照明之前考慮所有的角度。"
}