{
  "@type": "NewsArticle",
  "identifier": "2022--03--28--en--myfeed--HackerNews--NewsArticle--30829838",
  "url": "https://news.ycombinator.com/item?id=30829838",
  "headline": "How can I transform myself from a front-end developer to a data viz engineer?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm a front-end developer looking to change careers. I work on a marketing team, and I'm not happy with my job anymore. Marketing is boring (to me) and the lack of any data-driven strategy on the part of my org seems like a waste of resources. I also feel like I'm stagnating intellectually as a result of investing so much of my daily energy into the field of Marketing.<p>Lately I've become absolutely fascinated by the field of data visualization. I'm extremely comfortable working with D3 and React, so I think pivoting into data visualization will \na) make me much more hireable and \nb) be something I actually enjoy doing that can make a meaningful impact on people.<p>Can anyone recommend any resources, certificates, or keywords I can use to help my portfolio and résumé stand out in the data visualization field?<p>Is it possible to get hired as a data viz engineer without a degree in data visualization? I'm currently building out my portfolio with a bunch of interactive visualzations to help support my résumé, but my BA is in the humanities.<p>Does anyone have any tips on self-education resources for the data viz field?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "supertofu",
    "url": "https://news.ycombinator.com/user?id=supertofu"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30829838",
  "sameAs": "https://news.ycombinator.com/item?id=30829838",
  "dateCreated": "2022-03-28T13:21:11.937Z",
  "datePublished": "2022-03-28T12:36:21.000Z",
  "dateModified": "2022-03-28T13:21:11.937Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "我怎样才能把自己从一个前端开发者转变为一个数据可视化工程师？",
  "headline_zh-Hant": "我怎樣才能把自己從一個前端開發者轉變為一個數據可視化工程師？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个想改变职业的前端开发员。我在一个营销团队工作，我对我的工作不满意了。市场营销很无聊（对我来说），而且我的组织缺乏任何数据驱动的战略，这似乎是对资源的浪费。我还觉得自己在智力上停滞不前，因为我每天在营销领域投入了大量的精力。<p>最近，我对数据可视化领域非常着迷。我在使用D3和React时非常自如，所以我认为转向数据可视化将 \na) 使我更容易被雇用，并且 \n<p>谁能推荐一些资源、证书或关键词，让我的作品集和简历在数据可视化领域脱颖而出？<p>没有数据可视化的学位，是否有可能被聘用为数据可视化工程师？我目前正在用一堆交互式可视化作品建立我的作品集，以帮助支持我的简历，但我的学士学位是在人文学科。<p>有人对数据可视化领域的自我教育资源有什么建议吗？",
  "description_zh-Hant": "我是一個想改變職業的前端開發員。我在一個營銷團隊工作，我對我的工作不滿意了。市場營銷很無聊（對我來說），而且我的組織缺乏任何數據驅動的戰略，這似乎是對資源的浪費。我還覺得自己在智力上停滯不前，因為我每天在營銷領域投入了大量的精力。<p>最近，我對數據可視化領域非常著迷。我在使用D3和React時非常自如，所以我認為轉向數據可視化將 \na) 使我更容易被僱用，並且 \n<p>誰能推薦一些資源、證書或關鍵詞，讓我的作品集和簡歷在數據可視化領域脫穎而出？<p>沒有數據可視化的學位，是否有可能被聘用為數據可視化工程師？我目前正在用一堆交互式可視化作品建立我的作品集，以幫助支持我的簡歷，但我的學士學位是在人文學科。<p>有人對數據可視化領域的自我教育資源有什麼建議嗎？"
}