{
  "@type": "NewsArticle",
  "identifier": "2022--04--04--en--myfeed--HackerNews--NewsArticle--30907507",
  "url": "https://news.ycombinator.com/item?id=30907507",
  "headline": "Related to: Ask HN: Anyone here have good material for learning how to sketch",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Ask HN: Anyone here have good material for learning how to sketch from scratch?<p>Related to this previous post:\n&quot;Apologies if this is off-topic but the learning French thread got me wondering if anyone here is an artist in the downtime and has recommendations for learning materials when it comes to learning how to draw? I've tried Drawing on the Right Side of the Brain and it doesn't do it for me. I've tried nma.art and that's like the closest I've come to what I'm after but currently suffer from paralysis analysis with too many or too few courses to choose from. Any suggestions? I'm hoping to be able to eventually draw people and landscapes, willing to pay hundreds of dollars potentially for the right course or instruction per month not really looking for like a udemy type thing.&quot;<p>What about approaches to teaching children initially?  Most of what passes for art instruction in elementary schools seems to come from the school of thought of &quot;just give them some paper and pens and glue and glitter and they'll come up with something&quot;.  Or, worse, there is no art instruction whatsoever in school.  Curious if anyone has any thoughts on any programs or approaches that actually provide young kids with high quality foundational art instruction before their brains are fully formed into &quot;I can't draw (/paint/model/sculpt/etc.)&quot;",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "learnto",
    "url": "https://news.ycombinator.com/user?id=learnto"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30907507",
  "sameAs": "https://news.ycombinator.com/item?id=30907507",
  "dateCreated": "2022-04-04T15:34:21.643Z",
  "datePublished": "2022-04-04T15:06:42.000Z",
  "dateModified": "2022-04-04T15:34:21.643Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "与此相关。询问HN：这里有人有学习素描的好材料吗？",
  "headline_zh-Hant": "與此相關。詢問HN：這裡有人有學習素描的好材料嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Ask HN: 这里有人有好的材料来学习如何从头开始画素描吗？<p>与这个上一个帖子有关。\n&quot;如果这偏离了主题，请原谅，但学习法语的话题让我想知道这里是否有人在闲暇时是个艺术家，在学习如何绘画时有推荐的学习材料？我试过《右脑绘画》，但它对我来说并不合适。我试过nma.art，那是我最接近我所追求的，但目前有太多或太少的课程供我选择，使我患上了麻痹分析。有什么建议吗？我希望最终能够画出人物和风景，愿意为合适的课程或指导每月支付数百美元，而不是真的要找像udemy那样的东西。 大多数小学的艺术教学似乎来自于 \"只要给他们一些纸、笔、胶水和闪粉，他们就能想出办法 \"的思想。 或者，更糟糕的是，学校里没有任何艺术指导。 我很好奇，如果有人对那些在孩子们的大脑完全形成 \"我不会画画（/绘画/模型/雕塑/等等）\"之前，真正为他们提供高质量的基础艺术指导的项目或方法有什么想法。",
  "description_zh-Hant": "Ask HN: 這裡有人有好的材料來學習如何從頭開始畫素描嗎？<p>與這個上一個帖子有關。\n&quot;如果這偏離了主題，請原諒，但學習法語的話題讓我想知道這裡是否有人在閒暇時是個藝術家，在學習如何繪畫時有推薦的學習材料？我試過《右腦繪畫》，但它對我來說並不合適。我試過nma.art，那是我最接近我所追求的，但目前有太多或太少的課程供我選擇，使我患上了麻痺分析。有什麼建議嗎？我希望最終能夠畫出人物和風景，願意為合適的課程或指導每月支付數百美元，而不是真的要找像udemy那樣的東西。 大多數小學的藝術教學似乎來自於 \"只要給他們一些紙、筆、膠水和閃粉，他們就能想出辦法 \"的思想。 或者，更糟糕的是，學校裡沒有任何藝術指導。 我很好奇，如果有人對那些在孩子們的大腦完全形成 \"我不會畫畫（/繪畫/模型/雕塑/等等）\"之前，真正為他們提供高質量的基礎藝術指導的項目或方法有什麼想法。"
}