{
  "@type": "NewsArticle",
  "identifier": "2022--04--06--en--myfeed--HackerNews--NewsArticle--30933630",
  "url": "https://news.ycombinator.com/item?id=30933630",
  "headline": "Tell HN: The Price of Personal Information Is 1GB",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I lived in Thailand. The country has recently enacted Personal Data Protection Act 2019 (PDPA), but was delayed from becoming effective as the affected sectors are not ready. The law is essentially GDPR/CCPA in my country, meaning that business requires consent to process personal information. I don't usually object to the strictly necessary/legitimate interest, but I don't want my data to be used for targeted advertising, so I often decline the latter.<p>Today, I got an SMS that says &quot;Get Free 1GB of Internet for 24 hours by simply provide consent to process personal data under PDPA. More info at (website)&quot;. It came from mobile carrier that has 14 affiliated companies. I take a look at the website and it says:<p>&quot;... for the purpose of analyze and predict my preference or behavior, R&amp;D, product improvement and marketing planning in order to allow each company to present product/service/privilege/promotions and offers ... that has been carefully optimized and selected for your preference&quot;<p>They said opt-out is possible, but they has not announced how. Other places that employ opt-out sometimes make it more difficult to opt-out (asked for opt-in in store, call to opt-out). 1GB of Internet for their indefinite period of using my data for advertising is simply not comparable, so I decline to provide consent. I don't know how long will they ask me again. Has anyone been enticed to provide consent in similar manner? Would love to hear it!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "kayxspre",
    "url": "https://news.ycombinator.com/user?id=kayxspre"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30933630",
  "sameAs": "https://news.ycombinator.com/item?id=30933630",
  "dateCreated": "2022-04-06T16:12:40.244Z",
  "datePublished": "2022-04-06T15:54:00.000Z",
  "dateModified": "2022-04-06T16:12:40.244Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "告诉HN：个人信息的价格是1GB",
  "headline_zh-Hant": "告訴HN：個人信息的價格是1GB",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我住在泰国。该国最近颁布了《2019年个人数据保护法》（PDPA），但由于受影响的部门还没有准备好，所以推迟了生效。在我的国家，法律基本上是GDPR/CCPA，这意味着商业需要同意处理个人信息。我通常不反对严格意义上的必要/合法利益，但我不希望我的数据被用于有针对性的广告，所以我经常拒绝后者。<p>今天，我收到一条短信，上面写着&quot;只需提供同意根据PDPA处理个人数据，即可获得24小时的免费1GB网络。更多信息请访问（网站）&quot;。它来自有14家附属公司的移动运营商。我看了一下网站，上面说：<p>&quot;...为了分析和预测我的偏好或行为、研发、产品改进和营销计划，以便让每个公司提供产品/服务/特权/促销和优惠......这些都是根据你的偏好精心优化和选择的&quot;<p>他们说可以选择退出，但他们还没有宣布如何退出。其他采用选择退出的地方有时会使选择退出更加困难（要求在店内选择加入，打电话选择退出）。1GB的网络对于他们无限期地使用我的数据做广告来说，根本没有可比性，所以我拒绝提供同意。我不知道他们多久会再问我。有没有人被诱导以类似的方式提供同意？很想听听!",
  "description_zh-Hant": "我住在泰國。該國最近頒佈了《2019年個人數據保護法》（PDPA），但由於受影響的部門還沒有準備好，所以推遲了生效。在我的國家，法律基本上是GDPR/CCPA，這意味著商業需要同意處理個人信息。我通常不反對嚴格意義上的必要/合法利益，但我不希望我的數據被用於有針對性的廣告，所以我經常拒絕後者。<p>今天，我收到一條短信，上面寫著&quot;只需提供同意根據PDPA處理個人數據，即可獲得24小時的免費1GB網絡。更多信息請訪問（網站）&quot;。它來自有14家附屬公司的移動運營商。我看了一下網站，上面說：<p>&quot;...為了分析和預測我的偏好或行為、研發、產品改進和營銷計劃，以便讓每個公司提供產品/服務/特權/促銷和優惠......這些都是根據你的偏好精心優化和選擇的&quot;<p>他們說可以選擇退出，但他們還沒有宣佈如何退出。其他採用選擇退出的地方有時會使選擇退出更加困難（要求在店內選擇加入，打電話選擇退出）。1GB的網絡對於他們無限期地使用我的數據做廣告來說，根本沒有可比性，所以我拒絕提供同意。我不知道他們多久會再問我。有沒有人被誘導以類似的方式提供同意？很想聽聽!"
}