{
  "@type": "NewsArticle",
  "identifier": "2022--04--08--en--myfeed--HackerNews--NewsArticle--30956636",
  "url": "https://news.ycombinator.com/item?id=30956636",
  "headline": "People who press on cookie banners anything except “agree” – why do you do that?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am from a generation that is familiar with banners showing dancing Flash animations from the internets of the 00s, usually some boobs and butts on the middle of the screen, and I still remember that pressing [x] or [close] could either close the banner or do it even bigger. So if the cookie banner's overlay is not hard enough, I am comfortable to read a text through the overlay, but it seems way more broken because the owners of that dancing nudes at least realized that they are disturbing people, and those in charge of the cookie banners really believe that they protect the interests of the user, so cookie banners are noticeable agressiver - nude banners never had an overlay and almost never made the content unreadable before paying attention to them.<p>Some websites might require you to go through the jungle of odd choices about which cookies are acceptable and which are not. It's so similar to Italian strike (aka &quot;work-to rule&quot;). Imagine regular people who are forced to chose between the strange and even strangier. What can they choose but &quot;agree to everything&quot; or look an some gray text through a gray overlay?<p>There are definitely people in the HN crowd who can understand the different options offered by cookie banners. I have an example of this product of thought, maybe not the best, but good enough to demonstrate what the jungle is [1], so if at least one person in the whole world uses this option - share your answers:<p>1. What will you do on your next visit if your browser forgets the cookie - click again, right?<p>2. On which websites do you use these custom cookies, maybe you know something about some special websites?<p>3. Do you know about some instruments like DO-NOT-TRACK but for cookie banners? Adblock or adblock-like extentions IMO miss the point of doing the conscious decision.<p>4. If you are such an advanced user of cookie-banners then it is natural you to think they are somewhat useful for you - what are the advantages of this?<p>[1] https://www.hull.ac.uk/",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "eimrine",
    "url": "https://news.ycombinator.com/user?id=eimrine"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30956636",
  "sameAs": "https://news.ycombinator.com/item?id=30956636",
  "dateCreated": "2022-04-08T13:54:41.213Z",
  "datePublished": "2022-04-08T13:39:23.000Z",
  "dateModified": "2022-04-08T13:54:41.213Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "在cookie横幅上按下任何东西的人，除了 \"同意\"--你为什么要这样做？",
  "headline_zh-Hant": "在cookie橫幅上按下任何東西的人，除了 \"同意\"--你為什麼要這樣做？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我这一代人熟悉00年代互联网上显示跳舞的Flash动画的横幅，通常是屏幕中间的一些胸部和屁股，我还记得按[x]或[close]可以关闭横幅或把它做得更大。所以，如果饼干横幅的覆盖物不够硬，我很舒服地通过覆盖物阅读一段文字，但它似乎更破，因为那个跳舞裸体的主人至少意识到他们在干扰人们，而那些负责饼干横幅的人真的相信他们保护了用户的利益，所以饼干横幅是明显的侵略者--裸体横幅从来没有覆盖物，几乎没有让人无法阅读的内容，才会注意到它们。 <p>有些网站可能需要你在丛林中去选择哪些cookie是可以接受的，哪些是不可以的。这与意大利式罢工（又称&quot;工作--规则&quot;）是如此相似。想象一下，普通人被迫在奇怪的甚至更奇怪的东西之间做出选择。除了&quot;同意一切&quot;或者通过灰色的覆盖物看一些灰色的文字，他们还能选择什么呢？<p>在HN人群中肯定有人能理解cookie横幅所提供的不同选择。我有一个关于这个思想产品的例子，也许不是最好的，但足以证明什么是丛林[1]，所以如果全世界至少有一个人使用这个选项--分享你的答案：<p>1. 如果你的浏览器忘记了cookie，你在下次访问时会怎么做--重新点击，对吗？<p>2.你在哪些网站上使用这些自定义cookie，也许你知道一些特殊网站的情况？<p>3.你知道一些像DO-NOT-TRACK但针对cookie横幅的工具吗？Adblock或类似adblock的扩展工具IMO错过了做自觉决定的意义。<p>4.如果你是这样一个cookie横幅的高级用户，那么你自然会认为它们对你有点用处--这有什么好处？<p>[1] https://www.hull.ac.uk/",
  "description_zh-Hant": "我這一代人熟悉00年代互聯網上顯示跳舞的Flash動畫的橫幅，通常是屏幕中間的一些胸部和屁股，我還記得按[x]或[close]可以關閉橫幅或把它做得更大。所以，如果餅乾橫幅的覆蓋物不夠硬，我很舒服地通過覆蓋物閱讀一段文字，但它似乎更破，因為那個跳舞裸體的主人至少意識到他們在干擾人們，而那些負責餅乾橫幅的人真的相信他們保護了用戶的利益，所以餅乾橫幅是明顯的侵略者--裸體橫幅從來沒有覆蓋物，幾乎沒有讓人無法閱讀的內容，才會注意到它們。 <p>有些網站可能需要你在叢林中去選擇哪些cookie是可以接受的，哪些是不可以的。這與意大利式罷工（又稱&quot;工作--規則&quot;）是如此相似。想象一下，普通人被迫在奇怪的甚至更奇怪的東西之間做出選擇。除了&quot;同意一切&quot;或者通過灰色的覆蓋物看一些灰色的文字，他們還能選擇什麼呢？<p>在HN人群中肯定有人能理解cookie橫幅所提供的不同選擇。我有一個關於這個思想產品的例子，也許不是最好的，但足以證明什麼是叢林[1]，所以如果全世界至少有一個人使用這個選項--分享你的答案：<p>1. 如果你的瀏覽器忘記了cookie，你在下次訪問時會怎麼做--重新點擊，對嗎？<p>2.你在哪些網站上使用這些自定義cookie，也許你知道一些特殊網站的情況？<p>3.你知道一些像DO-NOT-TRACK但針對cookie橫幅的工具嗎？Adblock或類似adblock的擴展工具IMO錯過了做自覺決定的意義。<p>4.如果你是這樣一個cookie橫幅的高級用戶，那麼你自然會認為它們對你有點用處--這有什麼好處？<p>[1] https://www.hull.ac.uk/"
}