{
  "@type": "NewsArticle",
  "identifier": "2022--02--24--en--myfeed--HackerNews--NewsArticle--30460228",
  "url": "https://news.ycombinator.com/item?id=30460228",
  "headline": "Remind HN: Russian people did not vote for it's government",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Reading the comments about the recent events I see and understand the frustration and the desire to blame &quot;the russians&quot; for the things that it's government is doing. Given that I'd like for you all to understand and remember that the vast majority of the russian population has never voted for this government and it's actions do not represent the will of the russian people.<p>This is not a conjecture, it's a mathematical fact, you can explore the results of the recent elections yourself and see the scale of the perpetrated fraud: https://ruselection.herokuapp.com/russian-election-anomalies?locale=en<p>Most trusted russian election analyst Sergey Shpilkin estimates that without the &quot;election anomalies&quot;, the current government has likely received around 31–33% of the votes with an estimated real election turnout of around 38%.<p>Considering that turnout that comes out to around 12.8% of all eligible russian voters that actually voted for the current ruling party. Despite the complete government control over almost all russian media that has been spouting non-stop propaganda for well over a decade, only a tenth of the population has willingly given them their votes.<p>If it was up to the russian people, this government would not be in power right now, making the decisions it is currently making.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "asats",
    "url": "https://news.ycombinator.com/user?id=asats"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30460228",
  "sameAs": "https://news.ycombinator.com/item?id=30460228",
  "dateCreated": "2022-02-24T21:09:54.541Z",
  "datePublished": "2022-02-24T21:02:25.000Z",
  "dateModified": "2022-02-24T21:09:54.541Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "提醒HN：俄罗斯人民并没有投票给它的政府",
  "headline_zh-Hant": "提醒HN：俄羅斯人民並沒有投票給它的政府",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在阅读有关最近事件的评论时，我看到并理解人们的挫折感和将其政府所做的事情归咎于俄罗斯人的愿望。鉴于此，我希望你们都能理解并记住，绝大多数俄罗斯人都没有投票给这个政府，它的行为并不代表俄罗斯人民的意愿。<p>这不是一个猜想，这是一个数学事实，你们可以自己探索最近的选举结果，看看所实施的欺诈的规模：https://ruselection.herokuapp. com/russian-election-anomalies?locale=en<p>最值得信赖的俄罗斯选举分析家谢尔盖-什皮尔金估计，如果没有选举异常现象，现任政府可能获得了大约31-33%的选票，估计真正的选举投票率约为38%。<p>考虑到这一投票率，在所有符合条件的俄罗斯选民中，约有12.8%的人实际投票给现任执政党。尽管政府完全控制了几乎所有的俄罗斯媒体，并在十多年来不停地进行宣传，但只有十分之一的人愿意给他们投票。",
  "description_zh-Hant": "在閱讀有關最近事件的評論時，我看到並理解人們的挫折感和將其政府所做的事情歸咎於俄羅斯人的願望。鑑於此，我希望你們都能理解並記住，絕大多數俄羅斯人都沒有投票給這個政府，它的行為並不代表俄羅斯人民的意願。<p>這不是一個猜想，這是一個數學事實，你們可以自己探索最近的選舉結果，看看所實施的欺詐的規模：https://ruselection.herokuapp. com/russian-election-anomalies?locale=en<p>最值得信賴的俄羅斯選舉分析家謝爾蓋-什皮爾金估計，如果沒有選舉異常現象，現任政府可能獲得了大約31-33%的選票，估計真正的選舉投票率約為38%。<p>考慮到這一投票率，在所有符合條件的俄羅斯選民中，約有12.8%的人實際投票給現任執政黨。儘管政府完全控制了幾乎所有的俄羅斯媒體，並在十多年來不停地進行宣傳，但只有十分之一的人願意給他們投票。"
}