{
  "@type": "NewsArticle",
  "identifier": "2022--03--21--en--myfeed--HackerNews--NewsArticle--30757421",
  "url": "https://news.ycombinator.com/item?id=30757421",
  "headline": "Launch HN: Spoken (YC S21) – Better furniture shopping",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, we’re Dane and Geoff, the founders of Spoken (<a href=\"https://www.spoken.io/\" rel=\"nofollow\">https://www.spoken.io/</a>). We make it easy to find the lowest price for any furniture item across all big stores.<p>Buying physical things on the internet is hard. You have to quality-check a product without touching it, double-check dimensions for where the thing will go, and evaluate a seller's credibility, often with little data. But buying furniture online is a special case of hard, because the market is deliberately deceptive.<p>Furniture sellers actively prevent consumers from easily finding the same item at other stores, or under other names, because this allows them to charge more. The sellers get to name the products and they name them in confusing ways to facilitate price discriminaton. For example, this table at Wayfair (<a href=\"https://www.wayfair.com/furniture/pdp/williston-forge-veronica-dining-table-w001977704.html\" rel=\"nofollow\">https://www.wayfair.com/furniture/pdp/williston-forge-veroni...</a>) can also be found at Appliances Connection under a different name for roughly half the price (<a href=\"https://www.appliancesconnection.com/modway-eei2034brn.html\" rel=\"nofollow\">https://www.appliancesconnection.com/modway-eei2034brn.html</a>). With most online shopping, the products you want have unambiguous names—if you want, say, a TV, you can simply search “Samsung 55 inch” and see what both Best Buy and Walmart are charging. But with furniture, sellers work actively to disrupt an accurate product graph and keep the market inefficient.<p>The net result is that buying furniture feels icky, noisy, and predatorial. It is much like buying a used car from a used-car salesperson might have felt before Carmax. This is reflected in how much consumers hate the industry: across 14 of the biggest furniture retailers the average NPS is -11, compared with 37 for e-commerce as a whole.<p>At the same time, people are buying furniture online more than ever. It is a $50B online market per year (roughly 1/3 Amazon, 1/3 Wayfair, and 1/3 everyone else) but it’s nowhere possible to do a simple apples-to-apples search for like items. Even on Wayfair, you can find the same exact item with different names and prices.<p>There’s no reason why furniture shopping online shouldn’t have the same advantages over going to a physical store that, say, shopping for a TV online does. It just needs to become possible to search across the entire catalog of furniture inventory.<p>We encountered this problem when Dane moved to New York and went through the labor of buying and assembling an apartment's worth of furniture, only to discover that one of his pieces of furniture was listed at another store but called something completely different and sold for 50% less. We discovered this behavior was pervasive among furniture sellers. We devised a solution for a small set of items. Our findings generated excitement in several threads on Reddit (here’s one: <a href=\"https://old.reddit.com/r/HomeDecorating/comments/s1oz0p/urban_outfitters_home_dont_overpay/\" rel=\"nofollow\">https://old.reddit.com/r/HomeDecorating/comments/s1oz0p/urba...</a>). Many users told similar stories of frustration and confusion without a good solution and there was a lot of energy in these reactions—it turns out that the feeling of being taken advantage of is universally infuriating.<p>At the time, we were working on a tool to enable service professionals to grow their businesses. We did not find an acute enough pain for our then-users. When we started getting all these positive responses to exposing exploitative discrepancies in the furniture market, we realized we had hit on something people really care about, so we decided to build Spoken.<p>We crawl, scrape, and map product data and metadata across 1,000+ furniture stores to connect the exact same product across the internet. The mapping uses both algorithmic and human-driven scoring to evaluate exact product matches. It can be tricky, but it’s doable, to determine which products are the same—in a world of information abundance, there are many crumb trails. Often photos are the same. We can’t give away all the details here. But we do also augment brute human pattern-matching with our own tooling.<p>We aggregate all retailers’ inventory equally and surface transparent results—without ads, business-preference, or leaving out competitors. This means connecting Amazon, Google, Wayfair, and the long tail of hundreds of regional furniture stores.<p>Some shopping comparison extensions and applications do in fact show users some places that they can buy items—including some furniture items—more cheaply. However, their business models involve partnering with sellers, whom they give special treatment and won’t undercut. So they will only ever offer partial, not full information. We’ve decided not to do this, as we believe that the most efficient marketplace has a good chance to win in the end.<p>Our site is live, and free to use (<a href=\"https://www.spoken.io/\" rel=\"nofollow\">https://www.spoken.io/</a>). Our next step will be to allow users to purchase directly on our site across multiple stores to consolidate check out flows and avoid marketing pop-ups and emails. We will charge a fee and offer users an option to offset the environmental effect of their purchase. The stores will fulfill the orders.<p>We’re eager to hear your feedback and your experiences with the furniture market!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "lgabraham",
    "url": "https://news.ycombinator.com/user?id=lgabraham"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30757421",
  "sameAs": "https://news.ycombinator.com/item?id=30757421",
  "dateCreated": "2022-03-21T18:12:37.852Z",
  "datePublished": "2022-03-21T17:53:39.000Z",
  "dateModified": "2022-03-21T18:12:37.852Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "启动HN：口语化（YC S21）--更好的家具购物",
  "headline_zh-Hant": "啟動HN：口語化（YC S21）--更好的傢俱購物",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，我们是Dane和Geoff，Spoken（<a href=\"https://www.spoken.io/\" rel=\"nofollow\">https://www.spoken.io/</a>）的创办人。我们使人们能够轻松地找到所有大商店中任何家具商品的最低价格。<p>在互联网上购买实物是很难的。你必须在不接触产品的情况下对其进行质量检查，仔细检查产品的尺寸，并评估卖家的可信度，而这些数据往往很少。但在网上购买家具是一个特殊的困难案例，因为市场是故意欺骗的。<p>家具卖家积极阻止消费者在其他商店或其他名称下轻易找到相同的商品，因为这使他们能够收取更多的费用。卖家获得了产品的名称，他们以混乱的方式命名产品，以方便价格歧视。例如，Wayfair的这张桌子（<a href=\"https://www.wayfair.com/furniture/pdp/williston-forge-veronica-dining-table-w001977704.html\" rel=\"nofollow\">https://www.wayfair.com/furniture/pdp/williston-forge-veroni...</a>）也可以在Appliance Connection以不同的名称找到，价格大约是其一半（<a href=\"https://www.appliancesconnection.com/modway-eei2034brn.html\" rel=\"nofollow\">https://www.appliancesconnection.com/modway-eei2034brn.html</a>）。在大多数网上购物中，你想要的产品都有明确的名称--如果你想要，比如说，一台电视，你可以简单地搜索 \"三星55英寸\"，看看百思买和沃尔玛的收费情况。但在家具方面，卖家积极工作，以破坏准确的产品图谱，并保持市场的低效率。<p>最终的结果是，购买家具感觉恶心、嘈杂和掠夺性。这很像在Carmax之前，从二手车销售人员那里购买二手车的感觉。这反映在消费者对这个行业的厌恶程度上：在14家最大的家具零售商中，平均NPS为-11，而整个电子商务的NPS为37。这是一个每年500亿美元的在线市场（大约1/3是亚马逊，1/3是Wayfair，还有1/3是其他所有人），但现在没有任何地方可以对同类商品进行简单的苹果对苹果的搜索。即使在Wayfair，你也可以找到同样的物品，但名称和价格却不一样。<p>没有理由不在网上购买家具，就像在网上购买电视一样，拥有与去实体店相同的优势。<p>当Dane搬到纽约后，我们遇到了这个问题，他花了很大力气购买并组装了一套公寓的家具，却发现他的一件家具在另一家商店上市了，但名称却完全不同，而且售价低了50%。我们发现这种行为在家具销售商中普遍存在。我们为一小部分商品设计了一个解决方案。我们的发现在Reddit上的几个主题中引起了兴奋（这里有一个。<a href=\"https://old.reddit.com/r/HomeDecorating/comments/s1oz0p/urban_outfitters_home_dont_overpay/\" rel=\"nofollow\">https://old.reddit.com/r/HomeDecorating/comments/s1oz0p/urba...</a>）。许多用户讲述了类似的沮丧和困惑的故事，但却没有一个好的解决方案，这些反应中蕴含着大量的能量--事实证明，被人利用的感觉是普遍令人愤怒的。<p>当时，我们正在开发一个工具，使服务人员能够发展他们的业务。我们没有为我们当时的用户找到一个足够尖锐的痛点。当我们开始得到所有这些关于揭露家具市场中的剥削性差异的积极回应时，我们意识到我们找到了人们真正关心的东西，所以我们决定建立Spoken。<p>我们在1000多家家具店中抓取、刮削和映射产品数据和元数据，以连接整个互联网上完全相同的产品。该映射使用算法和人工驱动的评分来评估精确的产品匹配。确定哪些产品是相同的--在一个信息丰富的世界里，有许多碎屑的痕迹，这可能很棘手，但也是可以做到的。通常照片都是一样的。我们不能在这里透露所有的细节。<p>我们平等地汇总所有零售商的库存，并浮现出透明的结果--没有广告、商业偏好，或遗漏竞争对手。这意味着连接亚马逊、谷歌、Wayfair和数百个地区的长尾。",
  "description_zh-Hant": "嗨，HN，我們是Dane和Geoff，Spoken（<a href=\"https://www.spoken.io/\" rel=\"nofollow\">https://www.spoken.io/</a>）的創辦人。我們使人們能夠輕鬆地找到所有大商店中任何傢俱商品的最低價格。<p>在互聯網上購買實物是很難的。你必須在不接觸產品的情況下對其進行質量檢查，仔細檢查產品的尺寸，並評估賣家的可信度，而這些數據往往很少。但在網上購買傢俱是一個特殊的困難案例，因為市場是故意欺騙的。<p>傢俱賣家積極阻止消費者在其他商店或其他名稱下輕易找到相同的商品，因為這使他們能夠收取更多的費用。賣家獲得了產品的名稱，他們以混亂的方式命名產品，以方便價格歧視。例如，Wayfair的這張桌子（<a href=\"https://www.wayfair.com/furniture/pdp/williston-forge-veronica-dining-table-w001977704.html\" rel=\"nofollow\">https://www.wayfair.com/furniture/pdp/williston-forge-veroni...</a>）也可以在Appliance Connection以不同的名稱找到，價格大約是其一半（<a href=\"https://www.appliancesconnection.com/modway-eei2034brn.html\" rel=\"nofollow\">https://www.appliancesconnection.com/modway-eei2034brn.html</a>）。在大多數網上購物中，你想要的產品都有明確的名稱--如果你想要，比如說，一臺電視，你可以簡單地搜索 \"三星55英寸\"，看看百思買和沃爾瑪的收費情況。但在傢俱方面，賣家積極工作，以破壞準確的產品圖譜，並保持市場的低效率。<p>最終的結果是，購買傢俱感覺噁心、嘈雜和掠奪性。這很像在Carmax之前，從二手車銷售人員那裡購買二手車的感覺。這反映在消費者對這個行業的厭惡程度上：在14家最大的傢俱零售商中，平均NPS為-11，而整個電子商務的NPS為37。這是一個每年500億美元的在線市場（大約1/3是亞馬遜，1/3是Wayfair，還有1/3是其他所有人），但現在沒有任何地方可以對同類商品進行簡單的蘋果對蘋果的搜索。即使在Wayfair，你也可以找到同樣的物品，但名稱和價格卻不一樣。<p>沒有理由不在網上購買傢俱，就像在網上購買電視一樣，擁有與去實體店相同的優勢。<p>當Dane搬到紐約後，我們遇到了這個問題，他花了很大力氣購買並組裝了一套公寓的傢俱，卻發現他的一件傢俱在另一家商店上市了，但名稱卻完全不同，而且售價低了50%。我們發現這種行為在傢俱銷售商中普遍存在。我們為一小部分商品設計了一個解決方案。我們的發現在Reddit上的幾個主題中引起了興奮（這裡有一個。<a href=\"https://old.reddit.com/r/HomeDecorating/comments/s1oz0p/urban_outfitters_home_dont_overpay/\" rel=\"nofollow\">https://old.reddit.com/r/HomeDecorating/comments/s1oz0p/urba...</a>）。許多用戶講述了類似的沮喪和困惑的故事，但卻沒有一個好的解決方案，這些反應中蘊含著大量的能量--事實證明，被人利用的感覺是普遍令人憤怒的。<p>當時，我們正在開發一個工具，使服務人員能夠發展他們的業務。我們沒有為我們當時的用戶找到一個足夠尖銳的痛點。當我們開始得到所有這些關於揭露傢俱市場中的剝削性差異的積極迴應時，我們意識到我們找到了人們真正關心的東西，所以我們決定建立Spoken。<p>我們在1000多家傢俱店中抓取、刮削和映射產品數據和元數據，以連接整個互聯網上完全相同的產品。該映射使用算法和人工驅動的評分來評估精確的產品匹配。確定哪些產品是相同的--在一個信息豐富的世界裡，有許多碎屑的痕跡，這可能很棘手，但也是可以做到的。通常照片都是一樣的。我們不能在這裡透露所有的細節。<p>我們平等地彙總所有零售商的庫存，並浮現出透明的結果--沒有廣告、商業偏好，或遺漏競爭對手。這意味著連接亞馬遜、谷歌、Wayfair和數百個地區的長尾。"
}