{
  "@type": "NewsArticle",
  "identifier": "2022--03--07--en--myfeed--HackerNews--NewsArticle--30584851",
  "url": "https://news.ycombinator.com/item?id=30584851",
  "headline": "A plea, a rant, a profound sense of loss",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Take a man who loves freedom. Traded having a career job for freelancing and traveling. The man's afraid of two things, namely: Getting sick and not being able to support himself; and, since growing up in the 1980s and having nightmares as a child, nuclear war.\nLock him indoors for 2 years and terrify him with a deadly virus. No more travel, nowhere you can go. Whole world locked down. No freedom.\nThen confront him with the real possibility of nuclear war.\nAnd while you're doing it, take away the daily comfort of conversation. Take away the cafes and bars, the parks and friends' get-togethers. Replace his social life with an artificial world, not of real people, but of bubbles of friends on Zoom, and faceless opinionated idiots who might be bots, filling every space with ahistorical lies that can't be distinguished from basic ignorance. A world of faceless voices who first incredibly deny the virus, making it worse, then advocate for the end of the world. So that it seems none of them want to live. Or care about life.\nHow can they not care about life? How did so many angry and pessimistic people come to exist? A few years ago there was so much belief in a better future, in individuality, in the human spirit and the experience of knowing and loving the world. Suddenly it's been replaced by anger on every side, FOMO, some feeling that nothing is fair if your life isn't like someone else's. Suddenly every actress has huge puffy lips and looks like they mutated into a duck face photo. Suddenly it's not a mark of pride to eat rice and beans while working your way up. Suddenly everyone assumes they'll never get &quot;there&quot;, that they'll fail, that they're being lied to, that everything is rigged. And no one wants to know the truth, or look at the details. Everyone gets mileage out of being angry. They spend time complaining about what other people have instead of working on themselves, or making anything for themselves, or experiencing life in all its beauty and complexity. And so they hate life. \nIt costs nothing to travel, really. It costs nothing to read books. They don't do it. Ten years ago I would have been talking about a fragment of the religious right. Now I'm talking about everybody.\nThey just want to tear down the world. The anti-vax people and the anti-mask people, the climate change denialists. And the people panicking about climate change, panicking about who's vaccinated. End of the world doomers on all sides. No rationality. Just stories, conspiracy stories.<p>You wake up one day in your country, but it's a different country. There's no space for reasonable people who want to live a nice life, get along with their neighbor, be civil, work hard, enjoy the fruits of their labor. No space for civilian life. Everything is converted to internecine warfare. We all blame some vague outside force for creating this condition. You wake up with ignorant assholes screaming from every direction, meth addicts camped on your porch, crazy people driving by with confederate flags and shotguns, people excusing terrible behavior, people behaving terribly. A rabid desire to reject nuance; as if nuance is the enemy; as if irrational absolutism were a credit to one's character, rather than the ability to contextualize and see through to more complicated understandings of the world. You can see why they want it all to end. Their inner mindscape is some kind of hell because they lack the tools to think critically and objectively; they even lack the sense that they should find those tools. It's what Hannah Arendt described as the totalitarian mob, except there are two mobs; and neither has anything to live for.<p>But YOU have something to live for. And their ignorance is the enemy. So you try to speak your mind, to make personal connections, to take down the level of anger. But it doesn't work. The level of anger on all sides goes up every day. And you can see where it's all heading.<p>How could this happen in 2022? Every day someone's trying to open the door on an airplane, screaming to be let out. What is happening to the world? And do all the people who don't enjoy life need to destroy it for the rest of us?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "noduerme",
    "url": "https://news.ycombinator.com/user?id=noduerme"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30584851",
  "sameAs": "https://news.ycombinator.com/item?id=30584851",
  "dateCreated": "2022-03-07T06:54:39.055Z",
  "datePublished": "2022-03-07T06:43:56.000Z",
  "dateModified": "2022-03-07T06:54:39.055Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "一种恳求，一种咆哮，一种深刻的失落感",
  "headline_zh-Hant": "一種懇求，一種咆哮，一種深刻的失落感",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "以一个热爱自由的人为例。将拥有一份职业工作换成了自由职业者和旅行。这个人害怕两件事，即。生病，无法养活自己；以及，由于在20世纪80年代长大，从小就做噩梦，害怕核战争。\n把他关在室内2年，用致命的病毒吓唬他。不能再旅行，无处可去。整个世界被封锁。没有自由。\n然后让他面对核战争的真实可能性。\n当你这样做的时候，夺走日常舒适的谈话。拿走咖啡馆和酒吧，公园和朋友的聚会。用一个人造的世界取代他的社交生活，这个世界不是由真实的人组成的，而是由Zoom上的朋友气泡和不露面的有意见的白痴组成的，他们可能是机器人，用无法区分基本无知的非历史性的谎言填充每一个空间。一个由不露面的声音组成的世界，他们先是难以置信地否认病毒，使其变得更糟，然后鼓吹世界末日的到来。这样一来，似乎没有一个人想活下去。或者关心生命。\n他们怎么能不关心生命呢？怎么会有这么多愤怒和悲观的人存在？几年前，人们对美好的未来、对个性、对人类精神以及对认识和热爱世界的体验有那么多的信念。突然间，它被各方的愤怒所取代，FOMO，一些感觉，如果你的生活不像别人的，就没有什么是公平的。突然间，每个女演员都有巨大的浮肿的嘴唇，看起来像变异成鸭子脸的照片。突然间，在工作时吃米饭和豆子并不是一种骄傲的标志。突然间，每个人都认为他们永远不会到达那里，他们会失败，他们被骗了，一切都被操纵了。没有人想知道真相，也没有人想看细节。每个人都从愤怒中得到好处。他们花时间抱怨别人拥有什么，而不是为自己工作，或为自己创造什么，或体验生活的所有美丽和复杂性。因此，他们憎恨生活。\n其实，旅行并不花钱。读书也不花钱。他们不这样做。十年前，我说的是宗教右派的一部分人。现在我说的是所有人。\n他们只是想拆毁这个世界。反疫苗的人和反面具的人，否认气候变化的人。还有那些对气候变化感到恐慌的人，对谁接种疫苗感到恐慌的人。各方都有世界末日的预言家。毫无理性可言。<p>有一天你在你的国家醒来，但这是一个不同的国家。没有空间给那些想要过上美好生活、与邻居相处、文明、努力工作、享受劳动成果的理性人。没有平民生活的空间。一切都被转换为自相残杀的战争。我们都指责某种模糊的外部力量造成了这种状况。你醒来的时候，无知的混蛋们从各个方向尖叫，冰毒成瘾者在你的门廊上扎营，疯狂的人拿着邦联旗和猎枪开车经过，人们为可怕的行为找借口，人们的行为很糟糕。一种拒绝细微差别的狂热欲望；仿佛细微差别是敌人；仿佛非理性的绝对主义是对一个人性格的褒奖，而不是对世界的背景和更复杂的理解能力。你可以看到为什么他们希望这一切都结束。他们的内心世界是某种地狱，因为他们缺乏批判性和客观思考的工具；他们甚至缺乏他们应该找到这些工具的意识。这就是汉娜-阿伦特所描述的极权主义的暴民，只不过有两个暴民；而这两个暴民都没有什么可活的。而他们的无知就是敌人。所以你试图说出你的想法，建立个人联系，降低愤怒的程度。但这并不奏效。各方的愤怒程度每天都在上升。你可以看到这一切的走向。<p>这怎么可能在2022年发生？每天都有人试图打开飞机上的门，尖叫着要被放出来。这个世界正在发生什么？而所有不享受生活的人需要为我们其他人破坏它吗？",
  "description_zh-Hant": "以一個熱愛自由的人為例。將擁有一份職業工作換成了自由職業者和旅行。這個人害怕兩件事，即。生病，無法養活自己；以及，由於在20世紀80年代長大，從小就做噩夢，害怕核戰爭。\n把他關在室內2年，用致命的病毒嚇唬他。不能再旅行，無處可去。整個世界被封鎖。沒有自由。\n然後讓他面對核戰爭的真實可能性。\n當你這樣做的時候，奪走日常舒適的談話。拿走咖啡館和酒吧，公園和朋友的聚會。用一個人造的世界取代他的社交生活，這個世界不是由真實的人組成的，而是由Zoom上的朋友氣泡和不露面的有意見的白痴組成的，他們可能是機器人，用無法區分基本無知的非歷史性的謊言填充每一個空間。一個由不露面的聲音組成的世界，他們先是難以置信地否認病毒，使其變得更糟，然後鼓吹世界末日的到來。這樣一來，似乎沒有一個人想活下去。或者關心生命。\n他們怎麼能不關心生命呢？怎麼會有這麼多憤怒和悲觀的人存在？幾年前，人們對美好的未來、對個性、對人類精神以及對認識和熱愛世界的體驗有那麼多的信念。突然間，它被各方的憤怒所取代，FOMO，一些感覺，如果你的生活不像別人的，就沒有什麼是公平的。突然間，每個女演員都有巨大的浮腫的嘴唇，看起來像變異成鴨子臉的照片。突然間，在工作時吃米飯和豆子並不是一種驕傲的標誌。突然間，每個人都認為他們永遠不會到達那裡，他們會失敗，他們被騙了，一切都被操縱了。沒有人想知道真相，也沒有人想看細節。每個人都從憤怒中得到好處。他們花時間抱怨別人擁有什麼，而不是為自己工作，或為自己創造什麼，或體驗生活的所有美麗和複雜性。因此，他們憎恨生活。\n其實，旅行並不花錢。讀書也不花錢。他們不這樣做。十年前，我說的是宗教右派的一部分人。現在我說的是所有人。\n他們只是想拆毀這個世界。反疫苗的人和反面具的人，否認氣候變化的人。還有那些對氣候變化感到恐慌的人，對誰接種疫苗感到恐慌的人。各方都有世界末日的預言家。毫無理性可言。<p>有一天你在你的國家醒來，但這是一個不同的國家。沒有空間給那些想要過上美好生活、與鄰居相處、文明、努力工作、享受勞動成果的理性人。沒有平民生活的空間。一切都被轉換為自相殘殺的戰爭。我們都指責某種模糊的外部力量造成了這種狀況。你醒來的時候，無知的混蛋們從各個方向尖叫，冰毒成癮者在你的門廊上紮營，瘋狂的人拿著邦聯旗和獵槍開車經過，人們為可怕的行為找藉口，人們的行為很糟糕。一種拒絕細微差別的狂熱慾望；彷彿細微差別是敵人；彷彿非理性的絕對主義是對一個人性格的褒獎，而不是對世界的背景和更復雜的理解能力。你可以看到為什麼他們希望這一切都結束。他們的內心世界是某種地獄，因為他們缺乏批判性和客觀思考的工具；他們甚至缺乏他們應該找到這些工具的意識。這就是漢娜-阿倫特所描述的極權主義的暴民，只不過有兩個暴民；而這兩個暴民都沒有什麼可活的。而他們的無知就是敵人。所以你試圖說出你的想法，建立個人聯繫，降低憤怒的程度。但這並不奏效。各方的憤怒程度每天都在上升。你可以看到這一切的走向。<p>這怎麼可能在2022年發生？每天都有人試圖打開飛機上的門，尖叫著要被放出來。這個世界正在發生什麼？而所有不享受生活的人需要為我們其他人破壞它嗎？"
}