{
  "@type": "NewsArticle",
  "identifier": "2022--04--13--en--myfeed--HackerNews--NewsArticle--31018256",
  "url": "https://news.ycombinator.com/item?id=31018256",
  "headline": "Research Request: Self-Reproducing Systems",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "In order to colonize Mars it seems that a system that could (a) reproduce itself a few times and then (b) seek and collect needed raw materials for those systems which would repeat the cycle. The result is exponential growth. SpaceX and Axiom may get us to Mars but they can't terraform (mars-aform?) a planet with material only shipped from Earth.<p>I've been doing research in self-reproducing systems for a while now. In particular, I've been working with a robot and a 3D printer. This raises many thought experiments, such as how to create a servo motor. The point of the research is to highlight &quot;interesting issues&quot; and uncover interesting facts. For example, a Bridgeport is the only machine that can make all of its own parts (so far).<p>Many interesting ideas arise. For example, certain plants can extract useful elements. To quote (The PDF is behind a Springer paywall and I don't have access...)<p>&quot;On an uranium-mining-influenced area, sunflowers (Helianthus annuus) were grown on a small-scaled plot. Subsamples of sunflowers were harvested 34, 66, 96, 108, 140, and 170 days after sowing. Contents of Cd, Co, Cr, Cu, Fe, Mn, Ni, Pb, Th, U, Zn, and rare earth elements (REEs, La–Lu) were determined in the sunflower shoots, as well as total and bioavailable contents of these 25 elements in the soil taken on the day of sowing and after the last harvest.&quot;<p>Another interesting idea is to eliminate screws and screwdrivers by using Japanese joinery techniques on 3D printed parts.<p>If you know of published materials on self-reproducing systems, particularly in hardware, please post a link. Creative ideas are welcome.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "daly",
    "url": "https://news.ycombinator.com/user?id=daly"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31018256",
  "sameAs": "https://news.ycombinator.com/item?id=31018256",
  "dateCreated": "2022-04-13T18:36:49.623Z",
  "datePublished": "2022-04-13T18:19:47.000Z",
  "dateModified": "2022-04-13T18:36:49.623Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "研究请求。自我繁殖系统",
  "headline_zh-Hant": "研究請求。自我繁殖系統",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "为了殖民火星，似乎一个系统可以（a）自我繁殖几次，然后（b）为那些会重复循环的系统寻找和收集所需的原材料。其结果是指数式增长。SpaceX和Axiom可能会把我们带到火星，但他们无法用只从地球运来的材料对一个星球进行地球化改造（mars-aform？特别是，我一直在用一个机器人和一台3D打印机工作。这引发了许多思想实验，例如如何创建一个伺服电机。研究的重点是突出&quot;有趣的问题&quot;和发现有趣的事实。例如，Bridgeport是唯一可以自己制造所有零件的机器（到目前为止）。<p>出现了许多有趣的想法。例如，某些植物可以提取有用的元素。引用一下（PDF文件在斯普林格的付费墙后面，我没有权限......）<p>&quot;在一个受铀矿影响的地区，向日葵（Helianthus annuus）被种植在一个小规模的土地上。播种后34、66、96、108、140和170天，收获了向日葵的子样本。测定了向日葵嫩枝中的Cd、Co、Cr、Cu、Fe、Mn、Ni、Pb、Th、U、Zn和稀土元素（REEs，La-Lu）的含量，以及在播种当天和最后一次收获后土壤中这25种元素的总含量和生物可利用性。 &quot;<p>另一个有趣的想法是通过在3D打印部件上使用日本的细木工技术来消除螺钉和螺丝刀。<p>如果你知道关于自我复制系统的公开材料，特别是在硬件方面，请发布一个链接。我们欢迎有创意的想法。",
  "description_zh-Hant": "為了殖民火星，似乎一個系統可以（a）自我繁殖幾次，然後（b）為那些會重複循環的系統尋找和收集所需的原材料。其結果是指數式增長。SpaceX和Axiom可能會把我們帶到火星，但他們無法用只從地球運來的材料對一個星球進行地球化改造（mars-aform？特別是，我一直在用一個機器人和一臺3D打印機工作。這引發了許多思想實驗，例如如何創建一個伺服電機。研究的重點是突出&quot;有趣的問題&quot;和發現有趣的事實。例如，Bridgeport是唯一可以自己製造所有零件的機器（到目前為止）。<p>出現了許多有趣的想法。例如，某些植物可以提取有用的元素。引用一下（PDF文件在斯普林格的付費牆後面，我沒有權限......）<p>&quot;在一個受鈾礦影響的地區，向日葵（Helianthus annuus）被種植在一個小規模的土地上。播種後34、66、96、108、140和170天，收穫了向日葵的子樣本。測定了向日葵嫩枝中的Cd、Co、Cr、Cu、Fe、Mn、Ni、Pb、Th、U、Zn和稀土元素（REEs，La-Lu）的含量，以及在播種當天和最後一次收穫后土壤中這25種元素的總含量和生物可利用性。 &quot;<p>另一個有趣的想法是通過在3D打印部件上使用日本的細木工技術來消除螺釘和螺絲刀。<p>如果你知道關於自我複製系統的公開材料，特別是在硬件方面，請發佈一個鏈接。我們歡迎有創意的想法。"
}