{
  "@type": "NewsArticle",
  "identifier": "2022--04--06--en--myfeed--HackerNews--NewsArticle--30929456",
  "url": "https://news.ycombinator.com/item?id=30929456",
  "headline": "Need Career Advice/Guidance",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Most of my life I worked as a WordPress developer and learned a few other things in-between. WordPress was never my first choice but due to financials I needed a job quickly so, I got into this 5 years ago after completing my high schools and left college/formal education since then.<p>Last year, I was sick of everyday customising and fixing WordPress websites. I worked as a contractor for a few companies all these years. So, In July, I left everything and started working on my personal projects. I had experience with Python and Django because I was learning this once in a month or two.<p>So, I started improving these first. I can build eCommerce level websites with django and moreover JS, JQuery (due to WordPress and all those CMS), Postgresql, mysql, and recently learning React and HTML canvas.<p>Now, the situation is I haven't earned a single penny in last 9 months and my personal project haven't move forward to a level or any level at all. Because everytime I deploy, I came through a post or article here and there which every time I find useful and start redevelopment from scratch and this loop is not stoping from the last 4 months especially. So, I'm only working development part but not on its business part like SEO or content.<p>And now, I'm broke as hell and not sure what should I do. Whenever I look at jobs either for backend: they need algo and for frontend they need 10 different frameworks. I don't have any education background in CS or even in anything after high school.<p>What should I do now?<p>My overall skills: Python, Django, JS, JQuery, CMS like WordPress and Shopify, SEO, and paid ads.<p>My portfolio: 0\nAs a contractor I cannot show those websites in my portfolio and only I can tell but no one is going to listen without seeing first.<p>Should I learn a few more frameworks, languages or other thing like cloud to get a job as quickly as possible or should I just apply and these are enough?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "blackmario",
    "url": "https://news.ycombinator.com/user?id=blackmario"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30929456",
  "sameAs": "https://news.ycombinator.com/item?id=30929456",
  "dateCreated": "2022-04-06T08:12:54.825Z",
  "datePublished": "2022-04-06T07:36:09.000Z",
  "dateModified": "2022-04-06T08:12:54.825Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "需要职业咨询/指导",
  "headline_zh-Hant": "需要職業諮詢/指導",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我一生中的大部分时间都在做WordPress的开发工作，中间还学了一些其他东西。WordPress从来不是我的第一选择，但由于经济原因，我需要一份快速的工作，所以，我在5年前完成了我的高中学业，并从那时起离开了大学/正规教育。<p>去年，我已经厌倦了每天定制和修复WordPress网站。这些年来，我一直作为承包商为一些公司工作。所以，在7月份，我离开了一切，开始从事我的个人项目。我对Python和Django有经验，因为我一两个月就学一次。<p>所以，我先开始改进这些。我可以用Django建立电子商务级别的网站，此外还有JS、JQuery（由于WordPress和所有那些CMS）、Postgresql、mysql，最近还在学习React和HTML canvas。<p>现在，情况是我在过去9个月里没有赚到一分钱，我的个人项目也没有前进到一个级别或任何级别。因为每次我部署的时候，我都会在这里或那里看到一个帖子或文章，每次我都觉得很有用，然后从头开始重新开发，这个循环在过去4个月里没有停止过。所以，我只负责开发部分，而不负责SEO或内容等业务部分。<p>而现在，我已经破产了，不知道该怎么办。每当我看工作时，无论是后端：他们需要算法，还是前端，他们需要10个不同的框架。我在CS方面没有任何教育背景，甚至在高中毕业后也没有任何教育背景。<p>我现在应该做什么？<p>我的总体技能。Python、Django、JS、JQuery、CMS如WordPress和Shopify、SEO和付费广告。<p>我的作品集：0\n作为一个承包商，我不能在我的作品集中展示那些网站，只有我自己能说出来，但不先看的话，没有人会听的。<p>我应该多学一些框架、语言或其他像云一样的东西来尽快找到工作，还是我应该直接申请，这些就够了？",
  "description_zh-Hant": "我一生中的大部分時間都在做WordPress的開發工作，中間還學了一些其他東西。WordPress從來不是我的第一選擇，但由於經濟原因，我需要一份快速的工作，所以，我在5年前完成了我的高中學業，並從那時起離開了大學/正規教育。<p>去年，我已經厭倦了每天定製和修復WordPress網站。這些年來，我一直作為承包商為一些公司工作。所以，在7月份，我離開了一切，開始從事我的個人項目。我對Python和Django有經驗，因為我一兩個月就學一次。<p>所以，我先開始改進這些。我可以用Django建立電子商務級別的網站，此外還有JS、JQuery（由於WordPress和所有那些CMS）、Postgresql、mysql，最近還在學習React和HTML canvas。<p>現在，情況是我在過去9個月裡沒有賺到一分錢，我的個人項目也沒有前進到一個級別或任何級別。因為每次我部署的時候，我都會在這裡或那裡看到一個帖子或文章，每次我都覺得很有用，然後從頭開始重新開發，這個循環在過去4個月裡沒有停止過。所以，我只負責開發部分，而不負責SEO或內容等業務部分。<p>而現在，我已經破產了，不知道該怎麼辦。每當我看工作時，無論是後端：他們需要算法，還是前端，他們需要10個不同的框架。我在CS方面沒有任何教育背景，甚至在高中畢業後也沒有任何教育背景。<p>我現在應該做什麼？<p>我的總體技能。Python、Django、JS、JQuery、CMS如WordPress和Shopify、SEO和付費廣告。<p>我的作品集：0\n作為一個承包商，我不能在我的作品集中展示那些網站，只有我自己能說出來，但不先看的話，沒有人會聽的。<p>我應該多學一些框架、語言或其他像雲一樣的東西來儘快找到工作，還是我應該直接申請，這些就夠了？"
}