{
  "@type": "NewsArticle",
  "identifier": "2022--03--06--en--myfeed--HackerNews--NewsArticle--30575557",
  "url": "https://news.ycombinator.com/item?id=30575557",
  "headline": "Tell HN: Interesting fact I learned about human trafficking",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "A while back, I learned that in a certain country, it's a third world country, People are abducted and sold off as basically slaves. But that's not the interesting part, I am getting to it...<p>So cops are obviously involved in this. Cops say this area is under our jurisdiction, and if you wanna commit crimes here you gotta pay us too. In turn cops turn blind eye to the crimes, unless obviously someone important gets hurt, and cops also keep rivals criminal gangs out of the area by going after them. It's a win-win for both the criminal gang and cops.<p>But this means not all crimes are worth it, i.e. if cops want $10k per crime, you want to make sure your crime is netting you at least $13k to be worth it.<p>Which leads to next part, so what abductors do is before they even abduct people they do live bidding. Kinda like Google ads header bidding.<p>They describe the person they think is vulnerable to interested parties and start stalking him/her.<p>If they get high enough bid, they abduct the person, if not, that person gets to go home.<p>This helps with problem of them abducting someone and not getting high enough price to pay off cops.<p>So imagine getting bid on while you are out just buying an ice cream, fun times.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "lifeplusplus",
    "url": "https://news.ycombinator.com/user?id=lifeplusplus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30575557",
  "sameAs": "https://news.ycombinator.com/item?id=30575557",
  "dateCreated": "2022-03-06T06:52:57.165Z",
  "datePublished": "2022-03-06T06:45:35.000Z",
  "dateModified": "2022-03-06T06:52:57.165Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "告诉HN：我学到的关于人口贩运的有趣事实",
  "headline_zh-Hant": "告訴HN：我學到的關於人口販運的有趣事實",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "前段时间，我了解到在某个国家，也就是第三世界国家，人们被绑架，基本上被当作奴隶卖掉。但这不是有趣的部分，我正在说......<p>所以警察显然参与了这件事。警察说，这个地区属于我们的管辖范围，如果你想在这里犯罪，你也得付钱给我们。反过来，警察对犯罪行为视而不见，除非明显有重要的人受到伤害，而警察也通过追捕对手的犯罪团伙来阻止他们进入这个地区。这对犯罪团伙和警察来说是双赢的。<p>但这意味着并非所有的犯罪都值得，即如果警察想要每起犯罪1万美元，你要确保你的犯罪至少能给你带来1.3万美元的净收入才值得。<p>这导致了下一部分，所以绑架者所做的是在他们甚至绑架人之前就进行现场竞标。<p>他们向感兴趣的人描述他们认为脆弱的人，并开始跟踪他/她。<p>如果他们得到足够高的出价，他们就绑架这个人，如果没有，这个人就可以回家了。<p>这有助于解决他们绑架了某人，但没有得到足够高的价格来支付警察的问题。<p>所以想象一下，当你出去买一个冰淇淋的时候被竞标，有趣的时间。",
  "description_zh-Hant": "前段時間，我瞭解到在某個國家，也就是第三世界國家，人們被綁架，基本上被當作奴隸賣掉。但這不是有趣的部分，我正在說......<p>所以警察顯然參與了這件事。警察說，這個地區屬於我們的管轄範圍，如果你想在這裡犯罪，你也得付錢給我們。反過來，警察對犯罪行為視而不見，除非明顯有重要的人受到傷害，而警察也通過追捕對手的犯罪團伙來阻止他們進入這個地區。這對犯罪團伙和警察來說是雙贏的。<p>但這意味著並非所有的犯罪都值得，即如果警察想要每起犯罪1萬美元，你要確保你的犯罪至少能給你帶來1.3萬美元的淨收入才值得。<p>這導致了下一部分，所以綁架者所做的是在他們甚至綁架人之前就進行現場競標。<p>他們向感興趣的人描述他們認為脆弱的人，並開始跟蹤他/她。<p>如果他們得到足夠高的出價，他們就綁架這個人，如果沒有，這個人就可以回家了。<p>這有助於解決他們綁架了某人，但沒有得到足夠高的價格來支付警察的問題。<p>所以想象一下，當你出去買一個冰淇淋的時候被競標，有趣的時間。"
}