{
  "@type": "NewsArticle",
  "identifier": "2022--03--14--en--myfeed--HackerNews--NewsArticle--30672117",
  "url": "https://news.ycombinator.com/item?id=30672117",
  "headline": "Tell HN: Recruiters asking for current salary may respectfully fuck off",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "My new kink is responding to recruiters who ask for my current salary by asking them for the total comp for the role they're recruiting for.<p>It's purely for entertainment, of course - I won't even meet with them after that. A company that asks your current salary is asking to find out how little they can pay you. They are seeking to create and exploit a superior bargaining position that results from unequal knowledge - they know how much you make and how much they pay, but you only know one of those things. And that's how they treat you <i>before</i> you start working there.<p>I doubt that companies who do this can be persuaded to stop.<p>But if I were a VC, it might give me pause to learn that a company in my portfolio does this. Knowing that the make or break comes down to people - or at least suspecting that might matter - might make me worry about a company that rejects valuing the one single resource that decides the whole ballgame.<p>Anywho, my nonsense aside, the object of the game is to see how many messages a recruiter will respond with before giving an actual compensation number. An unsolicited phone call counts as two messages. My current record is 7.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "valar_m",
    "url": "https://news.ycombinator.com/user?id=valar_m"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30672117",
  "sameAs": "https://news.ycombinator.com/item?id=30672117",
  "dateCreated": "2022-03-14T13:35:41.450Z",
  "datePublished": "2022-03-14T13:23:12.000Z",
  "dateModified": "2022-03-14T13:35:41.450Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "告诉HN：招聘人员要求提供目前的工资，可以恭敬地滚开。",
  "headline_zh-Hant": "告訴HN：招聘人員要求提供目前的工資，可以恭敬地滾開。",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的新癖好是在回答那些问我目前工资的招聘人员时，问他们正在招聘的角色的总薪酬。<p>当然，这纯粹是为了娱乐--之后我甚至不会与他们见面。一家公司问你目前的工资，就是想知道他们能给你多少钱。They are seeking to create and exploit a superior bargaining position that results from unequal knowledge - they know how much you make and how much they pay, but you only know one of those things. And that's how they treat you <i>before</i> you start working there.<p>I doubt that companies who do this can be persuaded to stop.<p>But if I were a VC, it might give me pause to learn that a company in my portfolio does this. 知道决定成败的因素是人--或者至少怀疑这一点可能很重要--可能会让我担心一个拒绝重视决定整个球赛的单一资源的公司。<p>不管怎样，撇开我的胡言乱语，游戏的目的是看招聘人员在给出实际报酬数字之前会回复多少信息。一个不请自来的电话算作两条信息。我目前的记录是7条。",
  "description_zh-Hant": "我的新癖好是在回答那些問我目前工資的招聘人員時，問他們正在招聘的角色的總薪酬。<p>當然，這純粹是為了娛樂--之後我甚至不會與他們見面。一家公司問你目前的工資，就是想知道他們能給你多少錢。They are seeking to create and exploit a superior bargaining position that results from unequal knowledge - they know how much you make and how much they pay, but you only know one of those things. And that's how they treat you <i>before</i> you start working there.<p>I doubt that companies who do this can be persuaded to stop.<p>But if I were a VC, it might give me pause to learn that a company in my portfolio does this. 知道決定成敗的因素是人--或者至少懷疑這一點可能很重要--可能會讓我擔心一個拒絕重視決定整個球賽的單一資源的公司。<p>不管怎樣，撇開我的胡言亂語，遊戲的目的是看招聘人員在給出實際報酬數字之前會回覆多少信息。一個不請自來的電話算作兩條信息。我目前的記錄是7條。"
}