{
  "@type": "NewsArticle",
  "identifier": "2022--04--01--en--myfeed--HackerNews--NewsArticle--30878891",
  "url": "https://news.ycombinator.com/item?id=30878891",
  "headline": "What Is Agile?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The question sounds simple but the answer is probably not straight forward. There are thousands of books, blogs, courses, videos available on this subject, however, I still have a hard time understanding how does it work at a conceptual level. People say we can implement Agile methodology to software development to general business problems. Jeff Sutherland, Author of popular book on Agile (&quot;Scrum&quot;), suggests that we can solve humanities most important problems like poverty with this methodology.<p>I have been able to understand following things about Agile\n- Too much planning is a waste of time. Rather, just figure out the next important thing and get down to work.\n- Do things incrementally. For example, when building a software, rather building things in parts, build a smallest possible functional system and deliver it to it's user and then extend it feature by feature. (In contrast to other approaches, where you build things part by part )\n- Respond on feedback rather than planning everything in advance.\n- Communication over documentation<p>However, what are the general principle of this methodology and how do we apply to projects other than software. How do we really solve world problems, the agile way?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "amitgupta6",
    "url": "https://news.ycombinator.com/user?id=amitgupta6"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30878891",
  "sameAs": "https://news.ycombinator.com/item?id=30878891",
  "dateCreated": "2022-04-01T15:53:10.834Z",
  "datePublished": "2022-04-01T15:09:21.000Z",
  "dateModified": "2022-04-01T15:53:10.834Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "什么是敏捷？",
  "headline_zh-Hant": "什麼是敏捷？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这个问题听起来很简单，但答案可能并不直接。关于这个问题有成千上万的书籍、博客、课程和视频，然而，我仍然很难理解它在概念层面上是如何运作的。人们说，我们可以将敏捷方法用于软件开发，以解决一般商业问题。杰夫-萨瑟兰（Jeff Sutherland）是一本关于敏捷的流行书（&quot;Scrum&quot;）的作者，他建议我们可以用这种方法来解决人类最重要的问题，如贫穷。\n- 太多的计划是浪费时间的。相反，只要弄清楚下一件重要的事情，就可以开始工作了。\n- 循序渐进地做事情。例如，在建立一个软件时，与其把事情分成几部分，不如建立一个尽可能小的功能系统，并把它交付给用户，然后再逐一扩展它的功能。(与其他方法相反，你要一个部分一个部分地构建事物。）\n- 对反馈作出反应，而不是事先计划一切。\n- 然而，这种方法的一般原则是什么，我们如何应用于软件以外的项目。我们如何以敏捷的方式真正解决世界上的问题？",
  "description_zh-Hant": "這個問題聽起來很簡單，但答案可能並不直接。關於這個問題有成千上萬的書籍、博客、課程和視頻，然而，我仍然很難理解它在概念層面上是如何運作的。人們說，我們可以將敏捷方法用於軟件開發，以解決一般商業問題。傑夫-薩瑟蘭（Jeff Sutherland）是一本關於敏捷的流行書（&quot;Scrum&quot;）的作者，他建議我們可以用這種方法來解決人類最重要的問題，如貧窮。\n- 太多的計劃是浪費時間的。相反，只要弄清楚下一件重要的事情，就可以開始工作了。\n- 循序漸進地做事情。例如，在建立一個軟件時，與其把事情分成幾部分，不如建立一個儘可能小的功能系統，並把它交付給用戶，然後再逐一擴展它的功能。(與其他方法相反，你要一個部分一個部分地構建事物。）\n- 對反饋作出反應，而不是事先計劃一切。\n- 然而，這種方法的一般原則是什麼，我們如何應用於軟件以外的項目。我們如何以敏捷的方式真正解決世界上的問題？"
}