{
  "@type": "NewsArticle",
  "identifier": "2022--02--27--en--myfeed--HackerNews--NewsArticle--30493728",
  "url": "https://news.ycombinator.com/item?id=30493728",
  "headline": "Should the west be doing more to prepare for a possible gas shutoff by Putin?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Most of the articles about this seem to just summarize now dependent everyone is on Russia. I haven't seen much discussion about actual preparations for this possibility. I assume operators of the natural gas network in Europe are trying to estimate how they might cope somewhat, but I think Germany and Italy had good cause to hesitate on approving SWIFT removal. Biden also included in his announcement of sanctions that they would try to work on increasing oil supply from other nations at least to help Americans somewhat at the pump, but I haven't heard much from Europe on how they'll deal with potential fallout of natural gas supply from Russia decreasing or shut off completely.<p>With tougher sanctions and everyone sending weapons to Ukraine, this has to be something Putin is considering, shouldn't we be trying to mitigate this before people's homes go cold?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jaltekruse",
    "url": "https://news.ycombinator.com/user?id=jaltekruse"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30493728",
  "sameAs": "https://news.ycombinator.com/item?id=30493728",
  "dateCreated": "2022-02-27T23:11:54.837Z",
  "datePublished": "2022-02-27T23:02:20.000Z",
  "dateModified": "2022-02-27T23:11:54.837Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "西方国家是否应该做更多的准备，以应对普京可能关闭天然气？",
  "headline_zh-Hant": "西方國家是否應該做更多的準備，以應對普京可能關閉天然氣？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "关于这一点的大多数文章似乎只是总结了现在依赖于每个人对俄罗斯。我没有看到很多关于为这种可能性做实际准备的讨论。我想欧洲的天然气网络运营商正在努力估计他们可能会如何应对，但我认为德国和意大利有充分的理由在批准取消SWIFT时犹豫不决。拜登在宣布制裁时还表示，他们将努力增加来自其他国家的石油供应，至少在一定程度上帮助美国人，但我还没有从欧洲听到多少关于他们将如何处理来自俄罗斯的天然气供应减少或完全关闭的潜在影响的消息。<p>随着更严厉的制裁和每个人都向乌克兰运送武器，这必须是普京正在考虑的事情，我们不应该在人们的房子变冷之前努力缓解这种情况吗？",
  "description_zh-Hant": "關於這一點的大多數文章似乎只是總結了現在依賴於每個人對俄羅斯。我沒有看到很多關於為這種可能性做實際準備的討論。我想歐洲的天然氣網絡運營商正在努力估計他們可能會如何應對，但我認為德國和意大利有充分的理由在批准取消SWIFT時猶豫不決。拜登在宣佈制裁時還表示，他們將努力增加來自其他國家的石油供應，至少在一定程度上幫助美國人，但我還沒有從歐洲聽到多少關於他們將如何處理來自俄羅斯的天然氣供應減少或完全關閉的潛在影響的消息。<p>隨著更嚴厲的制裁和每個人都向烏克蘭運送武器，這必須是普京正在考慮的事情，我們不應該在人們的房子變冷之前努力緩解這種情況嗎？"
}