{
  "@type": "NewsArticle",
  "identifier": "2022--03--02--en--myfeed--HackerNews--NewsArticle--30526178",
  "url": "https://news.ycombinator.com/item?id=30526178",
  "headline": "Make Peace with Software",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The most important attribute to the current world tech should be - maintaining peace. \nEverything we achieved in software, philosophically speaking, is because of making a better life. So far you get my point.\nIf software would be delivered as current politics is delivered, we all engineers and devs would all be with empty pockets.<p>There is always a variable in a war that is not discovered at a valid time, so can we use software ideas to discover it?<p>Let's say I'm taking the Ukrainian side, what &quot;deep&quot; tools can be used to check facts like &quot;UKRAINIAN CRIMES IN DONBAS&quot;?\nSpecifically, this text<p>--\nVarious crimes were committed by the Ukrainian army, but also by Nazi organizations that were founded in Ukraine in the period from 2014 until today. All these crimes had the support of the Ukrainian authorities and the state leadership, genocide was committed against the Russian population who were persecuted because of their language, religion, culture and identity.\nIn those 8 years, from 2014 to 2022, Ukrainians constantly shelled the cities of DNR and LNR, in which numerous civilians, the elderly, women and children were killed.<p>Cities with a huge number of victims were shelled and devastated: Donetsk, Luhansk, Mariupol, Avdiaevsky and others.<p>From 2014 to 2021, the Army of Ukraine killed more than 150 children in the DNR and LNR, and more were wounded. On July 27, 2014, the main streets of the city of Gorlovka were targeted by armed formations of Ukraine, and 20 civilians, including 4 children, were killed on the streets of the city.<p>That day went down in history as &quot;Bloody Sunday&quot;. During the shelling, 23-year-old Kristina Zhuk died with her daughter in her arms, and after her death she became known as &quot;Gorlovka Madonna&quot;.<p>The Ukrainian army and volunteer detachments committed various crimes, tortured, raped and kidnapped in their actions. Russian-speaking people were beaten in Ukraine. Unpleasant scenes in which street musicians in Lviv were beaten because they sang in Russian, and in Kiev women were beaten only because they spoke in Russian, as well as a taxi driver in the city of Kamyanske who was beaten and shot in the leg because of the Russian language.<p>In Odessa, on May 2, 2014, Russian-speaking people were burned at the Trade Union House by radical members of the Right Sector organization, and more than 10 people were burned alive.<p>In addition to beatings because of the Russian language, Russians were left without a job, noting that they had to learn Ukrainian, and if they could not, they were considered to have a low level of intelligence and should be &quot;cut off&quot; because they are dangerous to society.<p>In the period from 2014 until today, Ukrainian ministers and President Zelensky have repeatedly called Russians scum when addressing their soldiers with support because they are fighting scum.<p>During that period, a large number of Nazi organizations were created in Ukraine. Nazi organizations operating on the territory of Ukraine are: Trident - Stepan Bandera, Organization of Ukrainian Nationalists, Ukrainian Insurgent Army, Right Sector, UNA-UNSO, Brotherhood - Korchinsky, Misanthrope Division (operating under the slogan &quot;Death to Russia&quot;, and uses the flag with with a swastika and the inscription &quot;Hail Hitler!&quot;).",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "djuric42",
    "url": "https://news.ycombinator.com/user?id=djuric42"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30526178",
  "sameAs": "https://news.ycombinator.com/item?id=30526178",
  "dateCreated": "2022-03-02T11:50:08.572Z",
  "datePublished": "2022-03-02T11:36:57.000Z",
  "dateModified": "2022-03-02T11:50:08.572Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "与软件和平相处",
  "headline_zh-Hant": "與軟件和平相處",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "当前世界科技最重要的属性应该是--维护和平。\n我们在软件方面取得的一切成就，从哲学上讲，都是因为使生活更美好。到目前为止，你已经明白了我的意思。\n<p>在战争中总是有一个变量在有效时间内没有被发现，那么我们能不能用软件的思想来发现它呢？<p>假设我站在乌克兰一边，有什么&quot;深层&quot;工具可以用来检查&quot;英国在顿巴斯的犯罪&quot;等事实？\n具体来说，这段文字<p>--\n乌克兰军队犯下了各种罪行，而且从2014年到今天，在乌克兰成立的纳粹组织也犯下了各种罪行。所有这些罪行都得到了乌克兰当局和国家领导人的支持，对因语言、宗教、文化和身份而受到迫害的俄罗斯人进行了种族灭绝。\n在这8年里，从2014年到2022年，乌克兰人不断地炮击DNR和LNR的城市，其中无数平民、老人、妇女和儿童被杀害。顿涅茨克、卢甘斯克、马里乌波尔、阿夫迪耶夫斯基等。<p>从2014年到2021年，乌克兰军队在DNR和LNR杀害了150多名儿童，还有更多的人受伤。2014年7月27日，戈尔洛夫卡市的主要街道成为乌克兰武装编队的目标，包括4名儿童在内的20名平民在该市的街道上被杀害。<p>那一天作为&quot;血腥星期天&quot;被载入历史。在炮击中，23岁的克里斯蒂娜-朱克抱着女儿死去，死后她被称为 \"戈尔洛夫卡圣母\"。<p>乌克兰军队和志愿兵分队在行动中犯下各种罪行，实施酷刑、强奸和绑架。说俄语的人在乌克兰被殴打。在利沃夫，街头音乐家因为用俄语唱歌而被殴打，在基辅，妇女只因为说俄语而被殴打，还有卡米扬斯克市的一名出租车司机因为俄语而被殴打，腿部中弹，这些都是令人不快的场面。<p>在敖德萨，2014年5月2日，讲俄语的人在工会大厦被右翼地带组织的激进成员烧死，有10多人被活活烧死。 <p>除了因为俄语而被殴打，俄罗斯人没有工作，指出他们必须学习乌克兰语，如果他们不能，他们被认为智力水平低下，应该被&quot;切断&quot;，因为他们对社会是危险的。<p>从2014年到今天，乌克兰部长和总统泽伦斯基在对他们的士兵讲话时，多次称俄罗斯人是人渣，支持他们的战斗。<p>在此期间，大量的纳粹组织在乌克兰创建。在乌克兰境内活动的纳粹组织有。三叉戟--斯捷潘-班德拉、乌克兰民族主义组织、乌克兰起义军、右翼部门、UNA-UNSO、兄弟会--科尔钦斯基、厌世师（在口号&quot;俄罗斯之死&quot;下活动，并使用带有纳粹标志和铭文&quot;希特勒万岁！&quot;的旗帜）。",
  "description_zh-Hant": "當前世界科技最重要的屬性應該是--維護和平。\n我們在軟件方面取得的一切成就，從哲學上講，都是因為使生活更美好。到目前為止，你已經明白了我的意思。\n<p>在戰爭中總是有一個變量在有效時間內沒有被發現，那麼我們能不能用軟件的思想來發現它呢？<p>假設我站在烏克蘭一邊，有什麼&quot;深層&quot;工具可以用來檢查&quot;英國在頓巴斯的犯罪&quot;等事實？\n具體來說，這段文字<p>--\n烏克蘭軍隊犯下了各種罪行，而且從2014年到今天，在烏克蘭成立的納粹組織也犯下了各種罪行。所有這些罪行都得到了烏克蘭當局和國家領導人的支持，對因語言、宗教、文化和身份而受到迫害的俄羅斯人進行了種族滅絕。\n在這8年裡，從2014年到2022年，烏克蘭人不斷地炮擊DNR和LNR的城市，其中無數平民、老人、婦女和兒童被殺害。頓涅茨克、盧甘斯克、馬裡烏波爾、阿夫迪耶夫斯基等。<p>從2014年到2021年，烏克蘭軍隊在DNR和LNR殺害了150多名兒童，還有更多的人受傷。2014年7月27日，戈爾洛夫卡市的主要街道成為烏克蘭武裝編隊的目標，包括4名兒童在內的20名平民在該市的街道上被殺害。<p>那一天作為&quot;血腥星期天&quot;被載入歷史。在炮擊中，23歲的克里斯蒂娜-朱克抱著女兒死去，死後她被稱為 \"戈爾洛夫卡聖母\"。<p>烏克蘭軍隊和志願兵分隊在行動中犯下各種罪行，實施酷刑、強姦和綁架。說俄語的人在烏克蘭被毆打。在利沃夫，街頭音樂家因為用俄語唱歌而被毆打，在基輔，婦女只因為說俄語而被毆打，還有卡米揚斯克市的一名出租車司機因為俄語而被毆打，腿部中彈，這些都是令人不快的場面。<p>在敖德薩，2014年5月2日，講俄語的人在工會大廈被右翼地帶組織的激進成員燒死，有10多人被活活燒死。 <p>除了因為俄語而被毆打，俄羅斯人沒有工作，指出他們必須學習烏克蘭語，如果他們不能，他們被認為智力水平低下，應該被&quot;切斷&quot;，因為他們對社會是危險的。<p>從2014年到今天，烏克蘭部長和總統澤倫斯基在對他們的士兵講話時，多次稱俄羅斯人是人渣，支持他們的戰鬥。<p>在此期間，大量的納粹組織在烏克蘭創建。在烏克蘭境內活動的納粹組織有。三叉戟--斯捷潘-班德拉、烏克蘭民族主義組織、烏克蘭起義軍、右翼部門、UNA-UNSO、兄弟會--科爾欽斯基、厭世師（在口號&quot;俄羅斯之死&quot;下活動，並使用帶有納粹標誌和銘文&quot;希特勒萬歲！&quot;的旗幟）。"
}