{
  "@type": "NewsArticle",
  "identifier": "2022--03--05--en--myfeed--HackerNews--NewsArticle--30564738",
  "url": "https://news.ycombinator.com/item?id=30564738",
  "headline": "How to Design for Optimization",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey All, so I often transcribe sections I like from audiobooks, blogs, podcasts etc. and save them for later. I saved this excerpt without reference two years ago, and now I'm trying to find where it's from. It references leading VC's in Silicon Valley, so it's definitely 2005+.<p>_______________<p>Maybe I’m affected by me growing up in an an unprecedented part of history, where the entire human knowledge is available through the click of a button. This has a number of key implications.\nThe first, If you fail, it’s hard to blame anyone but yourself. This is because unless you’re working on something truly unique, which is improbable, someone has worked on it before, and you can learn from that person. It’s true that the unique circumstances of the situation can be specific to you, but in general, most of the cases we deal with in life are some form of variation, of not outwright exactly the same, to something that someone else had dealt with before.<p>The second. The main problem in for most of history was to acquire the information necessary to gain the knowledge (we can think of knowledge as applied information, analagous to how engineering is applied sciences). For the first time ever, the problem isn’t getting the information; it’s all there on your browser, but it’s finding credible sources where the information is reliable, clear, and relevant to your situation. This is hard, and often takes skills. But you can often find those skills by going down the knowledges pipeline.<p>First, ask, who would know how to get such an information?<p>A librarian would likely have the formal education to go through the process of finding information. This means you can learn a lot from them. talk to a librarian, or find an online library, and read through their guidelines and processes. If this doesn’t get you through the process of finding information, it will at minimum throw you into the general community where there is applied knowledge on this, and you can begin to navigate to secondary sources.<p>Second, ask, who has gone through this before?<p>It is extremely improbable that no one had gone through what you’re through before. If you’re a startup founder and are confused about how to raise funds for the first time, figure out who has gone through that process before? probably other founders of bigger organizations. Talk/email them, and figure out how they went about it. What were helpful resources in their quest to learn more about this?<p>Third, how do you tell if the information is reliable or not?<p>There’s a ton of junk out there. Statistically, it’s probably more junk than not. How do you figure out which is reliable information and which isn’t?<p>I’m not sure yet. But I've found it helpful to go to the most expert possible source and figure out what they know. That will give you a baseline to start to assess what’s bullshit and what isn’t. Applied knowledge is information, and most of the community surrounding a topic usually repeat what the top 10% says and creates, regardless if it’s outdates or recently tested or not. You need to find that 10%, and figure out what they know.<p>For example, most VC’s repeat what the leading VC’s do. Leading VC’s, like a16z, sequoia, or YC, go down to the physics and investigate arguments themselves. They then publish the results, which are often consumed by lower-VC’s, who are often too lazy or inexperienced to conduct their own thought process, and will take these results as facts. \nThis works less in academia, where by default claims are questions. In industry, the 10% usually creates the literature and sets the standards.<p>Fourth, textbooks.<p>Textbooks are a great way to figure out the current consensus and literature on what’s going on within the community. They’r designed as reference points in which learners use to find information.  \nBlogs of leading authors/institutions.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Opy_",
    "url": "https://news.ycombinator.com/user?id=Opy_"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30564738",
  "sameAs": "https://news.ycombinator.com/item?id=30564738",
  "dateCreated": "2022-03-05T06:12:59.001Z",
  "datePublished": "2022-03-05T05:57:56.000Z",
  "dateModified": "2022-03-05T06:12:59.001Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "如何进行优化设计",
  "headline_zh-Hant": "如何進行優化設計",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，大家好，所以我经常从有声读物、博客、播客等处抄录我喜欢的部分，并保存起来备用。两年前，我在没有参考资料的情况下保存了这段摘录，现在我正试图找到它的出处。它提到了硅谷领先的风险投资公司，所以肯定是2005年以上。<p>_______________<p>也许我受到了影响，因为我成长在一个前所未有的历史时期，通过点击一个按钮就能获得整个人类的知识。这有一些关键的影响。\n第一，如果你失败了，除了你自己，很难责怪任何人。这是因为，除非你正在研究真正独特的东西，这是不可能的，否则有人曾经研究过，你可以向那个人学习。诚然，独特的情况可能是你所特有的，但一般来说，我们在生活中处理的大多数情况都是某种形式的变化，不是完全相同的，是别人以前处理过的东西。历史上大部分时间的主要问题是获取必要的信息以获得知识（我们可以认为知识是应用信息，类似于工程是应用科学）。有史以来第一次，问题不在于获取信息；信息都在你的浏览器上，而在于找到可靠的信息来源，这些信息是可靠的、清晰的，并且与你的情况相关。这很难，而且往往需要技巧。<p>首先，请问，谁会知道如何获得这样的信息？<p>图书馆员可能有正规的教育，可以通过寻找信息的过程。这意味着你可以从他们那里学到很多东西。与图书馆员交谈，或找到一个在线图书馆，并阅读他们的指导方针和流程。如果这不能让你通过寻找信息的过程，它至少会把你扔到有这方面的应用知识的一般社区，你可以开始导航到二级来源。<p>第二，问，谁以前经历过这个？<p>没有人以前经历过你所经历的事情是极其不可能的。如果你是一个初创企业的创始人，并且对如何首次筹集资金感到困惑，那么请弄清楚谁曾经经历过这个过程？ 可能是其他更大组织的创始人。与他们交谈/给他们发邮件，弄清楚他们是怎么做的。在他们寻求了解更多相关信息的过程中，有哪些有用的资源？<p>第三，你如何判断信息是否可靠？从统计学上看，垃圾可能比非垃圾更多。你如何找出哪些是可靠的信息，哪些是不可靠的信息？<p>我还不确定。但我发现，去找最专业的可能来源，并弄清楚他们知道什么，这很有帮助。这将给你一个基线，让你开始评估哪些是废话，哪些不是。应用知识就是信息，围绕一个主题的大多数社区通常会重复前10%的人说的话和创造的东西，不管它是否过时或最近是否经过测试。你需要找到那10%，并弄清楚他们知道什么。<p>例如，大多数风险投资公司重复领先的风险投资公司的做法。领先的风险投资公司，如a16z、Sequoia或YC，会深入到物理学中，自己调查论点。然后他们发表结果，这些结果往往被低级别的风险投资人所消费，他们往往太懒或没有经验来进行自己的思考过程，并会把这些结果当作事实。\n这在学术界的作用较小，因为在学术界，默认的说法是问题。在工业界，10%的人通常会创造文献并制定标准。<p>第四，教科书。<p>教科书是一个很好的方式来弄清楚当前的共识和社区内正在发生的文献。它们被设计为学习者用来寻找信息的参考点。 \n主要作者/机构的博客。",
  "description_zh-Hant": "嘿，大家好，所以我經常從有聲讀物、博客、播客等處抄錄我喜歡的部分，並保存起來備用。兩年前，我在沒有參考資料的情況下保存了這段摘錄，現在我正試圖找到它的出處。它提到了硅谷領先的風險投資公司，所以肯定是2005年以上。<p>_______________<p>也許我受到了影響，因為我成長在一個前所未有的歷史時期，通過點擊一個按鈕就能獲得整個人類的知識。這有一些關鍵的影響。\n第一，如果你失敗了，除了你自己，很難責怪任何人。這是因為，除非你正在研究真正獨特的東西，這是不可能的，否則有人曾經研究過，你可以向那個人學習。誠然，獨特的情況可能是你所特有的，但一般來說，我們在生活中處理的大多數情況都是某種形式的變化，不是完全相同的，是別人以前處理過的東西。歷史上大部分時間的主要問題是獲取必要的信息以獲得知識（我們可以認為知識是應用信息，類似於工程是應用科學）。有史以來第一次，問題不在於獲取信息；信息都在你的瀏覽器上，而在於找到可靠的信息來源，這些信息是可靠的、清晰的，並且與你的情況相關。這很難，而且往往需要技巧。<p>首先，請問，誰會知道如何獲得這樣的信息？<p>圖書館員可能有正規的教育，可以通過尋找信息的過程。這意味著你可以從他們那裡學到很多東西。與圖書館員交談，或找到一個在線圖書館，並閱讀他們的指導方針和流程。如果這不能讓你通過尋找信息的過程，它至少會把你扔到有這方面的應用知識的一般社區，你可以開始導航到二級來源。<p>第二，問，誰以前經歷過這個？<p>沒有人以前經歷過你所經歷的事情是極其不可能的。如果你是一個初創企業的創始人，並且對如何首次籌集資金感到困惑，那麼請弄清楚誰曾經經歷過這個過程？ 可能是其他更大組織的創始人。與他們交談/給他們發郵件，弄清楚他們是怎麼做的。在他們尋求瞭解更多相關信息的過程中，有哪些有用的資源？<p>第三，你如何判斷信息是否可靠？從統計學上看，垃圾可能比非垃圾更多。你如何找出哪些是可靠的信息，哪些是不可靠的信息？<p>我還不確定。但我發現，去找最專業的可能來源，並弄清楚他們知道什麼，這很有幫助。這將給你一個基線，讓你開始評估哪些是廢話，哪些不是。應用知識就是信息，圍繞一個主題的大多數社區通常會重複前10%的人說的話和創造的東西，不管它是否過時或最近是否經過測試。你需要找到那10%，並弄清楚他們知道什麼。<p>例如，大多數風險投資公司重複領先的風險投資公司的做法。領先的風險投資公司，如a16z、Sequoia或YC，會深入到物理學中，自己調查論點。然後他們發表結果，這些結果往往被低級別的風險投資人所消費，他們往往太懶或沒有經驗來進行自己的思考過程，並會把這些結果當作事實。\n這在學術界的作用較小，因為在學術界，默認的說法是問題。在工業界，10%的人通常會創造文獻並制定標準。<p>第四，教科書。<p>教科書是一個很好的方式來弄清楚當前的共識和社區內正在發生的文獻。它們被設計為學習者用來尋找信息的參考點。 \n主要作者/機構的博客。"
}