{
  "@type": "NewsArticle",
  "identifier": "2022--03--08--en--myfeed--HackerNews--NewsArticle--30597111",
  "url": "https://news.ycombinator.com/item?id=30597111",
  "headline": "CRIO – Software Engineer/ML Engineer – Remote – Freelance Project – $1k-2.5k",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We are developing a system to help designers visualize their digital works in different arrangements and/or patterns to quickly brainstorm other ideas. Our system is based on existing research papers, where the author has done a great job explaining the principles behind their work.<p>The system breaks down graphical design principles into mathematical formulas, which are used to evaluate the designs' energy function. Using the Nonlinear Inverse Optimization algorithm, the parameters for the energy function for the designs are optimized to find its optimized version. This optimized function can model other designs that can be used to brainstorm other arrangements.<p>We have already developed the system to extract the parameters needed from a design and the functions required to evaluate those parameters to create the energy function for the design.\nWe need to optimize this system and develop the more interesting aspect of the system, i.e., optimizing the energy functions of these designs.<p>REQUIREMENTS\n- 2 or more years of experience developing libraries and/or platform for enterprise products.\nExtensive knowledge of machine learning concepts like energy-based models, parallel tempering, Markov Chain Monte Carlo, etc.\n- Good understanding of mathematical concepts like sigmoid functions, differential equations, etc.\n- Currently, the system is developed in python, however, the developer can develop the system in any other language as well.\n- Great communication and collaboration skills.<p>Contact at contact@crio.digital",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "akki_1821",
    "url": "https://news.ycombinator.com/user?id=akki_1821"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30597111",
  "sameAs": "https://news.ycombinator.com/item?id=30597111",
  "dateCreated": "2022-03-08T06:54:18.454Z",
  "datePublished": "2022-03-08T06:43:41.000Z",
  "dateModified": "2022-03-08T06:54:18.454Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "CRIO - 软件工程师/ML工程师 - 远程 - 自由职业者项目 - $1k-2.5k",
  "headline_zh-Hant": "CRIO - 軟件工程師/ML工程師 - 遠程 - 自由職業者項目 - $1k-2.5k",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们正在开发一个系统，帮助设计师将他们的数字作品以不同的排列方式和/或模式进行可视化，以快速激发其他想法。我们的系统是基于现有的研究论文，作者对其作品背后的原理做了很好的解释。<p>该系统将图形设计原理分解为数学公式，用于评估设计的能量函数。使用非线性逆向优化算法，对设计的能量函数的参数进行优化，以找到其优化版本。这个优化的函数可以对其他设计进行建模，这些设计可以用来对其他安排进行头脑风暴。<p>我们已经开发了一个系统，从一个设计中提取所需的参数，以及评估这些参数所需的函数，以创建设计的能量函数。\n我们需要优化这个系统，并开发这个系统中更有趣的方面，即优化这些设计的能量函数。<p>要求\n- 有2年或以上开发企业产品库和/或平台的经验。\n对机器学习概念有广泛的了解，如基于能量的模型、平行调和、马尔科夫链蒙特卡洛等。\n- 对数学概念有很好的理解，如sigmoid函数、微分方程等。\n- 目前，该系统是用python开发的，但是，开发人员也可以用任何其他语言开发该系统。\n- 良好的沟通和协作能力。<p>联系地址：contact@crio.digital",
  "description_zh-Hant": "我們正在開發一個系統，幫助設計師將他們的數字作品以不同的排列方式和/或模式進行可視化，以快速激發其他想法。我們的系統是基於現有的研究論文，作者對其作品背後的原理做了很好的解釋。<p>該系統將圖形設計原理分解為數學公式，用於評估設計的能量函數。使用非線性逆向優化算法，對設計的能量函數的參數進行優化，以找到其優化版本。這個優化的函數可以對其他設計進行建模，這些設計可以用來對其他安排進行頭腦風暴。<p>我們已經開發了一個系統，從一個設計中提取所需的參數，以及評估這些參數所需的函數，以創建設計的能量函數。\n我們需要優化這個系統，並開發這個系統中更有趣的方面，即優化這些設計的能量函數。<p>要求\n- 有2年或以上開發企業產品庫和/或平臺的經驗。\n對機器學習概念有廣泛的瞭解，如基於能量的模型、平行調和、馬爾科夫鏈蒙特卡洛等。\n- 對數學概念有很好的理解，如sigmoid函數、微分方程等。\n- 目前，該系統是用python開發的，但是，開發人員也可以用任何其他語言開發該系統。\n- 良好的溝通和協作能力。<p>聯繫地址：contact@crio.digital"
}