{
  "@type": "NewsArticle",
  "identifier": "2022--03--03--en--myfeed--HackerNews--NewsArticle--30542063",
  "url": "https://news.ycombinator.com/item?id=30542063",
  "headline": "Alexey Guzey: Russian border shuts down in",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I got this email from him. Ordinarily I wouldn't post this here, but maybe someone will see it and take action.<p>Subject: 4 independent sources I have say that the Russian border shuts down in &lt;48, probably less than 24 hours. If you are in Russia and you can leave, leave now.\nDate: 2022-03-02 9:09 UTC<p>Kamil Galeev was the first source 2 days ago, confirmed by 3 more (private) sources since then. Kamil:<p>Для россиян - очень скоро выезд перекроют. Сначала для мужчин сколько-нибудь призывных возрастов, потом для всех<p>Рассмотрите возможность вотпрямщас выехать в любую открытую страну (кроме Беларуси). Грузия, Армения, Азербайджан, Казахстан, Монголия и далее по списку. Сейчас такая возможность еще есть, но ее перекроют быстро и без предупреждения<p>Если вы хотите или считаете своим долгом оставаться в РФ, это ваш выбор. Но если жить в этом вы не желаете, валить надо немедленно, лучше сегодня<p>Положение РФ гораздо хуже чем в Холодную войну. Полный ад может наступить внезапно и без предупреждения. Что касается экономического коллапса, так он гарантирован. На это могу поставить достаточно уверенно, потому что паровой каток санкций уже поехал. Западные госаппараты более механистичны, а потому большей степени подвержены институциональной инерции чем российский. Их трудно сдвинуть с места, но как сдвинули, так они едут-едут-едут и так еще очень долго. Потому что их не только запустить, но и остановить трудно, не существует человека который мог бы отдать такой приказ<p>Если хотите уехать, уезжайте немедленно, чем быстрее тем лучше, в любую открытую страну кроме Беларуси. Долго прицениваться какая лучше смысла нет, главное пересечь границу, а там видно будет. Казахстан и прочие вряд ли будут перекрывать выезд, а РФ будет. Если пока не определились куда и что делать дальше можно в Стамбул - это крупнейший хаб и оттуда летают почти во все страны<p>Как пересечете можно думать над дальнейшими действиями. Они понятно зависят от ваших финансов, умений, нетворка и множества сопутствующих обстоятельств<p>Это рекомендация которую я могу дать всем кто думает об отъезде. Что касается более конкретных соображений, я пока не готов выкладывать их в открытый доступ (подписчики могут посмотреть здесь (https://www.patreon.com/posts/63248958)). Но в отличие от всех остальных запейволенных текстов, этот я открою как только сочту возможным<p>Для тех кто хочет уехать но не знает ситуацию на местах - вот список русскоязычных телеграм чатов по 105 странам мира. Можно почитать и если что непонятно уточнить детали у тех кто уже там https://telegra.ph/chat360-10-14",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "telotortium",
    "url": "https://news.ycombinator.com/user?id=telotortium"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30542063",
  "sameAs": "https://news.ycombinator.com/item?id=30542063",
  "dateCreated": "2022-03-03T15:32:29.265Z",
  "datePublished": "2022-03-03T15:14:06.000Z",
  "dateModified": "2022-03-03T15:32:29.265Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "阿列克谢-古泽。俄罗斯边境关闭了在",
  "headline_zh-Hant": "阿列克謝-古澤。俄羅斯邊境關閉了在",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我收到他的这封电子邮件。通常情况下，我不会把这个贴在这里，但也许有人会看到并采取行动。<p>主题：我的4个独立消息来源说，俄罗斯边境在&lt;48，可能不到24小时就关闭了。如果你在俄罗斯，你可以离开，现在就离开。\n日期：2022-03-02 9:09 UTC<p>Kamil Galeev是2天前的第一个消息来源，此后又有3个（私人）消息来源证实。卡米尔：<p>俄罗斯人很快就会被封锁起来。首先是征兵年龄的男子，然后是所有人<p>请考虑离开去任何开放的国家（白俄罗斯除外）。格鲁吉亚、亚美尼亚、阿塞拜疆、哈萨克斯坦、蒙古和更远的地方。现在仍然是一个选择，但它会在没有警告的情况下迅速关闭。 如果你想，或认为留在俄罗斯是你的责任，这是你的选择。但如果你不想生活在其中，请立即离开，今天更好<p>俄罗斯的情况比冷战时期糟糕得多。所有的地狱都可能突然爆发，没有任何警告。至于经济崩溃，它是有保证的。我可以自信地打赌，因为制裁的蒸汽机已经在路上了。西方的国家机构更加机械化，因此比俄罗斯的国家机构更容易受到机构惰性的影响。它们很难被移动，但一旦被移动，它们就会一直持续下去，持续很长时间。因为他们不仅会跑，而且很难阻止，没有人会下这样的命令<p>如果你想离开，请立即离开，越快越好，去白俄罗斯以外的任何开放国家。找了很久也没有意义，最主要的是越过边界，然后你就会看到。哈萨克斯坦和其他国家不太可能阻止你的退出，而俄罗斯联邦会。如果你还没有决定去哪里，接下来做什么，你可以去伊斯坦布尔，那里是最大的枢纽，人们从那里飞往几乎所有的国家<p>当你穿过它时，你可以考虑进一步的行动。显然，这取决于你的财务状况、技能、网络和许多其他因素<p>这是我可以给任何正在考虑离开的人的建议。至于更具体的考虑，我还不准备公开发布（用户可以在这里看（https://www.patreon.com/posts/63248958））。但与所有其他帖子不同的是，一旦我认为有可能，我就会打开这个帖子<p>对于那些想离开但不了解当地情况的人来说--这里有一份105个国家的俄语Telegram聊天列表。你可以阅读它，如果有不清楚的地方，可以向已经在那里的人询问细节 https://telegra.ph/chat360-10-14",
  "description_zh-Hant": "我收到他的這封電子郵件。通常情況下，我不會把這個貼在這裡，但也許有人會看到並採取行動。<p>主題：我的4個獨立消息來源說，俄羅斯邊境在&lt;48，可能不到24小時就關閉了。如果你在俄羅斯，你可以離開，現在就離開。\n日期：2022-03-02 9:09 UTC<p>Kamil Galeev是2天前的第一個消息來源，此後又有3個（私人）消息來源證實。卡米爾：<p>俄羅斯人很快就會被封鎖起來。首先是徵兵年齡的男子，然後是所有人<p>請考慮離開去任何開放的國家（白俄羅斯除外）。格魯吉亞、亞美尼亞、阿塞拜疆、哈薩克斯坦、蒙古和更遠的地方。現在仍然是一個選擇，但它會在沒有警告的情況下迅速關閉。 如果你想，或認為留在俄羅斯是你的責任，這是你的選擇。但如果你不想生活在其中，請立即離開，今天更好<p>俄羅斯的情況比冷戰時期糟糕得多。所有的地獄都可能突然爆發，沒有任何警告。至於經濟崩潰，它是有保證的。我可以自信地打賭，因為制裁的蒸汽機已經在路上了。西方的國家機構更加機械化，因此比俄羅斯的國家機構更容易受到機構惰性的影響。它們很難被移動，但一旦被移動，它們就會一直持續下去，持續很長時間。因為他們不僅會跑，而且很難阻止，沒有人會下這樣的命令<p>如果你想離開，請立即離開，越快越好，去白俄羅斯以外的任何開放國家。找了很久也沒有意義，最主要的是越過邊界，然後你就會看到。哈薩克斯坦和其他國家不太可能阻止你的退出，而俄羅斯聯邦會。如果你還沒有決定去哪裡，接下來做什麼，你可以去伊斯坦布爾，那裡是最大的樞紐，人們從那裡飛往幾乎所有的國家<p>當你穿過它時，你可以考慮進一步的行動。顯然，這取決於你的財務狀況、技能、網絡和許多其他因素<p>這是我可以給任何正在考慮離開的人的建議。至於更具體的考慮，我還不準備公開發布（用戶可以在這裡看（https://www.patreon.com/posts/63248958））。但與所有其他帖子不同的是，一旦我認為有可能，我就會打開這個帖子<p>對於那些想離開但不瞭解當地情況的人來說--這裡有一份105個國家的俄語Telegram聊天列表。你可以閱讀它，如果有不清楚的地方，可以向已經在那裡的人詢問細節 https://telegra.ph/chat360-10-14"
}