{
  "@type": "NewsArticle",
  "identifier": "2022--03--01--en--myfeed--HackerNews--NewsArticle--30517088",
  "url": "https://news.ycombinator.com/item?id=30517088",
  "headline": "Show HN: Common Paper",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, Jake here, co-founder and CEO of Common Paper. https://commonpaper.com/ We’re excited to share a new approach to legal contracts.<p>Our vision is to turn contracts into APIs. https://commonpaper.com/blog/contracts-should-be-apis/  We’ve been working with contracts for our whole careers, previously at Stitch (acquired by Talend) and RJMetrics (acquired by Magento, then Adobe).<p>Before starting Common Paper, we interviewed more than 100 founders, lawyers, salespeople, and more from companies ranging from startups to Fortune 500 companies. We learned a lot about their frustrations with the slow, contentious status quo of contracting and what’s preventing things from being improved.<p>The root cause of the problem is that contracts are unstructured and inconsistent. There are an infinite number of legally valid ways to draft each term in any given contract, and things get even more complicated once people start negotiating. Microsoft Word documents with tracked changes get emailed back and forth, and it creates a big mess of unstructured data. All of this means that it’s really hard for people to actually understand what’s in all of their contracts, and it’s impossible to automate the process of following through on their obligations.<p>- An API for contracts changes all of that, and we have built several exciting elements in service of that vision (with a lot more to come):<p>- Open source, standard contracts: The first two are a Mutual NDA and Cloud Service Agreement (for selling software and cloud services). They are released under a Creative Commons CC BY 4.0 license, so they are free to download and use for any purpose. https://commonpaper.com/standards/<p>- Committee of attorneys that collaborated on the drafting of the contracts. They have experience in big law firms, in small boutique specialist firms, and as in-house at tech companies. The committee ensures that the standard contracts reflect market norms and industry best practices. https://commonpaper.com/committee<p>Software for managing and automating the contracts. Our structured contract platform is built from the ground up for standard contracts, and it enables direct access to the data inside them. That means negotiation, closing, and knowing what’s in your contracts is faster and easier than ever before. https://commonpaper.com/product/<p>We'd love your feedback. https://commonpaper.com/",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "jakestein",
    "url": "https://news.ycombinator.com/user?id=jakestein"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30517088",
  "sameAs": "https://news.ycombinator.com/item?id=30517088",
  "dateCreated": "2022-03-01T17:38:19.579Z",
  "datePublished": "2022-03-01T17:32:08.000Z",
  "dateModified": "2022-03-01T17:38:19.579Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 9
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Show HN: 普通纸张",
  "headline_zh-Hant": "Show HN: 普通紙張",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，我是Jake，Common Paper的联合创始人兼首席执行官。https://commonpaper.com/，我们很高兴与大家分享法律合同的新方法。<p>我们的愿景是将合同变成API。https://commonpaper.com/blog/contracts-should-be-apis/，我们的整个职业生涯都在与合同打交道，之前在Stitch（被Talend收购）和RJMetrics（被Magento收购，然后是Adobe）。<p>在创办Common Paper之前，我们采访了100多名创始人、律师、销售人员等，这些公司从初创公司到财富500强公司不等。我们了解到他们对缓慢的、有争议的合同现状的很多不满，以及阻碍事情改善的原因。<p>问题的根源在于合同是无序的、不一致的。在任何给定的合同中，有无数种法律上有效的方式来起草每个条款，一旦人们开始谈判，事情就变得更加复杂。带有跟踪修改的微软Word文档通过电子邮件来回发送，这就造成了非结构化数据的大混乱。所有这些意味着人们很难真正理解他们所有合同中的内容，也不可能将履行义务的过程自动化。<p>- 合同的API改变了这一切，我们已经建立了几个令人兴奋的元素来服务于这一愿景（还有更多的元素即将到来）：<p>- 开源、标准合同。前两个是相互的NDA和云服务协议（用于销售软件和云服务）。它们是在知识共享CC BY 4.0许可下发布的，所以它们可以免费下载并用于任何目的。https://commonpaper.com/standards/<p>- 合作起草合同的律师委员会。他们有在大型律师事务所、小型精品专业公司的经验，也有在科技公司内部任职的经验。该委员会确保标准合同反映市场规范和行业最佳实践。https://commonpaper.com/committee<p>用于管理和自动化合同的软件。我们的结构化合同平台是为标准合同而建立的，它可以直接访问合同内的数据。这意味着谈判、成交和了解合同中的内容比以前更快、更容易。https://commonpaper.com/product/<p>我们希望得到您的反馈。https://commonpaper.com/",
  "description_zh-Hant": "嗨，HN，我是Jake，Common Paper的聯合創始人兼首席執行官。https://commonpaper.com/，我們很高興與大家分享法律合同的新方法。<p>我們的願景是將合同變成API。https://commonpaper.com/blog/contracts-should-be-apis/，我們的整個職業生涯都在與合同打交道，之前在Stitch（被Talend收購）和RJMetrics（被Magento收購，然後是Adobe）。<p>在創辦Common Paper之前，我們採訪了100多名創始人、律師、銷售人員等，這些公司從初創公司到財富500強公司不等。我們瞭解到他們對緩慢的、有爭議的合同現狀的很多不滿，以及阻礙事情改善的原因。<p>問題的根源在於合同是無序的、不一致的。在任何給定的合同中，有無數種法律上有效的方式來起草每個條款，一旦人們開始談判，事情就變得更加複雜。帶有跟蹤修改的微軟Word文檔通過電子郵件來回發送，這就造成了非結構化數據的大混亂。所有這些意味著人們很難真正理解他們所有合同中的內容，也不可能將履行義務的過程自動化。<p>- 合同的API改變了這一切，我們已經建立了幾個令人興奮的元素來服務於這一願景（還有更多的元素即將到來）：<p>- 開源、標準合同。前兩個是相互的NDA和雲服務協議（用於銷售軟件和雲服務）。它們是在知識共享CC BY 4.0許可下發布的，所以它們可以免費下載並用於任何目的。https://commonpaper.com/standards/<p>- 合作起草合同的律師委員會。他們有在大型律師事務所、小型精品專業公司的經驗，也有在科技公司內部任職的經驗。該委員會確保標準合同反映市場規範和行業最佳實踐。https://commonpaper.com/committee<p>用於管理和自動化合同的軟件。我們的結構化合同平臺是為標準合同而建立的，它可以直接訪問合同內的數據。這意味著談判、成交和了解合同中的內容比以前更快、更容易。https://commonpaper.com/product/<p>我們希望得到您的反饋。https://commonpaper.com/"
}