{
  "@type": "NewsArticle",
  "identifier": "2022--04--22--en--myfeed--HackerNews--NewsArticle--31118132",
  "url": "https://news.ycombinator.com/item?id=31118132",
  "headline": "Tell HN: I'm an Imposter",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "First off, I'm no hacker, in any sense of the word. I work a warehouse job at a university bookstore and pack boxes all day. And I literally can't code anything, period. At home, my &quot;tech set up&quot; is a $250 Chromebook, a $30 Bluetooth speaker, and an old budget Android phone. But maybe we can look past the tech stuff.<p>Perhaps more relevant (and more problematic), is that I can't actually keep up with most of the discussions on here. 99% of the links on HN, I have no idea what it's talking about. And of the comments posted, I can maybe make sense of only a fraction, and I certainly don't understand enough to participate in any meaningful way.<p>Heck, I don't even browse the web anymore. Which means I have no links to submit, either.<p>So what am I left with? Asking a crapload of generic Ask-HNs. <i>One to two a day</i> for the past month, in fact.<p>So, <i>why am I here</i>?<p>Because in real life, I'm surrounded by people who are boring and uncritical. And even if the individuals themselves are not, the social norm certainly is (in my world, at least).<p>It's easy to go along to get along with everyone: I can be one of the <i>friendliest</i> people! While having <i>no friends</i>.<p>I'm admittedly not a &quot;naturally smart/intelligent&quot; person (trust me on this one), but I <i>am</i> a very curious soul, and I love to learn, love to think.<p>But the more I embrace my intellectual self, the more <i>disconnected</i> I feel from the rest of the world. The more my mind grows, the more it <i>dies</i> from loneliness.<p>So why am I here, posting all these Ask HNs? Obviously, to surround myself with like-minds (or more accurately, smarter minds), to fill the void that was becoming increasingly unbearable.<p>And I'm <i>so glad</i> I'm here. I've never felt this happy, this <i>alive</i>. To be seen, to be taken seriously. But in the back of my mind, I know I'm overly excited, maybe even <i>obsessed</i>. All the while realizing that I'm most likely making a fool out of myself, my naive, childish, attention-seeking self.<p>Do I belong here? Am I welcomed here? Maybe I can ask <i>that</i> on Ask HN? And what, die of embarrassment? Or, more likely, I'll just get pity points and sympathy reassurance. But how will I know what you all <i>really</i> think?<p>...<p>I think it's time for a break. Most likely won't be posting any more Ask HNs for a while. But I'll probably still poke around and lurk a bit. And I'm definitely still open to emails and hanging out on Discord. Feel free to reach out as usual.<p>Thank you all so so much for having me. Thank you for all your advice and wisdom. Thank you for being honest and constructive. Thank you for the generosity and support. It's been a blast. :))<p>Much love,\nSam",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31118132",
  "sameAs": "https://news.ycombinator.com/item?id=31118132",
  "dateCreated": "2022-04-22T05:03:48.153Z",
  "datePublished": "2022-04-22T04:15:04.000Z",
  "dateModified": "2022-04-22T05:03:48.153Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "告诉HN：我是个冒牌货",
  "headline_zh-Hant": "告訴HN：我是個冒牌貨",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "首先，我不是黑客，在任何意义上都不是。我在一所大学的书店做仓库工作，整天收拾箱子。而且我根本就不会编写任何代码，就这么简单。在家里，我的技术装备是一台价值250美元的Chromebook，一个30美元的蓝牙音箱，以及一部旧的预算安卓手机。<p>也许更相关（也更有问题）的是，我实际上无法跟上这里的大多数讨论。HN上99%的链接，我都不知道它在说什么。而在发布的评论中，我也许只能理解其中的一小部分，而且我肯定没有理解到足以参与任何有意义的方式。<p>该死，我甚至不再浏览网络。Which means I have no links to submit, either.<p>So what am I left with? Asking a crapload of generic Ask-HNs. <i>One to two a day</i> for the past month, in fact.<p>So, <i>why am I here</i>?<p>Because in real life, I'm surrounded by people who are boring and uncritical. And even if the individuals themselves are not, the social norm certainly is (in my world, at least).<p>It's easy to go along to get along with everyone: I can be one of the <i>friendliest</i> people! While having <i>no friends</i>.<p>I'm admittedly not a &quot;naturally smart/intelligent&quot; person (trust me on this one), but I <i>am</i> a very curious soul, and I love to learn, love to think.<p>But the more I embrace my intellectual self, the more <i>disconnected</i> I feel from the rest of the world. 我的思想越是成长，它就越是因孤独而死亡。<p>那么，我为什么在这里，发布所有这些 \"问 \"的HN？Obviously, to surround myself with like-minds (or more accurately, smarter minds), to fill the void that was becoming increasingly unbearable.<p>And I'm <i>so glad</i> I'm here. 我从来没有感到如此快乐，如此<i>活泼</i>。To be seen, to be taken seriously. But in the back of my mind, I know I'm overly excited, maybe even <i>obsessed</i>. All the while realizing that I'm most likely making a fool out of myself, my naive, childish, attention-seeking self.<p>Do I belong here? Am I welcomed here? Maybe I can ask <i>that</i> on Ask HN? 然后呢，尴尬地死去吗？或者，更有可能的是，我只会得到可怜的分数和同情的保证。但我怎么知道你们的真实想法呢？<p>...<p>我想是时候休息了。最有可能的是，我将在一段时间内不再发布任何 \"询问HN \"的帖子。但是，我可能仍然会四处打探和潜伏一下。我肯定仍然愿意接受电子邮件和在 Discord 上闲逛。请像往常一样联系我。<p>非常感谢你们邀请我。谢谢你们所有的建议和智慧。谢谢你们的诚实和建设性。谢谢你们的慷慨和支持。这是个很好的机会。:))<p>非常感谢。\n萨姆",
  "description_zh-Hant": "首先，我不是黑客，在任何意義上都不是。我在一所大學的書店做倉庫工作，整天收拾箱子。而且我根本就不會編寫任何代碼，就這麼簡單。在家裡，我的技術裝備是一臺價值250美元的Chromebook，一個30美元的藍牙音箱，以及一部舊的預算安卓手機。<p>也許更相關（也更有問題）的是，我實際上無法跟上這裡的大多數討論。HN上99%的鏈接，我都不知道它在說什麼。而在發佈的評論中，我也許只能理解其中的一小部分，而且我肯定沒有理解到足以參與任何有意義的方式。<p>該死，我甚至不再瀏覽網絡。Which means I have no links to submit, either.<p>So what am I left with? Asking a crapload of generic Ask-HNs. <i>One to two a day</i> for the past month, in fact.<p>So, <i>why am I here</i>?<p>Because in real life, I'm surrounded by people who are boring and uncritical. And even if the individuals themselves are not, the social norm certainly is (in my world, at least).<p>It's easy to go along to get along with everyone: I can be one of the <i>friendliest</i> people! While having <i>no friends</i>.<p>I'm admittedly not a &quot;naturally smart/intelligent&quot; person (trust me on this one), but I <i>am</i> a very curious soul, and I love to learn, love to think.<p>But the more I embrace my intellectual self, the more <i>disconnected</i> I feel from the rest of the world. 我的思想越是成長，它就越是因孤獨而死亡。<p>那麼，我為什麼在這裡，發佈所有這些 \"問 \"的HN？Obviously, to surround myself with like-minds (or more accurately, smarter minds), to fill the void that was becoming increasingly unbearable.<p>And I'm <i>so glad</i> I'm here. 我從來沒有感到如此快樂，如此<i>活潑</i>。To be seen, to be taken seriously. But in the back of my mind, I know I'm overly excited, maybe even <i>obsessed</i>. All the while realizing that I'm most likely making a fool out of myself, my naive, childish, attention-seeking self.<p>Do I belong here? Am I welcomed here? Maybe I can ask <i>that</i> on Ask HN? 然後呢，尷尬地死去嗎？或者，更有可能的是，我只會得到可憐的分數和同情的保證。但我怎麼知道你們的真實想法呢？<p>...<p>我想是時候休息了。最有可能的是，我將在一段時間內不再發布任何 \"詢問HN \"的帖子。但是，我可能仍然會四處打探和潛伏一下。我肯定仍然願意接受電子郵件和在 Discord 上閒逛。請像往常一樣聯繫我。<p>非常感謝你們邀請我。謝謝你們所有的建議和智慧。謝謝你們的誠實和建設性。謝謝你們的慷慨和支持。這是個很好的機會。:))<p>非常感謝。\n薩姆"
}