{
  "@type": "NewsArticle",
  "identifier": "2022--07--05--en--myfeed--HackerNews--NewsArticle--31990626",
  "url": "https://news.ycombinator.com/item?id=31990626",
  "headline": "Try Before You Buy – Not ready for prime time",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "An example of how to do things wrong when starting a new service.<p>I ordered a pair of shoes that did not fit. So I go to the amazon page and start the return process. Do I want to return or exchange? Exchange. But wait, the new size cost ~$15 more than the others. Choose return. Go search for other shoes. Wait, the same shoes in the new size are now the same price as the other ones. Eh?<p>Lesson #1. Do NOT choose exchange.<p>I package the shoes up and put them in a UPS drop box. A week later the shoes have not been picked up. Call Amazon support (good luck with that). I explain the situation for 5 minutes and they tell me I need to talk to the Try-Before-You-Buy team. TBYB team says not to worry.<p>Four days later I call Amazon support (good luck with that). I explain the situation for 5 minutes and they tell me I need to talk to the Try-Before-You-Buy team. TBYB team says I need to talk to UPS and file a claim.<p>I call UPS support (good luck with that) and they tell me I cannot file a claim since I am not the shipper, it is Amazon. ha ha ha.<p>I call Amazon (good luck with that) they say they will cancel the charge even though it is the fault of UPS and cancel the charge on the second pair of shoes that I have not yet returned.<p>Lesson #2. Support with Try-Before-You-Buy is dysfunctional. Good luck with that.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "talkingtab",
    "url": "https://news.ycombinator.com/user?id=talkingtab"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31990626",
  "sameAs": "https://news.ycombinator.com/item?id=31990626",
  "dateCreated": "2022-07-05T17:13:53.846Z",
  "datePublished": "2022-07-05T16:50:58.000Z",
  "dateModified": "2022-07-05T17:13:53.846Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "先试后买--尚未准备好进入黄金时段\n",
  "headline_zh-Hant": "先試後買--尚未準備好進入黃金時段\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "一个关于在开始新服务时如何做错事情的例子。<p>我订了一双鞋，但不合适。所以我去了亚马逊页面，开始了退货程序。我是要退货还是换货？换货。但是等等，新的尺寸比其他尺寸多花了~15美元。选择退货。去搜索其他鞋子。等等，新尺寸的相同鞋子现在和其他鞋子的价格相同。诶？<p>教训#1。<p>我把鞋子包装好，放在UPS快递箱里。一个星期后，鞋子还没有被取走。我打电话给亚马逊支持（祝你好运）。我解释了5分钟，他们告诉我，我需要和 \"先试后买 \"团队谈谈。TBYB团队说不用担心。<p>四天后，我打电话给亚马逊支持（祝你好运）。我解释了5分钟的情况，他们告诉我，我需要和 \"先试后买 \"团队谈谈。<p>我打电话给UPS支持（祝你好运），他们告诉我不能提出索赔，因为我不是托运人，是亚马逊。<p>我打电话给亚马逊（祝你好运），他们说他们将取消收费，尽管这是UPS的错，并取消我尚未退回的第二双鞋的收费。先试后买的支持是失灵的。祝你好运。\n",
  "description_zh-Hant": "一個關於在開始新服務時如何做錯事情的例子。<p>我訂了一雙鞋，但不合適。所以我去了亞馬遜頁面，開始了退貨程序。我是要退貨還是換貨？換貨。但是等等，新的尺寸比其他尺寸多花了~15美元。選擇退貨。去搜索其他鞋子。等等，新尺寸的相同鞋子現在和其他鞋子的價格相同。誒？<p>教訓#1。<p>我把鞋子包裝好，放在UPS快遞箱裡。一個星期後，鞋子還沒有被取走。我打電話給亞馬遜支持（祝你好運）。我解釋了5分鐘，他們告訴我，我需要和 \"先試後買 \"團隊談談。TBYB團隊說不用擔心。<p>四天後，我打電話給亞馬遜支持（祝你好運）。我解釋了5分鐘的情況，他們告訴我，我需要和 \"先試後買 \"團隊談談。<p>我打電話給UPS支持（祝你好運），他們告訴我不能提出索賠，因為我不是託運人，是亞馬遜。<p>我打電話給亞馬遜（祝你好運），他們說他們將取消收費，儘管這是UPS的錯，並取消我尚未退回的第二雙鞋的收費。先試後買的支持是失靈的。祝你好運。\n"
}