{
  "@type": "NewsArticle",
  "identifier": "2022--07--21--en--myfeed--HackerNews--NewsArticle--32185736",
  "url": "https://news.ycombinator.com/item?id=32185736",
  "headline": "Tell HN: Slack revealed email addresses of users to others in same workspace",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I just got this email from Slack:<p>&quot;Hello,<p>We are writing to inform you of an issue we recently discovered. A number of members of your workspace were inadvertently included on the same email. This means that you're able to see each other's email addresses in the “To” line. You are receiving this notice because you were sent this email on July 19 or July 20, 2022.<p>What happened and when?\nSlack emailed members of your workspace about the upcoming changes to Slack’s free plan with the subject line “New features coming to your Slack workspace.” Instead of sending each workspace member individual emails as intended, the email recipients on your team were visible in the same email message.<p>Slack identified this problem and immediately took steps to stop additional emails from being sent in this way. We're also reaching out to inform all users who received the email. All of the content of the email is still accurate for your team.<p>How was I impacted?\nSince you received one of these emails, this means that other people on your workspace who received the email may have inadvertently seen your email address.<p>What should I do?\nWe ask that you delete and not share, store, print, or in any way retain the original email with email addresses. If you have additional questions about this, you can reply to this email, or reach out to us at feedback@slack.com.<p>We know that the security and privacy of your data is important. We are very sorry for the inconvenience and concern this issue may have caused.<p>Sincerely,\nThe team at Slack&quot;<p>Guess they'll be dealing with some class action lawsuit soon.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "altdataseller",
    "url": "https://news.ycombinator.com/user?id=altdataseller"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32185736",
  "sameAs": "https://news.ycombinator.com/item?id=32185736",
  "dateCreated": "2022-07-21T22:27:48.423Z",
  "datePublished": "2022-07-21T21:59:17.000Z",
  "dateModified": "2022-07-21T22:27:48.423Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "告诉HN：Slack将用户的电子邮件地址透露给同一工作区的其他人\n",
  "headline_zh-Hant": "告訴HN：Slack將用戶的電子郵件地址透露給同一工作區的其他人\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我刚刚收到Slack的这封邮件：<p>&quot;你好，<p>我们写信通知你我们最近发现的一个问题。你的工作区的一些成员无意中被包括在同一封邮件中。这意味着你们能够在 \"收件人 \"一行看到对方的电子邮件地址。你收到这个通知是因为你在2022年7月19日或7月20日被发送了这封电子邮件。<p>发生了什么，什么时候发生的？\nSlack向您的工作区成员发送了关于Slack免费计划即将发生的变化的电子邮件，其主题是 \"您的Slack工作区即将出现的新功能\"。<p>Slack发现了这个问题，并立即采取措施阻止以这种方式发送更多的电子邮件，而不是按原计划向每个工作区成员发送单独的电子邮件，你的团队的电子邮件收件人在同一封电子邮件中可见。我们也正在联系通知所有收到该邮件的用户。该邮件的所有内容对你的团队来说仍然是准确的。<p>我是如何受到影响的？\n由于您收到了这些电子邮件中的一封，这意味着您工作区的其他收到电子邮件的人可能无意中看到了您的电子邮件地址。<p>我应该怎么做？\n我们要求您删除，不要分享、储存、打印或以任何方式保留带有电子邮件地址的原始电子邮件。如果您对此有其他问题，您可以回复这封邮件，或通过 feedback@slack.com 与我们联系。<p>我们知道您的数据安全和隐私很重要。我们对这个问题可能造成的不便和担忧感到非常抱歉。<p>真诚的。\nSlack的团队&quot;<p>我猜他们很快就会处理一些集体诉讼了。\n",
  "description_zh-Hant": "我剛剛收到Slack的這封郵件：<p>&quot;你好，<p>我們寫信通知你我們最近發現的一個問題。你的工作區的一些成員無意中被包括在同一封郵件中。這意味著你們能夠在 \"收件人 \"一行看到對方的電子郵件地址。你收到這個通知是因為你在2022年7月19日或7月20日被髮送了這封電子郵件。<p>發生了什麼，什麼時候發生的？\nSlack向您的工作區成員發送了關於Slack免費計劃即將發生的變化的電子郵件，其主題是 \"您的Slack工作區即將出現的新功能\"。<p>Slack發現了這個問題，並立即採取措施阻止以這種方式發送更多的電子郵件，而不是按原計劃向每個工作區成員發送單獨的電子郵件，你的團隊的電子郵件收件人在同一封電子郵件中可見。我們也正在聯繫通知所有收到該郵件的用戶。該郵件的所有內容對你的團隊來說仍然是準確的。<p>我是如何受到影響的？\n由於您收到了這些電子郵件中的一封，這意味著您工作區的其他收到電子郵件的人可能無意中看到了您的電子郵件地址。<p>我應該怎麼做？\n我們要求您刪除，不要分享、儲存、打印或以任何方式保留帶有電子郵件地址的原始電子郵件。如果您對此有其他問題，您可以回覆這封郵件，或通過 feedback@slack.com 與我們聯繫。<p>我們知道您的數據安全和隱私很重要。我們對這個問題可能造成的不便和擔憂感到非常抱歉。<p>真誠的。\nSlack的團隊&quot;<p>我猜他們很快就會處理一些集體訴訟了。\n"
}