{
  "@type": "NewsArticle",
  "identifier": "2022--06--20--en--myfeed--HackerNews--NewsArticle--31813308",
  "url": "https://news.ycombinator.com/item?id=31813308",
  "headline": "Instagram demands I send a picture of myself to prove I own my account",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So I tried to create an Instagram account yesterday. After registering, I was immediately told my account was disabled for suspicious activity, but that if I wished they would review it within 24 hours. Weird, I thought, but maybe it's just some rare false positive that can be triggered and I'm just unlucky. So I waited, patiently.<p>After 24 hours I tried to log in again and to my surprise, my account wasn't just temporarily disabled anymore but permanently deactivated and I was met with this message:<p>&gt; Your account has been disabled for violating our terms. Learn how you may be able to restore your account. https://help.instagram.com/521372114683554<p>How can I allegedly have broken Instagram terms when I just created the account and even verified it by phone? So I visited that link and asked them to restore it. What I get is an email by facebook that demands I send them a picture of myself holding a paper that I wrote a specific code on. Verbatim the email is this:<p>&gt; Hello, thank you for contacting us. Before we can help you, you must confirm that you are the owner of the account. Please respond to this email and attach a photograph of yourself, where you hold a piece of paper with the following, handwritten code on it: *** Please make sure that the photo fulfills the following criteria: \n- shows the above mentioned, handwritten code on a clean piece of paper, followed by your full name and username\n- shows both of your hands holding the paper as well as your complete face\n- it is well-lit and not too small, dark or blurred\n- is attached as a JPEG-file to your response E-Mail\nNote: Even if this account does not contain and pictures of yourself or it represents somebody or something else, we can only help you when we receive a picture of you which fulfills these criteria.<p>Am I the only one who finds this incredibly intrusive? I know I might be partially beating a dead horse here, as everyone knows Meta is pure evil. But this email really &quot;gave me the rest&quot;. I wouldn't use IG for posting pictures of myself anyway but now I won't ever be using anything from Meta even for business reasons.<p>Are there really no less intrusive ways than the above to prove ones ownership of account?? Why is email and phone verification not enough anymore these days? Is this the type of &quot;progress&quot; happening at FAANG? LOL",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jdthedisciple",
    "url": "https://news.ycombinator.com/user?id=jdthedisciple"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31813308",
  "sameAs": "https://news.ycombinator.com/item?id=31813308",
  "dateCreated": "2022-06-20T18:32:01.648Z",
  "datePublished": "2022-06-20T17:50:08.000Z",
  "dateModified": "2022-06-20T18:32:01.648Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 29
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 10
    }
  ],
  "headline_zh-Hans": "Instagram要求我发送一张自己的照片以证明我拥有自己的账户\n",
  "headline_zh-Hant": "Instagram要求我發送一張自己的照片以證明我擁有自己的賬戶\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "所以我昨天试图创建一个Instagram账户。注册后，我立即被告知我的账户因可疑活动而被禁用，但如果我愿意，他们会在24小时内审查。我想，这很奇怪，但也许这只是一些罕见的假阳性，可能会被触发，而我只是运气不好。<p>24小时后，我试图再次登录，令我吃惊的是，我的账户不再是暂时禁用，而是永久停用，我看到了这样的信息：<p>&gt; 您的账户因违反我们的条款而被禁用。https://help.instagram.com/521372114683554<p>我刚刚创建了账户，甚至还通过电话进行了验证，怎么可能涉嫌违反Instagram的条款？所以我访问了那个链接，要求他们恢复它。我得到的是一封电子邮件，要求我给他们发一张我拿着一张纸的照片，我在上面写了一个特定的代码。邮件的逐字记录是这样的：<p>&gt; 你好，感谢你与我们联系。在我们能帮助你之前，你必须确认你是该账户的所有者。请回复这封邮件，并附上一张你的照片，你拿着一张纸，上面有以下手写的代码。***请确保照片符合以下条件。\n- 在一张干净的纸上显示上述的手写代码，后面是你的全名和用户名\n- 显示你拿着纸的两只手，以及你完整的脸部\n- 光线充足，不要太小、太暗或太模糊\n- 以JPEG文件形式附在你的电子邮件中。\n注意：即使这个账户不包含你自己的照片，或者它代表某人或其他东西，我们只有在收到符合这些标准的你的照片时才能帮助你。我知道我可能部分地在这里打了一匹死马，因为大家都知道Meta是纯粹的邪恶。但这封邮件真的让我感到不安。我反正不会用IG发布自己的照片，但现在我不会再使用Meta的任何东西，即使是出于商业原因。<p>难道真的没有比上述方式更不具侵入性的方法来证明自己的账户所有权吗？为什么现在的电子邮件和电话验证已经不够了？这就是FAANG公司发生的那种&quot;进步&quot;吗？大笑\n",
  "description_zh-Hant": "所以我昨天試圖創建一個Instagram賬戶。註冊後，我立即被告知我的賬戶因可疑活動而被禁用，但如果我願意，他們會在24小時內審查。我想，這很奇怪，但也許這只是一些罕見的假陽性，可能會被觸發，而我只是運氣不好。<p>24小時後，我試圖再次登錄，令我吃驚的是，我的賬戶不再是暫時禁用，而是永久停用，我看到了這樣的信息：<p>&gt; 您的賬戶因違反我們的條款而被禁用。https://help.instagram.com/521372114683554<p>我剛剛創建了賬戶，甚至還通過電話進行了驗證，怎麼可能涉嫌違反Instagram的條款？所以我訪問了那個鏈接，要求他們恢復它。我得到的是一封電子郵件，要求我給他們發一張我拿著一張紙的照片，我在上面寫了一個特定的代碼。郵件的逐字記錄是這樣的：<p>&gt; 你好，感謝你與我們聯繫。在我們能幫助你之前，你必須確認你是該賬戶的所有者。請回復這封郵件，並附上一張你的照片，你拿著一張紙，上面有以下手寫的代碼。***請確保照片符合以下條件。\n- 在一張乾淨的紙上顯示上述的手寫代碼，後面是你的全名和用戶名\n- 顯示你拿著紙的兩隻手，以及你完整的臉部\n- 光線充足，不要太小、太暗或太模糊\n- 以JPEG文件形式附在你的電子郵件中。\n注意：即使這個賬戶不包含你自己的照片，或者它代表某人或其他東西，我們只有在收到符合這些標準的你的照片時才能幫助你。我知道我可能部分地在這裡打了一匹死馬，因為大家都知道Meta是純粹的邪惡。但這封郵件真的讓我感到不安。我反正不會用IG發佈自己的照片，但現在我不會再使用Meta的任何東西，即使是出於商業原因。<p>難道真的沒有比上述方式更不具侵入性的方法來證明自己的賬戶所有權嗎？為什麼現在的電子郵件和電話驗證已經不夠了？這就是FAANG公司發生的那種&quot;進步&quot;嗎？大笑\n"
}