{
  "@type": "NewsArticle",
  "identifier": "2022--04--20--en--myfeed--HackerNews--NewsArticle--31099993",
  "url": "https://news.ycombinator.com/item?id=31099993",
  "headline": "Looking for Technical Co-Founder ASAP",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN,<p>this is my first post on HN. After reading many posts and submits as well as success stories, I thought to give this a shot.<p>Situation is the following: \nMy team and I are hacking away different projects for a couple of years by now. We have been active primarily in the Gaming and Esport Market and build products for problems we were seeing. In September/ October 2021 we went ahead and entered the Blockchain Crazyness (investors since 2016, but going full-time from a business/ entrepreneurial perspective in 2021).<p>We started off with a NFT project and, being very community driven, had the community vote on the chain we will be launching on. This vote ended us being voted on Hedera HashGraph, a Top 30 Blockchain with NFT Infrastructure in Place since about 6 months. Hedera is a Distributed Ledger Technology and is traded among the best chains when it comes to fast transactions and environment friendliness.\nTo give the NFTs more utility, we've started building up the first NFT Marketplace on Hedera HashGraph. Quickly, we've reached almost a thousand users and a couple of thousands revenue generated.<p>While we said mentally goodbye to VCs after former products and with the beauty of the blockchain ecosystem (we are crowdfunding with NFTs, early investors are sort-of early backers), this changed: We talked to one single VC and got a termsheet on our table.<p>After discussing it team internally, if we want to go that route, we decided to do it. If we say yes to something, we are doubling down on that like crazy. We are working non-stop and keep building and shipping.<p>What a bummer it was, after we crashed through the Tech Due Dilligence, reason for that: We do not have a Computer Science graduate on the team.<p>We have been presented a timeline that we need to find a Technical Co-Founder until next Monday (5 days from writing) to have that deal working. While finding Co-Founders is sometimes difficult, we were thinking about the old Brian Armstrong, finding his Co-Founders only few hours before joining YC. Great companies are build by the madness of time constraint sometimes. Thus, this post.<p>We are looking for a Technical Co-Founder ASAP.<p>Few details: \nYou should be able to build WebApplications, our techstack is React and Typescript. \nBlockchain Knowledge is appreciated, but not required. \nWe are based in Berlin, Germany - being in similar timezones (+-3 hours) is benefitial, but not required.<p>To us: \nWe are having a large vision, building the whole NFT Infrastructure for Hedera (think OpenSea, RarityTools, Icy.Tools, NFTBank - together)\nWe are hardworking and ultra-commited\nWe know what we are doing but never stop learning\nWe are building user-centric and community-first<p>If this sounds interesting to you and you want to join a venture-backed startup, please reach out via the mail in my profile and we schedule a meeting ASAP.<p>Fingers crossed!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "datproto",
    "url": "https://news.ycombinator.com/user?id=datproto"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31099993",
  "sameAs": "https://news.ycombinator.com/item?id=31099993",
  "dateCreated": "2022-04-20T17:47:05.972Z",
  "datePublished": "2022-04-20T17:10:59.000Z",
  "dateModified": "2022-04-20T17:47:05.972Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "尽快寻找技术联合创始人",
  "headline_zh-Hant": "儘快尋找技術聯合創始人",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hey HN,<p>这是我在HN上的第一个帖子。在阅读了许多帖子和提交的资料以及成功的故事后，我想试一试。<p>情况如下。\n我和我的团队已经在不同的项目上做了几年了。我们主要活跃在游戏和电子竞技市场，为我们看到的问题开发产品。在2021年9月/10月，我们继续前进，并进入区块链的疯狂（自2016年以来的投资者，但在2021年从商业/创业的角度全职）。<p>我们从一个NFT项目开始，作为非常社区驱动，让社区投票决定我们将推出的链。这次投票结束后，我们被选为Hedera HashGraph，这是一个排名前30的区块链，自6个月以来就有NFT基础设施。Hedera是一种分布式账本技术，当涉及到快速交易和环境友好时，它被交易为最佳链。\n为了赋予NFT更多的效用，我们已经开始在Hedera HashGraph上建立了第一个NFT Marketplace。很快，我们已经达到了近千名用户，并产生了几千份收入。<p>虽然我们在以前的产品之后在精神上告别了风险投资，并与区块链生态系统的美丽（我们正在用NFTs进行众筹，早期投资者算是早期的支持者），但这改变了：我们与一个单一的风险投资交谈，并在我们的桌子上得到了一个条款表。<p>在内部讨论了团队，如果我们想走这条路线，我们决定这样做。如果我们对某件事说 \"是\"，我们就会疯狂地加倍努力去做。我们正在马不停蹄地工作，并继续建设和运输。<p>在我们通过技术尽职调查后，这是一个多么无奈的事情，原因是。我们的团队中没有一个计算机科学专业的毕业生。<p>我们被提出了一个时间表，我们需要在下周一（从写作开始的5天）之前找到一个技术联合创始人，以使这笔交易发挥作用。虽然寻找联合创始人有时很困难，但我们想到了以前的布莱恩-阿姆斯特朗，在加入YC前几小时才找到他的联合创始人。伟大的公司有时是在疯狂的时间限制下建立的。因此，这个帖子。<p>我们正在寻找一个技术联合创始人，尽快。<p>一些细节。\n你应该能够建立WebApplications，我们的技术栈是React和Typecript。\n区块链知识是值得赞赏的，但不是必须的。\n我们的总部设在德国柏林--在相似的时区（+-3小时）是有益的，但不是必须的。\n我们有一个很大的愿景，为Hedera建立整个NFT基础设施（想想OpenSea、RarityTools、Icy.Tools、NFTBank - 一起）。\n我们很勤奋，而且非常有责任心\n我们知道我们在做什么，但从未停止学习\n我们正在建立以用户为中心和社区第一的模式<p>如果这听起来很有趣，而且你想加入一个由风险投资支持的创业公司，请通过我个人资料中的邮件联系我们，我们将尽快安排一次会议。",
  "description_zh-Hant": "Hey HN,<p>這是我在HN上的第一個帖子。在閱讀了許多帖子和提交的資料以及成功的故事後，我想試一試。<p>情況如下。\n我和我的團隊已經在不同的項目上做了幾年了。我們主要活躍在遊戲和電子競技市場，為我們看到的問題開發產品。在2021年9月/10月，我們繼續前進，並進入區塊鏈的瘋狂（自2016年以來的投資者，但在2021年從商業/創業的角度全職）。<p>我們從一個NFT項目開始，作為非常社區驅動，讓社區投票決定我們將推出的鏈。這次投票結束後，我們被選為Hedera HashGraph，這是一個排名前30的區塊鏈，自6個月以來就有NFT基礎設施。Hedera是一種分佈式賬本技術，當涉及到快速交易和環境友好時，它被交易為最佳鏈。\n為了賦予NFT更多的效用，我們已經開始在Hedera HashGraph上建立了第一個NFT Marketplace。很快，我們已經達到了近千名用戶，併產生了幾千份收入。<p>雖然我們在以前的產品之後在精神上告別了風險投資，並與區塊鏈生態系統的美麗（我們正在用NFTs進行眾籌，早期投資者算是早期的支持者），但這改變了：我們與一個單一的風險投資交談，並在我們的桌子上得到了一個條款表。<p>在內部討論了團隊，如果我們想走這條路線，我們決定這樣做。如果我們對某件事說 \"是\"，我們就會瘋狂地加倍努力去做。我們正在馬不停蹄地工作，並繼續建設和運輸。<p>在我們通過技術盡職調查後，這是一個多麼無奈的事情，原因是。我們的團隊中沒有一個計算機科學專業的畢業生。<p>我們被提出了一個時間表，我們需要在下週一（從寫作開始的5天）之前找到一個技術聯合創始人，以使這筆交易發揮作用。雖然尋找聯合創始人有時很困難，但我們想到了以前的布萊恩-阿姆斯特朗，在加入YC前幾小時才找到他的聯合創始人。偉大的公司有時是在瘋狂的時間限制下建立的。因此，這個帖子。<p>我們正在尋找一個技術聯合創始人，儘快。<p>一些細節。\n你應該能夠建立WebApplications，我們的技術棧是React和Typecript。\n區塊鏈知識是值得讚賞的，但不是必須的。\n我們的總部設在德國柏林--在相似的時區（+-3小時）是有益的，但不是必須的。\n我們有一個很大的願景，為Hedera建立整個NFT基礎設施（想想OpenSea、RarityTools、Icy.Tools、NFTBank - 一起）。\n我們很勤奮，而且非常有責任心\n我們知道我們在做什麼，但從未停止學習\n我們正在建立以用戶為中心和社區第一的模式<p>如果這聽起來很有趣，而且你想加入一個由風險投資支持的創業公司，請通過我個人資料中的郵件聯繫我們，我們將盡快安排一次會議。"
}