{
  "@type": "NewsArticle",
  "identifier": "2022--07--30--en--myfeed--HackerNews--NewsArticle--32285593",
  "url": "https://news.ycombinator.com/item?id=32285593",
  "headline": "Show HN: The Poetry Corner – A React Native app to read public domain poems",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "TLDR - scratched my own itch with an app, added a pro plan and got my first subscribers this week!<p>Last December I started digging into poetry, it was a topic I always thought I liked, but just hadn’t explored very much. I soon discovered that a lot of the poetry sites online had pretty annoying designs, e.g. ads right at the end of the poem, (muting any emotional impact).<p>I also have wanted to be able to easily save a list of my favourites to easily come back to.<p>I decided to build and release a react native app which addressed these issues. It took about 4 weeks during the winter break to release an MVP to the App Store. The backend is using Firebase, which has been superb in allowing me to bootstrap the app quickly.<p>I soon added a poem of the day feature, which forced me into curation (needing to find 365 poems for the year!).  I’ve discovered so many amazing poems and poets as a result. One of the things I love about tech is that it can touch so many different domains and industries.<p>Anyway, fast forward six months of continuous development, adding features and refining the design, lots of late nights. I finally had enough of a feature set to demarcate some out to a paid plan with a free trial. And the first users have actually started subscribing!<p>I’ll soon be ramping up ads, currently just on the App Store Search, but soon with Google and Instagram. I’ll be seeing if I can spend x amount on ads to net a return in subscriptions. If so, I’ll be scaling it as fast as the budget will allow.<p>For the instagram ads, I’ll be marketing the poetry app with a mindfulness twist. Some people have already talked about this connection online, and I’ve personally experienced a deeper bond with nature and awareness of my own feelings as a result of reading so many poems.<p>So that’s where the app is now, and where I have in mind to take it. It’s been super fun working on it and any feedback is welcome!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "archiepeach",
    "url": "https://news.ycombinator.com/user?id=archiepeach"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32285593",
  "sameAs": "https://apps.apple.com/gb/app/the-poetry-corner/id1602552624",
  "dateCreated": "2022-07-30T10:27:07.786Z",
  "datePublished": "2022-07-30T10:11:22.000Z",
  "dateModified": "2022-07-30T10:27:07.786Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 诗歌角 - 一个阅读公共领域诗歌的React Native应用\n",
  "headline_zh-Hant": "Show HN: 詩歌角 - 一個閱讀公共領域詩歌的React Native應用\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>去年12月，我开始研究诗歌，这是我一直认为自己喜欢的一个主题，只是没有过多的探索。我很快就发现，网上的很多诗歌网站都有相当烦人的设计，例如，在诗歌的结尾处有广告，（削弱了任何情感上的影响）。<p>我还希望能够轻松地保存我的最爱列表，以便轻松地回来。寒假期间，我花了大约4周时间向App Store发布了一个MVP。后台使用的是Firebase，它在让我快速启动应用程序方面发挥了巨大的作用。<p>我很快增加了每日一诗的功能，这迫使我进行策划（需要为一年找到365首诗！）。 我因此发现了许多令人惊叹的诗歌和诗人。我喜欢科技的一个原因是，它可以触及许多不同的领域和行业。<p>无论如何，快进了六个月的持续发展，增加功能和完善设计，很多深夜。我终于有了足够的功能集，将一些功能划分为付费计划，并提供免费试用。第一批用户实际上已经开始订阅了！<p>我很快就会增加广告，目前只是在App Store搜索，但很快就会与谷歌和Instagram合作。我将看看我是否能在广告上花费X金额，以获得订阅的回报。<p>在Instagram的广告中，我将会推销带有正念的诗词应用。有些人已经在网上谈到了这种联系，而我个人也经历了与自然更深的联系，并在阅读大量诗歌后意识到自己的感受。<p>所以这就是这个应用程序现在的情况，也是我心中的方向。这是个超级有趣的工作，欢迎任何反馈意见\n",
  "description_zh-Hant": "<p>去年12月，我開始研究詩歌，這是我一直認為自己喜歡的一個主題，只是沒有過多的探索。我很快就發現，網上的很多詩歌網站都有相當煩人的設計，例如，在詩歌的結尾處有廣告，（削弱了任何情感上的影響）。<p>我還希望能夠輕鬆地保存我的最愛列表，以便輕鬆地回來。寒假期間，我花了大約4周時間向App Store發佈了一個MVP。後臺使用的是Firebase，它在讓我快速啟動應用程序方面發揮了巨大的作用。<p>我很快增加了每日一詩的功能，這迫使我進行策劃（需要為一年找到365首詩！）。 我因此發現了許多令人驚歎的詩歌和詩人。我喜歡科技的一個原因是，它可以觸及許多不同的領域和行業。<p>無論如何，快進了六個月的持續發展，增加功能和完善設計，很多深夜。我終於有了足夠的功能集，將一些功能劃分為付費計劃，並提供免費試用。第一批用戶實際上已經開始訂閱了！<p>我很快就會增加廣告，目前只是在App Store搜索，但很快就會與谷歌和Instagram合作。我將看看我是否能在廣告上花費X金額，以獲得訂閱的回報。<p>在Instagram的廣告中，我將會推銷帶有正念的詩詞應用。有些人已經在網上談到了這種聯繫，而我個人也經歷了與自然更深的聯繫，並在閱讀大量詩歌后意識到自己的感受。<p>所以這就是這個應用程序現在的情況，也是我心中的方向。這是個超級有趣的工作，歡迎任何反饋意見\n"
}