{
  "@type": "NewsArticle",
  "identifier": "2022--06--14--en--myfeed--HackerNews--NewsArticle--31741839",
  "url": "https://news.ycombinator.com/item?id=31741839",
  "headline": "Jun 14: Plato's CRITO: Vol. 2, pp. 31-43",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Plato's CRITO: A Philosopher Prefers Prison Cell<p>Socrates unceasingly strove for beauty, truth, and perfection. Sentenced to death on a false charge, he refused to escape from the death cell, even when opportunity was offered.<p>Vol. 2, pp. 31-43 (starts on page 39 of the .pdf)<p>Download Link Here: https://www.myharvardclassics.com/categories/20120212<p>Please comment below on your own thoughts and feeling towards today's reading.<p>Here are some passages I found interesting:<p>&quot;Cr. Why, indeed, Socrates, I myself would rather not have all this sleeplessness and sorrow. But I have been wondering at your peaceful slumbers, and that was the reason why I did not awaken you, because I wanted you to be out of pain. I have always thought you happy in the calmness of  your temperament; but never did I see the like of the easy, cheerful way in which you bear this calamity. Soc. Why, Crito, when a man has reached my age he ought not to be repining at the prospect of death. Cr. And yet other old men find themselves in similar misfortunes, and age does not prevent them from repining.&quot;<p>&quot;Soc. What! I suppose that the ship has come from Delos, on the arrival of which I am to die? Cr. No, the ship has not actually arrived, but she will probably be here to-day, as persons who have come from Sunium tell me that they have left her there; and therefore to-morrow, Socrates, will be the last day of your life.&quot;<p>&quot;For if you die I shall not only lose a friend who can never be re- placed, but there is another evil: people who do not know you and me will believe that I might have saved you if I had been willing to give money, but that I did not care. Now, can there be a worse disgrace than this—that I should be thought to value money more than the life of a friend? For the many will not be persuaded that I wanted you to escape, and that you refused. Soc. But why, my dear Crito, should we care about the opinion of the many ? Good men, and they are the only persons who are worth considering, will think of these things truly as they happened. Cr. But do you see, Socrates, that the opinion of the many must be regarded, as is evident in your own case, because they can do the very greatest evil to anyone who has lost their good opinion ?&quot;<p>Soc. And will life be worth having, if that higher part of man be depraved, which is improved by justice and deteriorated by injustice? Do we suppMse that principle, whatever it may be in man, which has to do with justice and injustice, to be inferior to the body? Cr. Certainly not. Soc. More honored, then? Cr. Far more honored. Soc. Then, my friend, we must not regard what the many say of us: but what he, the one man who has understanding of just and unjust, will say, and what the truth will say. And therefore you begin in error when you suggest that we should regard the opinion of the many about just and unjust, good and evil, honorable and dis- honorable.<p>Now you depart in innocence, a sufferer and not a doer of evil; a victim, not of the laws, but of men. But if you go forth, returning evil for evil, and injury for injury, breaking the covenants and agreements which you have made with us, and wronging those whom you ought least to wrong, that is to say, yourself, your friends, your country, and us, we shall be angry with you while you live, and our brethren, the laws in the world below, will receive you as an enemy; for they will know that you have done your best to destroy us. Listen, then, to us and not to Crito.<p>Leave me then, Crito, to fufil the will of God, and to follow whiter he leads",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "HarvardClassics",
    "url": "https://news.ycombinator.com/user?id=HarvardClassics"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31741839",
  "sameAs": "https://news.ycombinator.com/item?id=31741839",
  "dateCreated": "2022-06-14T16:39:04.743Z",
  "datePublished": "2022-06-14T16:30:27.000Z",
  "dateModified": "2022-06-14T16:39:04.743Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "6月14日：柏拉图的CRITO：第二卷，第31-43页\n",
  "headline_zh-Hant": "6月14日：柏拉圖的CRITO：第二卷，第31-43頁\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "柏拉图的CRITO：一个哲学家更喜欢监狱牢房<p>苏格拉底不间断地努力追求美、真理和完美。<p>第二卷，第31-43页（从.pdf的第39页开始）<p>下载链接：https://www.myharvardclassics.com/categories/20120212<p>请在下面评论你自己对今天阅读的想法和感受。<p>以下是我发现的一些有趣的段落：<p>&quot;Cr. 为什么，苏格拉底，我自己宁可不要这些失眠和悲伤。但我一直对你平静的沉睡感到奇怪，这就是我没有叫醒你的原因，因为我希望你能摆脱痛苦。我一直认为你的性情平和，是很幸福的；但我从来没有看到你像这样轻松、愉快地承受这场灾难的方式。克里托，一个人到了我这个年龄，就不应该对死亡的前景感到恐惧。克里托。然而，其他的老人也会遇到类似的不幸，而年龄并不能阻止他们悔恨。什么！我猜想那艘船是从德洛斯来的，我将在它到达时死去？克。不，船还没有真正到达，但她可能今天就到了，因为从苏尼姆来的人告诉我，他们把她留在了那里；因此，明天，苏格拉底，将是你生命的最后一天。&quot;<p>&quot;因为如果你死了，我不仅会失去一个永远无法重新安置的朋友，而且还有另一个坏处：不了解你我的人将相信，如果我愿意给钱，我本可以救你，但我不在乎。现在，还有比这更糟糕的耻辱吗--我被认为把金钱看得比朋友的生命更重要？因为许多人不会相信我想让你逃跑，而你却拒绝了。但是，我亲爱的克里特，我们为什么要关心许多人的意见呢？好人，他们是唯一值得考虑的人，他们会真实地思考这些事情，因为它们发生了。Cr. 但是你看到了吗，苏格拉底，必须考虑到许多人的意见，这在你自己的案例中是很明显的，因为他们可以对任何失去好意见的人造成最大的伤害。如果人的那个更高的部分是堕落的，它因正义而改善，因不正义而恶化，那么生命还值得拥有吗？我们是否认为那个原则，不管它在人身上是什么，与正义和非正义有关，都比身体低级？克。当然不是。那就更尊贵了？克。远远更尊贵。那么，我的朋友，我们不应该考虑许多人对我们的评价，而应该考虑他，那个对正义和非正义有认识的人，会怎么说，以及真理会怎么说。因此，当你建议我们应该考虑众人对正义与非正义、善与恶、光荣与不光荣的看法时，你就开始犯错了。<p>现在你离开时是无辜的，是受苦的，而不是作恶的；不是法律的受害者，而是人的受害者。但是，如果你去了，以恶报恶，以伤报伤，破坏你与我们签订的契约和协议，并对那些你最不应该伤害的人，也就是你自己、你的朋友、你的国家和我们，在你活着的时候，我们将对你感到愤怒，我们的兄弟们，即下面世界的法律，将把你当作敌人来接受；因为他们将知道，你已经尽了你最大的努力来摧毁我们。那么，请听我们的话，不要听克里托的话。<p>那么，克里托，请让我去履行上帝的旨意，去追随他的足迹。\n",
  "description_zh-Hant": "柏拉圖的CRITO：一個哲學家更喜歡監獄牢房<p>蘇格拉底不間斷地努力追求美、真理和完美。<p>第二卷，第31-43頁（從.pdf的第39頁開始）<p>下載鏈接：https://www.myharvardclassics.com/categories/20120212<p>請在下面評論你自己對今天閱讀的想法和感受。<p>以下是我發現的一些有趣的段落：<p>&quot;Cr. 為什麼，蘇格拉底，我自己寧可不要這些失眠和悲傷。但我一直對你平靜的沉睡感到奇怪，這就是我沒有叫醒你的原因，因為我希望你能擺脫痛苦。我一直認為你的性情平和，是很幸福的；但我從來沒有看到你像這樣輕鬆、愉快地承受這場災難的方式。克里託，一個人到了我這個年齡，就不應該對死亡的前景感到恐懼。克里託。然而，其他的老人也會遇到類似的不幸，而年齡並不能阻止他們悔恨。什麼！我猜想那艘船是從德洛斯來的，我將在它到達時死去？克。不，船還沒有真正到達，但她可能今天就到了，因為從蘇尼姆來的人告訴我，他們把她留在了那裡；因此，明天，蘇格拉底，將是你生命的最後一天。&quot;<p>&quot;因為如果你死了，我不僅會失去一個永遠無法重新安置的朋友，而且還有另一個壞處：不瞭解你我的人將相信，如果我願意給錢，我本可以救你，但我不在乎。現在，還有比這更糟糕的恥辱嗎--我被認為把金錢看得比朋友的生命更重要？因為許多人不會相信我想讓你逃跑，而你卻拒絕了。但是，我親愛的克里特，我們為什麼要關心許多人的意見呢？好人，他們是唯一值得考慮的人，他們會真實地思考這些事情，因為它們發生了。Cr. 但是你看到了嗎，蘇格拉底，必須考慮到許多人的意見，這在你自己的案例中是很明顯的，因為他們可以對任何失去好意見的人造成最大的傷害。如果人的那個更高的部分是墮落的，它因正義而改善，因不正義而惡化，那麼生命還值得擁有嗎？我們是否認為那個原則，不管它在人身上是什麼，與正義和非正義有關，都比身體低級？克。當然不是。那就更尊貴了？克。遠遠更尊貴。那麼，我的朋友，我們不應該考慮許多人對我們的評價，而應該考慮他，那個對正義和非正義有認識的人，會怎麼說，以及真理會怎麼說。因此，當你建議我們應該考慮眾人對正義與非正義、善與惡、光榮與不光榮的看法時，你就開始犯錯了。<p>現在你離開時是無辜的，是受苦的，而不是作惡的；不是法律的受害者，而是人的受害者。但是，如果你去了，以惡報惡，以傷報傷，破壞你與我們簽訂的契約和協議，並對那些你最不應該傷害的人，也就是你自己、你的朋友、你的國家和我們，在你活著的時候，我們將對你感到憤怒，我們的兄弟們，即下面世界的法律，將把你當作敵人來接受；因為他們將知道，你已經盡了你最大的努力來摧毀我們。那麼，請聽我們的話，不要聽克里託的話。<p>那麼，克里託，請讓我去履行上帝的旨意，去追隨他的足跡。\n"
}