{
  "@type": "NewsArticle",
  "identifier": "2022--08--08--en--myfeed--HackerNews--NewsArticle--32387722",
  "url": "https://news.ycombinator.com/item?id=32387722",
  "headline": "Patriot Response Group – Full stack developer – Full time",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Happy Monday.<p>My friend in startup space is looking for a Full stack Developer. If you know anyone skilled in Web, Mobile application, and API development, has SQL experience, is willing to learn new frameworks, has excellent debugging skills, and is looking for a new challenge, we would love to hear from you. Send your references and resume to DJ Ursal @ https://www.linkedin.com/in/djursal/. Feel free to forward this post to anyone who is interested and let me know if you need an introduction.<p>Required:\n• Bachelor’s degree in C. S., Mathematics, Electrical Engineering, or equivalent experience.\n• Minimum combined five years of programming experience in web and mobile-based applications.\n• Experience building and maintaining APIs\n• Experience with SQL, SQL Server, or PostgreSQL is a plus.<p>The person can be virtual but has to be here, LOCATED in the United States, and willing to travel 10% throughout the year.<p>About the Company\nPatriot Response Group is looking for a full-time software developers passionate about creating a cutting-edge platform. Patriot Response Group is a full-service Emergency Management firm offering more than 60 years of combined leadership experience in disaster response, recovery, and construction services. Operating in the U.S. and its territories, we focus on regions with limited resources and communities devastated by hurricanes, tornados, and severe flooding.<p>Our values: Passion, Integrity, and Loyalty.<p>This is an excellent opportunity to work on a friendly team of dedicated professionals in a culture that values teamwork, continuous learning, and service.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "shengxio",
    "url": "https://news.ycombinator.com/user?id=shengxio"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32387722",
  "sameAs": "https://news.ycombinator.com/item?id=32387722",
  "dateCreated": "2022-08-08T17:08:43.431Z",
  "datePublished": "2022-08-08T16:35:16.000Z",
  "dateModified": "2022-08-08T17:08:43.431Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "爱国者回应集团 - 全栈开发人员 - 全职\n",
  "headline_zh-Hant": "愛國者回應集團 - 全棧開發人員 - 全職\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "周一快乐！<p>我在创业领域的朋友正在寻找一名全栈开发人员。如果你认识的人精通Web、移动应用和API开发，有SQL经验，愿意学习新的框架，有出色的调试技能，并且正在寻找新的挑战，我们很想听到你的消息。请将您的推荐信和简历发送到DJ Ursal @ https://www.linkedin.com/in/djursal/。欢迎把这个帖子转发给任何有兴趣的人，如果你需要介绍，请告诉我。<p>要求。\n- C.S.、数学、电气工程专业的学士学位，或同等经验。\n- 至少有五年的网络和移动应用程序的编程经验。\n- 有建立和维护API的经验\n- 有SQL、SQL Server或PostgreSQL的经验更佳。<p>此人可以是虚拟的，但必须在这里，在美国境内，并愿意全年出差10%。\n爱国者反应集团正在寻找一位对创建尖端平台充满热情的全职软件开发人员。爱国者反应集团是一家提供全面服务的应急管理公司，在灾难响应、恢复和建设服务方面提供超过60年的综合领导经验。我们在美国及其领土上运营，专注于资源有限的地区和被飓风、龙卷风和严重洪灾破坏的社区。激情、诚信和忠诚。<p>这是一个很好的机会，可以在一个由敬业的专业人士组成的友好团队中工作，在一个重视团队合作、不断学习和服务的文化中工作。\n",
  "description_zh-Hant": "週一快樂！<p>我在創業領域的朋友正在尋找一名全棧開發人員。如果你認識的人精通Web、移動應用和API開發，有SQL經驗，願意學習新的框架，有出色的調試技能，並且正在尋找新的挑戰，我們很想聽到你的消息。請將您的推薦信和簡歷發送到DJ Ursal @ https://www.linkedin.com/in/djursal/。歡迎把這個帖子轉發給任何有興趣的人，如果你需要介紹，請告訴我。<p>要求。\n- C.S.、數學、電氣工程專業的學士學位，或同等經驗。\n- 至少有五年的網絡和移動應用程序的編程經驗。\n- 有建立和維護API的經驗\n- 有SQL、SQL Server或PostgreSQL的經驗更佳。<p>此人可以是虛擬的，但必須在這裡，在美國境內，並願意全年出差10%。\n愛國者反應集團正在尋找一位對創建尖端平臺充滿熱情的全職軟件開發人員。愛國者反應集團是一家提供全面服務的應急管理公司，在災難響應、恢復和建設服務方面提供超過60年的綜合領導經驗。我們在美國及其領土上運營，專注於資源有限的地區和被颶風、龍捲風和嚴重洪災破壞的社區。激情、誠信和忠誠。<p>這是一個很好的機會，可以在一個由敬業的專業人士組成的友好團隊中工作，在一個重視團隊合作、不斷學習和服務的文化中工作。\n"
}