{
  "@type": "NewsArticle",
  "identifier": "2022--06--18--en--myfeed--HackerNews--NewsArticle--31793274",
  "url": "https://news.ycombinator.com/item?id=31793274",
  "headline": "I'm ex startup CEO, schizophrenic and ex-inmate. Where should do I go next",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So I'm in my early 30 and completely unsure where should I go next. I'm undiagnosed schizophrenic in remission and here's my story.<p>In my early 20s I founded a startup, got it on rails with traction, revenue and investors, and I was fired from it.<p>Around time of firing I started developing schizophrenia, still undiagnosed because I never went to psychiatrists. I broke all my contacts within a year, locked myself in, broke up with my significant one and switched to a social recluse lifestyle.<p>I started tinkering with crypto around that time and made some money, so I don't really have to work a lot of time if I keep my lifestyle.<p>I kept my programming skills up do date, spent a lot of time with AI projects, but I was unable to find team-mates to work on these projects. Most of these projects I was involved with were solo efforts.<p>Eventually decease progressed to a point where I had no real life, locked in my apartment tinkering with AI and crypto, Terry Davis style. My schizophrenia symptoms were getting even worse to a point I had no real-world contacts except my parents.<p>Around 2019 my father died and my mental state gotten even worse. I landed in prison for 2 years for attacking a police officer.<p>It has been 6 months after the prison, I now mostly involved with AI RL, Rust and Substrate projects, but I'm afraid I've completely lost a direction in life, with 0 peers still. I figured out I might just find a normal programming job, but so far my resume with 8 years of non-working gap keeps alienating employers. I completely unsure where should I go next. I have no social life.<p>Are there other misguided people like me?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "schizo89",
    "url": "https://news.ycombinator.com/user?id=schizo89"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31793274",
  "sameAs": "https://news.ycombinator.com/item?id=31793274",
  "dateCreated": "2022-06-18T20:25:06.466Z",
  "datePublished": "2022-06-18T20:00:07.000Z",
  "dateModified": "2022-06-18T20:25:06.466Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "我是前创业公司首席执行官，有精神分裂症和前囚犯。我接下来应该去哪里？\n",
  "headline_zh-Hant": "我是前創業公司首席執行官，有精神分裂症和前囚犯。我接下來應該去哪裡？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我现在30岁出头，完全不确定下一步该怎么走。<p>在我20岁出头的时候，我创立了一家初创公司，让它有了牵引力、收入和投资者，然后我被解雇了。<p>在被解雇的前后，我开始患上精神分裂症，由于我从未去看精神病医生，所以仍然没有被诊断出来。我在一年内打破了所有的联系，把自己关在家里，与我重要的人分手，转而过着社交隐居的生活。<p>在那段时间，我开始修补加密货币，并赚了一些钱，所以如果我保持我的生活方式，我真的不需要工作很多时间。<p>我保持我的编程技能，花了很多时间在AI项目上，但我无法找到团队伙伴在这些项目上工作。<p>最终，我的病情发展到了一个地步，我没有真正的生活，被锁在公寓里捣鼓人工智能和加密货币，这是Terry Davis的风格。我的精神分裂症症状越来越严重，以至于除了我的父母，我在现实世界中没有任何联系。<p>2019年左右，我的父亲去世，我的精神状态变得更加糟糕。我因为袭击警察而入狱2年。<p>入狱后已经6个月了，我现在主要参与AI RL、Rust和Substrate项目，但我恐怕已经完全失去了生活的方向，仍然没有同伴。我想我可能会找到一份正常的编程工作，但到目前为止，我的简历上有8年没有工作的空白，一直在疏远雇主。我完全不确定我下一步应该去哪里。我没有社交生活。<p>还有其他像我这样被误导的人吗？\n",
  "description_zh-Hant": "我現在30歲出頭，完全不確定下一步該怎麼走。<p>在我20歲出頭的時候，我創立了一家初創公司，讓它有了牽引力、收入和投資者，然後我被解僱了。<p>在被解僱的前後，我開始患上精神分裂症，由於我從未去看精神病醫生，所以仍然沒有被診斷出來。我在一年內打破了所有的聯繫，把自己關在家裡，與我重要的人分手，轉而過著社交隱居的生活。<p>在那段時間，我開始修補加密貨幣，並賺了一些錢，所以如果我保持我的生活方式，我真的不需要工作很多時間。<p>我保持我的編程技能，花了很多時間在AI項目上，但我無法找到團隊夥伴在這些項目上工作。<p>最終，我的病情發展到了一個地步，我沒有真正的生活，被鎖在公寓裡搗鼓人工智能和加密貨幣，這是Terry Davis的風格。我的精神分裂症症狀越來越嚴重，以至於除了我的父母，我在現實世界中沒有任何聯繫。<p>2019年左右，我的父親去世，我的精神狀態變得更加糟糕。我因為襲擊警察而入獄2年。<p>入獄後已經6個月了，我現在主要參與AI RL、Rust和Substrate項目，但我恐怕已經完全失去了生活的方向，仍然沒有同伴。我想我可能會找到一份正常的編程工作，但到目前為止，我的簡歷上有8年沒有工作的空白，一直在疏遠僱主。我完全不確定我下一步應該去哪裡。我沒有社交生活。<p>還有其他像我這樣被誤導的人嗎？\n"
}