{
  "@type": "NewsArticle",
  "identifier": "2022--07--07--en--myfeed--HackerNews--NewsArticle--32015704",
  "url": "https://news.ycombinator.com/item?id=32015704",
  "headline": "From Jimmy Wales – WT.Social Needs Your Help",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Dear Supporters,<p>I need your help.<p>All the problems in the world that I've set out to try to solve with WikiTribune Social are as bad as ever. We're all seeing the possibility that Elon Musk will buy twitter and turn it into a radical free speech troll zone. He’s notorious himself for bad behavior on twitter - he definitely won't make twitter less toxic. He’s promised to allow Donald Trump back on the platform in the name of ‘free speech’, but let's be clear what he really wants: Trump kept twitter on the front page of every newspaper in the world for half a decade and it's very profitable for them to bring him back, no matter the cost.<p>WikiTribune has a different model. A strange model, to be sure, but it's one that I believe in. We don’t want our platform to grow by focussing on having as many pageviews as possible by maximizing addiction and outrage. We want to build something that people like you care enough about to support voluntarily, financially. It's a &quot;pay if you want&quot; model. I've joked many times - it may not be a great business model to give things away and hope people will voluntarily support them - but this is how I've built my career so far!\nWe are severely short on funds<p>There's no simple way to avoid saying it. I've chosen not to raise venture capital money because I want to maintain full creative control to build the vision that I have in mind. Over the past two years, I've been personally the major funder of the project - but it's straining my personal resources.<p>Over the past several months, we've gone back to the codebase and completely re-architected it from scratch pulling from everything that we've learned so far. We've got a great small community and the new software will have new ways to support and reward people for making quality posts (instead of how all other social networks reward people for making viral addictive fluff). Finishing this redesign will have a huge impact. I'm excited about it!<p>But to finish, I need your support. I have to pay for the development work to finish the new version of the site, and I need to do some PR and marketing to get the word out. I need to really start pushing this forward as a relaunch. If each of you can afford to give even a little, I think we have a real shot at making something revolutionary and new. We won't know unless we keep trying.<p>This is our chance to break the back of toxic social media by offering a better alternative. With Musk’s impending Twitter purchase, and the US elections approaching, time is short to create a space for healthier discourse, so please donate today.<p>Jimmy Wales",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "donutshop",
    "url": "https://news.ycombinator.com/user?id=donutshop"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32015704",
  "sameAs": "https://news.ycombinator.com/item?id=32015704",
  "dateCreated": "2022-07-07T16:42:14.836Z",
  "datePublished": "2022-07-07T16:00:27.000Z",
  "dateModified": "2022-07-07T16:42:14.836Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "来自吉米-威尔士的消息 - WT.Social需要你的帮助\n",
  "headline_zh-Hant": "來自吉米-威爾士的消息 - WT.Social需要你的幫助\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "亲爱的支持者们，<p>我需要你们的帮助。<p>世界上所有的问题，我已经着手尝试用WikiTribune Social来解决，但还是和以前一样糟糕。我们都看到，埃隆-马斯克有可能会买下twitter，并将其变成一个激进的言论自由的巨魔区。他本身就因在twitter上的不良行为而臭名昭著--他肯定不会让twitter的毒性降低。他承诺以 \"言论自由 \"的名义让唐纳德-特朗普回到平台上，但我们要清楚他真正想要什么。特朗普让twitter在世界每家报纸的头版上停留了半个月，让他回来对他们来说是非常有利的，不管付出什么代价。<p>WikiTribune有一个不同的模式。可以肯定的是，这是一个奇怪的模式，但这是我相信的模式。我们不希望我们的平台通过专注于通过最大限度地增加上瘾和愤怒而拥有尽可能多的页面浏览量来发展。我们希望建立一个像你这样的人足够关心的东西，并自愿在经济上给予支持。这是一个 \"你想要就付钱 \"的模式。我曾多次开玩笑说--把东西送出去并希望人们自愿支持它们，这可能不是一个伟大的商业模式--但这是我迄今为止建立自己事业的方式！我们的资金严重短缺。\n我们严重缺乏资金<p>没有什么简单的方法可以避免说出来。我选择不筹集风险投资资金，因为我想保持完全的创造性控制，以建立我心中的愿景。在过去的两年中，我个人一直是这个项目的主要资助者--但这使我的个人资源变得紧张。<p>在过去的几个月中，我们已经回到了代码库，并从头开始完全重新构建它，吸取了我们迄今为止学到的所有东西。我们有一个很好的小社区，新的软件将有新的方法来支持和奖励人们发表高质量的帖子（而不是所有其他社交网络奖励人们发表病毒性的上瘾的废话）。完成这一重新设计将产生巨大的影响。我很兴奋！<p>但要完成，我需要你的支持。我必须支付完成新版网站的开发工作，我还需要做一些公关和营销工作，让大家知道。我需要真正开始推动这项工作的重新启动。如果你们每个人都能付出哪怕一点点，我想我们就有机会做出一些革命性的新东西。除非我们继续尝试，否则我们不会知道。<p>这是我们的机会，通过提供更好的替代方案来打破有毒的社交媒体的背景。随着马斯克即将收购Twitter，以及美国大选的临近，创造一个更健康的话语空间的时间很短，所以请今天就捐款。\n",
  "description_zh-Hant": "親愛的支持者們，<p>我需要你們的幫助。<p>世界上所有的問題，我已經著手嘗試用WikiTribune Social來解決，但還是和以前一樣糟糕。我們都看到，埃隆-馬斯克有可能會買下twitter，並將其變成一個激進的言論自由的巨魔區。他本身就因在twitter上的不良行為而臭名昭著--他肯定不會讓twitter的毒性降低。他承諾以 \"言論自由 \"的名義讓唐納德-特朗普回到平臺上，但我們要清楚他真正想要什麼。特朗普讓twitter在世界每家報紙的頭版上停留了半個月，讓他回來對他們來說是非常有利的，不管付出什麼代價。<p>WikiTribune有一個不同的模式。可以肯定的是，這是一個奇怪的模式，但這是我相信的模式。我們不希望我們的平臺通過專注於通過最大限度地增加上癮和憤怒而擁有儘可能多的頁面瀏覽量來發展。我們希望建立一個像你這樣的人足夠關心的東西，並自願在經濟上給予支持。這是一個 \"你想要就付錢 \"的模式。我曾多次開玩笑說--把東西送出去並希望人們自願支持它們，這可能不是一個偉大的商業模式--但這是我迄今為止建立自己事業的方式！我們的資金嚴重短缺。\n我們嚴重缺乏資金<p>沒有什麼簡單的方法可以避免說出來。我選擇不籌集風險投資資金，因為我想保持完全的創造性控制，以建立我心中的願景。在過去的兩年中，我個人一直是這個項目的主要資助者--但這使我的個人資源變得緊張。<p>在過去的幾個月中，我們已經回到了代碼庫，並從頭開始完全重新構建它，吸取了我們迄今為止學到的所有東西。我們有一個很好的小社區，新的軟件將有新的方法來支持和獎勵人們發表高質量的帖子（而不是所有其他社交網絡獎勵人們發表病毒性的上癮的廢話）。完成這一重新設計將產生巨大的影響。我很興奮！<p>但要完成，我需要你的支持。我必須支付完成新版網站的開發工作，我還需要做一些公關和營銷工作，讓大家知道。我需要真正開始推動這項工作的重新啟動。如果你們每個人都能付出哪怕一點點，我想我們就有機會做出一些革命性的新東西。除非我們繼續嘗試，否則我們不會知道。<p>這是我們的機會，通過提供更好的替代方案來打破有毒的社交媒體的背景。隨著馬斯克即將收購Twitter，以及美國大選的臨近，創造一個更健康的話語空間的時間很短，所以請今天就捐款。\n"
}