{
  "@type": "NewsArticle",
  "identifier": "2022--07--29--en--myfeed--HackerNews--NewsArticle--32280981",
  "url": "https://news.ycombinator.com/item?id=32280981",
  "headline": "If your heart’s in it, money follows – Alexander Isora, Unicorn Platform $16k/mo",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "“It was my fault. I didn’t join because of the startup’s mission or values. I joined because I wanted to make fast money, and that was a mistake. I quit a year and a half ago. But I returned from the chaos and failure with new clarity. I realized that you have to focus on your passion, rather than just making money. I asked ‘life’ what I should do and I wrote a list of my passions. Web design was at the top. That’s when I came up with the idea for my next business. I started working on it and I didn’t panic about money because I really felt like I was in the flow of life. I asked life again to support me with money while I worked on my project — and money came. I didn’t have to boil an ocean or shake the ground to get it. People just appeared that wanted to support me. When I was ready, I immediately sold about 50 subscriptions to my platform, which allowed me eight months to work on it. It was so easy. This has been the brightest part of my life. I’ve learned that if you’re checking off your to-do list and your heart isn’t there, something needs to change. I try to stay in the flow of life as much as possible now, moment-to-moment. And doors just keep opening for me.” (from an interview in 2019)\n⠀\nAlexander Isora • Saint Petersburg, Russia⠀\nFounder of Unicorn Platform<p>Current MRR: $16,376\n Total users: 23,910\n Total paid subscribers: 954 \n MRR Churn: 8%",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "teela_na",
    "url": "https://news.ycombinator.com/user?id=teela_na"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32280981",
  "sameAs": "https://news.ycombinator.com/item?id=32280981",
  "dateCreated": "2022-07-29T19:41:29.077Z",
  "datePublished": "2022-07-29T19:40:04.000Z",
  "dateModified": "2022-07-29T19:41:29.077Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "如果你的心在里面，钱就在后面 - 亚历山大-伊索拉，独角兽平台16000美元/月\n",
  "headline_zh-Hant": "如果你的心在裡面，錢就在後面 - 亞歷山大-伊索拉，獨角獸平臺16000美元/月\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "\"这是我的错。我不是因为创业公司的使命或价值观而加入的。我加入是因为我想赚快钱，这是个错误。我在一年半前辞职了。但我从混乱和失败中回来后，有了新的清醒认识。我意识到，你必须专注于你的激情，而不仅仅是挣钱。我问 \"生活 \"我应该做什么，我写了一份我的激情清单。网页设计被排在了首位。就在那时，我想到了我的下一个业务的想法。我开始工作，我没有为钱而惊慌失措，因为我真的觉得我是在生活的流中。我再次要求生活在我的项目工作时用钱来支持我--钱就来了。我不需要煮沸海洋或摇动地面来获得它。人们只是出现了想要支持我。当我准备好的时候，我立即卖出了大约50个订阅我的平台，这让我有八个月的时间来进行工作。这真是太容易了。这是我生命中最光明的部分。我了解到，如果你正在检查你的待办事项清单，而你的心不在那里，那么有些事情需要改变。我现在尽量保持在生活的流程中，每时每刻。而大门就这样不断地为我打开。\" (来自2019年的一次采访)\n⠀\n亚历山大-伊索拉 - 俄罗斯，圣彼得堡⠀\n独角兽平台的创始人<p>目前的MRR：16,376美元\n 总用户数：23,910\n 总的付费用户。954 \n MRR流失率：8%。\n",
  "description_zh-Hant": "\"這是我的錯。我不是因為創業公司的使命或價值觀而加入的。我加入是因為我想賺快錢，這是個錯誤。我在一年半前辭職了。但我從混亂和失敗中回來後，有了新的清醒認識。我意識到，你必須專注於你的激情，而不僅僅是掙錢。我問 \"生活 \"我應該做什麼，我寫了一份我的激情清單。網頁設計被排在了首位。就在那時，我想到了我的下一個業務的想法。我開始工作，我沒有為錢而驚慌失措，因為我真的覺得我是在生活的流中。我再次要求生活在我的項目工作時用錢來支持我--錢就來了。我不需要煮沸海洋或搖動地面來獲得它。人們只是出現了想要支持我。當我準備好的時候，我立即賣出了大約50個訂閱我的平臺，這讓我有八個月的時間來進行工作。這真是太容易了。這是我生命中最光明的部分。我瞭解到，如果你正在檢查你的待辦事項清單，而你的心不在那裡，那麼有些事情需要改變。我現在儘量保持在生活的流程中，每時每刻。而大門就這樣不斷地為我打開。\" (來自2019年的一次採訪)\n⠀\n亞歷山大-伊索拉 - 俄羅斯，聖彼得堡⠀\n獨角獸平臺的創始人<p>目前的MRR：16,376美元\n 總用戶數：23,910\n 總的付費用戶。954 \n MRR流失率：8%。\n"
}