{
  "@type": "NewsArticle",
  "identifier": "2022--04--25--en--myfeed--HackerNews--NewsArticle--31150817",
  "url": "https://news.ycombinator.com/item?id=31150817",
  "headline": "NFT Tool – Feedback Wanted",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm currently building a Ethereum NFT Rarity Lookup Tool (whoa, I need a shorter way to describe this :D). We are fetching every token in a collection, analyze their metadata and rank them accordingly.<p>You can check it out here: https://cavar.io/<p>I've launched last week and I'm looking for feedback. So if you have NFTs, thinking of buying or have a general interest in the topic I would love to get your feedback on this.<p>Right now, we don't offer much features. But here is what we have so far:<p>Add projects(collections) to our database: Other than most rarity tools, we allow users to add projects to our database. If we don't have the collection that interests you in our database already, you can just add it. Depending on the amount of projects currently in queue it might take some time, but you can see the progress on the Projects Overview Page: https://cavar.io/projects<p>Projects Rarity Ranking: You can see all tokens in a project on the Project Detail Page (for example: https://cavar.io/project/proof-moonbirds). You see what see the ranking for each token at first glance. If you want to get more information about a specific token, just go to the:<p>Token Detail Page: Here you can see the traits and the respective values of the token (Example: https://cavar.io/project/boredapeyachtclub/1337/129943780)<p>We're adding new features on a daily basis. But most importantly: We're constantly fixing bugs (because we're still in alpha stage). Right now, our tool is FREE to use and we would appreciate any kind of feedback.<p>If you have feedback, please use the Feedback button on our page, leave me a comment here or hit us up on Twitter: https://twitter.com/cavarioNFT",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "cavario",
    "url": "https://news.ycombinator.com/user?id=cavario"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31150817",
  "sameAs": "https://news.ycombinator.com/item?id=31150817",
  "dateCreated": "2022-04-25T06:58:20.078Z",
  "datePublished": "2022-04-25T04:45:16.000Z",
  "dateModified": "2022-04-25T06:58:20.078Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "NFT工具--希望得到反馈",
  "headline_zh-Hant": "NFT工具--希望得到反饋",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我目前正在建立一个Ethereum NFT Rarity Lookup Tool（哇，我需要一个更简短的方式来描述这个：D）。我们正在获取一个集合中的每一个代币，分析它们的元数据并对它们进行相应的排名。<p>你可以在这里查看：https://cavar.io/<p>我已经在上周推出，我正在寻找反馈。因此，如果你有NFT，考虑购买或对这个主题有一般的兴趣，我希望得到你的反馈。<p>现在，我们没有提供太多的功能。但以下是我们目前拥有的功能：<p>向我们的数据库添加项目（收藏）。除了大多数稀有性工具外，我们允许用户向我们的数据库添加项目。如果我们的数据库中已经没有你感兴趣的藏品，你可以直接添加它。根据目前排队的项目数量，这可能需要一些时间，但你可以在项目概览页面看到进展：https://cavar.io/projects<p>项目稀有度排名。你可以在项目详情页上看到一个项目中的所有代币（例如：https://cavar.io/project/proof-moonbirds）。你看到的是看到每个代币的排名，一目了然。如果你想获得关于某个特定代币的更多信息，只需进入：<p>代币详情页。在这里你可以看到该代币的特质和各自的价值（例如：https://cavar.io/project/boredapeyachtclub/1337/129943780）<p>我们每天都在增加新的功能。但最重要的是。我们正在不断地修复错误（因为我们仍处于阿尔法阶段）。现在，我们的工具是免费使用的，我们将感谢任何形式的反馈。<p>如果你有反馈，请使用我们页面上的反馈按钮，在这里给我留言或在Twitter上联系我们：https://twitter.com/cavarioNFT",
  "description_zh-Hant": "我目前正在建立一個Ethereum NFT Rarity Lookup Tool（哇，我需要一個更簡短的方式來描述這個：D）。我們正在獲取一個集合中的每一個代幣，分析它們的元數據並對它們進行相應的排名。<p>你可以在這裡查看：https://cavar.io/<p>我已經在上週推出，我正在尋找反饋。因此，如果你有NFT，考慮購買或對這個主題有一般的興趣，我希望得到你的反饋。<p>現在，我們沒有提供太多的功能。但以下是我們目前擁有的功能：<p>向我們的數據庫添加項目（收藏）。除了大多數稀有性工具外，我們允許用戶向我們的數據庫添加項目。如果我們的數據庫中已經沒有你感興趣的藏品，你可以直接添加它。根據目前排隊的項目數量，這可能需要一些時間，但你可以在項目概覽頁面看到進展：https://cavar.io/projects<p>項目稀有度排名。你可以在項目詳情頁上看到一個項目中的所有代幣（例如：https://cavar.io/project/proof-moonbirds）。你看到的是看到每個代幣的排名，一目瞭然。如果你想獲得關於某個特定代幣的更多信息，只需進入：<p>代幣詳情頁。在這裡你可以看到該代幣的特質和各自的價值（例如：https://cavar.io/project/boredapeyachtclub/1337/129943780）<p>我們每天都在增加新的功能。但最重要的是。我們正在不斷地修復錯誤（因為我們仍處於阿爾法階段）。現在，我們的工具是免費使用的，我們將感謝任何形式的反饋。<p>如果你有反饋，請使用我們頁面上的反饋按鈕，在這裡給我留言或在Twitter上聯繫我們：https://twitter.com/cavarioNFT"
}