{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--myfeed--HackerNews--NewsArticle--32296364",
  "url": "https://news.ycombinator.com/item?id=32296364",
  "headline": "(Programmers) Thoughts on getting more and more responsibility but no extra pay?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm a mid-level software engineer, with both junior and senior developers in the team.<p>Our new manager is super keen on delegating work to the rest of the team. I keep finding myself being dragged into a random meetings that I have no idea about, where I'm expected to wing it, all because she invited me along without me knowing.<p>She's decided to make the developers run stand up each morning, along with other regular meetings, to free up her time, as if it wasn't degrading enough for us.<p>I've also been dragged into teaching other teams how to code, along with other &quot;confidence gaining&quot; objectives, all whilst still doing my actual work.<p>This is all being disguised as &quot;personal development&quot;, that will help us &quot;gain confidence&quot; but we're really just being taken advantage of.<p>I can see this quickly becoming an issue. I know it's not a good mindset to have but I should just be nailing tickets and writing code, yet I'm slowly but surely taking on the load of a senior / management position. How tf do you handle this?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "DanUKs",
    "url": "https://news.ycombinator.com/user?id=DanUKs"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32296364",
  "sameAs": "https://news.ycombinator.com/item?id=32296364",
  "dateCreated": "2022-07-31T15:59:50.968Z",
  "datePublished": "2022-07-31T15:49:42.000Z",
  "dateModified": "2022-07-31T15:59:50.968Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "(程序员)对越来越多的责任却没有额外报酬的想法？\n",
  "headline_zh-Hant": "(程序員)對越來越多的責任卻沒有額外報酬的想法？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一名中级软件工程师，团队里有初级和高级开发人员。<p>我们的新经理超级热衷于将工作分配给团队的其他成员。我总是发现自己被拖进一个我不知道的随机会议，在那里我被期望翼，所有这些都是因为她在我不知道的情况下邀请我一起参加。<p>她决定让开发人员每天早上和其他定期会议一起站起来，以释放她的时间，好像这对我们来说还不够堕落似的。 <p>我还被拉去教其他团队如何编写代码，以及其他 \"获得信心 \"的目标，同时还在做我的实际工作。<p>这一切都被伪装成 \"个人发展\"，这将有助于我们 \"获得信心\"，但我们实际上只是被利用了。我知道这不是一个好的心态，但我应该只是在钉票和写代码，但我正在慢慢地但肯定地承担起一个高级/管理职位的负担。你是如何处理这个问题的？\n",
  "description_zh-Hant": "我是一名中級軟件工程師，團隊裡有初級和高級開發人員。<p>我們的新經理超級熱衷於將工作分配給團隊的其他成員。我總是發現自己被拖進一個我不知道的隨機會議，在那裡我被期望翼，所有這些都是因為她在我不知道的情況下邀請我一起參加。<p>她決定讓開發人員每天早上和其他定期會議一起站起來，以釋放她的時間，好像這對我們來說還不夠墮落似的。 <p>我還被拉去教其他團隊如何編寫代碼，以及其他 \"獲得信心 \"的目標，同時還在做我的實際工作。<p>這一切都被偽裝成 \"個人發展\"，這將有助於我們 \"獲得信心\"，但我們實際上只是被利用了。我知道這不是一個好的心態，但我應該只是在釘票和寫代碼，但我正在慢慢地但肯定地承擔起一個高級/管理職位的負擔。你是如何處理這個問題的？\n"
}