{
  "@type": "NewsArticle",
  "identifier": "2022--06--11--en--myfeed--ben-werdmuller--NewsArticle--f48c127706f4eef96b92e3f01fc31d21",
  "url": "https://werd.io/2022/for-the-upside",
  "headline": "For the upside",
  "publisher": {
    "@type": "Organization",
    "name": "werd.io",
    "url": "https://werd.io/feed/"
  },
  "description": "<div class=\"e-content entry-content\">\n<p>“That’s really why you join a startup,” someone said to me recently, over a phone call. “For the financial upside.”</p><p>I retained my composure, but I found it more jarring than I let on: I’ve never joined a startup for the financial upside. <em>Should</em> I have?</p><p>I made some kind of tempered comment about it being okay to want to make a Steve Jobsian dent in the universe. For me, it’s not even about that: Steve Jobs was famously an asshole to his employees, a die-hard capitalist who would jettison people who he felt didn’t live up to his singular vision. I don’t find that inspiring, and I think there’s something fundamentally wrong with being inspired by someone who doesn’t treat people around them well.</p><p>For me, it’s always been about community and social change. The internet has transformed the way we communicate, do business, and live our lives on a fundamental level. It’s hard to remember a world before we could order anything on Amazon, or access virtually all human knowledge through a screen - but it’s only been a few decades. The ubiquitous internet is only really as old as the iPhone 3G: thirteen years of high-speed change. It’s been no time at all.</p><p>I love technology. It’s in my blood: I learned to write words and code at the same time. I love programming, and I love trying new technologies. Well-designed hardware and software is still like magic to me. But together with the ability to connect with anyone, anywhere, came a brand of highly-centralized, unfettered capitalism. Companies like Uber intentionally decimated markets and livelihoods by staying one step ahead of changing legislation. Hard-won liberties like the eight hour workday were bulldozed through the gig economy. These are things that are hard to love.</p><p>I’m far from a libertarian. Maybe it’s the European in me - I went to university for free, depended on free healthcare, and was delighted by the quality of both - but strong safety nets and protection from poverty and violence seem to me like fundamental tenets of a well-functioning society. To me, a financially efficient market is not the same as an optimal one; rather than focusing on growth, we should be optimizing for inclusion, care, empathy, and quality of life.</p><p>There’s always been an underlying libertarianism in tech. But the internet’s exponential growth brought in a kind of coin-operated mentality that’s slowly become the prevailing culture. Some people got rich very, very quickly, so there was an influx of people who wanted to get rich quick too. For them, safety nets and regulations were just barriers to “innovation”; in this context, innovation just meant finding ways to make money more quickly through software. Through their lens, a high-speed global communications network seems like little more than a way to build hyper-effective monopolies. Even the modern decentralization movement, which to its credit is partially about making monopolies impossible, is largely fueled by greed.</p><p>It doesn’t have to be that way. I’m far from the only technologist who sits far from that mindset. Just as unions provide a much-needed worker-oriented counter-force to leadership and capital, there’s room for communities in tech that push for more utopian ideals. They may be underfunded in comparison, but they’re passionate, they’re smart, and they affect the trajectory of the whole internet.</p><p>The startups I’ve founded have been direct reactions to centralized tendencies. Elgg, an open source white label community platform, was originally designed as a response to proprietary learning management systems that cost taxpayer-funded universities millions of dollars through predatory business models. It later became a way for people to run communities that weren’t subject to Facebook’s rules and surveillance. Known was in some ways a second run at that idea: a way for anyone to run their own social profile, or a profile for a group, that was fully under their control. I saw early that dependence on sites like Facebook had the potential to undermine democracy, and this was my attempt to do something about it.</p><p>I’ve never joined a startup because I wanted to get rich. I’ve usually joined because I saw major social problems that I wanted to help solve: in news-gathering, in sustainability for independent creators, in financial safety. I’ve never been alone, but I’ve always been in the minority: communities of people who see a problem that the industry at large doesn’t seem to care about at best, or at worst wants to exploit for financial gain. Those are the people I’m grateful to work alongside.</p><p>Another person told me recently that I had given them the confidence to renegotiate a work situation based on their values. They hadn’t previously thought it was possible to do work in this industry and stay true to their principles; I had shown them that it was at least possible to fight for them. That gives me hope. It’s another good reason to make the choices I do.</p><p>“That’s really why you join a startup,” that first person told me over the phone. “For the financial upside.” Respectfully, I have to disagree.</p></div>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Ben Werdmüller",
    "url": "https://werd.io/feed/"
  },
  "discussionUrl": "https://werd.io/2022/for-the-upside",
  "sameAs": "https://werd.io/2022/for-the-upside",
  "dateCreated": "2022-06-11T17:56:21.359Z",
  "datePublished": "2022-05-29T19:12:39.000Z",
  "dateModified": "2022-06-11T17:56:21.359Z",
  "interactionStatistic": [],
  "headline_zh-Hans": "对于上升期\n",
  "headline_zh-Hant": "對於上升期\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1
    }
  ]
}