{
  "@type": "NewsArticle",
  "identifier": "2022--07--15--en--myfeed--HackerNews--NewsArticle--32111505",
  "url": "https://news.ycombinator.com/item?id=32111505",
  "headline": "My father still doesn't know how to copy and paste text",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Just a small story that should serve as a reality check for me and perhaps others here.<p>As programmers and technology experts, we realize that most people do not understand machine-learning or other Computer Science things, but might assume that by CURRENT_YEAR working age people generally understand basic computer usage. Wow-oh-wow: no.<p>I'm currently visiting the parents for a mini-vacation for a couple of weeks. Since I'm the resident expert, my father asked me for some help with a computer task on his Mac. No problem.<p>In the process of talking him through the issue, I asked him to copy-and-paste some text. He didn't understand what I meant. I'm not talking about not memorizing the keyboard shortcuts, but he was genuinely not understanding what copying and pasting even referred to. He was struggling with the mental concept of selecting and copying text in one program and pasting it for use elsewhere in another program.  Walking him through the process (which I'm certain he didn't really understand) took several frustrating minutes. His best understanding of how to transfer text before this was to save a file in one program and try and open it in another program.<p>My father is not a techie by any means, but he's used a computer daily for recreation at least the last 15 years on both Mac and Windows, managed the household technology stuff, and performed normal light office tasks in the course of his work—using the Internet, typing documents, and printing them out.<p>I assume very little from an average user, but this is a hell of a reminder that:<p>* the Least Common Denominator of users still has a minimal understanding of how to use a computer despite actually using it for productive work<p>* don't understand the capabilities of their system<p>* feel incredibly frustrated when their UIs change in any way because they work by memorizing how to do tasks, not logical problem solving using their knowledge of the system<p>* most people still need to be protected from themselves and there's a reason why by default many UIs are dumbed down to what we think is an absurdly basic level",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "logicalmonster",
    "url": "https://news.ycombinator.com/user?id=logicalmonster"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32111505",
  "sameAs": "https://news.ycombinator.com/item?id=32111505",
  "dateCreated": "2022-07-15T19:21:16.574Z",
  "datePublished": "2022-07-15T18:48:19.000Z",
  "dateModified": "2022-07-15T19:21:16.574Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "我父亲仍然不知道如何复制和粘贴文本\n",
  "headline_zh-Hant": "我父親仍然不知道如何複製和粘貼文本\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>作为程序员和技术专家，我们意识到大多数人并不了解机器学习或其他计算机科学的东西，但可能会认为在CURRENT_YEAR工作年龄的人普遍了解基本的计算机使用。哇--哦--哇：不。<p>我目前正在拜访父母，进行为期几周的小型度假。由于我是常驻专家，我父亲要求我帮助他在Mac上完成一项电脑任务。没问题。<p>在和他讨论这个问题的过程中，我让他复制和粘贴一些文字。他不明白我的意思。我不是在说他没有记住键盘快捷键，而是他真的不明白复制和粘贴指的是什么。他对在一个程序中选择和复制文本并将其粘贴到另一个程序的其他地方这一心理概念感到很纠结。 指导他完成这个过程（我确信他并不真正理解）花了好几分钟，令人沮丧。在这之前，他对如何传输文本的最佳理解是在一个程序中保存一个文件，并尝试在另一个程序中打开它。<p>我父亲绝不是一个技术专家，但他至少在过去15年里每天都在Mac和Windows上使用计算机，管理家庭技术的东西，并在工作过程中执行正常的轻型办公任务--使用互联网、输入文件并打印出来。 <p>我对普通用户的假设非常少，但这是一个地狱般的提醒。 <p>* 用户中的最小公分母仍然对如何使用计算机有最低限度的了解，尽管他们实际上是在使用计算机进行生产性工作<p>* 不了解他们系统的能力<p>* 当他们的用户界面发生任何变化时，他们会感到非常沮丧，因为他们通过记忆如何做任务来工作，而不是利用他们的系统知识来解决逻辑问题<p>* 大多数人仍然需要保护自己，这就是为什么许多用户界面默认会被稀释到我们认为是一个荒谬的基本水平的原因\n",
  "description_zh-Hant": "<p>作為程序員和技術專家，我們意識到大多數人並不瞭解機器學習或其他計算機科學的東西，但可能會認為在CURRENT_YEAR工作年齡的人普遍瞭解基本的計算機使用。哇--哦--哇：不。<p>我目前正在拜訪父母，進行為期幾周的小型度假。由於我是常駐專家，我父親要求我幫助他在Mac上完成一項電腦任務。沒問題。<p>在和他討論這個問題的過程中，我讓他複製和粘貼一些文字。他不明白我的意思。我不是在說他沒有記住鍵盤快捷鍵，而是他真的不明白複製和粘貼指的是什麼。他對在一個程序中選擇和複製文本並將其粘貼到另一個程序的其他地方這一心理概念感到很糾結。 指導他完成這個過程（我確信他並不真正理解）花了好幾分鐘，令人沮喪。在這之前，他對如何傳輸文本的最佳理解是在一個程序中保存一個文件，並嘗試在另一個程序中打開它。<p>我父親絕不是一個技術專家，但他至少在過去15年裡每天都在Mac和Windows上使用計算機，管理家庭技術的東西，並在工作過程中執行正常的輕型辦公任務--使用互聯網、輸入文件並打印出來。 <p>我對普通用戶的假設非常少，但這是一個地獄般的提醒。 <p>* 用戶中的最小公分母仍然對如何使用計算機有最低限度的瞭解，儘管他們實際上是在使用計算機進行生產性工作<p>* 不瞭解他們系統的能力<p>* 當他們的用戶界面發生任何變化時，他們會感到非常沮喪，因為他們通過記憶如何做任務來工作，而不是利用他們的系統知識來解決邏輯問題<p>* 大多數人仍然需要保護自己，這就是為什麼許多用戶界面默認會被稀釋到我們認為是一個荒謬的基本水平的原因\n"
}