{
  "@type": "NewsArticle",
  "identifier": "2022--07--29--en--myfeed--HackerNews--NewsArticle--32272803",
  "url": "https://news.ycombinator.com/item?id=32272803",
  "headline": "Tell HN: Food is too expensive now",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Groceries are expensive but eating out has now become very expensive, I find myself almost not getting any take outs or eating at restaurants. Maybe once every quarter. And When I do eat out I'm always annoyed how not only prices are almost 2x, but actually it's less and taste crap compared to just 2 years ago. Imagine your favorite food spot of 10+ years suddenly trash and expensive.<p>This has objectively lowered quality of my life, I don't really buy any electronics, my phone is 6+ years old, and computer is 5 years old. I like to buy to simplest clothes in bulk 10 for $X. Because happiness from stuff just isn't there for me, I'd rather get quiet time at beach and watch sunset with a friend, or engage in intellectual debate. So food was only thing I enjoyed getting. Now it cost $170+ for family portion, and $25+ at cheapest place for 1.<p>Sure It's affordable for me at my tech salary, but I'm not going to be spending more on food than rent. Is there hope on the horizon? why wont' govt do something to bring prices down, bring deflation.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "techsin101",
    "url": "https://news.ycombinator.com/user?id=techsin101"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32272803",
  "sameAs": "https://news.ycombinator.com/item?id=32272803",
  "dateCreated": "2022-07-29T09:26:38.793Z",
  "datePublished": "2022-07-29T03:23:18.000Z",
  "dateModified": "2022-07-29T09:26:38.793Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 21
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 44
    }
  ],
  "headline_zh-Hans": "告诉HN：现在食物太贵了\n",
  "headline_zh-Hant": "告訴HN：現在食物太貴了\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "杂货很贵，但现在外出就餐已经变得非常昂贵，我发现自己几乎没有得到任何外卖或在餐馆吃饭。也许每季度一次。当我在外面吃饭时，我总是很恼火，不仅价格几乎是2倍，而且实际上与两年前相比，价格更低，味道更差。想象一下，你最喜欢的10多年的食物地点突然变成了垃圾，而且价格昂贵。<p>这客观上降低了我的生活质量，我不太买任何电子产品，我的手机已经6年多了，电脑也有5年了。我喜欢买最简单的衣服，散装10件X元。因为东西带来的快乐对我来说并不存在，我宁愿在海滩上安静地和朋友一起看日落，或者进行智力辩论。所以食物是我唯一喜欢得到的东西。现在，一家人吃一顿要170多美元，最便宜的地方吃一顿也要25美元。<p>当然，以我的技术工资来说，这是可以承受的，但我不会在食物上花费比房租更多。为什么政府不做些什么来降低价格，带来通货紧缩呢？\n",
  "description_zh-Hant": "雜貨很貴，但現在外出就餐已經變得非常昂貴，我發現自己幾乎沒有得到任何外賣或在餐館吃飯。也許每季度一次。當我在外面吃飯時，我總是很惱火，不僅價格幾乎是2倍，而且實際上與兩年前相比，價格更低，味道更差。想象一下，你最喜歡的10多年的食物地點突然變成了垃圾，而且價格昂貴。<p>這客觀上降低了我的生活質量，我不太買任何電子產品，我的手機已經6年多了，電腦也有5年了。我喜歡買最簡單的衣服，散裝10件X元。因為東西帶來的快樂對我來說並不存在，我寧願在海灘上安靜地和朋友一起看日落，或者進行智力辯論。所以食物是我唯一喜歡得到的東西。現在，一家人吃一頓要170多美元，最便宜的地方吃一頓也要25美元。<p>當然，以我的技術工資來說，這是可以承受的，但我不會在食物上花費比房租更多。為什麼政府不做些什麼來降低價格，帶來通貨緊縮呢？\n"
}