{
  "@type": "NewsArticle",
  "identifier": "2022--04--25--en--myfeed--HackerNews--NewsArticle--31155253",
  "url": "https://news.ycombinator.com/item?id=31155253",
  "headline": "For people using FOSS email software, how do you filter organizational spam?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Just to be specific, I am asking about a good way to manage mail in the following situation:<p>I am using an open source email client and a mail hoster who and does the usual spam filtering in an excellent and privacy-friendly way.<p>For reading mail, I use my work computer, my laptop and my phone, the first two running claws-mail and the latter K9 Mail.<p>The issue I have is that I have some parties that I need to communicate with which do the following thing:<p>They are larger companies or associations (think in online shops, recruiting companies, professional organizations, organizators of recreational activities or sites such as LinkedIn or XING).<p>These can legitimately contact me for specific purposes (I gave consent to that, and gave them my email address), but what happens is that they then use my address to contact me for their own (non-consented) purposes, for their magazine, some event, some suggestion, an opportunity, something else, yet another thing, and so on.... The purpose is clear: They want to grab as much of my attention as possible in the hope that I might engage more with their offers or activities.<p>Blacklisting such addresses does not help in the long run, because senders and domains change all the time. Possibly, they have recognized that not all their messages are wanted and could become blocked, and they are now fast-switching sender domains to get around that. The messages and newsletters might have unsubscribe links, but as soon as I unsubscribe one, I have one or two new ones.<p>Traditional keyword-based spam filtering does not help either, because they use the same terms for their legitimate stuff and the things why I did initiate the subscription / communication / registration in the first place. This would not only block /their/ site, but also mails from people that I am actually more interested in. Part of the problem is that I am actually interested in some of that stuff, but not in the actual deluge of messages.<p>What would help would be perhaps some form of whitelisting. But how to do that effectively?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jnxx",
    "url": "https://news.ycombinator.com/user?id=jnxx"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31155253",
  "sameAs": "https://news.ycombinator.com/item?id=31155253",
  "dateCreated": "2022-04-25T14:40:07.475Z",
  "datePublished": "2022-04-25T14:25:00.000Z",
  "dateModified": "2022-04-25T14:40:07.475Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "对于使用FOSS电子邮件软件的人来说，你是如何过滤组织性垃圾邮件的？",
  "headline_zh-Hant": "對於使用FOSS電子郵件軟件的人來說，你是如何過濾組織性垃圾郵件的？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "具体来说，我想问一下在以下情况下管理邮件的好方法：<p>我正在使用一个开源的电子邮件客户端和一个邮件主机，该主机以一种出色的、对隐私友好的方式进行通常的垃圾邮件过滤。<p>对于阅读邮件，我使用我的工作电脑、我的笔记本电脑和我的手机，前两者运行claws-mail，后者使用K9 Mail。 <p>我遇到的问题是，我有一些需要与之沟通的方面，它们做了以下事情：<p>它们是较大的公司或协会（想想在网上商店、招聘公司、专业组织、娱乐活动的组织者或诸如LinkedIn或XING等网站）。 <p>这些可以出于特定的目的合法地与我联系（我同意这样做，并把我的电子邮件地址给了他们），但发生的情况是，他们随后使用我的地址为他们自己的（非同意的）目的与我联系，为他们的杂志、一些活动、一些建议、一个机会、其他的东西、又一个东西，等等....。目的很明确：他们想尽可能多地抓住我的注意力，希望我可能会更多地参与他们的提议或活动。<p>从长远来看，将这些地址列入黑名单并没有帮助，因为发送者和域名一直在变化。可能，他们已经认识到不是所有的信息都被需要，而且可能会被屏蔽，他们现在正在快速切换发件人的域名来绕过这个问题。<p>传统的基于关键词的垃圾邮件过滤也无济于事，因为他们对合法的东西和我首先发起的订阅/通信/注册的东西使用同样的术语。这不仅会阻止他们的网站，也会阻止来自我真正感兴趣的人的邮件。部分问题是，我实际上对其中的一些东西感兴趣，但对实际的大量信息不感兴趣。<p>有帮助的也许是某种形式的白名单。但如何有效地做到这一点呢？",
  "description_zh-Hant": "具體來說，我想問一下在以下情況下管理郵件的好方法：<p>我正在使用一個開源的電子郵件客戶端和一個郵件主機，該主機以一種出色的、對隱私友好的方式進行通常的垃圾郵件過濾。<p>對於閱讀郵件，我使用我的工作電腦、我的筆記本電腦和我的手機，前兩者運行claws-mail，後者使用K9 Mail。 <p>我遇到的問題是，我有一些需要與之溝通的方面，它們做了以下事情：<p>它們是較大的公司或協會（想想在網上商店、招聘公司、專業組織、娛樂活動的組織者或諸如LinkedIn或XING等網站）。 <p>這些可以出於特定的目的合法地與我聯繫（我同意這樣做，並把我的電子郵件地址給了他們），但發生的情況是，他們隨後使用我的地址為他們自己的（非同意的）目的與我聯繫，為他們的雜誌、一些活動、一些建議、一個機會、其他的東西、又一個東西，等等....。目的很明確：他們想盡可能多地抓住我的注意力，希望我可能會更多地參與他們的提議或活動。<p>從長遠來看，將這些地址列入黑名單並沒有幫助，因為發送者和域名一直在變化。可能，他們已經認識到不是所有的信息都被需要，而且可能會被屏蔽，他們現在正在快速切換髮件人的域名來繞過這個問題。<p>傳統的基於關鍵詞的垃圾郵件過濾也無濟於事，因為他們對合法的東西和我首先發起的訂閱/通信/註冊的東西使用同樣的術語。這不僅會阻止他們的網站，也會阻止來自我真正感興趣的人的郵件。部分問題是，我實際上對其中的一些東西感興趣，但對實際的大量信息不感興趣。<p>有幫助的也許是某種形式的白名單。但如何有效地做到這一點呢？"
}