{
  "@type": "NewsArticle",
  "identifier": "2022--06--22--en--myfeed--HackerNews--NewsArticle--31838764",
  "url": "https://news.ycombinator.com/item?id=31838764",
  "headline": "Launch HN: Astro (YC W21) – Build your own dev teams in Latin America",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Howdy HN!<p>We’re Jacqueline and Frank from Astro (<a href=\"https://www.tryastro.com/\" rel=\"nofollow\">https://www.tryastro.com/</a>). We’re a platform that gives you access to engineering talent in Latin America and lets you build teams there. We take care of the sourcing, payroll, HR, benefits, local procurement, and equipment, all from an easy-to-use dashboard. (Video here: <a href=\"https://www.youtube.com/watch?v=RmiVOVfbHFI\" rel=\"nofollow\">https://www.youtube.com/watch?v=RmiVOVfbHFI</a>)<p>Before starting Astro, we worked as leaders at the same company, Jacqueline in sales and Frank in engineering. As we built our teams, we found it was very hard to compete against top tech companies for talent. Therefore, we broadened our search beyond Austin, Texas.<p>We ended up working with various partners in Latin America because of the strong talent pool, great English, and US friendly time zones. However, finding and retaining engineering teams in Latin America was a challenge. We loved our teammates, but were never thrilled about the outsourcing firms they worked for. Because they weren’t our employees, we couldn’t control what they were being paid, couldn’t give them benefits and perks, and the only visibility we had was the $150/hr bill we got from the outsourcing company. How much of that actually went to the team?<p>Because traditional outsourcing firms tend to attract non-tech clients and their culture revolves around billable hours, our team members were also unsatisfied with the outsourcing company that they worked for. Freelancing could be an alternative, but is also difficult for teams in Latin America due to its inherent risk and likelihood of being treated as a second class contractor on a foreign team rather than a first-class stakeholder.<p>We were stuck with three uncomfortable options: outsource the entire product, manage a large team of independent freelancers, or rely on an outsourcing company to create our engineering culture.<p>What we really wanted were our own teams, including our own offices, equipment, salaries, benefits, etc. But setting up a foreign entity and knowing how to hire in foreign markets was a distraction and difficult—not to mention payroll, benefits, procurement, legal compliance, etc.<p>We ultimately went to work at different companies, but continued to experience the same pain points at our new companies. Finally, in 2018, after commiserating many times over beers, we decided to build the company we kept looking for, a company to automatically handle all of these international complexities.<p>We originally called ourselves Austin Software and we started by building teams by hand for startups in Austin, Texas. Then, we started to realize we had gotten good at solving lots of problems on behalf of teams in the US: sourcing Macbooks, finding competitive local benefits and perks, legal compliance, even organizing happy hours, travel and SWAG. Our idea was to productize what we’d learned and make it available to other companies. We got tired of explaining that we build teams, not bill project hours! So we built Astro (“Austin Software Tool for Recommendations and Opportunities” :)<p>You can think of Astro as something like a love child between Toptal + Gusto + WeWork + Amazon (the latter because of the logistics we do — more on that below), tailored specifically for software engineering teams in LATAM. Unlike Toptal or Turing, we fulfill local benefits, equipment, even team-building events. Our pricing is also transparent, in contrast to companies that charge by the hour, upfront fees, or handcuff you to long-term contracts. Customers review and pay for 1) the developer’s desired salary, 2) benefits and taxes, and 3) our 15% management fee on a week-to-week basis.<p>Here’s one example of the kind of thing we take care of. A 16 inch M1 Macbook Pro is not just a perk in Latin America, they actually save countless hours when dealing with heavy dev environments. But they’re difficult to source in Latin America, especially outside of the handful of major cities. And even if they are sourced, they’re extremely expensive, especially if they know you’re an American company, and getting them to teammates across South America runs the risk of theft or damage. We solve this by having local entities, local logistics, local distribution and secure local offices.<p>We’re proud of the fact that developers in Latin America have a much better experience working with us. That’s because our customers (i.e. the companies using Astro) are looking to scale their engineering departments with long-term stakeholders, not temporary “horsepower”, and also because real tech culture (the sort of thing devs in Silicon Valley take for granted) is a huge draw for developers, but nearly impossible to find via outsourcing shops, and very hit-and-miss on Toptal/Turing.<p>We hope you’ll try us out! Visit <a href=\"https://www.TryAstro.com\" rel=\"nofollow\">https://www.TryAstro.com</a>, and configure your desired team (See video tutorial and screenshots below if you're just curious). Astro will source, pre-vet, schedule interviews, send offer letters, manage employment contracts, and coordinate equipment, office space, and SWAG. Once that’s set up, you can use Astro to manage your team on an ongoing basis: salaries, bonuses, additional benefits, perks, equipment, etc.<p>We’d love to hear your feedback and we’re excited to answer any questions!<p>Checkout some screenshots here: <a href=\"https://drive.google.com/drive/folders/17qYsZLKrhPdE1Ud1LA5A8RYNZiJkXo41\" rel=\"nofollow\">https://drive.google.com/drive/folders/17qYsZLKrhPdE1Ud1LA5A...</a>\nCheckout a video tutorial here: <a href=\"https://www.youtube.com/watch?v=RmiVOVfbHFI\" rel=\"nofollow\">https://www.youtube.com/watch?v=RmiVOVfbHFI</a>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "FrankLicea",
    "url": "https://news.ycombinator.com/user?id=FrankLicea"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31838764",
  "sameAs": "https://news.ycombinator.com/item?id=31838764",
  "dateCreated": "2022-06-22T17:15:12.298Z",
  "datePublished": "2022-06-22T17:07:15.000Z",
  "dateModified": "2022-06-22T17:15:12.298Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Launch HN: Astro (YC W21) - 在拉丁美洲建立自己的开发团队\n",
  "headline_zh-Hant": "Launch HN: Astro (YC W21) - 在拉丁美洲建立自己的開發團隊\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Howdy HN!<p>We’re Jacqueline and Frank from Astro (<a href=\"https://www.tryastro.com/\" rel=\"nofollow\">https://www.tryastro.com/</a>). We’re a platform that gives you access to engineering talent in Latin America and lets you build teams there. We take care of the sourcing, payroll, HR, benefits, local procurement, and equipment, all from an easy-to-use dashboard. (Video here: <a href=\"https://www.youtube.com/watch?v=RmiVOVfbHFI\" rel=\"nofollow\">https://www.youtube.com/watch?v=RmiVOVfbHFI</a>)<p>Before starting Astro, we worked as leaders at the same company, Jacqueline in sales and Frank in engineering. As we built our teams, we found it was very hard to compete against top tech companies for talent. Therefore, we broadened our search beyond Austin, Texas.<p>We ended up working with various partners in Latin America because of the strong talent pool, great English, and US friendly time zones. However, finding and retaining engineering teams in Latin America was a challenge. We loved our teammates, but were never thrilled about the outsourcing firms they worked for. Because they weren’t our employees, we couldn’t control what they were being paid, couldn’t give them benefits and perks, and the only visibility we had was the $150/hr bill we got from the outsourcing company. 由于传统的外包公司倾向于吸引非技术客户，而且他们的文化围绕着计费时间，我们的团队成员也对他们所工作的外包公司不满意。自由职业可能是一种选择，但对拉丁美洲的团队来说也很困难，因为它有固有的风险，而且有可能被当作外国团队的二等承包商，而不是一等利益相关者。<p>我们被三种令人不舒服的选择所困：将整个产品外包出去，管理一个由独立自由职业者组成的大型团队，或者依靠外包公司来创造我们的工程文化。<p>我们真正想要的是自己的团队，包括自己的办公室、设备、工资和福利等。但是，建立一个外国实体并知道如何在外国市场上招聘是一件令人分心和困难的事情--更不用说工资、福利、采购、法律合规等等。<p>我们最终去了不同的公司工作，但在新公司继续经历着同样的痛点。最后，在2018年，在多次喝着啤酒惺惺相惜之后，我们决定建立我们一直在寻找的公司，一个自动处理所有这些国际复杂问题的公司。<p>我们最初称自己为奥斯汀软件公司，我们开始为德克萨斯州奥斯汀的初创公司手工建立团队。然后，我们开始意识到，我们已经善于代表美国的团队解决很多问题：采购Macbook，寻找有竞争力的当地福利和津贴，法律合规，甚至组织快乐时光、旅行和SWAG。我们的想法是将我们学到的东西产品化，并提供给其他公司。我们已经厌倦了解释我们建立团队，而不是计算项目时间！所以我们建立了Astro（\"奥斯汀软件\"）。因此，我们建立了Astro（\"奥斯汀推荐和机会的软件工具\":）<p>你可以把Astro看作是Toptal + Gusto + WeWork + Amazon（后者是因为我们所做的物流--下面会详细介绍）之间的爱情结晶，专门为拉丁美洲的软件工程团队量身定做。与Toptal或Turing不同的是，我们满足当地的福利、设备，甚至是团队建设活动。我们的定价也是透明的，与那些按小时收费、预付费用或将你铐在长期合同上的公司形成鲜明对比。客户审查并支付1）开发人员所需的工资，2）福利和税收，以及3）我们每周15%的管理费。<p>这里有一个例子说明我们所处理的事情。一台16英寸的M1 Macbook Pro在拉丁美洲不仅仅是一项福利，在处理繁重的开发环境时，它们实际上节省了无数的时间。但它们在拉丁美洲很难采购，特别是在少数几个主要城市之外。即使它们被采购了，它们也非常昂贵，特别是当他们知道你是一家美国公司时，而且把它们送到南美洲的队友那里有被盗或损坏的风险。我们通过拥有本地实体、本地物流、本地分销和安全的本地办公室来解决这个问题。<p>我们感到自豪的是，拉丁美洲的开发人员与我们合作的经验要好得多。这是因为我们的客户（即\n",
  "description_zh-Hant": "Howdy HN!<p>We’re Jacqueline and Frank from Astro (<a href=\"https://www.tryastro.com/\" rel=\"nofollow\">https://www.tryastro.com/</a>). We’re a platform that gives you access to engineering talent in Latin America and lets you build teams there. We take care of the sourcing, payroll, HR, benefits, local procurement, and equipment, all from an easy-to-use dashboard. (Video here: <a href=\"https://www.youtube.com/watch?v=RmiVOVfbHFI\" rel=\"nofollow\">https://www.youtube.com/watch?v=RmiVOVfbHFI</a>)<p>Before starting Astro, we worked as leaders at the same company, Jacqueline in sales and Frank in engineering. As we built our teams, we found it was very hard to compete against top tech companies for talent. Therefore, we broadened our search beyond Austin, Texas.<p>We ended up working with various partners in Latin America because of the strong talent pool, great English, and US friendly time zones. However, finding and retaining engineering teams in Latin America was a challenge. We loved our teammates, but were never thrilled about the outsourcing firms they worked for. Because they weren’t our employees, we couldn’t control what they were being paid, couldn’t give them benefits and perks, and the only visibility we had was the $150/hr bill we got from the outsourcing company. 由於傳統的外包公司傾向於吸引非技術客戶，而且他們的文化圍繞著計費時間，我們的團隊成員也對他們所工作的外包公司不滿意。自由職業可能是一種選擇，但對拉丁美洲的團隊來說也很困難，因為它有固有的風險，而且有可能被當作外國團隊的二等承包商，而不是一等利益相關者。<p>我們被三種令人不舒服的選擇所困：將整個產品外包出去，管理一個由獨立自由職業者組成的大型團隊，或者依靠外包公司來創造我們的工程文化。<p>我們真正想要的是自己的團隊，包括自己的辦公室、設備、工資和福利等。但是，建立一個外國實體並知道如何在外國市場上招聘是一件令人分心和困難的事情--更不用說工資、福利、採購、法律合規等等。<p>我們最終去了不同的公司工作，但在新公司繼續經歷著同樣的痛點。最後，在2018年，在多次喝著啤酒惺惺相惜之後，我們決定建立我們一直在尋找的公司，一個自動處理所有這些國際複雜問題的公司。<p>我們最初稱自己為奧斯汀軟件公司，我們開始為德克薩斯州奧斯汀的初創公司手工建立團隊。然後，我們開始意識到，我們已經善於代表美國的團隊解決很多問題：採購Macbook，尋找有競爭力的當地福利和津貼，法律合規，甚至組織快樂時光、旅行和SWAG。我們的想法是將我們學到的東西產品化，並提供給其他公司。我們已經厭倦瞭解釋我們建立團隊，而不是計算項目時間！所以我們建立了Astro（\"奧斯汀軟件\"）。因此，我們建立了Astro（\"奧斯汀推薦和機會的軟件工具\":）<p>你可以把Astro看作是Toptal + Gusto + WeWork + Amazon（後者是因為我們所做的物流--下面會詳細介紹）之間的愛情結晶，專門為拉丁美洲的軟件工程團隊量身定做。與Toptal或Turing不同的是，我們滿足當地的福利、設備，甚至是團隊建設活動。我們的定價也是透明的，與那些按小時收費、預付費用或將你銬在長期合同上的公司形成鮮明對比。客戶審查並支付1）開發人員所需的工資，2）福利和稅收，以及3）我們每週15%的管理費。<p>這裡有一個例子說明我們所處理的事情。一臺16英寸的M1 Macbook Pro在拉丁美洲不僅僅是一項福利，在處理繁重的開發環境時，它們實際上節省了無數的時間。但它們在拉丁美洲很難採購，特別是在少數幾個主要城市之外。即使它們被採購了，它們也非常昂貴，特別是當他們知道你是一家美國公司時，而且把它們送到南美洲的隊友那裡有被盜或損壞的風險。我們通過擁有本地實體、本地物流、本地分銷和安全的本地辦公室來解決這個問題。<p>我們感到自豪的是，拉丁美洲的開發人員與我們合作的經驗要好得多。這是因為我們的客戶（即\n"
}