{
  "@type": "NewsArticle",
  "identifier": "2022--07--01--en--myfeed--ben-werdmuller--NewsArticle--08549852dbd1e1b5e87b631cea88f92d",
  "url": "https://werd.io/2022/reading-watching-playing-using-june-2022",
  "headline": "Reading, watching, playing, using: June, 2022",
  "publisher": {
    "@type": "Organization",
    "name": "werd.io",
    "url": "https://werd.io/feed/"
  },
  "description": "<div class=\"e-content entry-content\">\n<p>This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for April, 2022.</p><h3>Books</h3><p><a href=\"https://bookshop.org/a/7949/9781735016511\">Reap3r, by Eliot Peper.</a> A page-turner set in a very familiar world to me - I had fun recognizing the scenery, the interpersonal dynamics, the cultural references. There was adventure, plausible near-future science fiction scenarios mined for tension; I had trouble putting it down, and that’s exactly what I wanted from it. Worth a read.</p><p><a href=\"https://bookshop.org/a/7949/9780525562948\">The Glass Hotel, by Emily St John Mandel.</a> Her writing style takes a lot of getting used to: not so much plot as collage. I spent the first third to a half wondering where we were going. Still, there’s an interesting story here, and well-drawn characters. The themes take some teasing out but are rewarding.</p><h3>Notable Articles</h3><h4>Business</h4><p><a href=\"https://www.bloomberg.com/news/articles/2022-06-14/starbucks-threatens-trans-benefits-in-anti-union-push-staff-say\">Starbucks Threatens Loss of Trans Benefits in Anti-Union Push, Staff Say.</a> “Starbucks Corp. managers in several states have told baristas that its vaunted transgender-inclusive health-care benefits could go away if they unionize, employees alleged in interviews and a new complaint filed with the US labor board.”</p><p><a href=\"https://www.forbes.com/sites/jenamcgregor/2022/06/09/microsoft-announces-it-will-include-pay-ranges-in-all-us-job-postings-experts-predict-it-will-be-the-first-of-many/?sh=d907a4b5c72f\">Microsoft Announces It Will Include Pay Ranges In All U.S. Job Postings. Experts Predict It Will Be The First Of Many.</a> “Changes may not ripple through big companies immediately. Many employers don’t relish sharing pay data that’s long been kept secret. Laws in some other jurisdictions that require disclosure of pay ranges—there are now six, including New York City—don’t go into effect for months, and employers have already pushed to postpone the practice there.” But when it happens - and it will - it will be a great step forward, in particular for communities that have systemically been underpaid.</p><p><a href=\"https://blogs.microsoft.com/on-the-issues/2022/06/02/employee-organizing-engagement-labor-economy/\">Microsoft adopts principles for employee organizing and engagement with labor organizations.</a> “We recognize that employees have a legal right to choose whether to form or join a union. We respect this right and do not believe that our employees or the company’s other stakeholders benefit by resisting lawful employee efforts to participate in protected activities, including forming or joining a union.” Major statement from Microsoft, breaking rank with most of the rest of the industry.</p><h4>Climate</h4><p><a href=\"https://www.technologyreview.com/2022/06/30/1055272/supreme-court-climate-policy-epa/\">The US Supreme Court just gutted federal climate policy.</a> ““Capping carbon dioxide emissions at a level that will force a nationwide transition away from the use of coal to generate electricity may be a sensible ‘solution to the crisis of the day,’” the decision reads. “But it is not plausible that Congress gave EPA the authority to adopt on its own such a regulatory scheme.””</p><p><a href=\"https://www.protocol.com/climate/ev-used-cars-exported-abroad\">The US is pushing EVs while sending its polluting gas-guzzlers abroad.</a> “But what’s missing from that agenda is any plan for how to deal with the diesel and gas-guzzling vehicles being exported in increasingly large numbers to low-income countries around the world. That essentially offshores carbon and air pollution, but in the case of the climate and public health, out of sight isn’t out of mind. That missing piece could wind up derailing the very purpose of Biden’s clean transportation plan and global climate goals.”</p><h4>Covid</h4><p><a href=\"https://apnews.com/article/covid-science-health-england-54d29ae3af5c700f15d704c14ee224b5\">COVID vaccines saved 20M lives in 1st year, scientists say.</a> “The researchers used data from 185 countries to estimate that vaccines prevented 4.2 million COVID-19 deaths in India, 1.9 million in the United States, 1 million in Brazil, 631,000 in France and 507,000 in the United Kingdom.”</p><h4>Crypto</h4><p><a href=\"https://theintercept.com/2022/06/29/crypto-coinbase-tracer-ice/?utm_source=twitter&amp;utm_campaign=theintercept&amp;utm_medium=social\">Cryptocurrency Titan Coinbase Providing “Geo Tracking Data” to ICE.</a> “Coinbase, the largest cryptocurrency exchange in the United States, is selling Immigrations and Customs Enforcement a suite of features used to track and identify cryptocurrency users, according to contract documents shared with The Intercept.”</p><p><a href=\"https://amycastor.com/2022/06/18/bitcoin-fell-below-20000-and-why-it-has-further-to-go/\">Bitcoin fell below $20,000 — and why it has further to go.</a> “Of course, everyone is asking, why did bitcoin plunge so quickly Saturday night? What pushed it below $20,000 so suddenly? Somebody is selling. Who needs to sell?”</p><p><a href=\"https://restofworld.org/2022/why-crypto-crash-different-latin-america/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=feeds\">Why the crypto crash hits different in Latin America.</a> “As the Venezuelan economist Aarón Olmos of the Institute of Higher Administrative Studies (IESA) told Rest of World, people in Latin America began turning to crypto as a way to circumvent their unstable or stagnant economies. He said that in surveys he ran with crypto users in Venezuela, the most common response was, “I would rather have a digital asset whose price goes up and down than a currency whose only real trend is down, thanks to the political economy.””</p><p><a href=\"https://www.nytimes.com/2022/06/15/technology/kraken-crypto-culture.html\">Inside a Corporate Culture War Stoked by a Crypto C.E.O.</a> “He also questioned their use of preferred pronouns and led a discussion about “who can refer to another person as the N word.” And he told workers that questions about women’s intelligence and risk appetite compared with men’s were “not as settled as one might have initially thought.”” Reprehensible.</p><p><a href=\"https://futurism.com/the-byte/anthony-hopkins-nfts\">There's an Interesting Theory About Why Anthony Hopkins Is Suddenly Shilling NFTs.</a> “Since Hopkins’ public turn towards blockchain, Twitter users have been quick to point out that CAA is an investor in the OpenSea NFT market, and others still suggested that the agency is pushing its talent to shill NFTs because of this investment.”</p><h4>Culture</h4><p><a href=\"https://www.imfineimfine.com/p/nate\">Nate.</a> “I made this comic to explain things to my family, but you can have it too.” This is delightful.</p><p><a href=\"https://boxd.it/2VtN0r\">A half star review of Top Gun: Maverick (2022).</a> “Even if one can ignore the rabidly bloodthirsty nature of this movie, it is still absolute garbage. The morals of this story are, and I am not exaggerating in the slightest: soldiers should ignore orders to stand down, and you should take actions without thinking about them. Our heroes follow these lessons throughout the story and are constantly rewarded for it. It is a child’s understanding of bravery and honor, coated in thick layers of some of the most painfully sentimental slime that Hollywood has ever produced.”</p><p><a href=\"https://www.edinburghnews.scotsman.com/whats-on/arts-and-entertainment/edinburgh-festival-fringe-phoebe-waller-bridge-heralds-new-dawn-in-major-shake-up-to-win-over-locals-and-red-card-rogue-venue-operators-3724778\">Edinburgh Festival Fringe: Phoebe Waller-Bridge heralds 'new dawn' in major shake-up to win over locals and 'red card' rogue venue operators.</a> “The Fringe Society has pledged to “eradicate” exploitative, unsafe and unfair work practices by introducing a new three-stage system, which will see event organisers banned from using the official programme, website and box office if they fall foul of official guidelines for a third time.” Good to see.</p><h4>Media</h4><p><a href=\"https://www.pewresearch.org/fact-tank/2022/06/27/twitter-is-the-go-to-social-media-site-for-u-s-journalists-but-not-for-the-public/\">Twitter is the go-to social media site for U.S. journalists, but not for the public.</a> “More than nine-in-ten journalists in the United States (94%) use social media for their jobs, according to a recent Pew Research Center survey of reporters, editors and others working in the news industry. But the sites that journalists use most frequently differ from those that the public turns to for news.”</p><p><a href=\"https://www.washingtonpost.com/media/2022/06/29/news-deserts-newspapers-democracy/\">Every week, two more newspapers close — and ‘news deserts’ grow larger.</a> “Already, some 2,500 dailies and weeklies have shuttered since 2005; there are fewer than 6,500 left. Every week, two more disappear. And although many digital-only news sites have cropped up around the nation, most communities that lost a local newspaper will not get a print or digital replacement.”</p><p><a href=\"https://www.bloomberg.com/news/articles/2022-06-21/fox-corp-loses-bid-to-toss-dominion-suit-over-election-claims\">Fox Corp. Loses Bid to Toss Dominion Defamation Lawsuit Over Vote-Rigging Claims.</a> “Delaware Superior Court Judge Eric M. Davis on Tuesday denied Fox Corp.’s motion to dismiss the suit, saying Dominion Voting Systems had shown that the Murdochs may have been on notice that the conspiracy theory that rigged voting machines tilted the vote was false but let Fox News broadcast it anyway. Dominion cited in its suit a report that Rupert Murdoch spoke with Trump a few days after the election “and informed him that he had lost,” the judge noted.”</p><h4>Politics</h4><p><a href=\"https://www.washingtonpost.com/opinions/2022/06/29/roe-v-wade-democratic-establishment-failures/\">The fall of Roe v. Wade is the culmination of the Democratic establishment’s failures.</a> “The overturning of Roe v. Wade, and the underwhelming reaction from senior Democratic leaders to that huge defeat, make the case even clearer that the party’s too-long-in-power leaders — including President Biden — need to move aside. On their watch, a radicalized Republican Party has gained so much power that it’s on the verge of ending American democracy as we know it.”</p><p><a href=\"https://www.thisisgoingtobebig.com/blog/2022/6/27/the-philosophy-that-underpins-the-right-its-not-what-you-think\">The Philosophy that Underpins the Right: It's Not What You Think.</a> A notable piece from a venture capital investor: “After the Supreme Court decision overturning Roe vs. Wade, I was chatting with someone who grew up in another country and hadn’t spent a lot of time in and around American politics. They were trying to understand the inherent contradictions between a theoretically conservative right that expands the government to legislate over personal decisions like the healthcare around a pregnancy.”</p><p><a href=\"https://19thnews.org/2022/06/companies-anti-lgbtq-bills-lawmakers/\">Pride sponsors also donate to lawmakers behind anti-LGBTQ+ bills.</a> “At least seven companies and their employee-led PACs tracked by Data for Progress continued campaign donations for the 2022 election cycle to politicians backing anti-LGBTQ+ legislation after signing a pledge against such bills from the Human Rights Campaign and Freedom for All Americans.”</p><p><a href=\"https://19thnews.org/2022/06/abortion-law-roe-v-wade-survey-voter-turnout/\">Overturning Roe v. Wade could drive voter turnout, poll finds.</a> “A Kaiser Family Foundation survey found that 64 percent of U.S adults say they do not want abortion rights to be overturned, with 37 percent of voters saying a Roe reversal would make them more motivated to vote.”</p><p><a href=\"https://www.huffpost.com/entry/far-right-idaho_n_628277e2e4b0c84db7282bd6\">Living With The Far-Right Insurgency In Idaho.</a> “A lot has been written about both the radicalization of the Republican Party and the decline of democracy in the U.S. — about the country being at a precipice. It’s maybe easy for those warnings to become background noise, or to dismiss them as doom-mongering pieces of clickbait. But in Idaho, the nightmare scenario is crossing into reality, as an authoritarian GOP sets about to create a whiter, Christian nation.”</p><p><a href=\"https://apnews.com/article/2022-midterm-elections-pennsylvania-religion-nationalism-8bf7a6115725f508a37ef944333bc145\">Christian nationalism on the rise in some GOP campaigns.</a> “According to a recent survey by the institute, white evangelical Christians were among the strongest supporters of the assertion that God intended America as a “promised land” for European Christians. Those who backed that idea were far more likely to agree that “true American patriots may have to resort to violence ... to save our country.””</p><h4>Science</h4><p><a href=\"https://futurism.com/neoscope/dyslexia-human-evolution-study\">Dyslexia Actually Grants Special Powers, Researchers Say.</a> “A team of Cambridge scientists published research in the journal Frontiers of Psychology earlier today that raises the possibility that dyslexia, which affects an estimated one in five people worldwide, could actually help the human species adapt and ensure future success.”</p><p><a href=\"https://amp.theguardian.com/australia-news/2022/jun/20/fluffy-crab-that-wears-a-sponge-as-a-hat-discovered-in-western-australia\">‘Fluffy’ crab that wears a sponge as a hat discovered in Western Australia.</a> “Hosie said it wasn’t clear why Lamarckdromia beagle was so fluffy.” But I’m glad that it is.</p><p><a href=\"https://defector.com/why-is-this-tiny-frog-so-awful-at-jumping/\">Why Is This Tiny Frog So Awful At Jumping?</a> “The pumpkin toadlet, which is a frog but not a toad, is so terrible at landing its jumps that its sheer incompetence has become a subject of scientific inquiry. A team of researchers from the United States and Brazil that includes Confetti and Singh say they have an answer: The miniaturized toadlets are so tiny that the fluid-filled chambers in their inner ears which control their balance function rather ineffectively, dooming the valiant little jumpers to a lifetime of crash landings.”</p><p><a href=\"https://www.france24.com/en/live-news/20220610-asteroid-samples-contain-clues-to-origin-of-life-japan-scientists\">Asteroid samples contain 'clues to origin of life': Japan scientists.</a> “Scientists have been questioning how organic matter -- including amino acids -- was created or where it came from, and the fact that amino acids were discovered in the sample offers a reason to think that amino acids were brought to Earth from outer space.”</p><h4>Society</h4><p><a href=\"https://www.texastribune.org/2022/06/30/texas-slavery-involuntary-relocation/\">Texas educator group proposes referring to slavery as “involuntary relocation” in second grade curriculum.</a> “This group proposing second grade curriculum revisions was given a copy of Senate Bill 3, Texas’ law that dictates how slavery and race is taught in Texas. In it, the law states that slavery can’t be taught as a true founding of the United States and that slavery was nothing more than a deviation from American values.”</p><p><a href=\"https://www.wjtv.com/news/state/1955-warrant-in-emmett-till-case-found-family-seeks-arrest/?utm_medium=referral&amp;utm_source=t.co&amp;utm_campaign=socialflow\">1955 warrant in Emmett Till case found, family seeks arrest.</a> “A team searching a Mississippi courthouse basement for evidence about the lynching of Black teenager Emmett Till has found the unserved warrant charging a white woman in his 1955 kidnapping, and relatives of the victim want authorities to finally arrest her nearly 70 years later.” All this terrible history is so close.</p><p><a href=\"https://19thnews.org/2022/06/patients-abortion-clinics-texas-turned-away-roe-overturned/\">Patients in Texas abortion clinic waiting rooms were turned away as Roe fell.</a> “Those turned away were patients who were now outside an already small window: In September, Texas banned abortion past six weeks of pregnancy. That law was the first in a series of abortion restrictions passed in states across the country in the last year that served as a preview of life after Roe.”</p><p><a href=\"https://19thnews.org/2022/06/liberal-supreme-court-justices-abortion-dissent-roe-v-wade-america/\">Liberal Supreme Court justices detail post-Roe America in furious abortion dissent.</a> ““Those responsible for the original Constitution, including the Fourteenth Amendment, did not perceive women as equals, and did not recognize women’s rights,” Breyer continued, adding that the court may as well rely on standards from the Dark Ages, and that this “consigns women to second-class citizenship.””</p><p><a href=\"https://www.nytimes.com/2022/06/13/us/ohio-teachers-guns-training.html?smid=tw-nytimes&amp;smtyp=cur\">Ohio Makes It Easier for Teachers to Carry Guns at School.</a> “A new law requires educators and other school staff members who want to carry a weapon to undergo no more than 24 hours of training — compared with more than 700 hours previously.” What could possibly go wrong?</p><p><a href=\"https://19thnews.org/2022/06/students-women-prevention-gun-violence/\">Young women are leading the movement to stop the next school shooting.</a> ““People often forget that women are the backbone of most of our progressive movements in this country,” Eastmond said. “So, I have noticed a lot of women involved [in gun reform], but that’s not something out of the ordinary that we haven’t seen before. I think women just naturally end up involved in progressive change.””</p><p><a href=\"https://time.com/6184659/trans-youth-gender-expansive-photo-essay/\">A Year in Photos of Gender Expansive Youth Across U.S.</a> “The photographer Annie Flanagan spent a year documenting gender-expansive young people across the U.S. as they experience adolescence at a fraught political and cultural time. Flanagan’s subjects are supporting one another, thriving, and finding joy. They’re getting ready for summer vacation. They’re hanging out with their friends. They’re maneuvering the social dynamics of prom. They’re walking across the stage at high school graduation and getting their diplomas, looking to the future, and planning for better days. These moments send their own message.”</p><p><a href=\"https://www.nytimes.com/2022/06/06/opinion/kim-phuc-vietnam-napalm-girl-photograph.html\">It’s Been 50 Years. I Am Not ‘Napalm Girl’ Anymore.</a> “I cannot speak for the families in Uvalde, Texas, but I think that showing the world what the aftermath of a gun rampage truly looks like can deliver the awful reality. We must face this violence head-on, and the first step is to look at it.”</p><p><a href=\"https://www.foreignaffairs.com/articles/ethiopia/2022-06-02/ethiopias-invisible-ethnic-cleansing\">Ethiopia’s Invisible Ethnic Cleansing.</a> “For more than a year and a half, a largely invisible campaign of ethnic cleansing has played out in Ethiopia’s northern region of Tigray. Older people, women, and children have been loaded onto trucks and forced out of their villages and hometowns. Men have been herded into overcrowded detention sites, where  many have died of disease, starvation, or torture. In total, severalhundred thousand Tigrayans have been forcibly uprooted because of their ethnicity.”</p><h4>Technology</h4><p><a href=\"https://apnews.com/article/abortion-technology-politics-health-016eb3efd65dafc2b568af1495f5bac5\">Instagram and Facebook remove posts offering abortion pills.</a> “The Facebook account was immediately put on a “warning” status for the post, which Facebook said violated its standards on “guns, animals and other regulated goods.” Yet, when the AP reporter made the same exact post but swapped out the words “abortion pills” for “a gun,” the post remained untouched. A post with the same exact offer to mail “weed” was also left up and not considered a violation.”</p><p><a href=\"https://www.wired.com/story/section-230-is-a-last-line-of-defense-for-abortion-speech-online/\">Section 230 Is a Last Line of Defense for Abortion Speech Online.</a> “Section 230 is the last line of defense keeping reproductive health care support, information, and fundraising online. Under Section 230, internet platforms that host and moderate user-generated content cannot generally be sued for that content. Section 230 is not absolute. It does not provide immunity if the platform develops or creates the content, and it does not provide immunity from the enforcement of federal criminal laws. But, crucially, it does protect against criminal liability from state laws.”</p><p><a href=\"https://www.jwz.org/blog/2016/10/they-live-and-the-secret-history-of-the-mozilla-logo/\">They Live and the secret history of the Mozilla logo.</a> “So that was the time that I somehow convinced a multi-billion dollar corporation to give away the source code to their flagship product and re-brand it using propaganda art by the world’s most notorious graffiti artist.”</p><p><a href=\"https://www.w3.org/2022/06/pressrelease-w3c-le.html.en\">W3C to become a public-interest non-profit organization.</a> “We need a structure where we meet at a faster pace the demands of new web capabilities and address the urgent problems of the web. The W3C Team is small, bounded in size, and the Hosted model hinders rapid development and acquisition of skills in new fields.”</p><p><a href=\"https://variety.com/2022/digital/news/amazon-alexa-voice-dead-grandmother-1235301516/\">Amazon Shows Off Alexa Speaking in the Voice of a Dead Relative.</a> “In a video demo shown at the event, a young boy says, “Alexa, can Grandma finish reading me ‘The Wizard of Oz’?” — whereupon a synthesized voice of the grandmother emanates from an Amazon Echo Dot smart speaker.” That’s a hard no from me.</p><p><a href=\"https://themarkup.org/pixel-hunt/2022/06/15/facebook-and-anti-abortion-clinics-are-collecting-highly-sensitive-info-on-would-be-patients\">Facebook and Anti-Abortion Clinics Are Collecting Highly Sensitive Info on Would-Be Patients.</a> “More than a third of the websites sent data to Facebook when someone made an appointment for an “abortion consultation” or “pre-termination screening.” And at least 39 sites sent Facebook details such as the person’s name, email address, or phone number.”</p><p><a href=\"https://themarkup.org/pixel-hunt/2022/06/16/facebook-is-receiving-sensitive-medical-information-from-hospital-websites\">Facebook Is Receiving Sensitive Medical Information from Hospital Websites.</a> “A tracking tool installed on many hospitals’ websites has been collecting patients’ sensitive health information—including details about their medical conditions, prescriptions, and doctor’s appointments—and sending it to Facebook.”</p><p><a href=\"https://futurism.com/tesla-nhtsa-autopilot-report\">Tesla Accused of Shutting Off Autopilot Moments Before Impact.</a> “In the report, the NHTSA spotlights 16 separate crashes, each involving a Tesla vehicle plowing into stopped first responders and highway maintenance vehicles. In the crashes, it claims, records show that the self-driving feature had “aborted vehicle control less than one second prior to the first impact” — a finding that calls supposedly-exonerating crash reports, which Musk himself has a pension for circulating, into question.”</p><p><a href=\"https://blog.mozilla.org/en/products/firefox/firefox-rolls-out-total-cookie-protection-by-default-to-all-users-worldwide/\">Firefox Rolls Out Total Cookie Protection By Default To All Users.</a> Really good work.</p><p><a href=\"https://www.protocol.com/bulletins/salesforce-nra-policy\">Salesforce to employees: We're not going to stop working with the NRA.</a> “Salesforce employees have asked the company to end its relationship with the National Rifle Association. But during an all-hands Wednesday, co-CEOs Bret Taylor and Marc Benioff said that the company wouldn’t bar specific customers from using its services, according to a recording obtained by Protocol.”</p><p><a href=\"https://www.wired.com/story/smartphones-ukraine-civilian-combatant/\">Smartphones Blur the Line Between Civilian and Combatant.</a> This seems to be laying some dangerous ground: “The principle of distinction between the two roles is a critical cornerstone of international humanitarian law—the law of armed conflict, codified by decades of customs and laws such as the Geneva Conventions. Those considered civilians and civilian targets are not to be attacked by military forces; as they are not combatants, they should be spared. At the same time, they also should not act as combatants—if they do, they may lose this status.”</p></div>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Ben Werdmüller",
    "url": "https://werd.io/feed/"
  },
  "discussionUrl": "https://werd.io/2022/reading-watching-playing-using-june-2022",
  "sameAs": "https://werd.io/2022/reading-watching-playing-using-june-2022",
  "dateCreated": "2022-07-01T15:50:46.919Z",
  "datePublished": "2022-07-01T15:46:34.000Z",
  "dateModified": "2022-07-01T15:50:46.919Z",
  "interactionStatistic": [],
  "headline_zh-Hans": "阅读、观看、玩耍、使用。6月，2022年\n",
  "headline_zh-Hant": "閱讀、觀看、玩耍、使用。6月，2022年\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<div class=\"e-content entry-content\">\n<p>This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for April, 2022.</p><h3>Books</h3><p><a href=\"https://bookshop.org/a/7949/9781735016511\">Reap3r, by Eliot Peper.</a> A page-turner set in a very familiar world to me - I had fun recognizing the scenery, the interpersonal dynamics, the cultural references. There was adventure, plausible near-future science fiction scenarios mined for tension; I had trouble putting it down, and that’s exactly what I wanted from it. Worth a read.</p><p><a href=\"https://bookshop.org/a/7949/9780525562948\">The Glass Hotel, by Emily St John Mandel.</a> Her writing style takes a lot of getting used to: not so much plot as collage. I spent the first third to a half wondering where we were going. Still, there’s an interesting story here, and well-drawn characters. The themes take some teasing out but are rewarding.</p><h3>Notable Articles</h3><h4>Business</h4><p><a href=\"https://www.bloomberg.com/news/articles/2022-06-14/starbucks-threatens-trans-benefits-in-anti-union-push-staff-say\">Starbucks Threatens Loss of Trans Benefits in Anti-Union Push, Staff Say.</a> “Starbucks Corp. managers in several states have told baristas that its vaunted transgender-inclusive health-care benefits could go away if they unionize, employees alleged in interviews and a new complaint filed with the US labor board.”</p><p><a href=\"https://www.forbes.com/sites/jenamcgregor/2022/06/09/microsoft-announces-it-will-include-pay-ranges-in-all-us-job-postings-experts-predict-it-will-be-the-first-of-many/?sh=d907a4b5c72f\">Microsoft Announces It Will Include Pay Ranges In All U.S. Job Postings. Experts Predict It Will Be The First Of Many.</a> “Changes may not ripple through big companies immediately. Many employers don’t relish sharing pay data that’s long been kept secret. Laws in some other jurisdictions that require disclosure of pay ranges—there are now six, including New York City—don’t go into effect for months, and employers have already pushed to postpone the practice there.” But when it happens - and it will - it will be a great step forward, in particular for communities that have systemically been underpaid.</p><p><a href=\"https://blogs.microsoft.com/on-the-issues/2022/06/02/employee-organizing-engagement-labor-economy/\">Microsoft adopts principles for employee organizing and engagement with labor organizations.</a> “We recognize that employees have a legal right to choose whether to form or join a union. We respect this right and do not believe that our employees or the company’s other stakeholders benefit by resisting lawful employee efforts to participate in protected activities, including forming or joining a union.” Major statement from Microsoft, breaking rank with most of the rest of the industry.</p><h4>Climate</h4><p><a href=\"https://www.technologyreview.com/2022/06/30/1055272/supreme-court-climate-policy-epa/\">The US Supreme Court just gutted federal climate policy.</a> ““Capping carbon dioxide emissions at a level that will force a nationwide transition away from the use of coal to generate electricity may be a sensible ‘solution to the crisis of the day,’” the decision reads. “But it is not plausible that Congress gave EPA the authority to adopt on its own such a regulatory scheme.””</p><p><a href=\"https://www.protocol.com/climate/ev-used-cars-exported-abroad\">The US is pushing EVs while sending its polluting gas-guzzlers abroad.</a> “But what’s missing from that agenda is any plan for how to deal with the diesel and gas-guzzling vehicles being exported in increasingly large numbers to low-income countries around the world. That essentially offshores carbon and air pollution, but in the case of the climate and public health, out of sight isn’t out of mind. That missing piece could wind up derailing the very purpose of Biden’s clean transportation plan and global climate goals.”</p><h4>Covid</h4><p><a href=\"https://apnews.com/article/covid-science-health-england-54d29ae3af5c700f15d704c14ee224b5\">COVID vaccines saved 20M lives in 1st year, scientists say. </a> “The researchers used data from 185 countries to estimate that vaccines prevented 4.2 million COVID-19 deaths in India, 1.9 million in the United States, 1 million in Brazil, 631,000 in France and 507,000 in the United Kingdom.”</p><h4>Crypto</h4><p><a href=\"https://theintercept.com/2022/06/29/crypto-coinbase-tracer-ice/?utm_source=twitter&amp;utm_camp\n",
  "description_zh-Hant": "<div class=\"e-content entry-content\">\n<p>This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for April, 2022.</p><h3>Books</h3><p><a href=\"https://bookshop.org/a/7949/9781735016511\">Reap3r, by Eliot Peper.</a> A page-turner set in a very familiar world to me - I had fun recognizing the scenery, the interpersonal dynamics, the cultural references. There was adventure, plausible near-future science fiction scenarios mined for tension; I had trouble putting it down, and that’s exactly what I wanted from it. Worth a read.</p><p><a href=\"https://bookshop.org/a/7949/9780525562948\">The Glass Hotel, by Emily St John Mandel.</a> Her writing style takes a lot of getting used to: not so much plot as collage. I spent the first third to a half wondering where we were going. Still, there’s an interesting story here, and well-drawn characters. The themes take some teasing out but are rewarding.</p><h3>Notable Articles</h3><h4>Business</h4><p><a href=\"https://www.bloomberg.com/news/articles/2022-06-14/starbucks-threatens-trans-benefits-in-anti-union-push-staff-say\">Starbucks Threatens Loss of Trans Benefits in Anti-Union Push, Staff Say.</a> “Starbucks Corp. managers in several states have told baristas that its vaunted transgender-inclusive health-care benefits could go away if they unionize, employees alleged in interviews and a new complaint filed with the US labor board.”</p><p><a href=\"https://www.forbes.com/sites/jenamcgregor/2022/06/09/microsoft-announces-it-will-include-pay-ranges-in-all-us-job-postings-experts-predict-it-will-be-the-first-of-many/?sh=d907a4b5c72f\">Microsoft Announces It Will Include Pay Ranges In All U.S. Job Postings. Experts Predict It Will Be The First Of Many.</a> “Changes may not ripple through big companies immediately. Many employers don’t relish sharing pay data that’s long been kept secret. Laws in some other jurisdictions that require disclosure of pay ranges—there are now six, including New York City—don’t go into effect for months, and employers have already pushed to postpone the practice there.” But when it happens - and it will - it will be a great step forward, in particular for communities that have systemically been underpaid.</p><p><a href=\"https://blogs.microsoft.com/on-the-issues/2022/06/02/employee-organizing-engagement-labor-economy/\">Microsoft adopts principles for employee organizing and engagement with labor organizations.</a> “We recognize that employees have a legal right to choose whether to form or join a union. We respect this right and do not believe that our employees or the company’s other stakeholders benefit by resisting lawful employee efforts to participate in protected activities, including forming or joining a union.” Major statement from Microsoft, breaking rank with most of the rest of the industry.</p><h4>Climate</h4><p><a href=\"https://www.technologyreview.com/2022/06/30/1055272/supreme-court-climate-policy-epa/\">The US Supreme Court just gutted federal climate policy.</a> ““Capping carbon dioxide emissions at a level that will force a nationwide transition away from the use of coal to generate electricity may be a sensible ‘solution to the crisis of the day,’” the decision reads. “But it is not plausible that Congress gave EPA the authority to adopt on its own such a regulatory scheme.””</p><p><a href=\"https://www.protocol.com/climate/ev-used-cars-exported-abroad\">The US is pushing EVs while sending its polluting gas-guzzlers abroad.</a> “But what’s missing from that agenda is any plan for how to deal with the diesel and gas-guzzling vehicles being exported in increasingly large numbers to low-income countries around the world. That essentially offshores carbon and air pollution, but in the case of the climate and public health, out of sight isn’t out of mind. That missing piece could wind up derailing the very purpose of Biden’s clean transportation plan and global climate goals.”</p><h4>Covid</h4><p><a href=\"https://apnews.com/article/covid-science-health-england-54d29ae3af5c700f15d704c14ee224b5\">COVID vaccines saved 20M lives in 1st year, scientists say. </a> “The researchers used data from 185 countries to estimate that vaccines prevented 4.2 million COVID-19 deaths in India, 1.9 million in the United States, 1 million in Brazil, 631,000 in France and 507,000 in the United Kingdom.”</p><h4>Crypto</h4><p><a href=\"https://theintercept.com/2022/06/29/crypto-coinbase-tracer-ice/?utm_source=twitter&amp;utm_camp\n"
}