{
  "@type": "NewsArticle",
  "identifier": "2022--06--10--en--myfeed--HackerNews--NewsArticle--31690480",
  "url": "https://news.ycombinator.com/item?id=31690480",
  "headline": "For $5/mo, you can steal $38,000/month from your enemies",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "It's actually sort of funny. Not for the receiving end, which would likely be able to negotiate or just suspend their service instead of owing $38k, but still. There should be a documentary on this if I'm being honest.<p>Today's topic: Content Delivery Networks that charge per request.<p>It's a common practice but it's horrific for smaller companies that can't negotiate contracts.<p>Fastly, CloudFront, Google Cloud CDN and more all charge for requests made to CDN deployments.<p>Vultr. Linode. Digital Ocean. -and more. $5/month for a not too terrible server and 1TB of egress. Not a threat until you spam someone's CDN deployment. And no, I'm not talking about 1TB. I'm talking about sending 51 billion requests a month to CDN endpoints for $5/month. Want to mitigate that? That'll cost 10x the amount per request for Google Cloud Armor or Amazon WAF (not kidding). I'm sure this actually is't a common practice, but it makes you wonder about the companies that switch from enterprise CDNs to Cloudflare.......<p>HTTP stress testing software like wrk is wickedly powerful and insightful. WRK can easily send 20k requests per second per core. Find a resource small enough and it's game over for the receiving end. It can easily be used as a tool for your worst enemies. The only way to mitigate it is to host your own solution, like Varnish etc. or negotiate a contract with the CDN provider, which will costs hundreds or thousands of dollars a month. Not a likely solution for small to medium sized businesses.<p>Thoughts? Comments? Stories? Ideas?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "nikolqy",
    "url": "https://news.ycombinator.com/user?id=nikolqy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31690480",
  "sameAs": "https://news.ycombinator.com/item?id=31690480",
  "dateCreated": "2022-06-10T05:56:12.129Z",
  "datePublished": "2022-06-10T05:42:35.000Z",
  "dateModified": "2022-06-10T05:56:12.129Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "只需5美元/月，你就可以从你的敌人那里窃取38,000美元/月。\n",
  "headline_zh-Hant": "只需5美元/月，你就可以從你的敵人那裡竊取38,000美元/月。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这实际上有点好笑。对于接收方来说，他们很可能能够进行谈判，或者只是暂停他们的服务，而不是欠下3.8万美元，但仍然如此。如果我是诚实的，应该有一部关于这个问题的纪录片。<p>今天的话题。内容交付网络按请求收费。<p>这是一种常见的做法，但对于无法谈判合同的小公司来说，这是很可怕的。<p>Fastly、CloudFront、Google Cloud CDN等都对向CDN部署的请求收费。Linode。数字海洋。-以及更多。5美元/月的服务器和1TB的出口并不可怕。在你向别人的CDN部署发送垃圾邮件之前，这不是一种威胁。不，我说的不是1TB。我说的是以5美元/月的价格每月向CDN终端发送510亿个请求。想减轻这种影响吗？这将花费10倍于Google Cloud Armor或Amazon WAF（不是开玩笑）的每个请求量。我相信这实际上不是一种常见的做法，但它让你想知道那些从企业CDN转向Cloudflare的公司.......<p>像wrk这样的HTTP压力测试软件是非常强大和有洞察力的。WRK可以轻松地在每个核心每秒发送20k个请求。找到一个足够小的资源，对于接收端来说，游戏就结束了。它可以很容易地被用作你最坏的敌人的一个工具。缓解它的唯一方法是托管你自己的解决方案，如Varnish等，或与CDN供应商谈判合同，这将花费每月数百或数千美元。对于中小型企业来说，这不是一个可能的解决方案。<p>有什么想法？评论？故事？想法？\n",
  "description_zh-Hant": "這實際上有點好笑。對於接收方來說，他們很可能能夠進行談判，或者只是暫停他們的服務，而不是欠下3.8萬美元，但仍然如此。如果我是誠實的，應該有一部關於這個問題的紀錄片。<p>今天的話題。內容交付網絡按請求收費。<p>這是一種常見的做法，但對於無法談判合同的小公司來說，這是很可怕的。<p>Fastly、CloudFront、Google Cloud CDN等都對向CDN部署的請求收費。Linode。數字海洋。-以及更多。5美元/月的服務器和1TB的出口並不可怕。在你向別人的CDN部署發送垃圾郵件之前，這不是一種威脅。不，我說的不是1TB。我說的是以5美元/月的價格每月向CDN終端發送510億個請求。想減輕這種影響嗎？這將花費10倍於Google Cloud Armor或Amazon WAF（不是開玩笑）的每個請求量。我相信這實際上不是一種常見的做法，但它讓你想知道那些從企業CDN轉向Cloudflare的公司.......<p>像wrk這樣的HTTP壓力測試軟件是非常強大和有洞察力的。WRK可以輕鬆地在每個核心每秒發送20k個請求。找到一個足夠小的資源，對於接收端來說，遊戲就結束了。它可以很容易地被用作你最壞的敵人的一個工具。緩解它的唯一方法是託管你自己的解決方案，如Varnish等，或與CDN供應商談判合同，這將花費每月數百或數千美元。對於中小型企業來說，這不是一個可能的解決方案。<p>有什麼想法？評論？故事？想法？\n"
}