{
  "@type": "NewsArticle",
  "identifier": "2022--07--11--en--myfeed--HackerNews--NewsArticle--32052591",
  "url": "https://news.ycombinator.com/item?id=32052591",
  "headline": "Fear of failing in this field is giving me severe senioritis",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This is quite a personal post. I just want to ask this community's advice because I feel like my life is going in a downward spiral already.<p>First off, I'm not from the US or any country which has a major impact on global tech development. Most tech jobs here are either in big local companies or in outsourcing.<p>I'm currently in my senior year but has been struggling to finish my senior project for more than two years already (yes, I've been a senior for that long) because I'm too afraid to graduate and enter the tech field. I'm actually losing interest in my project as time goes by and my passion for most things tech-related has been dwindling. Trying to do anything about it just makes me think how much &quot;I hate this work.&quot;<p>Some of my peers in other fields actually say they envy me for choosing this degree because based on their perception, it could lead me to a job that could make me well-off. However, seeing how much work I need to do (i.e. through constant studying and learning) just to have a steady career, it's making me question if I really made the right choice in terms of my education and possible career paths. Moreover, I'm starting to feel the pressure of the job market seeing how more people are entering this field because &quot;this is where the money is.&quot; Not to mention the job cuts I've been hearing about because of global recession.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "irisedhaze",
    "url": "https://news.ycombinator.com/user?id=irisedhaze"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32052591",
  "sameAs": "https://news.ycombinator.com/item?id=32052591",
  "dateCreated": "2022-07-11T05:41:26.825Z",
  "datePublished": "2022-07-11T05:34:27.000Z",
  "dateModified": "2022-07-11T05:41:26.825Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "害怕在这个领域失败，让我有严重的老年炎。\n",
  "headline_zh-Hant": "害怕在這個領域失敗，讓我有嚴重的老年炎。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这是个相当个人化的帖子。我只是想征求这个社区的意见，因为我觉得我的生活已经在走下坡路了。<p>首先，我不是来自美国或任何对全球科技发展有重大影响的国家。这里的大多数科技工作不是在当地的大公司，就是在外包公司。<p>我目前在读大四，但两年多来一直在努力完成我的大四项目（是的，我已经读了那么久的大四），因为我太害怕毕业和进入科技领域。随着时间的推移，我实际上对我的项目失去了兴趣，而且我对大多数与技术有关的事情的热情也在减少。试图做任何事情只会让我觉得自己是多么的&quot;讨厌这份工作。<p>我的一些其他领域的同行居然说他们羡慕我选择这个学位，因为根据他们的看法，这可以让我找到一份可以让我富裕的工作。然而，看到我需要做多少工作（即通过不断的学习和借鉴）才能有一个稳定的职业，这让我怀疑自己在教育和可能的职业道路方面是否真的做出了正确的选择。此外，我开始感受到就业市场的压力，看到越来越多的人进入这个领域，因为这是赚钱的地方，更不用说我一直听说因为全球经济衰退而削减工作。\n",
  "description_zh-Hant": "這是個相當個人化的帖子。我只是想徵求這個社區的意見，因為我覺得我的生活已經在走下坡路了。<p>首先，我不是來自美國或任何對全球科技發展有重大影響的國家。這裡的大多數科技工作不是在當地的大公司，就是在外包公司。<p>我目前在讀大四，但兩年多來一直在努力完成我的大四項目（是的，我已經讀了那麼久的大四），因為我太害怕畢業和進入科技領域。隨著時間的推移，我實際上對我的項目失去了興趣，而且我對大多數與技術有關的事情的熱情也在減少。試圖做任何事情只會讓我覺得自己是多麼的&quot;討厭這份工作。<p>我的一些其他領域的同行居然說他們羨慕我選擇這個學位，因為根據他們的看法，這可以讓我找到一份可以讓我富裕的工作。然而，看到我需要做多少工作（即通過不斷的學習和借鑑）才能有一個穩定的職業，這讓我懷疑自己在教育和可能的職業道路方面是否真的做出了正確的選擇。此外，我開始感受到就業市場的壓力，看到越來越多的人進入這個領域，因為這是賺錢的地方，更不用說我一直聽說因為全球經濟衰退而削減工作。\n"
}