{
  "@type": "NewsArticle",
  "identifier": "2022--06--11--en--myfeed--HackerNews--NewsArticle--31705284",
  "url": "https://news.ycombinator.com/item?id=31705284",
  "headline": "Archaeological news – this week's top three",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Happy Saturday, folks! I curated this week's archaeological news below:<p>[Prehistoric “Swiss Army knife” indicates early humans communicated](https://www.eurekalert.org/news-releases/955471)\nTL;DR A particular type of stone tool is found in southern Africa across large distances and multiple biomes, indicating that ancient peoples were communicating and sharing technology. The Howiesons Poort backed artifacts (“Howiesons Poort” being a Middle Stone Age cultural period), also known as “stone Swiss Army Knives”, were produced in huge quantities roughly 65,000 years ago. According to Paloma de la Peña, “While the making of the stone tool was not particularly difficult, the hafting of the stone to the handle through the use of glue and adhesives was hard, which highlights that they were sharing and communicating complex information with each other.” Interestingly, this supports one explanation of why the biggest exit out of Africa 60,000-70,000 years ago was so successful — that there was sufficient social connection for a large-scale exodus. “What was also striking was that the abundance of tools made in the same shape coincided with great changes in the climatic conditions. We believe that this is a social response to the changing environment across southern Africa.”<p>[How an ancient rice beer helped brew Chinese civilisation](https://www.scmp.com/news/people-culture/environment/article/3180155/how-ancient-rice-beer-helped-brew-chinese)\nTL;DR A new study showed that red rice beer created “cultural interactions” between autonomous neolithic peoples in China. These independent groups started blending together during the “interaction sphere”, beginning around 4,000 years ago, kicking off a new phase in Chinese history. The brew was brought to China by the Dawenku culture between 4,600 and 6,700 years ago. It is made in large clay basins called dakougangs, which were a big technological advancement in themselves. Being able to make large quantities of red rice beer for feasts provided individuals with prestige, and the realization that this technology would have helped people gain status may shed “new light on the intensified transregional interactions which contributed to the growth of social stratification at the dawn of Chinese civilisation.” As a side note, this was not merely because people liked to drink — the red hue of the beer likely made it a sacred ceremonial substance associated with blood.<p>[Industrial Manufacturing Of Wool And Wool Textiles In The Bronze Age Italy](https://archaeologynewsnetwork.blogspot.com/2022/06/industrial-manufacturing-of-wool-and.html)\nTL;DR Montale in Northern Italy had some of the first wool production in Europe, and it may have even been done on an industrial scale. In a recent study, archaeologist Serena Sabatina made a case for this through the sheer quantity of textile tools found at the site, as well as the analysis of teeth. The latter showed that sheep and goats were raised and died in the same area, indicating that they were closely managed on site. The article goes on to say that it took over a year to get enough wool from 10 sheep to make a 3.5x3.5 meter cloth, hence the need for economically sustainable wool production. &quot;Thanks to particularly favorable social and environmental conditions, they were able to specialize in the production of wool and likely exported wool, wool yarn or perhaps even woven wool textiles. They were then able to trade wool and textiles for goods not available in the area.&quot;",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jamesofthedrum",
    "url": "https://news.ycombinator.com/user?id=jamesofthedrum"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31705284",
  "sameAs": "https://news.ycombinator.com/item?id=31705284",
  "dateCreated": "2022-06-11T15:45:31.236Z",
  "datePublished": "2022-06-11T15:37:09.000Z",
  "dateModified": "2022-06-11T15:45:31.236Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "考古新闻--本周的前三名\n",
  "headline_zh-Hant": "考古新聞--本週的前三名\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "周六快乐，伙计们！我把本周的考古新闻整理如下：<p>[史前 \"瑞士军刀 \"表明早期人类的沟通方式]() 我把本周的考古学新闻策划如下：<p>[史前 \"瑞士军刀 \"表明早期人类在进行交流](https://www.eurekalert.org/news-releases/955471)\nTL;DR 在非洲南部发现了一种特殊类型的石器，跨越了很大的距离和多个生物群落，表明古代人在交流和分享技术。Howiesons Poort支持的文物（\"Howiesons Poort \"是指中石器时代的文化时期），也被称为 \"石头瑞士军刀\"，大约在6.5万年前大量生产。根据Paloma de la Peña的说法，\"虽然石器的制作并不特别困难，但通过使用胶水和粘合剂将石块铰接到手柄上是很难的，这突出表明他们彼此之间在分享和交流复杂的信息\"。有趣的是，这支持了一种解释，即为什么6万至7万年前最大的出走非洲是如此成功--有足够的社会联系来进行大规模出走。\"同样引人注目的是，大量相同形状的工具的出现与气候条件的巨大变化相吻合。我们认为这是整个南部非洲对环境变化的一种社会反应。\"<p>[古代米酒如何帮助酝酿中国文明](https://www.scmp.com/news/people-culture/environment/article/3180155/how-ancient-rice-beer-helped-brew-chinese)\nTL;DR 一项新的研究表明，红米啤酒在中国新石器时代的自治民族之间创造了 \"文化互动\"。这些独立的群体在 \"互动范围 \"内开始融合，大约在4000年前开始，开启了中国历史的新阶段。酿酒是在4600年至6700年前由大汶口文化带入中国的。它是在被称为达文库的大型粘土盆中制作的，这本身就是一个很大的技术进步。能够为宴会制作大量的红米啤酒为个人提供了声望，意识到这种技术会帮助人们获得地位，可能会使人们 \"对跨区域互动的加强有了新的认识，这种互动促进了中国文明初期的社会分层的增长\"。顺便提一下，这不仅仅是因为人们喜欢喝酒--啤酒的红色色调很可能使它成为与血有关的神圣的仪式物质。<p>[意大利青铜时代羊毛和羊毛纺织品的工业制造](https://archaeologynewsnetwork.blogspot.com/2022/06/industrial-manufacturing-of-wool-and.html)\nTL;DR 意大利北部的Montale有一些欧洲最早的羊毛生产，它甚至可能是以工业规模进行的。在最近的一项研究中，考古学家Serena Sabatina通过在该遗址发现的大量纺织工具以及对牙齿的分析，证明了这一点。后者显示，绵羊和山羊是在同一地区饲养和死亡的，表明它们在现场被密切管理。文章接着说，从10只羊身上获取足够的羊毛来制作一块3.5x3.5米的布需要一年多的时间，因此需要经济上可持续的羊毛生产。 &quot;由于特别有利的社会和环境条件，他们能够专门生产羊毛，并可能出口羊毛、羊毛纱线，甚至可能是羊毛纺织品。然后，他们能够用羊毛和纺织品换取该地区没有的商品。\n",
  "description_zh-Hant": "週六快樂，夥計們！我把本週的考古新聞整理如下：<p>[史前 \"瑞士軍刀 \"表明早期人類的溝通方式]() 我把本週的考古學新聞策劃如下：<p>[史前 \"瑞士軍刀 \"表明早期人類在進行交流](https://www.eurekalert.org/news-releases/955471)\nTL;DR 在非洲南部發現了一種特殊類型的石器，跨越了很大的距離和多個生物群落，表明古代人在交流和分享技術。Howiesons Poort支持的文物（\"Howiesons Poort \"是指中石器時代的文化時期），也被稱為 \"石頭瑞士軍刀\"，大約在6.5萬年前大量生產。根據Paloma de la Peña的說法，\"雖然石器的製作並不特別困難，但通過使用膠水和粘合劑將石塊鉸接到手柄上是很難的，這突出表明他們彼此之間在分享和交流複雜的信息\"。有趣的是，這支持了一種解釋，即為什麼6萬至7萬年前最大的出走非洲是如此成功--有足夠的社會聯繫來進行大規模出走。\"同樣引人注目的是，大量相同形狀的工具的出現與氣候條件的巨大變化相吻合。我們認為這是整個南部非洲對環境變化的一種社會反應。\"<p>[古代米酒如何幫助醞釀中國文明](https://www.scmp.com/news/people-culture/environment/article/3180155/how-ancient-rice-beer-helped-brew-chinese)\nTL;DR 一項新的研究表明，紅米啤酒在中國新石器時代的自治民族之間創造了 \"文化互動\"。這些獨立的群體在 \"互動範圍 \"內開始融合，大約在4000年前開始，開啟了中國歷史的新階段。釀酒是在4600年至6700年前由大汶口文化帶入中國的。它是在被稱為達文庫的大型粘土盆中製作的，這本身就是一個很大的技術進步。能夠為宴會製作大量的紅米啤酒為個人提供了聲望，意識到這種技術會幫助人們獲得地位，可能會使人們 \"對跨區域互動的加強有了新的認識，這種互動促進了中國文明初期的社會分層的增長\"。順便提一下，這不僅僅是因為人們喜歡喝酒--啤酒的紅色色調很可能使它成為與血有關的神聖的儀式物質。<p>[意大利青銅時代羊毛和羊毛紡織品的工業製造](https://archaeologynewsnetwork.blogspot.com/2022/06/industrial-manufacturing-of-wool-and.html)\nTL;DR 意大利北部的Montale有一些歐洲最早的羊毛生產，它甚至可能是以工業規模進行的。在最近的一項研究中，考古學家Serena Sabatina通過在該遺址發現的大量紡織工具以及對牙齒的分析，證明了這一點。後者顯示，綿羊和山羊是在同一地區飼養和死亡的，表明它們在現場被密切管理。文章接著說，從10只羊身上獲取足夠的羊毛來製作一塊3.5x3.5米的布需要一年多的時間，因此需要經濟上可持續的羊毛生產。 &quot;由於特別有利的社會和環境條件，他們能夠專門生產羊毛，並可能出口羊毛、羊毛紗線，甚至可能是羊毛紡織品。然後，他們能夠用羊毛和紡織品換取該地區沒有的商品。\n"
}