{
  "@type": "NewsArticle",
  "identifier": "2022--04--16--en--myfeed--HackerNews--NewsArticle--31055371",
  "url": "https://news.ycombinator.com/item?id=31055371",
  "headline": "I read most Hacker News comments as written by cis males, I want to do better",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I had a realization about this a few weeks ago. I know there are serious problems with tech being cis male dominated, pay disparities, harassment and general mistreatment of women, non-binary and trans people are very sadly all too common. I believe that the teams I have been on have treated all team members with respect, admittedly I didn't know anything about my teammates compensation so there could have been hidden issues I didn't see.<p>I don't want to be part of the problem, I want to be elevating the voices of women, non-binary and trans people in these kinds of spaces so we can change the culture of our industry.<p>I would like to hear from of the non cis-male members of the Hacker News community. Do you think the absence of things like profile pictures or a space for pronouns is a benefit of the community? Do you like participating in discussions here? Does leaving gender out of how we identify users, unless they decide to write about it in a post, make posting here more approachable than other communities?<p>I think women I have met have generally been better at identifying the gender of an author and identifying negative patterns in tone, etc. There is a lot of assertive tone in comments, people claiming to know absolute facts even in debatable topics, which I believe has contributed to the problem I have assuming so many voices on the site are cis male.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jaltekruse",
    "url": "https://news.ycombinator.com/user?id=jaltekruse"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31055371",
  "sameAs": "https://news.ycombinator.com/item?id=31055371",
  "dateCreated": "2022-04-16T19:50:12.745Z",
  "datePublished": "2022-04-16T19:33:03.000Z",
  "dateModified": "2022-04-16T19:50:12.745Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "我读到的大多数Hacker News的评论都是由阴阳人男性写的，我想做得更好",
  "headline_zh-Hant": "我讀到的大多數Hacker News的評論都是由陰陽人男性寫的，我想做得更好",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几周前，我对这个问题有了认识。我知道科技界存在着严重的问题，即以男性为主导的阴阳人，薪酬差距、骚扰和对女性、非二元和变性人的普遍虐待都非常可悲地存在。我相信我所在的团队对所有团队成员都很尊重，当然，我对我的队友的报酬一无所知，所以可能有一些我没有看到的隐性问题。<p>我不想成为问题的一部分，我想在这些空间里提高女性、非二元和变性人的声音，这样我们就可以改变我们的行业文化。你认为没有个人资料照片或代名词空间这样的东西是社区的一个好处吗？你喜欢参与这里的讨论吗？除非用户决定在帖子中写上性别，否则我们在这里发帖是否比其他社区更平易近人？<p>我认为我遇到的女性通常更善于识别作者的性别，并识别语气中的负面模式，等等。在评论中，有很多自信的语气，即使在有争议的话题中，人们也声称知道绝对的事实，我相信这也造成了我认为网站上很多声音都是阴性男性的问题。",
  "description_zh-Hant": "幾周前，我對這個問題有了認識。我知道科技界存在著嚴重的問題，即以男性為主導的陰陽人，薪酬差距、騷擾和對女性、非二元和變性人的普遍虐待都非常可悲地存在。我相信我所在的團隊對所有團隊成員都很尊重，當然，我對我的隊友的報酬一無所知，所以可能有一些我沒有看到的隱性問題。<p>我不想成為問題的一部分，我想在這些空間裡提高女性、非二元和變性人的聲音，這樣我們就可以改變我們的行業文化。你認為沒有個人資料照片或代名詞空間這樣的東西是社區的一個好處嗎？你喜歡參與這裡的討論嗎？除非用戶決定在帖子中寫上性別，否則我們在這裡發帖是否比其他社區更平易近人？<p>我認為我遇到的女性通常更善於識別作者的性別，並識別語氣中的負面模式，等等。在評論中，有很多自信的語氣，即使在有爭議的話題中，人們也聲稱知道絕對的事實，我相信這也造成了我認為網站上很多聲音都是陰性男性的問題。"
}