{
  "@type": "NewsArticle",
  "identifier": "2022--07--03--en--myfeed--HackerNews--NewsArticle--31968223",
  "url": "https://news.ycombinator.com/item?id=31968223",
  "headline": "Can we have a less flamey discussion of self driving cars?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I know that righteous indignation is the new national pastime, but I would find it a lot more interesting to hear a more nuanced discussion from this community on the topic of self-driving.<p>Some questions that come to mind:<p>- Would it contribute positively to our world if competent self driving existed?<p>- What are the various approaches to get from here to there, and what are their relative merits and risks?<p>- Assuming some approach showed promise, how should we expose it to real world conditions to allow for validation and ongoing improvement?<p>- Do the technically-savvy folks on this list think that a heuristic approach (i.e. a bunch of rules written by humans) could ever succeed at effective self driving in diverse conditions?  Or is the machine learning + massive data approach more likely to solve it?  Or do you consider it fundamentally unsolveable?<p>- What interesting moral and legal questions arise if effective self-driving becomes available?<p>- What might be the economic and environmental ramifications of a world with ubiquitous “robotaxis”?<p>Anyone care to pick one and take a swing at it?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "hefferbub",
    "url": "https://news.ycombinator.com/user?id=hefferbub"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31968223",
  "sameAs": "https://news.ycombinator.com/item?id=31968223",
  "dateCreated": "2022-07-03T15:25:28.955Z",
  "datePublished": "2022-07-03T15:03:40.000Z",
  "dateModified": "2022-07-03T15:25:28.955Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 7
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "我们能否对自动驾驶汽车进行一次不那么火热的讨论？\n",
  "headline_zh-Hant": "我們能否對自動駕駛汽車進行一次不那麼火熱的討論？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我知道义愤填膺是新的国家消遣方式，但我认为从这个社区听到关于自动驾驶话题的更细致的讨论会更有趣。<p>我想到了一些问题：<p>- 如果有能力的自动驾驶存在，它会对我们的世界做出积极的贡献吗？<p>- 从这里到那里有哪些不同的方法，它们的相对优点和风险是什么？ <p>- 假设某种方法显示出前景，我们应该如何将其暴露在现实世界的条件下，以便进行验证和持续改进？<p>- 这个名单上精通技术的人是否认为启发式方法（即由人类编写的一堆规则）能够在不同条件下成功实现有效的自动驾驶？ 还是机器学习+海量数据的方法更有可能解决这个问题？ <p>- 如果有效的自动驾驶成为可能，会出现哪些有趣的道德和法律问题？<p>- 一个拥有无处不在的 \"机器人轴 \"的世界可能会产生哪些经济和环境影响？\n",
  "description_zh-Hant": "我知道義憤填膺是新的國家消遣方式，但我認為從這個社區聽到關於自動駕駛話題的更細緻的討論會更有趣。<p>我想到了一些問題：<p>- 如果有能力的自動駕駛存在，它會對我們的世界做出積極的貢獻嗎？<p>- 從這裡到那裡有哪些不同的方法，它們的相對優點和風險是什麼？ <p>- 假設某種方法顯示出前景，我們應該如何將其暴露在現實世界的條件下，以便進行驗證和持續改進？<p>- 這個名單上精通技術的人是否認為啟發式方法（即由人類編寫的一堆規則）能夠在不同條件下成功實現有效的自動駕駛？ 還是機器學習+海量數據的方法更有可能解決這個問題？ <p>- 如果有效的自動駕駛成為可能，會出現哪些有趣的道德和法律問題？<p>- 一個擁有無處不在的 \"機器人軸 \"的世界可能會產生哪些經濟和環境影響？\n"
}