{
  "@type": "NewsArticle",
  "identifier": "2022--04--17--en--myfeed--HackerNews--NewsArticle--31061164",
  "url": "https://news.ycombinator.com/item?id=31061164",
  "headline": "How Do I get my Co-Founder to Leave?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi there,<p>I developed my business myself &amp; spent ~$3k of my own funds. When my website was 95% complete, I got one of my friends, Zake* to create my logos about a month before we went live. We agreed that I’d pay Zake $300 for the logos. Zake changed their mind &amp; said I should rather give them 5% of my business, co-founder title &amp; a “seat at the table”. This was 1.5 years ago &amp; it was their initial offer, I didn’t negotiate with them.<p>We didn’t sign any type of contract at all (bad idea, I know). We verbally agreed that Zake would a) post on social media 5 days a week b) do our SEO c) update the website images once a month, minor things like changing the website banner d) make any misc documents look good (no content just aesthetics) ie our pitch deck e) attend our weekly team meetings. I pay for everything, which I think is fair.<p>On our website Zake is listed as a co-founder, but we have no signed contract/ paperwork whatsoever, their shares are sweat shares &amp; they haven’t invested any money into the business.<p>We’ve had a lot of “almosts” but as of today we have don’t have any investors &amp; the company is not worth much. YTD, we make about $2k - $5k in monthly revenue. Last year, we were making $0 - $1k a month. We live in a developing country, cost of living is a lot lower here.<p>Zake does close to nothing &amp; I have proof of me repeatedly asking them to do their tasks. For the past 1.5 years this has been an ongoing issue with us. I have emails of Zake admitting that they don’t pull their weight &amp; they’ll change, but they haven’t.<p>I want Zake to leave my business. About a week ago I sent Zake a kind email stating that it may be “best for both of us” if they leave the business. I offered Zake $750 as a severance package of sorts. They have not responded. I texted &amp; dm’d too &amp; no response either.<p>Honestly, I don’t mind negotiating with them &amp; giving them a bit more money, I just want them gone. They don’t even attend our team meetings anymore. This whole year they’ve worked on the business for max 2 hours (team meetings included), it’s almost May.<p>Although they were supposed to do the SEO in September 2020, they still haven’t done it. I paid a freelancer to do the SEO instead. Other than the SEO, I’m doing all of Zake’s tasks. Literally 100%. It’s honestly not that tough. I spend max 2 hours a week doing it &amp; I know that Zake just doesn’t care about the business, which is okay but they should just  leave then.<p>Since I’ve been gaining popularity on my personal social media (my followers are in the 6 figures, last year it was 5 figures) our sales have been rapidly increasing &amp; I sense that Zake is keeping one foot in the door in case we blow up, but they aren’t willing to do any of the work to help us get there. I also have a great opportunity that will make my business more money &amp; I want to be sure that Zake is no longer part of the business before that happens, or least we should have a signed contract. This opportunity is time sensitive &amp; I haven’t told anyone about it.<p>I’m thinking about sending Zake a Founder’s agreement, with cliff vesting + termination info. But I doubt they’ll respond to it, never mind sign it.<p>Do you all have any advice on how I can get Zake out completely &amp; quickly? Or any general proposed next steps, especially because we don’t have a contract &amp; they do not respond to any of my messages.<p>They are also one of my oldest &amp; closet friends &amp; I think they think I’ll never get rid of them because of that. I will though.<p>Thanks in advance!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "JosephPitt",
    "url": "https://news.ycombinator.com/user?id=JosephPitt"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31061164",
  "sameAs": "https://news.ycombinator.com/item?id=31061164",
  "dateCreated": "2022-04-17T15:33:01.968Z",
  "datePublished": "2022-04-17T14:41:49.000Z",
  "dateModified": "2022-04-17T15:33:01.968Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "我如何让我的联合创始人离开？",
  "headline_zh-Hant": "我如何讓我的聯合創始人離開？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，<p>我自己开发了我的业务&amp；花了~3千美元的自有资金。当我的网站完成了95%时，我让我的一个朋友Zake*在我们上线前一个月为我制作了标志。我们商定，我付给Zake 300美元的标志费。Zake改变了主意，说我应该给他们5%的业务、联合创始人的头衔和 \"会议席位\"。这是1.5年前的事，是他们最初的报价，我没有与他们谈判。<p>我们根本没有签署任何类型的合同（我知道这是个坏主意）。我们口头约定，Zake将a）每周5天在社交媒体上发布信息；b）做我们的SEO；c）每月更新一次网站图片，小事如改变网站横幅；d）使任何杂项文件看起来很好（没有内容，只有美感），如我们的Pitch deck；e）参加我们每周的团队会议。<p>在我们的网站上，Zake被列为联合创始人，但我们没有签署任何合同/文件，他们的股份是汗水股份，他们没有向企业投入任何资金。<p>我们有很多 \"几乎\"，但到今天为止，我们没有任何投资者，公司也没有多少价值。到目前为止，我们的月收入约为2千至5千美元。去年，我们的月收入是0-1千美元。我们住在一个发展中国家，这里的生活成本要低得多。<p>Zake几乎什么都不做&amp; 我有证据，我反复要求他们做他们的任务。在过去的1.5年里，这一直是我们的一个持续问题。我有Zake的电子邮件，承认他们没有发挥自己的作用&amp; 他们会改变，但他们没有。<p>我希望Zake离开我的生意。大约一周前，我给Zake发了一封善意的电子邮件，表示如果他们离开公司，这可能是 \"对我们两个人最好的\"。我向Zake提供了750美元作为某种遣散费。他们没有回应。说实话，我不介意和他们谈判，给他们多一点钱，我只是希望他们离开。他们甚至不参加我们的团队会议了。这一年来，他们在业务上最多只工作了2个小时（包括团队会议），现在已经快5月了。<p>虽然他们应该在2020年9月做SEO，但他们仍然没有做。我付钱给一个自由职业者来做SEO。除了SEO之外，我正在做Zake的所有任务。实际上是100%。说实话，这并不难。<p>自从我在个人社交媒体上获得知名度以来（我的粉丝在6位数，去年是5位数），我们的销售额一直在迅速增加；我感觉到Zake在保持一只脚在门口，以防我们爆炸，但他们不愿意做任何工作来帮助我们达到目标。我还有一个很好的机会，可以让我的生意赚更多的钱&amp；我想在这之前确定Zake不再是生意的一部分，或者至少我们应该有一份签署的合同。<p>我正在考虑向Zake发送一份创始人协议，其中包括悬崖归属和终止信息。<p>你们对我如何能让Zake完全离开和快速离开有什么建议吗？<p>他们也是我最老的朋友之一，我想他们认为我不会因此而摆脱他们。不过我会的。<p>事先谢谢你!",
  "description_zh-Hant": "嗨，<p>我自己開發了我的業務&amp；花了~3千美元的自有資金。當我的網站完成了95%時，我讓我的一個朋友Zake*在我們上線前一個月為我製作了標誌。我們商定，我付給Zake 300美元的標誌費。Zake改變了主意，說我應該給他們5%的業務、聯合創始人的頭銜和 \"會議席位\"。這是1.5年前的事，是他們最初的報價，我沒有與他們談判。<p>我們根本沒有簽署任何類型的合同（我知道這是個壞主意）。我們口頭約定，Zake將a）每週5天在社交媒體上發佈信息；b）做我們的SEO；c）每月更新一次網站圖片，小事如改變網站橫幅；d）使任何雜項文件看起來很好（沒有內容，只有美感），如我們的Pitch deck；e）參加我們每週的團隊會議。<p>在我們的網站上，Zake被列為聯合創始人，但我們沒有簽署任何合同/文件，他們的股份是汗水股份，他們沒有向企業投入任何資金。<p>我們有很多 \"幾乎\"，但到今天為止，我們沒有任何投資者，公司也沒有多少價值。到目前為止，我們的月收入約為2千至5千美元。去年，我們的月收入是0-1千美元。我們住在一個發展中國家，這裡的生活成本要低得多。<p>Zake幾乎什麼都不做&amp; 我有證據，我反覆要求他們做他們的任務。在過去的1.5年裡，這一直是我們的一個持續問題。我有Zake的電子郵件，承認他們沒有發揮自己的作用&amp; 他們會改變，但他們沒有。<p>我希望Zake離開我的生意。大約一週前，我給Zake發了一封善意的電子郵件，表示如果他們離開公司，這可能是 \"對我們兩個人最好的\"。我向Zake提供了750美元作為某種遣散費。他們沒有迴應。說實話，我不介意和他們談判，給他們多一點錢，我只是希望他們離開。他們甚至不參加我們的團隊會議了。這一年來，他們在業務上最多隻工作了2個小時（包括團隊會議），現在已經快5月了。<p>雖然他們應該在2020年9月做SEO，但他們仍然沒有做。我付錢給一個自由職業者來做SEO。除了SEO之外，我正在做Zake的所有任務。實際上是100%。說實話，這並不難。<p>自從我在個人社交媒體上獲得知名度以來（我的粉絲在6位數，去年是5位數），我們的銷售額一直在迅速增加；我感覺到Zake在保持一隻腳在門口，以防我們爆炸，但他們不願意做任何工作來幫助我們達到目標。我還有一個很好的機會，可以讓我的生意賺更多的錢&amp；我想在這之前確定Zake不再是生意的一部分，或者至少我們應該有一份簽署的合同。<p>我正在考慮向Zake發送一份創始人協議，其中包括懸崖歸屬和終止信息。<p>你們對我如何能讓Zake完全離開和快速離開有什麼建議嗎？<p>他們也是我最老的朋友之一，我想他們認為我不會因此而擺脫他們。不過我會的。<p>事先謝謝你!"
}