{
  "@type": "NewsArticle",
  "identifier": "2022--07--11--en--myfeed--HackerNews--NewsArticle--32052666",
  "url": "https://news.ycombinator.com/item?id=32052666",
  "headline": "Does the internet have a 1 star review problem?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "A few days ago, I was in the lobby of my hotel on a Greek island. A woman was at the front desk very upset about having not been upgraded. She was yelling at the staff and causing a real scene. She left with everyone visibly shaken.  Chatting with them a little after, this sounds like an all too common scene.<p>This morning, as promised, a 1 star rating shows up on every review platform. She claims the hotel is ugly, the staff was rude and racist, and even that someone had pushed her.<p>Everything about this claim is a lie. My partner and have been here 4 days and everything has been fantastic. Every single person on the staff goes out of their way to be helpful and the property is beautiful.<p>Looking more at their reviews online, there are a handful of 1 star reviews with some crazy claims. One even looks to have photoshopped an image to make the pool appear dirty. Almost every 1 star review mentioned not being upgraded.<p>I've become especially sensitive to this after listing a property on Airbnb last year. Almost all guests and reviews are wonderful, thoughtful comments about my home and it's location. But then occasionally get a 3 star review with an explanation of something like &quot;the dryer vent had lint in it&quot;. Come on...you're staying in a cabin in the woods, not the St Regis.<p>As a business owner and a technologist, I feel a ton of empathy for people that have it all on the line and can be so vulnerable. How can rating systems better account for/normalize against this kind of behavior?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "iflypropplanes",
    "url": "https://news.ycombinator.com/user?id=iflypropplanes"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32052666",
  "sameAs": "https://news.ycombinator.com/item?id=32052666",
  "dateCreated": "2022-07-11T05:55:55.171Z",
  "datePublished": "2022-07-11T05:48:13.000Z",
  "dateModified": "2022-07-11T05:55:55.171Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "互联网有一个1星评论的问题吗？\n",
  "headline_zh-Hant": "互聯網有一個1星評論的問題嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几天前，我在希腊一个岛上的酒店大堂里。一个女人在前台，对没有被升级的事非常不满。她对工作人员大喊大叫，引起了一场真正的骚乱。她离开时，每个人都明显受到了震动。 之后和他们聊了一会儿，这听起来像是一个太常见的场景。<p>今天早上，如约而至，一个1星的评价出现在每个评论平台上。她声称酒店很丑陋，工作人员很粗鲁，有种族歧视，甚至还有人推了她。<p>关于这个说法，一切都是谎言。我的伙伴和我已经在这里呆了4天，一切都很好。每一个工作人员都不遗余力地提供帮助，而且这个地方非常漂亮。<p>再看看他们在网上的评论，有几条一星的评论，其中有一些疯狂的说法。其中一个甚至看起来对图片进行了PS，使游泳池看起来很脏。几乎所有的一星评论都提到了没有升级。<p>去年我在Airbnb上列出了一处房产后，对这个问题变得特别敏感。几乎所有的客人和评论都是很好的，对我的房子和它的位置有很好的评价。但偶尔也会收到一个三星级的评论，其中的解释是：\"烘干机的通风口有绒毛\"。拜托......你住的是森林中的小木屋，而不是圣瑞吉酒店。<p>作为一个企业主和技术专家，我对那些把一切都放在网上的人感到非常同情，他们可能是如此脆弱。如何让评级系统更好地考虑/规范这种行为？\n",
  "description_zh-Hant": "幾天前，我在希臘一個島上的酒店大堂裡。一個女人在前臺，對沒有被升級的事非常不滿。她對工作人員大喊大叫，引起了一場真正的騷亂。她離開時，每個人都明顯受到了震動。 之後和他們聊了一會兒，這聽起來像是一個太常見的場景。<p>今天早上，如約而至，一個1星的評價出現在每個評論平臺上。她聲稱酒店很醜陋，工作人員很粗魯，有種族歧視，甚至還有人推了她。<p>關於這個說法，一切都是謊言。我的夥伴和我已經在這裡呆了4天，一切都很好。每一個工作人員都不遺餘力地提供幫助，而且這個地方非常漂亮。<p>再看看他們在網上的評論，有幾條一星的評論，其中有一些瘋狂的說法。其中一個甚至看起來對圖片進行了PS，使游泳池看起來很髒。幾乎所有的一星評論都提到了沒有升級。<p>去年我在Airbnb上列出了一處房產後，對這個問題變得特別敏感。幾乎所有的客人和評論都是很好的，對我的房子和它的位置有很好的評價。但偶爾也會收到一個三星級的評論，其中的解釋是：\"烘乾機的通風口有絨毛\"。拜託......你住的是森林中的小木屋，而不是聖瑞吉酒店。<p>作為一個企業主和技術專家，我對那些把一切都放在網上的人感到非常同情，他們可能是如此脆弱。如何讓評級系統更好地考慮/規範這種行為？\n"
}