{
  "@type": "NewsArticle",
  "identifier": "2022--07--30--en--myfeed--HackerNews--NewsArticle--32283773",
  "url": "https://news.ycombinator.com/item?id=32283773",
  "headline": "Do you regret deleting FB or IG or any social media?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have long been thinking about deleting my FB account after taking out all the info and datapoints. I have been actively using FB many years ago, I still have a lot of &quot;friends on facebook&quot; who I haven't really talked with in over 3-4 years, I still go to FB because it's a habit and all I get is the waste of time in groups about birds not being real. I feel the urge to delete FB to become more productive (I know, sounds funny). I have already deleted most social media apps from my phone, but I still use it all via browser. There are no benefits from FB, I don't know why I need it, I have not used FB to communicate with anyone from real life in over 4 years. I know many of you have been deleting facebook accounts over a really long time due to data sharing concerns – but after deleting, do you find yourself missing anything from FB? Do you wish you could bring back time and not delete FB? Or do you simply not think about it anymore? I know it should not be a big deal, but FB was the center of my online life many years ago and although, now looking back, I realise it was rather unhealthy and obsessive, I still feel like deleting it would delete a significant part of my life, even if it was in the past.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "happyexplorer",
    "url": "https://news.ycombinator.com/user?id=happyexplorer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32283773",
  "sameAs": "https://news.ycombinator.com/item?id=32283773",
  "dateCreated": "2022-07-30T03:58:20.954Z",
  "datePublished": "2022-07-30T02:28:03.000Z",
  "dateModified": "2022-07-30T03:58:20.954Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 14
    }
  ],
  "headline_zh-Hans": "你后悔删除FB或IG或任何社交媒体吗？\n",
  "headline_zh-Hant": "你後悔刪除FB或IG或任何社交媒體嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我长期以来一直在考虑在取出所有信息和数据点后删除我的FB账户。很多年前我就积极使用FB，我还有很多&quot;facebook&quot;上的朋友，我已经有3-4年多没有真正交谈过了，我仍然去FB，因为这是一种习惯，而我得到的只是在群里浪费的关于鸟类不真实的时间。我感到有种冲动，要删除FB，以提高工作效率（我知道，听起来很好笑）。我已经从我的手机上删除了大多数社交媒体应用程序，但我仍然通过浏览器使用这一切。FB没有任何好处，我不知道我为什么需要它，我已经4年多没有用FB与现实生活中的人交流了。我知道你们中的许多人由于担心数据共享而在很长一段时间内一直在删除facebook账户--但在删除之后，你是否发现自己对FB有什么想念？你是否希望自己能让时间倒流，不删除FB？还是你根本就不再去想它了？我知道这不应该是个大问题，但多年前，FB是我网络生活的中心，虽然现在回头看，我意识到这是相当不健康和强迫性的，但我仍然觉得删除它将删除我生活中的一个重要部分，即使它已经成为过去。\n",
  "description_zh-Hant": "我長期以來一直在考慮在取出所有信息和數據點後刪除我的FB賬戶。很多年前我就積極使用FB，我還有很多&quot;facebook&quot;上的朋友，我已經有3-4年多沒有真正交談過了，我仍然去FB，因為這是一種習慣，而我得到的只是在群裡浪費的關於鳥類不真實的時間。我感到有種衝動，要刪除FB，以提高工作效率（我知道，聽起來很好笑）。我已經從我的手機上刪除了大多數社交媒體應用程序，但我仍然通過瀏覽器使用這一切。FB沒有任何好處，我不知道我為什麼需要它，我已經4年多沒有用FB與現實生活中的人交流了。我知道你們中的許多人由於擔心數據共享而在很長一段時間內一直在刪除facebook賬戶--但在刪除之後，你是否發現自己對FB有什麼想念？你是否希望自己能讓時間倒流，不刪除FB？還是你根本就不再去想它了？我知道這不應該是個大問題，但多年前，FB是我網絡生活的中心，雖然現在回頭看，我意識到這是相當不健康和強迫性的，但我仍然覺得刪除它將刪除我生活中的一個重要部分，即使它已經成為過去。\n"
}