{
  "@type": "NewsArticle",
  "identifier": "2022--06--27--en--myfeed--HackerNews--NewsArticle--31899407",
  "url": "https://news.ycombinator.com/item?id=31899407",
  "headline": "Snorkel AI is looking for core front end engineers",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Snorkel AI | https://snorkel.ai/ | Senior Frontend Engineer | Full-time | ONSITE | SF Bay Area<p>Just a quick bit about Snorkel. We're backed by top tier investors (https://snorkel.ai/company/) and just raised our Series C last year, putting us in a really well strong position to continue building Snorkel Flow and our business. Our customers include some of the world's largest enterprises — top US banks, Memorial Sloan Kettering Cancer Center, Chubb, F500 biotechs, and more (https://snorkel.ai/case-studies/) — and we're empowering their data science teams to build high quality models in just hours or days instead of weeks or months. But we're really just getting started on our journey, and there are so many diverse opportunities for having impact across the company.<p>As a senior front-end engineer, you'll build amazing interfaces that will empower developers and non-developers alike to rapidly build, manage, and analyze ML pipelines in Snorkel Flow.<p>Front-end is incredibly important to our mission here at Snorkel. The intuitive—and as some users have called them, fun—workflows we've created to help data scientists and subject matter experts quickly build high quality training data sets and ML models are what set us apart. Right now, we're looking for leadership across some major initiatives focusing on \n* performance and snappiness (streaming server-side rendering, SWR, React Suspense etc.);\n* deepening our design system and component library (Storybook, Chromatic); and \n* general front-end codebase architecture to make sure we can keep scaling and moving fast.<p>Absolutely no need to have experience or deep familiarity with ML/AI, but there's no better place and no better team to work with if you're interested in learning what it takes to build production ML systems.<p>## Main Responsibilities\n* Design and develop key interfaces of Snorkel Flow, including a novel IDE for programmatic labeling, data analysis, and visualization tools\n* Advocate and help define standards for the best practices in performance, product quality, security and user experience across the entire application\n* Provide mentorship and foster a growth and collaborative mindset for all members of your team.\n* Collaborate with cross functional teams on developing large scale products\n* Proactively identify technical debt and implement solutions to improve product iteration<p>## Preferred Qualifications\n* 5+ years of professional experience with modern React (ES7, React hooks, TypeScript)\n* Strong technical communication skills and initiative\n* Experience leading front-end projects / features\n* Product engineering experience building full-stack web applications\n* Ability to prototype and iterate quickly around sophisticated user workflows\n* Obsession with front-end development best practices, including designing unit and end-to-end tests\n* Ability to work in a fast-paced, startup environment<p>You can find more information on our job posting (https://boards.greenhouse.io/snorkelai/jobs/4136833004), in this FAQ (https://snorkel.ai/faq/), and on our website (https://snorkel.ai/join-us/).<p>If interested, email rakesh.guha@snorkel.ai and sharyl.sun@snorkel.ai.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "guharakesh",
    "url": "https://news.ycombinator.com/user?id=guharakesh"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31899407",
  "sameAs": "https://news.ycombinator.com/item?id=31899407",
  "dateCreated": "2022-06-27T19:42:19.146Z",
  "datePublished": "2022-06-27T19:17:24.000Z",
  "dateModified": "2022-06-27T19:42:19.146Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Snorkel AI正在寻找核心前端工程师\n",
  "headline_zh-Hant": "Snorkel AI正在尋找核心前端工程師\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Snorkel AI | https://snorkel.ai/ | 高级前端工程师 | 全职 | 在职 | 旧金山湾区<p>简单介绍一下Snorkel。我们得到顶级投资者（https://snorkel.ai/company/）的支持，去年刚完成C轮融资，使我们处于非常有利的地位，可以继续建设Snorkel Flow和我们的业务。我们的客户包括一些世界上最大的企业--美国顶级银行、纪念斯隆凯特琳癌症中心、Chubb、F500生物技术公司等（https://snorkel.ai/case-studies/），我们使他们的数据科学团队能够在几小时或几天内建立高质量的模型，而不是几周或几个月。<p>作为一名高级前端工程师，你将建立令人惊叹的界面，使开发人员和非开发人员都能在Snorkel Flow中快速建立、管理和分析ML管道。<p>前端对我们在Snorkel的任务非常重要。我们创建了直观的--正如一些用户所说的，有趣的--工作流程，以帮助数据科学家和主题专家快速建立高质量的训练数据集和ML模型，这是我们与众不同的地方。现在，我们正在寻找一些重大举措的领导，重点是 \n* 性能和敏捷性（流式服务器端渲染、SWR、React Suspense等）。\n* 深化我们的设计系统和组件库（Storybook, Chromatic）；以及 \n<p>绝对不需要有ML/AI的经验或深度熟悉，但如果你有兴趣学习建立生产型ML系统所需要的东西，没有比这更好的地方和团队了。\n* 设计和开发Snorkel Flow的关键界面，包括用于程序化标签、数据分析和可视化工具的新颖IDE。\n* 倡导并帮助定义整个应用程序在性能、产品质量、安全和用户体验方面的最佳实践标准\n* 为你的团队的所有成员提供指导并培养成长和协作的心态。\n* 与跨职能团队合作开发大规模的产品\n* 主动识别技术债务，并实施解决方案，以改善产品迭代<p>## 优选资格\n* 5年以上现代React（ES7，React钩子，TypeScript）的专业经验\n* 有较强的技术沟通能力和主动性\n* 有领导前端项目/功能的经验\n* 有构建全栈网络应用的产品工程经验\n* 有能力围绕复杂的用户工作流程进行原型设计和快速迭代\n* 痴迷于前端开发的最佳实践，包括设计单元和端到端的测试\n<p>您可以在我们的招聘启事（https://boards.greenhouse.io/snorkelai/jobs/4136833004）、常见问题（https://snorkel.ai/faq/）和我们的网站（https://snorkel.ai/join-us/）上找到更多信息。<p>如果感兴趣，请发送电子邮件至 rakesh.guha@snorkel.ai 和 sharyl.sun@snorkel.ai。\n",
  "description_zh-Hant": "Snorkel AI | https://snorkel.ai/ | 高級前端工程師 | 全職 | 在職 | 舊金山灣區<p>簡單介紹一下Snorkel。我們得到頂級投資者（https://snorkel.ai/company/）的支持，去年剛完成C輪融資，使我們處於非常有利的地位，可以繼續建設Snorkel Flow和我們的業務。我們的客戶包括一些世界上最大的企業--美國頂級銀行、紀念斯隆凱特琳癌症中心、Chubb、F500生物技術公司等（https://snorkel.ai/case-studies/），我們使他們的數據科學團隊能夠在幾小時或幾天內建立高質量的模型，而不是幾周或幾個月。<p>作為一名高級前端工程師，你將建立令人驚歎的界面，使開發人員和非開發人員都能在Snorkel Flow中快速建立、管理和分析ML管道。<p>前端對我們在Snorkel的任務非常重要。我們創建了直觀的--正如一些用戶所說的，有趣的--工作流程，以幫助數據科學家和主題專家快速建立高質量的訓練數據集和ML模型，這是我們與眾不同的地方。現在，我們正在尋找一些重大舉措的領導，重點是 \n* 性能和敏捷性（流式服務器端渲染、SWR、React Suspense等）。\n* 深化我們的設計系統和組件庫（Storybook, Chromatic）；以及 \n<p>絕對不需要有ML/AI的經驗或深度熟悉，但如果你有興趣學習建立生產型ML系統所需要的東西，沒有比這更好的地方和團隊了。\n* 設計和開發Snorkel Flow的關鍵界面，包括用於程序化標籤、數據分析和可視化工具的新穎IDE。\n* 倡導並幫助定義整個應用程序在性能、產品質量、安全和用戶體驗方面的最佳實踐標準\n* 為你的團隊的所有成員提供指導並培養成長和協作的心態。\n* 與跨職能團隊合作開發大規模的產品\n* 主動識別技術債務，並實施解決方案，以改善產品迭代<p>## 優選資格\n* 5年以上現代React（ES7，React鉤子，TypeScript）的專業經驗\n* 有較強的技術溝通能力和主動性\n* 有領導前端項目/功能的經驗\n* 有構建全棧網絡應用的產品工程經驗\n* 有能力圍繞複雜的用戶工作流程進行原型設計和快速迭代\n* 痴迷於前端開發的最佳實踐，包括設計單元和端到端的測試\n<p>您可以在我們的招聘啟事（https://boards.greenhouse.io/snorkelai/jobs/4136833004）、常見問題（https://snorkel.ai/faq/）和我們的網站（https://snorkel.ai/join-us/）上找到更多信息。<p>如果感興趣，請發送電子郵件至 rakesh.guha@snorkel.ai 和 sharyl.sun@snorkel.ai。\n"
}