{
  "@type": "NewsArticle",
  "identifier": "2022--04--25--en--myfeed--HackerNews--NewsArticle--31153652",
  "url": "https://news.ycombinator.com/item?id=31153652",
  "headline": "Ever wanted galleries to be more social and rich of moments?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "frames - &quot;a gen-z social gallery&quot;. A gallery exclusive for captured moments of different circles of friends. A social media straight out of the camera.<p>A home for all the casual clicks that you would not post on social media, all the funny and weird moments of different circles of friends that eventually get lost when shared via other chat applications.<p>Featuring a moment-centric chat system, retrieve and discuss conversations that happened at the time of the moment.<p>Capturing moments and adding to threads is so easy that you create memories categorized based on threads without even realizing it. You can create multiple threads like one for your dog, one for your loved one, one for your gang, and add your friends to it as well.<p>This place offers zero noise as you can't add screenshots or memes or, be it, any jpeg file; you can only add what is captured from the camera.<p>The product is in its early stage and out in play store. We are looking forward to suggestions and thoughts from people for making this product better and probably shedding light in new problems that we can solve.<p>website:\nhttps://www.frames.live",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "aarvis",
    "url": "https://news.ycombinator.com/user?id=aarvis"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31153652",
  "sameAs": "https://news.ycombinator.com/item?id=31153652",
  "dateCreated": "2022-04-25T13:28:10.634Z",
  "datePublished": "2022-04-25T12:45:53.000Z",
  "dateModified": "2022-04-25T13:28:10.634Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "有没有想过让画廊变得更有社会性，更有丰富的时刻？",
  "headline_zh-Hant": "有沒有想過讓畫廊變得更有社會性，更有豐富的時刻？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "框架 - &quot;一个gen-z社交画廊&quot;。一个专为不同的朋友圈拍摄的时刻而设的画廊。一个直接从相机里出来的社交媒体。<p>所有你不会在社交媒体上发布的随手拍的照片的家，所有不同朋友圈的有趣和奇怪的时刻，在通过其他聊天应用程序分享时最终会丢失。<p>拥有一个以时刻为中心的聊天系统，检索和讨论发生在时刻的对话。你可以创建多个线程，如为你的狗创建一个，为你的爱人创建一个，为你的团伙创建一个，并将你的朋友也加入其中。<p>这个地方提供了零噪音，因为你不能添加屏幕截图或备忘录，或者，任何jpeg文件；你只能添加从相机拍摄的内容。我们期待着人们的建议和想法，以使这个产品变得更好，并可能在我们可以解决的新问题中得到启示。\nhttps://www.frames.live",
  "description_zh-Hant": "框架 - &quot;一個gen-z社交畫廊&quot;。一個專為不同的朋友圈拍攝的時刻而設的畫廊。一個直接從相機裡出來的社交媒體。<p>所有你不會在社交媒體上發佈的隨手拍的照片的家，所有不同朋友圈的有趣和奇怪的時刻，在通過其他聊天應用程序分享時最終會丟失。<p>擁有一個以時刻為中心的聊天系統，檢索和討論發生在時刻的對話。你可以創建多個線程，如為你的狗創建一個，為你的愛人創建一個，為你的團伙創建一個，並將你的朋友也加入其中。<p>這個地方提供了零噪音，因為你不能添加屏幕截圖或備忘錄，或者，任何jpeg文件；你只能添加從相機拍攝的內容。我們期待著人們的建議和想法，以使這個產品變得更好，並可能在我們可以解決的新問題中得到啟示。\nhttps://www.frames.live"
}