{
  "@type": "NewsArticle",
  "identifier": "2022--04--15--en--myfeed--HackerNews--NewsArticle--31039281",
  "url": "https://news.ycombinator.com/item?id=31039281",
  "headline": "How would you solve this problem?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I thought HN crowd might enjoy noodling this. I am a commercial real estate broker working with a large developer in a major North American city. This is the type of prisoner's dilemma I face.<p>Let's say we try to assembly a lot that consists of 10 properties with different owners (different sized lots). Developers can pay around x per buildable square foot, and that amount is higher for each individual owner than what they could get if they are selling their property individually. The fair way to pay everyone is to divide total amount the land is worth to the developer proportionally by lot size to each owner.<p>This is the problem that always arises: people get greedy. Not everyone, but at least 2 out of these 10 owner will be unreasonable. If everyone, or enough people get greedy, it kills the deal. On the other hand people who are greedy and hold out get more than people who are more amiable. So, from the stand point of the owner who wants to maximize their proceeds being greedy works, but only if everyone else is not.<p>I only get paid if the deal closes. If you were me how would you approach this prisoner's dilemma from my side?<p>Let's start with I have amount M that the land is worth, I have 10 owners with different sized lots. Now what? I have a goal to buy up the 10 lots at M or below. What should my strategy be here? I have to tie all the lots at the same time (I have 60 days from the day the first property is tied up, to buy the last one).<p>Thank you for your thoughts!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "goodJobWalrus",
    "url": "https://news.ycombinator.com/user?id=goodJobWalrus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31039281",
  "sameAs": "https://news.ycombinator.com/item?id=31039281",
  "dateCreated": "2022-04-15T12:16:05.675Z",
  "datePublished": "2022-04-15T12:13:03.000Z",
  "dateModified": "2022-04-15T12:16:05.675Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "你会如何解决这个问题？",
  "headline_zh-Hant": "你會如何解決這個問題？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我想HN人群可能会喜欢这个。我是一名商业房地产经纪人，与北美一个主要城市的一个大型开发商合作。这就是我所面临的囚徒困境的类型。<p>假设我们试图组装一个由10个不同业主（不同大小的地段）的房产组成的地段。开发商可以为每一个可建的平方英尺支付大约x的费用，而这个数额对于每个单独的业主来说都比他们单独出售自己的房产所能得到的要高。支付给每个人的公平方式是将土地的总价值按比例划分给开发商和每个业主的地段大小。不是所有人，但这10个业主中至少有2个是不合理的。如果每个人，或足够多的人变得贪婪，就会扼杀交易。另一方面，贪婪和坚持的人比和蔼可亲的人得到更多。因此，从业主的角度来看，想要使他们的收益最大化，贪婪是可行的，但前提是其他人都不贪婪。如果你是我，你将如何从我的角度来处理这个囚徒困境？<p>让我们从我拥有土地价值的M数额开始，我有10个拥有不同大小土地的业主。现在怎么办？我的目标是以M或低于M的价格买下这10块土地。我的策略应该是什么？我必须同时捆绑所有的土地（从第一个房产被捆绑之日起，我有60天时间来购买最后一个）。",
  "description_zh-Hant": "我想HN人群可能會喜歡這個。我是一名商業房地產經紀人，與北美一個主要城市的一個大型開發商合作。這就是我所面臨的囚徒困境的類型。<p>假設我們試圖組裝一個由10個不同業主（不同大小的地段）的房產組成的地段。開發商可以為每一個可建的平方英尺支付大約x的費用，而這個數額對於每個單獨的業主來說都比他們單獨出售自己的房產所能得到的要高。支付給每個人的公平方式是將土地的總價值按比例劃分給開發商和每個業主的地段大小。不是所有人，但這10個業主中至少有2個是不合理的。如果每個人，或足夠多的人變得貪婪，就會扼殺交易。另一方面，貪婪和堅持的人比和藹可親的人得到更多。因此，從業主的角度來看，想要使他們的收益最大化，貪婪是可行的，但前提是其他人都不貪婪。如果你是我，你將如何從我的角度來處理這個囚徒困境？<p>讓我們從我擁有土地價值的M數額開始，我有10個擁有不同大小土地的業主。現在怎麼辦？我的目標是以M或低於M的價格買下這10塊土地。我的策略應該是什麼？我必須同時捆綁所有的土地（從第一個房產被捆綁之日起，我有60天時間來購買最後一個）。"
}