{
  "@type": "NewsArticle",
  "identifier": "2022--06--20--en--myfeed--HackerNews--NewsArticle--31808855",
  "url": "https://news.ycombinator.com/item?id=31808855",
  "headline": "A Reddit Community poops for purpose",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "If you put your poop into an airtight container, it decomposes using a process called anaerobic digestion. This creates biogas, which can be used as an energy source. It is a big business, countries like Germany have around 10000 commercial biogas plants in operation. But also smaller tanks, sometimes smaller than an oil barrel, are often used to power off the grid and rural communities.<p>The composition of the organic waste along with a whole other slew of environmental factors has a massive impact on the energy generated. But because few bother to experiment, on an industrial scale current feedstock is often limited to well understood &quot;safe&quot; substrate such as maize or corn.<p>This is something a Reddit community now aims to tackle.<p>Anaerobic digestion of organic matter is well enough understood, that key components of the process can be described by more or less complex mathematical models. This opens up the possibility to find suitable candidates for new substrate purely through mathematical modeling. This is comparable to the automated drugs discovery process nowadays explored in the pharmaceutical community.<p>Using BioNet, a software modeling the anaerobic digestion process through simplified but established algorithms, a lot of the preliminary investigation is conducted. If suitable revelations about the anaerobic digestion process are found digitally, the hope is to be able to replicate this in a real biogas tank as well. \nCritics are doubtful of the validity of any revelations gained through this endeavor. According to the community, skepticism is warranted. But the successful applicability of anaerobic digestion models in the past raises at least the prospect that digital models are a worthwhile addition for any researcher in the field. It's similar to how computational fluid dynamics have augmented real wind tunnels in the design of a vehicle, they say.<p>BioNet and related software do not offer any fundamental new capabilities. But they simplify access to complicated mathematical models, that previously were only reserved to researchers in the field. Making science more open and accessible, is one of the fundamental pillars of biohacking. Because even though vague guesses exist, much of the work is still trial and error. And trial and error benefits from great participation.<p>Links:\nhttps://apps.microsoft.com/store/detail/bionet/9NMNRN406NL4?hl=en-en&amp;gl=en<p>https://www.reddit.com/r/Biohackers/comments/vgicfa/powering_your_phone_through_your_poop_biogas/",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Blubal3d",
    "url": "https://news.ycombinator.com/user?id=Blubal3d"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31808855",
  "sameAs": "https://news.ycombinator.com/item?id=31808855",
  "dateCreated": "2022-06-20T11:41:44.890Z",
  "datePublished": "2022-06-20T11:07:17.000Z",
  "dateModified": "2022-06-20T11:41:44.890Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "一个Reddit社区为了目的而大便\n",
  "headline_zh-Hant": "一個Reddit社區為了目的而大便\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "如果你把大便放进一个密闭的容器里，它就会利用一种叫做厌氧消化的过程进行分解。这就产生了沼气，可以作为一种能源来使用。这是个大生意，像德国这样的国家有大约10000个商业沼气厂在运行。但也有更小的罐子，有时比油桶还小，经常被用来为电网外和农村社区供电。<p>有机废物的成分以及其他一系列环境因素对产生的能源有巨大影响。但是，由于很少有人愿意做实验，在工业规模上，目前的原料往往局限于人们所熟知的安全基质，如玉米。<p>这是一个Reddit社区现在要解决的问题。<p>人们对有机物的厌氧消化有足够的了解，该过程的关键组成部分可以通过或多或少的复杂数学模型来描述。这就为纯粹通过数学模型找到合适的新基质候选者提供了可能。<p>使用BioNet，一个通过简化但已确立的算法对厌氧消化过程进行建模的软件，进行大量的初步调查。如果以数字方式发现了关于厌氧消化过程的适当启示，那么希望也能在真正的沼气池中进行复制。\n批评者对通过这一努力获得的任何启示的有效性表示怀疑。根据社区的说法，持怀疑态度是有道理的。但过去厌氧消化模型的成功适用性至少提出了一个前景，即数字模型对该领域的任何研究者来说都是一个值得的补充。他们说，这类似于计算流体力学在汽车设计中对真实风洞的增强。<p>BioNet和相关软件没有提供任何基本的新功能。但它们简化了对复杂数学模型的访问，而这些模型以前只保留给该领域的研究人员。让科学更加开放和容易获得，是生物黑客的基本支柱之一。因为即使存在模糊的猜测，大部分的工作仍然是试错。而试验和错误得益于伟大的参与。<p>链接。\nhttps://apps.microsoft.com/store/detail/bionet/9NMNRN406NL4?hl=en-en&amp;gl=en<p>https://www.reddit.com/r/Biohackers/comments/vgicfa/powering_your_phone_through_your_poop_biogas/\n",
  "description_zh-Hant": "如果你把大便放進一個密閉的容器裡，它就會利用一種叫做厭氧消化的過程進行分解。這就產生了沼氣，可以作為一種能源來使用。這是個大生意，像德國這樣的國家有大約10000個商業沼氣廠在運行。但也有更小的罐子，有時比油桶還小，經常被用來為電網外和農村社區供電。<p>有機廢物的成分以及其他一系列環境因素對產生的能源有巨大影響。但是，由於很少有人願意做實驗，在工業規模上，目前的原料往往侷限於人們所熟知的安全基質，如玉米。<p>這是一個Reddit社區現在要解決的問題。<p>人們對有機物的厭氧消化有足夠的瞭解，該過程的關鍵組成部分可以通過或多或少的複雜數學模型來描述。這就為純粹通過數學模型找到合適的新基質候選者提供了可能。<p>使用BioNet，一個通過簡化但已確立的算法對厭氧消化過程進行建模的軟件，進行大量的初步調查。如果以數字方式發現了關於厭氧消化過程的適當啟示，那麼希望也能在真正的沼氣池中進行復制。\n批評者對通過這一努力獲得的任何啟示的有效性表示懷疑。根據社區的說法，持懷疑態度是有道理的。但過去厭氧消化模型的成功適用性至少提出了一個前景，即數字模型對該領域的任何研究者來說都是一個值得的補充。他們說，這類似於計算流體力學在汽車設計中對真實風洞的增強。<p>BioNet和相關軟件沒有提供任何基本的新功能。但它們簡化了對複雜數學模型的訪問，而這些模型以前只保留給該領域的研究人員。讓科學更加開放和容易獲得，是生物黑客的基本支柱之一。因為即使存在模糊的猜測，大部分的工作仍然是試錯。而試驗和錯誤得益於偉大的參與。<p>鏈接。\nhttps://apps.microsoft.com/store/detail/bionet/9NMNRN406NL4?hl=en-en&amp;gl=en<p>https://www.reddit.com/r/Biohackers/comments/vgicfa/powering_your_phone_through_your_poop_biogas/\n"
}