{
  "@type": "NewsArticle",
  "identifier": "2022--07--14--en--myfeed--HackerNews--NewsArticle--32096656",
  "url": "https://news.ycombinator.com/item?id=32096656",
  "headline": "Tell HN: Upwork Has an Impersonation Problem",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The past few days I started getting interview invites from companies and people I had never heard of. I initially shrugged it off as aggressive spam, but after declining one of the invites, one of the emailers followed up to confirm that I was the same person that they were talking to on Upwork.<p>I had never setup an Upwork profile before so I said no, after which they responded with a link to a profile of someone that was completely impersonating me. They had scraped my LinkedIn page for information and were interviewing under the guise of being someone they were not (they were even using my picture). I talked to Upwork support, and after about 36 hours they deleted the impersonator. However, I just did another search and there is already someone else impersonating me again (this time they changed the face on the picture).<p>I only discovered this because the first impersonator was too lazy to change my resume they downloaded from my website and kept my real email on it, so some companies had used that email to contact me instead of their Upwork registered email.<p>I would recommend everyone search for their name on Upwork (I had to wrap mine in quotes to find the matches) and make sure they aren't being impersonated.<p>In the meantime, Upwork really needs a better validation mechanism. As engineers we really have no recourse, and there is absolutely nothing we can do to prevent this from happening.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "aarbor989",
    "url": "https://news.ycombinator.com/user?id=aarbor989"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32096656",
  "sameAs": "https://news.ycombinator.com/item?id=32096656",
  "dateCreated": "2022-07-14T15:30:57.689Z",
  "datePublished": "2022-07-14T14:42:00.000Z",
  "dateModified": "2022-07-14T15:30:57.689Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "告诉HN：Upwork有一个冒名顶替的问题\n",
  "headline_zh-Hant": "告訴HN：Upwork有一個冒名頂替的問題\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "过去几天，我开始收到来自我从未听说过的公司和个人的面试邀请。起初我把它当作咄咄逼人的垃圾邮件，但在拒绝了其中一个邀请后，其中一个发邮件的人跟进确认我就是他们在Upwork上交谈的那个人。<p>我以前从未建立过Upwork的档案，所以我说不，之后他们回复了一个完全冒充我的人的档案链接。他们搜刮了我的LinkedIn页面的信息，并以他们不是的身份进行面试（他们甚至使用我的照片）。我与Upwork的支持人员谈过，大约36小时后，他们删除了这个冒名顶替者。<p>我之所以发现这一点，是因为第一个冒名顶替者懒得改掉他们从我的网站上下载的简历，并在上面保留了我的真实电子邮件，所以一些公司用这个电子邮件与我联系，而不是用他们的Upwork注册电子邮件。 <p>我建议大家在Upwork上搜索自己的名字（我不得不把我的名字用引号包起来才能找到匹配的名字），并确保他们没有被冒充。<p>与此同时，Upwork真的需要一个更好的验证机制。作为工程师，我们真的无能为力，而且我们完全没有办法防止这种情况的发生。\n",
  "description_zh-Hant": "過去幾天，我開始收到來自我從未聽說過的公司和個人的面試邀請。起初我把它當作咄咄逼人的垃圾郵件，但在拒絕了其中一個邀請後，其中一個發郵件的人跟進確認我就是他們在Upwork上交談的那個人。<p>我以前從未建立過Upwork的檔案，所以我說不，之後他們回覆了一個完全冒充我的人的檔案鏈接。他們搜刮了我的LinkedIn頁面的信息，並以他們不是的身份進行面試（他們甚至使用我的照片）。我與Upwork的支持人員談過，大約36小時後，他們刪除了這個冒名頂替者。<p>我之所以發現這一點，是因為第一個冒名頂替者懶得改掉他們從我的網站上下載的簡歷，並在上面保留了我的真實電子郵件，所以一些公司用這個電子郵件與我聯繫，而不是用他們的Upwork註冊電子郵件。 <p>我建議大家在Upwork上搜索自己的名字（我不得不把我的名字用引號包起來才能找到匹配的名字），並確保他們沒有被冒充。<p>與此同時，Upwork真的需要一個更好的驗證機制。作為工程師，我們真的無能為力，而且我們完全沒有辦法防止這種情況的發生。\n"
}