{
  "@type": "NewsArticle",
  "identifier": "2022--06--07--en--myfeed--HackerNews--NewsArticle--31648326",
  "url": "https://news.ycombinator.com/item?id=31648326",
  "headline": "Tell HN: I used the same computer since 2007 (with minor upgrades)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "With all the news about the Apple M2 and the people excited to sunset their couple years old computers, I feel compelled to share my reality (and that of many others outside the HN bubble).<p>I'm a 27 years old software developer from Brazil. The computer in question was assembled in 2007 from parts that were mostly bought abroad (and then gifted to me) by a wealthier relative that was visiting. That's a key point: the currency exchange rates and the import taxes make electronics out of reach for the common folks.<p>That was an AMD2+ motherboard, 4GB of DDR2, a 5400 RPM rust spinner, and a Phenom X4 coupled with an ATI 4870.<p>Although the household was never in a dire situation financially, I had always been taught by example to fix things and keep using them for as long as possible. Even back in elementary school times I would troubleshoot computer issues myself and brush off dust from the components.<p>Yes, there have been hardware failures since 2007: two HDDs died (about 6 years lifespan for each), the 4870 died (but I extended its life for one more year with the bake-it-in-the-oven trick), one DIMM failure, a PSU blowout and a CPU cooler bracket mechanical failure.<p>All replacements that had to be purchased would cost me a significant amount of money. HDDs and PSUs were not that expensive, but GPUs were out of reach. When that DIMM died in 2018, I purchased an used and dusty DDR2 replacement kit off AliExpress.<p>After the pandemic hit and I got my first proper (remote) job in 2020, I splurged and replaced some components: a hand-me-down GPU from a wealthier friend (I had been using the onboard graphics since the 4870 died), an AMD3 motherboard, a Phenom II X4 and some DDR3, all used and from AliExpress.<p>The monitor, a 22&quot; TFT panel from Samsung, is still kicking since 2007 with a couple of dead pixels. Same goes for the mouse, manufactured by an unknown Chinese brand, and a membrane keyboard that I completely disassembled and scrubbed clean under a running faucet.<p>Even with my career finally taking off (I'm due to complete undergraduate Computer Science this year) I don't see myself doing major upgrades/purchases any soon.<p>When was the last time you gave something extra life instead of throwing it away?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "andrecarini",
    "url": "https://news.ycombinator.com/user?id=andrecarini"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31648326",
  "sameAs": "https://news.ycombinator.com/item?id=31648326",
  "dateCreated": "2022-06-07T02:03:39.762Z",
  "datePublished": "2022-06-07T00:22:47.000Z",
  "dateModified": "2022-06-07T02:03:39.762Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 82
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 48
    }
  ],
  "headline_zh-Hans": "告诉HN：我从2007年开始使用同一台电脑（有小幅升级）。\n",
  "headline_zh-Hant": "告訴HN：我從2007年開始使用同一臺電腦（有小幅升級）。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "随着所有关于苹果M2的新闻和人们兴奋地晒出他们几年前的电脑，我觉得有必要分享我的现实（以及HN泡沫之外的许多其他人的现实）。这台电脑是在2007年由一个来访的较富裕的亲戚用大部分在国外购买的零件组装而成（然后赠送给我）。这是一个关键点：货币汇率和进口税使电子产品对普通人来说遥不可及。<p>那是一块AMD2+主板，4GB DDR2，一个5400 RPM的锈蚀旋转器，以及一个Phenom X4和ATI 4870。<p>尽管家庭经济状况从未陷入困境，但我一直被教育要修理东西，并尽可能地保持使用它们。<p>是的，自2007年以来一直有硬件故障：两个硬盘死了（每个硬盘的寿命约为6年），4870死了（但我用烤箱烘烤的方法将其寿命延长了一年），一个DIMM故障，一个PSU爆炸，一个CPU冷却器支架机械故障。硬盘和PSU并不昂贵，但GPU却遥不可及。当DIMM在2018年死掉时，我从AliExpress购买了一个二手的、布满灰尘的DDR2替换套件。<p>在大流行病发生后，我在2020年得到了我的第一份正式（远程）工作，我挥霍并更换了一些组件：一个更富有的朋友递过来的GPU（自从4870死掉后我一直在使用板载图形），一块AMD3主板，一个Phenom II X4和一些DDR3，都是二手的，来自AliExpress。 <p>显示器是三星的22&quot;TFT面板，自2007年以来一直在运行，只有几个死像素。鼠标也是如此，它是由一个不知名的中国品牌制造的，还有一个薄膜键盘，我把它完全拆开，在流水的水龙头下擦洗干净。<p>即使我的事业终于起飞（我今年将完成计算机科学的本科课程），我也不认为自己很快会进行重大的升级/购买。\n",
  "description_zh-Hant": "隨著所有關於蘋果M2的新聞和人們興奮地曬出他們幾年前的電腦，我覺得有必要分享我的現實（以及HN泡沫之外的許多其他人的現實）。這臺電腦是在2007年由一個來訪的較富裕的親戚用大部分在國外購買的零件組裝而成（然後贈送給我）。這是一個關鍵點：貨幣匯率和進口稅使電子產品對普通人來說遙不可及。<p>那是一塊AMD2+主板，4GB DDR2，一個5400 RPM的鏽蝕旋轉器，以及一個Phenom X4和ATI 4870。<p>儘管家庭經濟狀況從未陷入困境，但我一直被教育要修理東西，並儘可能地保持使用它們。<p>是的，自2007年以來一直有硬件故障：兩個硬盤死了（每個硬盤的壽命約為6年），4870死了（但我用烤箱烘烤的方法將其壽命延長了一年），一個DIMM故障，一個PSU爆炸，一個CPU冷卻器支架機械故障。硬盤和PSU並不昂貴，但GPU卻遙不可及。當DIMM在2018年死掉時，我從AliExpress購買了一個二手的、佈滿灰塵的DDR2替換套件。<p>在大流行病發生後，我在2020年得到了我的第一份正式（遠程）工作，我揮霍並更換了一些組件：一個更富有的朋友遞過來的GPU（自從4870死掉後我一直在使用板載圖形），一塊AMD3主板，一個Phenom II X4和一些DDR3，都是二手的，來自AliExpress。 <p>顯示器是三星的22&quot;TFT面板，自2007年以來一直在運行，只有幾個死像素。鼠標也是如此，它是由一個不知名的中國品牌製造的，還有一個薄膜鍵盤，我把它完全拆開，在流水的水龍頭下擦洗乾淨。<p>即使我的事業終於起飛（我今年將完成計算機科學的本科課程），我也不認為自己很快會進行重大的升級/購買。\n"
}