{
  "@type": "NewsArticle",
  "identifier": "2022--06--28--en--myfeed--HackerNews--NewsArticle--31907374",
  "url": "https://news.ycombinator.com/item?id=31907374",
  "headline": "Tell HN: I DDoSed myself using AWS CloudFront and Lambda Edge and got $4.5k bill",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am using awesome NextJS and serverless-nextjs and deploy my app to CloudFront and Lambda@Edge.<p>I made a mistake and accidentally created a serverless function that called itself. In a recursive loop, with a 30s timeout. I thought I fixed it and deployed the code to the dev environment.<p>I have had an AWS Billing alert (Budgets) set up to prompt me when my monthly budget goes over $300 (my usual bill is $200/month).<p>Imagine the terror when I woke up the next day to see the AWS Billing alert email saying I already owed $1,484! I removed a function and deployed it again in 30 minutes, but it was too late. It has already run for 24 hours, using over 70 million Gb-Second!<p>Only after that I've learned that AWS Billing alerts do not work this way for CloudFront. You get delayed information on charges because they collect them from all regions.<p>On the following day, the bill settled at a shocking $4600. This is more than we have ever spent on AWS all time.<p>CloudFront includes the AWS Shield Standard feature, but somehow, it was not activated for this case (Lambda@Edge calling itself via CloudFront).<p>Now, I understand that I should have created CloudWatch alarms, which would alert me when the number of requests exceeds the limit. The problem is, that they need to be set up per region, and I got CloudFront charges from all points of presence.<p>I am a big proponent of the serverless approach. It makes it easy to scale and develop things (e.g., you get PR review version branches for free, both frontend and backend code like Vercel does). But now, I am unsure because such unexpected charges can ruin a side-project or emerging startup.<p>Now I am waiting on a response from AWS Support on these charges; maybe they can help me waive part of that.<p>What is your experience with it? Would you recommend to use to build a new product if you are bootstrapped, 3-person startup?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "huksley",
    "url": "https://news.ycombinator.com/user?id=huksley"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31907374",
  "sameAs": "https://news.ycombinator.com/item?id=31907374",
  "dateCreated": "2022-06-28T13:46:30.219Z",
  "datePublished": "2022-06-28T13:23:44.000Z",
  "dateModified": "2022-06-28T13:46:30.219Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "告诉HN：我使用AWS CloudFront和Lambda Edge对自己进行DDoS攻击，得到了4.5万美元的账单\n",
  "headline_zh-Hant": "告訴HN：我使用AWS CloudFront和Lambda Edge對自己進行DDoS攻擊，得到了4.5萬美元的賬單\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我正在使用令人敬畏的NextJS和serverless-nextjs，并将我的应用部署到CloudFront和Lambda@Edge。<p>我犯了一个错误，不小心创建了一个调用自己的无服务器函数。在一个递归循环中，有30秒的超时。我以为我解决了这个问题，并将代码部署到了开发环境中。<p>我已经设置了AWS账单提醒（Budgets），当我的月度预算超过300美元（我平时的账单是200美元/月）时，就会提示我。<p>想象一下，当我第二天醒来看到AWS账单提醒邮件说我已经欠下了1484美元时的恐惧吧 我删除了一个函数，并在30分钟内再次部署它，但为时已晚。它已经运行了24小时，使用了超过7000万Gb-Second！<p>之后我才知道，AWS Billing警报对CloudFront来说不是这样的。你得到的收费信息是延迟的，因为他们从所有地区收集收费信息。<p>第二天，账单结算的金额达到了惊人的4600美元。<p>CloudFront 包括 AWS Shield Standard 功能，但不知何故，它在这种情况下没有被激活（Lambda@Edge 通过 CloudFront 调用自己）。<p>现在，我明白我应该创建 CloudWatch 警报，这将在请求数超过限制时提醒我。问题是，它们需要在每个区域进行设置，而我从所有的存在点都得到了 CloudFront 的收费。<p>我是无服务器方法的忠实支持者。它使扩展和开发事情变得很容易（例如，你可以免费获得PR审核版本分支，包括前端和后端代码，就像Vercel那样）。但现在，我不确定，因为这种意外的收费会毁掉一个副业或新兴的创业公司。<p>现在我正在等待AWS支持部门对这些收费的答复；也许他们可以帮助我免除部分费用。<p>你对它有什么经验？如果你是自给自足的3人创业公司，你会推荐用它来建立一个新产品吗？\n",
  "description_zh-Hant": "我正在使用令人敬畏的NextJS和serverless-nextjs，並將我的應用部署到CloudFront和Lambda@Edge。<p>我犯了一個錯誤，不小心創建了一個調用自己的無服務器函數。在一個遞歸循環中，有30秒的超時。我以為我解決了這個問題，並將代碼部署到了開發環境中。<p>我已經設置了AWS賬單提醒（Budgets），當我的月度預算超過300美元（我平時的賬單是200美元/月）時，就會提示我。<p>想象一下，當我第二天醒來看到AWS賬單提醒郵件說我已經欠下了1484美元時的恐懼吧 我刪除了一個函數，並在30分鐘內再次部署它，但為時已晚。它已經運行了24小時，使用了超過7000萬Gb-Second！<p>之後我才知道，AWS Billing警報對CloudFront來說不是這樣的。你得到的收費信息是延遲的，因為他們從所有地區收集收費信息。<p>第二天，賬單結算的金額達到了驚人的4600美元。<p>CloudFront 包括 AWS Shield Standard 功能，但不知何故，它在這種情況下沒有被激活（Lambda@Edge 通過 CloudFront 調用自己）。<p>現在，我明白我應該創建 CloudWatch 警報，這將在請求數超過限制時提醒我。問題是，它們需要在每個區域進行設置，而我從所有的存在點都得到了 CloudFront 的收費。<p>我是無服務器方法的忠實支持者。它使擴展和開發事情變得很容易（例如，你可以免費獲得PR審核版本分支，包括前端和後端代碼，就像Vercel那樣）。但現在，我不確定，因為這種意外的收費會毀掉一個副業或新興的創業公司。<p>現在我正在等待AWS支持部門對這些收費的答覆；也許他們可以幫助我免除部分費用。<p>你對它有什麼經驗？如果你是自給自足的3人創業公司，你會推薦用它來建立一個新產品嗎？\n"
}