{
  "@type": "NewsArticle",
  "identifier": "2022--06--03--en--myfeed--HackerNews--NewsArticle--31603318",
  "url": "https://news.ycombinator.com/item?id=31603318",
  "headline": "Discussion: Website claims to “require” Windows or Mac but doesn't block Linux",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I may have discussed this at other places in the past.<p>I run FreeBSD on my desktop, and am a customer of Chase Bank (along with a few others), mainly since my family set me up there.<p>Chase claims to require Windows or macOS for their online banking, but doesn't block GNU/Linux or Chrome OS, while kicking out OSes like FreeBSD and OpenBSD. I could log in fine on multiple Linux distros fine, and on FreeBSD with a &quot;user agent switcher&quot;.<p>I asked Chase if they could unblock FreeBSD the same way, even mentioning Linux and user agent switchers. Chase gave their usual BS about &quot;system requirements&quot; and &quot;our website is working as designed&quot;. The person who talked to me was in fact pretty rude.<p>While I can use a user agent switcher and it works fine that way, and most websites (even banks) don't whitelist OSes. I find it absurd that Chase can claim that they require Windows or macOS at every level, but not block Linux or Chrome OS.<p>I'm betting that either blocking Linux and Chrome OS would make headlines, or alternatively that Chase uses a FOSS library that blocks BSD but not Linux or Chrome OS.<p>I'm also betting that they couldn't unblock FreeBSD if they unblock Linux since enterprises are generally very stiff and inflexible with requirements. If the higher ups say &quot;only Windows or Mac&quot; devs can't deviate.<p>A FreeBSD user like me is well aware of the whitelist, but a casual Ubuntu or Chromebook user may not even know these &quot;requirements&quot; exist since both &quot;Linux&quot; or &quot;CrOS&quot; are whitelisted.<p>It could go away when Chase's website is redesigned. Many websites in the early-00s depended on IE6 and now nobody does on the public Internet. Doesn't mean it will go away. Look at AT&amp;T Fiber's 802.1X or Verizon's and AT&amp;T's IMEI whitelist, nobody else globally does whitelisting to the same extent, or even Verizon FiOS and T-Mobile.<p>I think Bank of America says something similar to Chase but fortunately doesn't really enforce it the same way. I don't use BoA, though. I also remember an ACT prep website as a teen which only allowed Windows or Mac when I used FreeBSD (w/o plugins), but that aged very poorly in today's era of Chrome OS-based schools. There may be many more examples, feel free to discuss here.<p>Yes, I could use another bank, and I'm attempting to, but my family's weird money management system is a big roadblock making it harder for me versus most people. I moved one direct deposit and yet it caused chaos. Chase is sticky for my family like the Apple ecosystem is for many. We even have &quot;private client&quot; status.<p>Not an iPhone user, I could be a teenager today and want to run LineageOS, but my family is tied into the Apple ecosystem making it hard to leave an iPhone, just a bit easier for me with Chase since user agent switchers exist, but you can't get an Android to connect to iMessage or other iServices.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "neelc",
    "url": "https://news.ycombinator.com/user?id=neelc"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31603318",
  "sameAs": "https://news.ycombinator.com/item?id=31603318",
  "dateCreated": "2022-06-03T03:19:20.484Z",
  "datePublished": "2022-06-03T01:57:20.000Z",
  "dateModified": "2022-06-03T03:19:20.484Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "讨论。网站声称 \"需要 \"Windows或Mac，但并不阻止Linux。\n",
  "headline_zh-Hant": "討論。網站聲稱 \"需要 \"Windows或Mac，但並不阻止Linux。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我过去可能在其他地方讨论过这个问题。<p>我在桌面上运行 FreeBSD，是大通银行的客户（还有其他一些客户），主要是因为我的家人把我安排在那里。<p>大通银行声称他们的网上银行需要 Windows 或 macOS，但并没有阻止 GNU/Linux 或 Chrome OS，而把 FreeBSD 和 OpenBSD 等操作系统踢出局。我可以在多个Linux发行版上正常登录，也可以在FreeBSD上用&quot;用户代理切换器&quot;登录。<p>我问Chase他们是否可以用同样的方式解禁FreeBSD，甚至提到了Linux和用户代理切换器。大通公司给出了他们惯用的关于&quot;系统要求&quot;和&quot;我们的网站正在按设计工作&quot;的废话。<p>虽然我可以使用用户代理切换器，而且这样做效果很好，大多数网站（甚至银行）都没有将操作系统列入白名单。<p>我敢打赌，要么封锁Linux和Chrome OS会成为头条新闻，要么Chase使用一个FOSS库，封锁BSD但不封锁Linux或Chrome OS。<p>我还敢打赌，如果他们解除了Linux的封锁，就无法解除FreeBSD，因为企业的要求一般都很严格，没有灵活性。<p>像我这样的FreeBSD用户很清楚白名单，但Ubuntu或Chromebook的普通用户可能甚至不知道这些&quot;要求&quot;的存在，因为&quot;Linux&quot;或&quot;CrOS&quot;都是白名单。00年代早期的许多网站都依赖于IE6，现在公共互联网上没有人这样做了。但这并不意味着它将消失。看看AT&amp;T Fiber的802.1X或Verizon和AT&amp;T的IMEI白名单，全球没有人做同样程度的白名单，甚至Verizon FiOS和T-Mobile也是如此。<p>我认为美国银行的说法与大通类似，但幸运的是并没有真正以同样的方式执行它。不过，我没有使用美国银行。我还记得十几岁时的一个ACT准备网站，当我使用FreeBSD（无插件）时，只允许使用Windows或Mac，但在今天这个基于Chrome OS的学校时代，这种做法已经非常糟糕了。可能还有更多的例子，欢迎在此讨论。<p>是的，我可以使用另一家银行，而且我正在尝试，但我家里奇怪的资金管理系统是一个很大的路障，使我与大多数人相比更难。我移动了一个直接存款，却造成了混乱。大通银行对我的家庭来说很粘稠，就像苹果生态系统对许多人一样。我们甚至有&quot;私人客户&quot;身份。<p>我不是一个iPhone用户，我今天可能是一个青少年，想运行LineageOS，但我的家人被捆绑在苹果生态系统中，使我很难离开iPhone，只是对我来说，大通更容易一点，因为存在用户代理切换器，但你不能让Android连接到iMessage或其他i服务。\n",
  "description_zh-Hant": "我過去可能在其他地方討論過這個問題。<p>我在桌面上運行 FreeBSD，是大通銀行的客戶（還有其他一些客戶），主要是因為我的家人把我安排在那裡。<p>大通銀行聲稱他們的網上銀行需要 Windows 或 macOS，但並沒有阻止 GNU/Linux 或 Chrome OS，而把 FreeBSD 和 OpenBSD 等操作系統踢出局。我可以在多個Linux發行版上正常登錄，也可以在FreeBSD上用&quot;用戶代理切換器&quot;登錄。<p>我問Chase他們是否可以用同樣的方式解禁FreeBSD，甚至提到了Linux和用戶代理切換器。大通公司給出了他們慣用的關於&quot;系統要求&quot;和&quot;我們的網站正在按設計工作&quot;的廢話。<p>雖然我可以使用用戶代理切換器，而且這樣做效果很好，大多數網站（甚至銀行）都沒有將操作系統列入白名單。<p>我敢打賭，要麼封鎖Linux和Chrome OS會成為頭條新聞，要麼Chase使用一個FOSS庫，封鎖BSD但不封鎖Linux或Chrome OS。<p>我還敢打賭，如果他們解除了Linux的封鎖，就無法解除FreeBSD，因為企業的要求一般都很嚴格，沒有靈活性。<p>像我這樣的FreeBSD用戶很清楚白名單，但Ubuntu或Chromebook的普通用戶可能甚至不知道這些&quot;要求&quot;的存在，因為&quot;Linux&quot;或&quot;CrOS&quot;都是白名單。00年代早期的許多網站都依賴於IE6，現在公共互聯網上沒有人這樣做了。但這並不意味著它將消失。看看AT&amp;T Fiber的802.1X或Verizon和AT&amp;T的IMEI白名單，全球沒有人做同樣程度的白名單，甚至Verizon FiOS和T-Mobile也是如此。<p>我認為美國銀行的說法與大通類似，但幸運的是並沒有真正以同樣的方式執行它。不過，我沒有使用美國銀行。我還記得十幾歲時的一個ACT準備網站，當我使用FreeBSD（無插件）時，只允許使用Windows或Mac，但在今天這個基於Chrome OS的學校時代，這種做法已經非常糟糕了。可能還有更多的例子，歡迎在此討論。<p>是的，我可以使用另一家銀行，而且我正在嘗試，但我家裡奇怪的資金管理系統是一個很大的路障，使我與大多數人相比更難。我移動了一個直接存款，卻造成了混亂。大通銀行對我的家庭來說很粘稠，就像蘋果生態系統對許多人一樣。我們甚至有&quot;私人客戶&quot;身份。<p>我不是一個iPhone用戶，我今天可能是一個青少年，想運行LineageOS，但我的家人被捆綁在蘋果生態系統中，使我很難離開iPhone，只是對我來說，大通更容易一點，因為存在用戶代理切換器，但你不能讓Android連接到iMessage或其他i服務。\n"
}