{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--myfeed--HackerNews--NewsArticle--32297772",
  "url": "https://news.ycombinator.com/item?id=32297772",
  "headline": "Late to the Party",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a programmer with about 1 year of experience in python. I think I am fairly good in this with some project in machine learning as well. Covid-19 messed up my college and did'nt pay attention to my computer science engineering bachelors subjects. With me being a new comer to this tech world, I realize I need to do my part with core concepts like, Hardware, networking, PC making, OS , microprocessors .. along with incorporating my learning in ML and other new technologies. My wish to learn the core concepts has nothing to do with any requirement with my current profession in programming. But I do feel like I lack core concepts and have this peer pressure to know these things, to be able to call myself a 'techie' . Has anyone ever felt this need to learn all these basics ? The quantity of this thing is so huge that I know cannot be achieved in a single month or two. And I know this also requires physical applications in some areas to fully understand it. I am unable to comprehend how to incorporate all the old school computer basics into my daily learnings along with being able to have time to keep up current programming technologies. So yeah:<p>1. I would love to hear experiences of people starting new into the computer world with not just basic - turn on and shut down kinda start, but actual core concepts, how did you start and what things did you start with, how long did it take and what was your motivation ?<p>2. What things should I start with ? Courses, links, materials on Operating system, Computer Hardware, Networking, Microprocessors/controllers, PC making and any other topic that you feel like I should add to it.<p>3. It started purely from my genuine interest in these topics, but over the time I feel like I am under peer pressure to know these things.. Is this the right away I am addressing this phase/thought ?<p>4. Anyone has a good idea of how do I Implement learning this large amount of knowledge learning along with new constant learning in profession based technology learning.. Will it burn me out ? Any thing on this will help.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "couldbeanything",
    "url": "https://news.ycombinator.com/user?id=couldbeanything"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32297772",
  "sameAs": "https://news.ycombinator.com/item?id=32297772",
  "dateCreated": "2022-07-31T19:21:35.512Z",
  "datePublished": "2022-07-31T18:53:54.000Z",
  "dateModified": "2022-07-31T19:21:35.512Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "姗姗来迟\n",
  "headline_zh-Hant": "姍姍來遲\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一名程序员，在Python方面有大约1年的经验。我认为我在这方面相当出色，在机器学习方面也有一些项目。Covid-19把我的大学搞得一团糟，没有注意到我的计算机科学工程学士学位的科目。由于我是这个技术世界的新来者，我意识到我需要在核心概念方面做我的工作，如硬件、网络、PC制造、操作系统、微处理器......同时还要结合我在ML和其他新技术方面的学习。我希望学习核心概念，这与我目前在编程方面的职业要求无关。但我确实感觉到我缺乏核心概念，而且有这种同行的压力，要知道这些东西，才能称自己为 \"技术员\"。有没有人觉得有必要学习所有这些基础知识？这个东西的数量是如此巨大，我知道不可能在一两个月内实现。而且我知道这也需要在某些方面的实际应用才能完全理解它。我无法理解如何将所有老式的计算机基础知识纳入我的日常学习，同时能够有时间跟上当前的编程技术。所以啊：<p>1. 我想听听那些刚进入计算机世界的人的经验，不仅仅是基本的--开机和关机，而是实际的核心概念，你是如何开始的，你从什么东西开始，花了多长时间，你的动机是什么？ <p>2、我应该从什么东西开始？<p>3.这纯粹是我对这些主题的兴趣，但随着时间的推移，我觉得我受到了同行的压力，必须了解这些东西。这是我解决这个阶段/想法的正确方式吗？ <p>4.谁有好的想法，我如何实施学习这个大量的知识学习，同时在基于专业的技术学习中不断地学习新的知识。会不会把我烧死？这方面的任何事情都会有帮助。\n",
  "description_zh-Hant": "我是一名程序員，在Python方面有大約1年的經驗。我認為我在這方面相當出色，在機器學習方面也有一些項目。Covid-19把我的大學搞得一團糟，沒有注意到我的計算機科學工程學士學位的科目。由於我是這個技術世界的新來者，我意識到我需要在核心概念方面做我的工作，如硬件、網絡、PC製造、操作系統、微處理器......同時還要結合我在ML和其他新技術方面的學習。我希望學習核心概念，這與我目前在編程方面的職業要求無關。但我確實感覺到我缺乏核心概念，而且有這種同行的壓力，要知道這些東西，才能稱自己為 \"技術員\"。有沒有人覺得有必要學習所有這些基礎知識？這個東西的數量是如此巨大，我知道不可能在一兩個月內實現。而且我知道這也需要在某些方面的實際應用才能完全理解它。我無法理解如何將所有老式的計算機基礎知識納入我的日常學習，同時能夠有時間跟上當前的編程技術。所以啊：<p>1. 我想聽聽那些剛進入計算機世界的人的經驗，不僅僅是基本的--開機和關機，而是實際的核心概念，你是如何開始的，你從什麼東西開始，花了多長時間，你的動機是什麼？ <p>2、我應該從什麼東西開始？<p>3.這純粹是我對這些主題的興趣，但隨著時間的推移，我覺得我受到了同行的壓力，必須瞭解這些東西。這是我解決這個階段/想法的正確方式嗎？ <p>4.誰有好的想法，我如何實施學習這個大量的知識學習，同時在基於專業的技術學習中不斷地學習新的知識。會不會把我燒死？這方面的任何事情都會有幫助。\n"
}