{
  "@type": "NewsArticle",
  "identifier": "2022--06--04--en--myfeed--HackerNews--NewsArticle--31618823",
  "url": "https://news.ycombinator.com/item?id=31618823",
  "headline": "Markdown bloggers, what's your newsletter tool?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "If you host your markdown blog on GitHub, what's your newsletter tool?<p>Email marketing tools like ConvertKit and Mailchimp make me want to vomit. I'm sure it's great for e-commerce megacorps using complex automation logic. But for independent writers, not so much: the UX is too multi-purpose and doesn't inspire. And I'd prefer to keep GitHub as my one source of content-truth.<p>Newsletter tools like Ghost and Revue can be turned into pure email list managers, kind of. They allow you to unlist posts, but the posts are still accessible if you get ahold of their link. Furthermore, default CTAs like &quot;View online&quot; and &quot;Unsubscribe&quot; point to their own front-end. It's a meh workaround.<p>So I want a simple newsletter service with read-access to my blog's GitHub repo. When I publish a post there (with the category &quot;Newsletter&quot;, say) an email goes out, containing a backlink to that post on my blog. Alternatively, the tool may have write-access to my repo, allowing me to publish from inside the tool.<p>Are there any tools that do this? Am I doomed to copy-pasting posts into some email list manager like Listmonk? Is it ridiculous to get annoyed about this, or can anyone relate? Will I have to build it myself?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "notyeast",
    "url": "https://news.ycombinator.com/user?id=notyeast"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31618823",
  "sameAs": "https://news.ycombinator.com/item?id=31618823",
  "dateCreated": "2022-06-04T10:44:10.398Z",
  "datePublished": "2022-06-04T10:33:14.000Z",
  "dateModified": "2022-06-04T10:44:10.398Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Markdown博主，你的通讯工具是什么？\n",
  "headline_zh-Hant": "Markdown博主，你的通訊工具是什麼？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "如果你在GitHub上托管你的markdown博客，你的通讯工具是什么？<p>像ConvertKit和Mailchimp这样的电子邮件营销工具让我想呕吐。我相信对于使用复杂的自动化逻辑的电子商务大公司来说，它是很好的。但对于独立作家来说，就不是那么回事了：用户体验太多，不能激发灵感。<p>像Ghost和Revue这样的新闻通讯工具可以变成纯粹的电子邮件列表管理器，有点像。他们允许你取消帖子的列表，但如果你掌握了他们的链接，这些帖子仍然可以访问。此外，默认的CTA，如&quot;在线查看&quot;和&quot;取消订阅&quot;指向他们自己的前端。<p>所以我想要一个简单的通讯服务，可以读取我博客的GitHub repo。当我在那里发布了一篇文章（比如说，类别为 \"通讯\"），就会有一封邮件发出，其中包含我博客上那篇文章的反向链接。另外，该工具可能有写到我的repo的权限，允许我从该工具内部发布。我是否注定要把帖子复制到一些电子邮件列表管理器（如Listmonk）中？对这个问题感到恼火是不是很可笑，或者有谁能说说？我必须自己建立它吗？\n",
  "description_zh-Hant": "如果你在GitHub上託管你的markdown博客，你的通訊工具是什麼？<p>像ConvertKit和Mailchimp這樣的電子郵件營銷工具讓我想嘔吐。我相信對於使用複雜的自動化邏輯的電子商務大公司來說，它是很好的。但對於獨立作家來說，就不是那麼回事了：用戶體驗太多，不能激發靈感。<p>像Ghost和Revue這樣的新聞通訊工具可以變成純粹的電子郵件列表管理器，有點像。他們允許你取消帖子的列表，但如果你掌握了他們的鏈接，這些帖子仍然可以訪問。此外，默認的CTA，如&quot;在線查看&quot;和&quot;取消訂閱&quot;指向他們自己的前端。<p>所以我想要一個簡單的通訊服務，可以讀取我博客的GitHub repo。當我在那裡發佈了一篇文章（比如說，類別為 \"通訊\"），就會有一封郵件發出，其中包含我博客上那篇文章的反向鏈接。另外，該工具可能有寫到我的repo的權限，允許我從該工具內部發布。我是否註定要把帖子複製到一些電子郵件列表管理器（如Listmonk）中？對這個問題感到惱火是不是很可笑，或者有誰能說說？我必須自己建立它嗎？\n"
}