{
  "@type": "NewsArticle",
  "identifier": "2022--07--27--en--myfeed--HackerNews--NewsArticle--32252168",
  "url": "https://news.ycombinator.com/item?id=32252168",
  "headline": "Breaking up with Windows – need a recommendation",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "After years (holy cow decades!) of using Windows for my day-to-day working environment, I feel it's time to move on to Linux. I've identified the apps that I use 90%-95% of the time and feel like I have good alternatives for them, with the exception of one. I will be using Linux mainly with a graphical interface, so that I can be pretty much up-to-speed from day one. As a dev/consultant in the Windows world, my main apps are a browser, a good code editor, remote desktop (mostly to Windows servers), FTP/SFTP, email, and common Office-related stuff (Excel, Word, Powerpoint). I think I've figured out substitutions for everything except the email client. Right now I use Postbox, which is great and generally meets my needs, but they do not have a Linux version. My big stumbling block for email seems to be that I tend to keep ALL emails forever, and I need to have a decent search. I also have around 15-20 different email accounts that I monitor at all times. My email storage footprint is currently around the 25GB range. Some email clients simply cannot deal with the sheer number of emails and size of data in this scenario. At the moment, I am thinking that Thunderbird might be my only option, but I used it (long ago) and seem to recall that it got slower and slower when dealing with so much data. Maybe that aspect has improved, but does anybody have recommendations for a graphical email client for Linux that can handle these requirements?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "code_Whisperer",
    "url": "https://news.ycombinator.com/user?id=code_Whisperer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32252168",
  "sameAs": "https://news.ycombinator.com/item?id=32252168",
  "dateCreated": "2022-07-27T16:39:13.995Z",
  "datePublished": "2022-07-27T16:02:29.000Z",
  "dateModified": "2022-07-27T16:39:13.995Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "与Windows分手 - 需要一个建议\n",
  "headline_zh-Hant": "與Windows分手 - 需要一個建議\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在我的日常工作环境中使用Windows多年（神圣的几十年！）后，我觉得是时候转向Linux了。我已经确定了我90%-95%的时间都在使用的应用程序，并且感觉我有很好的替代品，只有一个例外。我将主要使用图形界面的Linux，这样我就可以从第一天起就能基本达到要求了。作为一个Windows世界的开发/顾问，我的主要应用是浏览器、一个好的代码编辑器、远程桌面（主要是Windows服务器）、FTP/SFTP、电子邮件和常见的Office相关东西（Excel、Word、Powerpoint）。我想我已经找到了除了电子邮件客户端之外的所有替代物。现在我用的是Postbox，它很好，一般能满足我的需要，但他们没有Linux版本。我使用电子邮件的最大障碍似乎是我倾向于永远保留所有的电子邮件，而我需要有一个体面的搜索。我也有大约15-20个不同的电子邮件账户，我一直在监控。我的电子邮件存储空间目前在25GB左右。在这种情况下，一些电子邮件客户端根本无法处理庞大的电子邮件数量和数据规模。目前，我在想Thunderbird可能是我唯一的选择，但我用过它（很久以前），似乎记得它在处理这么多数据时变得越来越慢。也许这方面已经有所改善，但有谁能推荐一个能处理这些要求的Linux图形化电子邮件客户端？\n",
  "description_zh-Hant": "在我的日常工作環境中使用Windows多年（神聖的幾十年！）後，我覺得是時候轉向Linux了。我已經確定了我90%-95%的時間都在使用的應用程序，並且感覺我有很好的替代品，只有一個例外。我將主要使用圖形界面的Linux，這樣我就可以從第一天起就能基本達到要求了。作為一個Windows世界的開發/顧問，我的主要應用是瀏覽器、一個好的代碼編輯器、遠程桌面（主要是Windows服務器）、FTP/SFTP、電子郵件和常見的Office相關東西（Excel、Word、Powerpoint）。我想我已經找到了除了電子郵件客戶端之外的所有替代物。現在我用的是Postbox，它很好，一般能滿足我的需要，但他們沒有Linux版本。我使用電子郵件的最大障礙似乎是我傾向於永遠保留所有的電子郵件，而我需要有一個體面的搜索。我也有大約15-20個不同的電子郵件賬戶，我一直在監控。我的電子郵件存儲空間目前在25GB左右。在這種情況下，一些電子郵件客戶端根本無法處理龐大的電子郵件數量和數據規模。目前，我在想Thunderbird可能是我唯一的選擇，但我用過它（很久以前），似乎記得它在處理這麼多數據時變得越來越慢。也許這方面已經有所改善，但有誰能推薦一個能處理這些要求的Linux圖形化電子郵件客戶端？\n"
}