{
  "@type": "NewsArticle",
  "identifier": "2022--06--21--en--myfeed--HackerNews--NewsArticle--31820088",
  "url": "https://news.ycombinator.com/item?id=31820088",
  "headline": "Double trigger clause in US employment offer letter",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I wondered if you could help me with this one. I would prefer to use a lawyer but I've left this quite late, so I'd like to hear others experiences (not legal advice obviously).<p>I'm currently negotiating an executive-level employment offer letter for a high-growth startup. I've secured a double-trigger clause in the offer letter but the wording is limited to my termination within 12 months after a sale. The VP HR implied there was flexibility to give more to me within this clause. I'm unfamiliar with double triggers and have read online that the other pieces I might ask for are:<p>- a short pre-closing window (3 months or shorter) to counter any preemptive termination by the company to avoid a payout<p>- a longer period where I might be terminated after the change in ownership<p>- an additional clause that unvested stock is accelerated should I leave for &quot;good cause&quot;<p>My questions are:<p>- Are these usual clauses to ask for?<p>- What else might I ask for within a double trigger clause",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "yayabo",
    "url": "https://news.ycombinator.com/user?id=yayabo"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31820088",
  "sameAs": "https://news.ycombinator.com/item?id=31820088",
  "dateCreated": "2022-06-21T07:28:42.492Z",
  "datePublished": "2022-06-21T05:03:51.000Z",
  "dateModified": "2022-06-21T07:28:42.492Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "美国就业邀请函中的双重触发条款\n",
  "headline_zh-Hant": "美國就業邀請函中的雙重觸發條款\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我想知道你是否可以帮助我解决这个问题。我希望使用律师，但我已经很晚了，所以我想听听别人的经验（显然不是法律建议）。<p>我目前正在为一家高增长的初创企业谈判一份高管级别的聘用合同。我在聘书中争取到了一个双重触发条款，但措辞仅限于在出售后12个月内终止。人力资源副总裁暗示在这个条款中可以灵活地给予我更多的待遇。我不熟悉双重触发条款，我在网上看到，我可能要求的其他条款是：<p>- 一个较短的成交前窗口（3个月或更短），以应对公司为避免赔付而进行的任何先发制人的终止<p>- 一个较长的时期，我可能在所有权变更后被终止<p>- 一个附加条款，如果我因&quot;良好理由&quot;离开，未归属的股票将加速生效<p> 我的问题是：<p>- 这些是通常需要要求的条款？ <p>- 在双重触发条款中我还可以要求什么？\n",
  "description_zh-Hant": "我想知道你是否可以幫助我解決這個問題。我希望使用律師，但我已經很晚了，所以我想聽聽別人的經驗（顯然不是法律建議）。<p>我目前正在為一家高增長的初創企業談判一份高管級別的聘用合同。我在聘書中爭取到了一個雙重觸發條款，但措辭僅限於在出售後12個月內終止。人力資源副總裁暗示在這個條款中可以靈活地給予我更多的待遇。我不熟悉雙重觸發條款，我在網上看到，我可能要求的其他條款是：<p>- 一個較短的成交前窗口（3個月或更短），以應對公司為避免賠付而進行的任何先發制人的終止<p>- 一個較長的時期，我可能在所有權變更後被終止<p>- 一個附加條款，如果我因&quot;良好理由&quot;離開，未歸屬的股票將加速生效<p> 我的問題是：<p>- 這些是通常需要要求的條款？ <p>- 在雙重觸發條款中我還可以要求什麼？\n"
}