{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--myfeed--HackerNews--NewsArticle--31596278",
  "url": "https://news.ycombinator.com/item?id=31596278",
  "headline": "YC Application: Does this qualify as hacking a system?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I know it's late for applications etc, but I was curious if this answer would qualify for the question &quot;Please tell us about the time you most successfully hacked some (non-computer) system to your advantage.&quot;<p>In 2016, before cross-country roaming data was a thing in Europe, I was working on a startup that would offer free wifi to Uber passengers to give them targeted ads to locations in London and products sold by the Driver.<p>In order to create a network of Uber Drivers that would join my platform, I developed a sort of script:\nEvery time I would ride in an Uber, I would adress their car (90% of the times, a Prius): &quot;Ah, a Prius, nice car man! It's electric right?&quot; we'd talk about the benefits of EV, then from there to Tesla, then to autopilot and the alledged purchase of a fleet of Teslas by Uber that was in the papers at the time.<p>This would create a sense of scarcity in the Driver's mind. Soon Uber might turn to self-driving cars and he might be out of a job. That's when I'd start talking about Pablo Escolar, a San Francisco Uber Driver who was making $200'000 selling jewelry to his passengers (I can't make this up, just google it), and the opportunity to do that himself. He could join my platform, put a wifi device in his car and eventually build a self sustaining online store that would be profitable when the robots take over.<p>With this script I built a network of over 100 Drivers, all ready to join my platform and advertise their products, local attractions and spas.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "mrmrch",
    "url": "https://news.ycombinator.com/user?id=mrmrch"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31596278",
  "sameAs": "https://news.ycombinator.com/item?id=31596278",
  "dateCreated": "2022-06-02T16:43:10.329Z",
  "datePublished": "2022-06-02T15:43:41.000Z",
  "dateModified": "2022-06-02T16:43:10.329Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "YC申请。这是否符合黑客攻击系统的条件？\n",
  "headline_zh-Hant": "YC申請。這是否符合黑客攻擊系統的條件？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我知道现在申请已经晚了，但我很好奇这个答案是否符合问题&quot;请告诉我们你最成功地黑掉一些（非计算机）系统对你有利的时间。 &quot;<p>2016年，在欧洲的跨国漫游数据还没有出现的时候，我正在做一家创业公司，为Uber乘客提供免费的WIFI，为他们提供伦敦的地点和司机销售的产品的定向广告。<p>为了创建一个Uber司机网络，让他们加入我的平台，我开发了一种脚本。\n每次我乘坐Uber时，我都会称呼他们的车（90%的时候是普锐斯）：&quot;啊，普锐斯，好车，伙计！这是电动的吧？我们会谈论电动车的好处，然后谈到特斯拉，再谈到自动驾驶，以及当时报纸上报道的Uber购买特斯拉车队的说法。很快，Uber可能会转向自动驾驶汽车，他可能会失去工作。这时，我就会开始谈论Pablo Escolar，一个旧金山的Uber司机，他向乘客出售珠宝赚了20万美元（这不是我编的，谷歌一下就知道了），以及自己做这个的机会。他可以加入我的平台，在他的车里放一个WIFI设备，最终建立一个自我维持的网上商店，当机器人接管时就可以盈利。<p>通过这个脚本，我建立了一个超过100名司机的网络，都准备加入我的平台，为他们的产品、当地景点和温泉做广告。\n",
  "description_zh-Hant": "我知道現在申請已經晚了，但我很好奇這個答案是否符合問題&quot;請告訴我們你最成功地黑掉一些（非計算機）系統對你有利的時間。 &quot;<p>2016年，在歐洲的跨國漫遊數據還沒有出現的時候，我正在做一家創業公司，為Uber乘客提供免費的WIFI，為他們提供倫敦的地點和司機銷售的產品的定向廣告。<p>為了創建一個Uber司機網絡，讓他們加入我的平臺，我開發了一種腳本。\n每次我乘坐Uber時，我都會稱呼他們的車（90%的時候是普銳斯）：&quot;啊，普銳斯，好車，夥計！這是電動的吧？我們會談論電動車的好處，然後談到特斯拉，再談到自動駕駛，以及當時報紙上報道的Uber購買特斯拉車隊的說法。很快，Uber可能會轉向自動駕駛汽車，他可能會失去工作。這時，我就會開始談論Pablo Escolar，一箇舊金山的Uber司機，他向乘客出售珠寶賺了20萬美元（這不是我編的，谷歌一下就知道了），以及自己做這個的機會。他可以加入我的平臺，在他的車裡放一個WIFI設備，最終建立一個自我維持的網上商店，當機器人接管時就可以盈利。<p>通過這個腳本，我建立了一個超過100名司機的網絡，都準備加入我的平臺，為他們的產品、當地景點和溫泉做廣告。\n"
}