{
  "@type": "NewsArticle",
  "identifier": "2022--04--26--en--myfeed--HackerNews--NewsArticle--31164858",
  "url": "https://news.ycombinator.com/item?id=31164858",
  "headline": "Non-Tech Founders Conundrum -How do I hire the right tech talent for my startup?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "&quot;How do I hire the right tech talent for my startup?&quot;\nThis is the most common question pitched to me during my discussions with fellow founders, especially the non-tech founders:<p>Here are my thoughts:<p>1. Hire for your tech-stack<p>Don't rely on the hiring style of FAANG. Realise that FAANG hires people to solve complex technical challenges and they invest in training their engineers, before onboarding them on any project. Startups are different.\nIn 99% of the cases, you aren't hiring to solve an unheard technical problem. All you want is a good programmer who can start contributing ASAP. So hire someone that resonates with the skills of your existing tech stack.\nThe whole notion that a good engineer can quickly learn a new framework/language is misleading. Sure you can learn the basics of JAVA in probably a couple of weeks' time, but getting mastery over it is years of effort. The latter is what you call a 10x engineer.<p>2. Go beyond CS/IT pedigree<p>I find it hard to search for any reason why a degree in CS/IT would be required for building the tech. With the abundance of resources on the internet, there isn't any barrier to entry in the field of programming. I personally have interacted with many self-taught coders who have amazed me with their breadth of knowledge.<p>3. Tap into your network<p>Early-stage companies don't need a full-time software architect. Tap into your network and ask help for to review your system design. Ideally, these people should themselves had build a system from scratch, they will be able to help you the most. Once a quarter review is more than enough early on.<p>For founders in my network who are looking to get their system design and security review, I'd be more than happy to help to the best of my ability. Feel free to reach out.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "SecopSolution",
    "url": "https://news.ycombinator.com/user?id=SecopSolution"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31164858",
  "sameAs": "https://news.ycombinator.com/item?id=31164858",
  "dateCreated": "2022-04-26T11:10:15.611Z",
  "datePublished": "2022-04-26T07:14:41.000Z",
  "dateModified": "2022-04-26T11:10:15.611Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "非技术创始人的难题--如何为我的初创企业雇用合适的技术人才？",
  "headline_zh-Hant": "非技術創始人的難題--如何為我的初創企業僱用合適的技術人才？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我如何为我的初创公司雇用合适的技术人才？\n这是我在与其他创始人讨论时最常提出的问题，尤其是那些非技术创始人：<p>以下是我的想法：<p>1.为你的技术栈招聘<p>不要依赖FAANG的招聘风格。意识到FAANG雇用人员来解决复杂的技术挑战，他们在任何项目的入职前，都会投资培训他们的工程师。初创公司则不同。\n在99%的情况下，你并不是为了解决一个前所未闻的技术问题而招聘的。你想要的是一个能尽快开始贡献的好程序员。所以要雇佣一个与你现有技术堆栈的技能有共鸣的人。\n认为一个好的工程师可以快速学习一个新的框架/语言的整个概念是误导性的。当然，你可以在几周的时间内学会JAVA的基础知识，但要掌握它需要多年的努力。<p>2.超越CS/IT血统<p>我发现很难找到任何理由来解释为什么建设技术需要CS/IT学位。随着互联网上资源的丰富，在编程领域并没有任何进入的障碍。我个人曾与许多自学成才的编码员交流，他们的知识广度令我惊讶。<p>3.挖掘你的网络<p>早期阶段的公司不需要一个全职的软件架构师。挖掘你的网络，并请求帮助来审查你的系统设计。理想情况下，这些人应该自己也曾从头开始建立一个系统，他们将能给你最大的帮助。<p>对于我的网络中那些希望得到系统设计和安全审查的创始人，我非常乐意尽我所能提供帮助。请随时联系我。",
  "description_zh-Hant": "我如何為我的初創公司僱用合適的技術人才？\n這是我在與其他創始人討論時最常提出的問題，尤其是那些非技術創始人：<p>以下是我的想法：<p>1.為你的技術棧招聘<p>不要依賴FAANG的招聘風格。意識到FAANG僱用人員來解決複雜的技術挑戰，他們在任何項目的入職前，都會投資培訓他們的工程師。初創公司則不同。\n在99%的情況下，你並不是為了解決一個前所未聞的技術問題而招聘的。你想要的是一個能儘快開始貢獻的好程序員。所以要僱傭一個與你現有技術堆棧的技能有共鳴的人。\n認為一個好的工程師可以快速學習一個新的框架/語言的整個概念是誤導性的。當然，你可以在幾周的時間內學會JAVA的基礎知識，但要掌握它需要多年的努力。<p>2.超越CS/IT血統<p>我發現很難找到任何理由來解釋為什麼建設技術需要CS/IT學位。隨著互聯網上資源的豐富，在編程領域並沒有任何進入的障礙。我個人曾與許多自學成才的編碼員交流，他們的知識廣度令我驚訝。<p>3.挖掘你的網絡<p>早期階段的公司不需要一個全職的軟件架構師。挖掘你的網絡，並請求幫助來審查你的系統設計。理想情況下，這些人應該自己也曾從頭開始建立一個系統，他們將能給你最大的幫助。<p>對於我的網絡中那些希望得到系統設計和安全審查的創始人，我非常樂意盡我所能提供幫助。請隨時聯繫我。"
}