{
  "@type": "NewsArticle",
  "identifier": "2022--06--17--en--myfeed--HackerNews--NewsArticle--31783215",
  "url": "https://news.ycombinator.com/item?id=31783215",
  "headline": "How to hack a hospital? Scada ICCShacking",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello everyone\n My name is Semih.  I am an 18 year old hacker.  Actually, it would be more accurate to say SCADA/ICS and OSINT hacker.  Today I'm going to talk to you about hacking critical industrial control systems.  When I first started this business, there were not many resources on the internet, so I decided to write this blog.  I want to inspire you by writing an incident that happened to me First of all, I must say that scada hacking is not like other types of hacking.  Thanks to the scada system you hacked, you can sometimes cut off the electricity of a city, and sometimes cause dozens of planes to crash at an airport.\n I was doing bug bounty when I was 16 years old.  I suffered many injustices and did not receive any money.  I wanted to focus on a more serious field.  First, I targeted a sector (health sector).  Then I chose a country and chose India.  The reason they chose India was because they produced thousands of unsafe software.  I then identified a suitable company (www.meddiff.com).  Then I found the ip address of the software the company sells (I won't tell you how I found these ip addresses).  I then discovered an incorrect security configuration in the system.  I was able to enter the hospital system by taking advantage of this vulnerability and I was very surprised.  Because I had the citizenship information, phone numbers, loads of connected devices and bank accounts of thousands of patients and doctors.  I discovered 100 more hospitals affected by this vulnerability.  I infiltrated all these hospitals.  Later, I wrote an e-mail to the company that produced this software, but even after 6 months, there was still no progress.  I reported this to the Indian consulate in my country.  They also directed me to the ministry of defense.  I was promised a monetary reward by the company, but they did not. And they closed the gap.\n                                                    If you have more questions about Scada/ICS hacking, you can reach me on Instagram.\n  @32smh32",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "comaksemih",
    "url": "https://news.ycombinator.com/user?id=comaksemih"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31783215",
  "sameAs": "https://news.ycombinator.com/item?id=31783215",
  "dateCreated": "2022-06-17T19:45:59.835Z",
  "datePublished": "2022-06-17T19:37:36.000Z",
  "dateModified": "2022-06-17T19:45:59.835Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "如何黑掉一家医院？Scada ICCShacking\n",
  "headline_zh-Hant": "如何黑掉一家醫院？Scada ICCShacking\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好\n 我的名字是Semih。 我是一个18岁的黑客。 事实上，说是SCADA/ICS和OSINT黑客更准确。 今天我要和大家谈谈黑掉关键工业控制系统的问题。 当我刚开始做这个行业时，互联网上没有多少资源，所以我决定写这个博客。 我想通过写一个发生在我身上的事件来启发你们 首先，我必须说，scada黑客与其他类型的黑客不同。 由于你入侵的scada系统，你有时可以切断一个城市的电力，有时可以导致几十架飞机在机场坠毁。\n 我在16岁的时候就开始做漏洞赏金。 我遭受了许多不公正的待遇，没有收到任何钱。 我想把注意力放在一个更严肃的领域。 首先，我瞄准了一个部门（卫生部门）。 然后我选择了一个国家，选择了印度。 之所以选择印度，是因为他们生产了成千上万的不安全软件。 然后我确定了一个合适的公司（www.meddiff.com）。 然后我找到了该公司销售的软件的ip地址（我不会告诉你我是如何找到这些ip地址的）。 然后我发现系统中的安全配置不正确。 我利用这个漏洞进入了医院的系统，我感到非常惊讶。 因为我有成千上万的病人和医生的公民身份信息、电话号码、连接设备的负载和银行账户。 我又发现了100家受此漏洞影响的医院。 我潜入了所有这些医院。 后来，我给生产这个软件的公司写了一封电子邮件，但即使过了6个月，仍然没有任何进展。 我向印度驻我国的领事馆报告了此事。 他们还指引我去找国防部。 该公司答应给我一笔钱奖励，但他们没有。而他们关闭了这个缺口。\n                                                    如果你有更多关于Scada/ICS黑客攻击的问题，你可以在Instagram上联系我。\n  @32smh32\n",
  "description_zh-Hant": "大家好\n 我的名字是Semih。 我是一個18歲的黑客。 事實上，說是SCADA/ICS和OSINT黑客更準確。 今天我要和大家談談黑掉關鍵工業控制系統的問題。 當我剛開始做這個行業時，互聯網上沒有多少資源，所以我決定寫這個博客。 我想通過寫一個發生在我身上的事件來啟發你們 首先，我必須說，scada黑客與其他類型的黑客不同。 由於你入侵的scada系統，你有時可以切斷一個城市的電力，有時可以導致幾十架飛機在機場墜毀。\n 我在16歲的時候就開始做漏洞賞金。 我遭受了許多不公正的待遇，沒有收到任何錢。 我想把注意力放在一個更嚴肅的領域。 首先，我瞄準了一個部門（衛生部門）。 然後我選擇了一個國家，選擇了印度。 之所以選擇印度，是因為他們生產了成千上萬的不安全軟件。 然後我確定了一個合適的公司（www.meddiff.com）。 然後我找到了該公司銷售的軟件的ip地址（我不會告訴你我是如何找到這些ip地址的）。 然後我發現系統中的安全配置不正確。 我利用這個漏洞進入了醫院的系統，我感到非常驚訝。 因為我有成千上萬的病人和醫生的公民身份信息、電話號碼、連接設備的負載和銀行賬戶。 我又發現了100家受此漏洞影響的醫院。 我潛入了所有這些醫院。 後來，我給生產這個軟件的公司寫了一封電子郵件，但即使過了6個月，仍然沒有任何進展。 我向印度駐我國的領事館報告了此事。 他們還指引我去找國防部。 該公司答應給我一筆錢獎勵，但他們沒有。而他們關閉了這個缺口。\n                                                    如果你有更多關於Scada/ICS黑客攻擊的問題，你可以在Instagram上聯繫我。\n  @32smh32\n"
}