{
  "@type": "NewsArticle",
  "identifier": "2022--06--24--en--myfeed--HackerNews--NewsArticle--31856539",
  "url": "https://news.ycombinator.com/item?id=31856539",
  "headline": "Funded startup with short runway left, options?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I need help deciding what direction to take my startup in the current climate. It’s 3 founders (friends from college) with equal equity (1 founder has a full-time job at another startup but takes the same salary and helps out) and a small team of developers. When we founded (5 years ago) we raised $4m and were focused on big data for healthcare. A few years ago we pivoted to a consumer platform. Currently we have a product in closed beta with 500 users. The problem is that the product isn’t finished and users don’t stay on the platform but there some active users share a ton of data with us. We were thinking we could do an IOT play once we get to market but we haven’t gotten around to building those features. Maybe we can become revenue positive just selling user data for research but that isn’t going to happen fast enough to cover our burn and if we cut the burn we can’t finish the product. I’m concerned because the funding market looks brutal and we have less than a year of runway. The founders don’t agree which direction to take the company in (but it’s amicable) and the other two founders are super casual about our situation. What are our options? Is the funding crisis overblown, and maybe we could raise money? Is it possible to be acquired maybe for our team or technology and find a new home? Are we better off shutting down?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "scaredfounder",
    "url": "https://news.ycombinator.com/user?id=scaredfounder"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31856539",
  "sameAs": "https://news.ycombinator.com/item?id=31856539",
  "dateCreated": "2022-06-24T02:18:20.313Z",
  "datePublished": "2022-06-24T00:03:48.000Z",
  "dateModified": "2022-06-24T02:18:20.313Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "获得资金的初创企业，剩下的跑道很短，有什么选择？\n",
  "headline_zh-Hant": "獲得資金的初創企業，剩下的跑道很短，有什麼選擇？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我需要帮助来决定在目前的环境下，我的创业公司应该朝什么方向发展。公司有3个创始人（大学同学），股权均等（其中一个创始人在另一家创业公司有全职工作，但拿同样的工资并提供帮助），还有一个小型的开发者团队。当我们成立时（5年前），我们筹集了400万美元，专注于医疗保健的大数据。几年前，我们转向了消费者平台。目前，我们有一个产品处于封闭测试阶段，有500个用户。问题是，产品还没有完成，用户也没有留在平台上，但有一些活跃的用户与我们分享了大量的数据。我们在想，一旦我们进入市场，我们可以做一个物联网的游戏，但我们还没来得及建立这些功能。也许我们可以通过出售用户数据进行研究来实现收入，但这不会快到足以支付我们的烧钱，如果我们削减烧钱，我们就无法完成产品。我很担心，因为融资市场看起来很残酷，而我们只有不到一年的时间。创始人不同意把公司带向哪个方向（但这是友好的），另外两个创始人对我们的情况也很随意。我们有什么选择？资金危机是否被夸大了，也许我们可以筹集资金？有没有可能因为我们的团队或技术而被收购，并找到一个新家？我们是否最好关闭？\n",
  "description_zh-Hant": "我需要幫助來決定在目前的環境下，我的創業公司應該朝什麼方向發展。公司有3個創始人（大學同學），股權均等（其中一個創始人在另一家創業公司有全職工作，但拿同樣的工資並提供幫助），還有一個小型的開發者團隊。當我們成立時（5年前），我們籌集了400萬美元，專注於醫療保健的大數據。幾年前，我們轉向了消費者平臺。目前，我們有一個產品處於封閉測試階段，有500個用戶。問題是，產品還沒有完成，用戶也沒有留在平臺上，但有一些活躍的用戶與我們分享了大量的數據。我們在想，一旦我們進入市場，我們可以做一個物聯網的遊戲，但我們還沒來得及建立這些功能。也許我們可以通過出售用戶數據進行研究來實現收入，但這不會快到足以支付我們的燒錢，如果我們削減燒錢，我們就無法完成產品。我很擔心，因為融資市場看起來很殘酷，而我們只有不到一年的時間。創始人不同意把公司帶向哪個方向（但這是友好的），另外兩個創始人對我們的情況也很隨意。我們有什麼選擇？資金危機是否被誇大了，也許我們可以籌集資金？有沒有可能因為我們的團隊或技術而被收購，並找到一個新家？我們是否最好關閉？\n"
}