{
  "@type": "NewsArticle",
  "identifier": "2022--04--22--en--myfeed--HackerNews--NewsArticle--31125395",
  "url": "https://news.ycombinator.com/item?id=31125395",
  "headline": "Hackers Occupational Ailments",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Musculoskeletal, Cardiovascular, Psychological and Visual problems are briefly discussed:\nBecause most individuals do not use ergonomic chairs, mouse pads and so on, back pain and carpal tunnel syndrome are common.Limited access to sun/vitamin D, exacerbate this. Limited activity and high carb diet, often bring about degrees of glucose intolerance. While the use of tall/standing desks may encourage activity, standing for long periods without walking (pumping the muscles and pumping blood in vessels)increases the long term incidence of varicose veins ( compression stockings would help). Limited activity, also leads to lower HDL ( good cholesterol) and obesity, further stressing the cardiovascular system. Limited real (as opposed to virtual) interactions in individuals who do not have “outside” connections leads to a sense of loneliness. Depression ( often presented as anger or lack of discipline, poor sleep and dietary habits) is more often under appreciated in the age of WFH and limited friendly inquiries.\nLong periods of staring at screen in short distance ( unless, if the screen is close to a window and one takes breaks looking at the distance)exacerbate near-sightedness.\nThe goal of this brief is to put light on the problems, though, some solutions are embedded.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "ircard",
    "url": "https://news.ycombinator.com/user?id=ircard"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31125395",
  "sameAs": "https://news.ycombinator.com/item?id=31125395",
  "dateCreated": "2022-04-22T17:54:25.842Z",
  "datePublished": "2022-04-22T17:51:28.000Z",
  "dateModified": "2022-04-22T17:54:25.842Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "黑客们的职业病",
  "headline_zh-Hant": "黑客們的職業病",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "简要讨论了肌肉骨骼、心血管、心理和视觉问题。\n由于大多数人不使用符合人体工程学的椅子、鼠标垫等，背痛和腕管综合症很常见。有限的活动和高碳水化合物饮食，往往带来一定程度的葡萄糖不耐受。虽然使用高/站立式办公桌可能会鼓励活动，但长期站立而不行走（抽动肌肉和抽动血管中的血液）会增加静脉曲张的长期发生率（压力袜会有帮助）。有限的活动，也会导致较低的高密度脂蛋白（好的胆固醇）和肥胖，进一步给心血管系统带来压力。在没有 \"外部 \"联系的个人中，有限的真实（相对于虚拟）互动导致了孤独感的产生。抑郁症（通常表现为愤怒或缺乏纪律，睡眠和饮食习惯不佳）在WFH和有限的友好询问的时代更经常被低估。\n长时间短距离地盯着屏幕（除非屏幕离窗户很近，人休息时看一下远处），会加重近视的程度。\n本简报的目的是阐明这些问题，但也包含了一些解决方案。",
  "description_zh-Hant": "簡要討論了肌肉骨骼、心血管、心理和視覺問題。\n由於大多數人不使用符合人體工程學的椅子、鼠標墊等，背痛和腕管綜合症很常見。有限的活動和高碳水化合物飲食，往往帶來一定程度的葡萄糖不耐受。雖然使用高/站立式辦公桌可能會鼓勵活動，但長期站立而不行走（抽動肌肉和抽動血管中的血液）會增加靜脈曲張的長期發生率（壓力襪會有幫助）。有限的活動，也會導致較低的高密度脂蛋白（好的膽固醇）和肥胖，進一步給心血管系統帶來壓力。在沒有 \"外部 \"聯繫的個人中，有限的真實（相對於虛擬）互動導致了孤獨感的產生。抑鬱症（通常表現為憤怒或缺乏紀律，睡眠和飲食習慣不佳）在WFH和有限的友好詢問的時代更經常被低估。\n長時間短距離地盯著屏幕（除非屏幕離窗戶很近，人休息時看一下遠處），會加重近視的程度。\n本簡報的目的是闡明這些問題，但也包含了一些解決方案。"
}