{
  "@type": "NewsArticle",
  "identifier": "2022--08--04--en--myfeed--HackerNews--NewsArticle--32344010",
  "url": "https://news.ycombinator.com/item?id=32344010",
  "headline": "Tell HN: Amazon shopping is racing to the bottom of quality",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Amazon shopping is becoming increasingly pointless as one or more of the following are true:<p>- There are multiple products, sometimes dozens, which are actually the same product in the same or different colors, and often with a variety of nonsense manufactorer names.  So there is the appearance of choice while actually the non-same items are difficult to find (needle in haystack)<p>- Products tend to be very low quality.  If you take time to read the reviews, it's obvious that many of the high reviews are stuffed.  The low score reviews usually tell the same story: a critical part breaks on first use, or a critical flaw renders the item completely unsuitable for the task it is intended for.<p>- Counterfeits... I don't even need to get into this, as it's a very well-known problem.<p>Unfortunately, the Walmart effect applies here too, because the low prices attract most shoppers, and the small players (and brick and mortar stores) can't compete and go out of business.  If they try to compete, they typically just find the same garbage manufacturers who are selling on Amazon.  It's a race to the bottom.<p>As consumers, we end up with items that are either useless on arrival (and not even worth returning), or they are far less than we would have hoped or wished for or been willing to pay for.<p>The great irony is, with the ability to import items from around the globe, and the significant number of online stores, it can still be impossible to find even a decent simple item (such as an extended reach car wash brush).<p>Even if you search more broadly than directly on Amazon, you see the same few items across most online retailers.  And when you read reviews of the items on each retailer website, you see the same low score complaints... sometimes in such detail that you can be certain that it was the exact same product.<p>I see no solution to this.  There is one country where most of this garbage comes from, but any special measures to penalize their exports will just result in shifting the manufacturing to another don't-care country which will pick up the slack.<p>Imagine the total cost of this situation, from materials consumption to trash piles (which is a short process for many of these products).  It's an obscene waste.<p>/rant",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "z9znz",
    "url": "https://news.ycombinator.com/user?id=z9znz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32344010",
  "sameAs": "https://news.ycombinator.com/item?id=32344010",
  "dateCreated": "2022-08-04T15:31:11.808Z",
  "datePublished": "2022-08-04T15:15:04.000Z",
  "dateModified": "2022-08-04T15:31:11.808Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "告诉HN：亚马逊购物正在向质量底线飙升\n",
  "headline_zh-Hant": "告訴HN：亞馬遜購物正在向質量底線飆升\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "亚马逊购物正变得越来越没有意义，因为以下一项或多项是真实的：<p>- 有多种产品，有时是几十种，实际上是同一产品，颜色相同或不同，而且往往有各种无稽的制造商名称。 因此，表面上有选择，而实际上非相同的商品很难找到（大海捞针）<p>- 产品往往质量很差。 如果你花时间阅读评论，很明显，许多高分评论是被塞进去的。 低分的评论通常讲述了同样的故事：一个关键的部件在第一次使用时就坏了，或者一个关键的缺陷使该物品完全不适合它所要完成的任务。<p>不幸的是，沃尔玛效应也适用于此，因为低价吸引了大多数购物者，而小厂商（和实体店）无法竞争而倒闭。 如果他们试图竞争，他们通常只是找到在亚马逊上销售的那些垃圾制造商。 <p>作为消费者，我们最终得到的商品要么在到达时毫无用处（甚至不值得退货），要么远远低于我们所希望的或希望的或愿意支付的。 <p>最具讽刺意味的是，由于有能力从全球各地进口物品，以及大量的网上商店，即使是一个像样的简单物品（如伸手可及的洗车刷），也不可能找到。<p>即使你在亚马逊上进行比直接搜索更广泛的搜索，你在大多数网上零售商那里看到的都是同样的少数物品。 当你在每个零售商的网站上阅读这些商品的评论时，你会看到同样的低分投诉......有时，你可以确定这是完全相同的产品。<p>我看不出有什么解决办法。 有一个国家是这些垃圾的主要来源地，但任何惩罚其出口的特别措施只会导致将制造业转移到另一个不关心的国家，而这些国家会接过来。<p>想象一下这种情况的总成本，从材料消耗到垃圾堆（对许多这些产品来说是一个短暂的过程）。 这是一种可怕的浪费。<p>/rant\n",
  "description_zh-Hant": "亞馬遜購物正變得越來越沒有意義，因為以下一項或多項是真實的：<p>- 有多種產品，有時是幾十種，實際上是同一產品，顏色相同或不同，而且往往有各種無稽的製造商名稱。 因此，表面上有選擇，而實際上非相同的商品很難找到（大海撈針）<p>- 產品往往質量很差。 如果你花時間閱讀評論，很明顯，許多高分評論是被塞進去的。 低分的評論通常講述了同樣的故事：一個關鍵的部件在第一次使用時就壞了，或者一個關鍵的缺陷使該物品完全不適合它所要完成的任務。<p>不幸的是，沃爾瑪效應也適用於此，因為低價吸引了大多數購物者，而小廠商（和實體店）無法競爭而倒閉。 如果他們試圖競爭，他們通常只是找到在亞馬遜上銷售的那些垃圾製造商。 <p>作為消費者，我們最終得到的商品要麼在到達時毫無用處（甚至不值得退貨），要麼遠遠低於我們所希望的或希望的或願意支付的。 <p>最具諷刺意味的是，由於有能力從全球各地進口物品，以及大量的網上商店，即使是一個像樣的簡單物品（如伸手可及的洗車刷），也不可能找到。<p>即使你在亞馬遜上進行比直接搜索更廣泛的搜索，你在大多數網上零售商那裡看到的都是同樣的少數物品。 當你在每個零售商的網站上閱讀這些商品的評論時，你會看到同樣的低分投訴......有時，你可以確定這是完全相同的產品。<p>我看不出有什麼解決辦法。 有一個國家是這些垃圾的主要來源地，但任何懲罰其出口的特別措施只會導致將製造業轉移到另一個不關心的國家，而這些國家會接過來。<p>想象一下這種情況的總成本，從材料消耗到垃圾堆（對許多這些產品來說是一個短暫的過程）。 這是一種可怕的浪費。<p>/rant\n"
}