{
  "@type": "NewsArticle",
  "identifier": "2022--06--11--en--myfeed--ben-werdmuller--NewsArticle--442364ce738843a0a33091c25314e745",
  "url": "https://werd.io/2022/reading-watching-playing-using-may-2022",
  "headline": "Reading, watching, playing, using: May, 2022",
  "publisher": {
    "@type": "Organization",
    "name": "werd.io",
    "url": "https://werd.io/feed/"
  },
  "description": "<div class=\"e-content entry-content\">\n<p>This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for May, 2022.</p><h3>Books</h3><p><a href=\"https://bookshop.org/books/beyond-magenta-transgender-teens-speak-out/9780763673680\">Beyond Magenta: Transgender Teens Speak Out, by Susan Kuklin.</a> I wanted to like this, but I can’t recommend it. Granted, it’s almost a decade old, and the discourse has evolved since then. But the author leaves gender essentialism and some stories that verge on abuse unaddressed. It’s great that these teenagers’ stories are told verbatim, but it’s not great to miss out on the nuanced commentary that they demand. I love the idea and I hope someone executes it better than this.</p><p><a href=\"https://bookshop.org/a/7949/9780525560548\">Hood Feminism: Notes from the Women That a Movement Forgot, by Mikki Kendall.</a> A heartfelt argument for truly intersectional feminism. Occasionally challenging in the way that helps you stretch and learn, and overall a vision of what the politics of the future need to look like. As an introduction, it’s near-perfect, and I want to send it to quite a few people I know.</p><h3>Notable Articles</h3><h4>Business</h4><p><a href=\"https://www.huffpost.com/entry/mass-shootings-work_l_628e6c73e4b0cda85db97dcd\">The Worst Thing You Can Do At Work After Another Mass Shooting Is Nothing.</a> ““You can’t do ‘business as usual’ after a tragic event, which is something that many employers do and fail to prioritize the needs of their staff during such a difficult time,” said Katheryn Perez, a California-based psychotherapist. “The needs and humanity of your staff should take priority over anything.””</p><p><a href=\"https://www.businessinsider.com/spacex-paid-250000-to-a-flight-attendant-who-accused-elon-musk-of-sexual-misconduct-2022-5\">SpaceX Paid $250,000 to a Flight Attendant Who Accused Elon Musk of Sexual Misconduct.</a> “The flight attendant told her friend that the billionaire SpaceX and Tesla founder asked her to come to his room during a flight in late 2016 “for a full body massage,” the declaration says. When she arrived, the attendant found that Musk “was completely naked except for a sheet covering the lower half of his body.” During the massage, the declaration says, Musk “exposed his genitals” and then “touched her and offered to buy her a horse if she would ‘do more,’ referring to the performance of sex acts.””</p><p><a href=\"https://www.nature.com/articles/s41586-022-04643-y\">Virtual communication curbs creative idea generation.</a> “In a laboratory study and a field experiment across five countries (in Europe, the Middle East and South Asia), we show that videoconferencing inhibits the production of creative ideas. By contrast, when it comes to selecting which idea to pursue, we find no evidence that videoconferencing groups are less effective (and preliminary evidence that they may be more effective) than in-person groups.” Flaring? Bad over video. Focusing? Just fine.</p><h4>Climate</h4><p><a href=\"https://www.axios.com/2022/05/04/april-sets-record-highest-co2-levels\">April sets record for highest CO2 levels in human history.</a> “Levels of carbon dioxide in the atmosphere reached the highest levels on record for any calendar month during April, averaging 420 parts per million (ppm) for the first time since observations began in 1958, according to new data.”</p><h4>Covid</h4><p><a href=\"https://annehelen.substack.com/p/the-normalization-of-working-through\">The Normalization of \"Working Through Covid\".</a> “But I am here to say — to myself as much as any of you faced with this decision — that this is line of thinking is morally bankrupt. It has productivity culture brainworms. It is evidence of the most toxic scarcity mindset, and one of the most pernicious side-effects of the spread of “flexible” work.”</p><p><a href=\"https://www.nbcnews.com/news/us-news/covids-toll-us-reaches-1-million-deaths-unfathomable-number-rcna22105?cid=sm_npd_nn_tw_ma\">Covid's toll in U.S. reaches 1 million deaths, a once unfathomable number.</a> “The United States on Wednesday surpassed 1 million Covid-19 deaths, according to data compiled by NBC News — a once unthinkable scale of loss even for the country with the world’s highest recorded toll from the virus.”</p><h4>Crypto</h4><p><a href=\"https://restofworld.org/2022/argentina-nigeria-terra-crash/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=feeds\">From Argentina to Nigeria, people saw Terra as more stable than local currency. They lost everything.</a> “The apparent security of stablecoins has made them attractive to people in countries that experience high inflation or currency devaluations, such as Argentina, Iran, and Nigeria. The UST crash, which has hit other crypto assets, shattered that illusion. Valeria is one of more than a dozen people Rest of World  spoke with, from countries including Argentina, Venezuela, Iran, Iraq, and Nigeria, who invested in UST — the third-largest stablecoin — and its accompanying Luna token, and who said they have now lost tens of thousands of dollars in savings.”</p><p><a href=\"https://www.ft.com/content/446e0e6a-6858-4e33-a6cf-8c2e302dc75d?fbclid=IwAR1AyCg10czf3O445k0pHx4uwYOGPke2X6jPY_JoE3dhX7bU81_-13CUKdQ\">There is a moral case against crypto.</a> ““We” are not, in fact all going to make it — in a negative-sum or even zero-sum game, that’s impossible. The people using this line might, but that’s because they got in before everyone else. They are relying on the “greater fool” — which they hope includes you, dear reader — continuing to believe these lies and perpetuating their dishonest schemes.”</p><p><a href=\"https://hbr.org/2022/05/cautionary-tales-from-cryptoland\">Cautionary Tales from Cryptoland.</a> “It’s a compelling pitch; I’ll give them that. But crypto has so far been enormously successful at taking wealth from the average person or the financially disadvantaged and “redistributing” it to the already wealthy.”</p><p><a href=\"https://fortune.com/2022/05/11/coinbase-bankruptcy-crypto-assets-safe-private-key-earnings-stock/\">Coinbase admits users may lose crypto if exchange goes bankrupt.</a> “Coinbase said in its earnings report Tuesday that it holds $256 billion in both fiat currencies and cryptocurrencies on behalf of its customers. Yet the exchange noted that in the event it ever declared bankruptcy, “the crypto assets we hold in custody on behalf of our customers could be subject to bankruptcy proceedings.” Coinbase users would become “general unsecured creditors,” meaning they have no right to claim any specific property from the exchange in proceedings. Their funds would become inaccessible.” Uhh.</p><h4>Culture</h4><p><a href=\"https://thenextweb.com/news/halseys-record-label-wont-release-a-new-song-until-it-goes-viral-on-tiktok-is-this-the-future-of-the-music-industry\">Want to make it in the music industry? You better go viral on TikTok.</a> Halsey: “Basically I have a song that I love that I wanna release ASAP but my record label won’t let me. I’ve been in this industry for 8 years and I’ve sold over 165 million records. And my record company is saying that I can’t release it unless they can fake a viral moment on TikTok. Everything is marketing. And they are doing this to basically every artist these days. I just wanna release music, man. And I deserve better tbh. I’m tired.”</p><p><a href=\"https://interconnected.org/home/2022/05/26/filtered\">Filtered for ownership.</a> “Incredible to think of ownership as being so arbitrary. Implies that we could have completely different configurations of ownership, moral frameworks around it, feelings around it.” A fun exploration of several different ownership conundrums.</p><p><a href=\"https://swelltype.com/yep-i-created-the-new-avatar-font/\">Yep, I created the new AVATAR font.</a> “Like any self-respecting type designer, I’ve seen the SNL Papyrus skit, and I usually watch it again whenever someone sends me a link (which is pretty often). I do believe it’s Ryan Gosling’s finest performance. But unlike many type nerds, I think Papyrus is actually a pretty cool-looking font, and must admit that it wasn’t a bad fit for the original AVATAR logo, despite also appearing on Shakira merch and off-brand tea.”</p><h4>Fiction Fodder</h4><p><a href=\"https://futurism.com/the-byte/researcher-possible-change-laws-physics\">NASA Sponsored Researcher Suggests It Might Be Possible to Change the Laws of Physics.</a> “In an extremely cosmic-brain take, University of Rochester astrophysics professor Adam Frank suggests that a civilization could advance so much that it could eventually tinker with the fundamental laws of physics.”</p><h4>Media</h4><p><a href=\"https://news.cornell.edu/stories/2022/05/online-retail-images-reveal-skin-tone-discrepancies\">Online retail images reveal skin tone discrepancies.</a> “Their study, “Computing Colorism: Skin Tone in Online Retail Imagery,” published March 13 in Visual Communication, found that still images of models had statistically lighter skin tones than in videos of the same product and model. They also found evidence of “tokenism” – that is, many of the websites had one model who was considerably darker-skinned than the others”</p><p><a href=\"https://www.theguardian.com/tv-and-radio/2022/may/08/doctor-who-ncuti-gatwa-to-replace-jodie-whittaker-bbc-announces?CMP=Share_iOSApp_Other\">Doctor Who: Ncuti Gatwa to replace Jodie Whittaker, BBC announces.</a> “The Scottish actor, who was born in Rwanda, starred as Eric Effiong in Netflix’s hugely popular Sex Education about the socially awkward high school student Otis (Asa Butterfield) and his sex therapist mother Jean (Gillian Anderson). He will become the first black actor to play the title role full-time.” With no shade to the current era, which I’ve enjoyed very much, I can’t wait.</p><p><a href=\"https://bylinetimes.com/2022/05/06/wipe-jews-off-the-face-of-the-earth-racism-and-antisemitic-slurs-of-viral-youtuber-exposed/\">‘Wipe Jews Off the Face of the Earth’: Racism and Antisemitic Slurs of Viral YouTuber Exposed.</a> “Watson uses a string of racist and homophobic epithets and claims that he is sick of “media f—t activists” sticking signs “up in my face trying to get me to join the gay ft Palestinian cause. I don’t give a shit about Israel and Palestine. I care about white people. Not sand n—r Jew P—i f—t c—s”.”</p><h4>Politics</h4><p><a href=\"https://www.pbs.org/newshour/politics/why-is-the-gop-escalating-attacks-on-trans-rights-experts-say-the-goal-is-to-make-sure-evangelicals-vote\">Why is the GOP escalating attacks on trans rights? Experts say the goal is to make sure evangelicals vote.</a> “In the 2018 midterms, the Human Rights Campaign, with polling firm Catalyst, found that people they dubbed “equality voters,” those whose support for LGBTQ+ rights strongly influenced their voting choices, made up 29 percent of the electorate. White evangelicals made up 26 percent of the vote.” This is going to be an increasingly losing strategy over time.</p><p><a href=\"https://www.politico.com/news/2022/05/11/inflation-roe-dems-connect-voters-00031602\">Inflation’s biting. Roe’s fraying. Dems are still trying to connect with voters.</a> “When Porter gave an emotional speech about how inflation has been hitting her family for months during a private House Democratic Caucus meeting last week, she said it seemed like the first time the personal toll of high consumer prices had sunk in for some lawmakers in the room.”</p><p><a href=\"https://www.axios.com/mark-esper-book-trump-protesters-24e93272-2af5-423d-be3b-164daab7b43d.html\">Former Pentagon chief Esper says Trump wanted to shoot protesters.</a> “Former Defense Secretary Mark Esper charges in a memoir out May 10 that former President Trump said when demonstrators were filling the streets around the White House following the death of George Floyd: “Can’t you just shoot them? Just shoot them in the legs or something?””</p><p><a href=\"https://www.texastribune.org/2022/04/29/immigration-title-42-biden/?utm_campaign=trib-social&amp;utm_content=1651262125&amp;utm_medium=social&amp;utm_source=twitter\">What you need to know about the Title 42 policy that sends migrants to Mexico.</a> “The U.S. Centers for Disease Control and Prevention recently announced that it plans to end Title 42 on May 23 because COVID-19 cases have decreased and vaccines are widely available. But that date is now in question because of Republican-led lawsuits aimed at keeping the policy in place.”</p><p><a href=\"https://www.reuters.com/legal/government/fed-judiciary-says-yes-free-pacer-searches-here-are-details-so-far-2022-05-31/\">Fed judiciary says yes to free PACER searches. Here are the details so far.</a> “Federal judiciary policymakers have approved a plan to eliminate costly fees for online docket searches amid debate in Congress about whether to force the court system to make its PACER electronic court record system free for the general public.” RIP Aaron Swartz.</p><h4>Science</h4><p><a href=\"https://www.outsideonline.com/health/wellness/sunscreen-sun-exposure-skin-cancer-science/\">Is Sunscreen the New Margarine?</a> “So Lindqvist decided to look at overall mortality rates, and the results were shocking. Over the 20 years of the study, sun avoiders were twice as likely to die as sun worshippers.”</p><p><a href=\"https://www.nature.com/articles/s41598-022-10261-5\">Cats learn the names of their friend cats in their daily lives.</a> “This study provides evidence that cats link a companion’s name and corresponding face without explicit training.”</p><p><a href=\"https://www.biospace.com/article/researchers-answer-how-and-why-infants-die-from-sids/\">Researchers Pinpoint Reason Infants Die From SIDS.</a> “Previously, parents were told SIDS could be prevented if they took proper precautions: laying babies on their backs, not letting them overheat and keeping all toys and blankets out of the crib were a few of the most important preventative steps. So, when SIDS still occurred, parents were left with immense guilt, wondering if they could have prevented their baby’s death.”</p><h4>Society</h4><p><a href=\"https://www.scientificamerican.com/article/the-science-is-clear-gun-control-saves-lives/\">The Science Is Clear: Gun Control Saves Lives.</a> “The science is abundantly clear: More guns do not stop crime. Guns kill more children each year than auto accidents. More children die by gunfire in a year than on-duty police officers and active military members. Guns are a public health crisis, just like COVID, and in this, we are failing our children, over and over again.”</p><p><a href=\"https://www.bloomberg.com/news/articles/2022-05-28/all-aboard-germany-s-gas-saving-summer-of-super-cheap-trains\">All Aboard Germany's Gas-Saving Summer of Super-Cheap Trains.</a> “For the three months of summer starting June 1, a month’s travel ticket will cost just 9 euros ($9.56) a month for all subways, buses, trams and regional trains. This will slash the cost of public transit to almost token levels.” Way to make me homesick for Europe.</p><p><a href=\"https://www.axios.com/2022/05/26/gun-deaths-children-america\">Guns have become the top injury-related cause of death for U.S. kids.</a> “School shootings have become tragically common in the U.S., but constitute only a small fraction of gun deaths among children.”</p><p><a href=\"https://www.nejm.org/doi/full/10.1056/NEJMc2201761\">Current Causes of Death in Children and Adolescents in the United States.</a> “Since 2016, that gap has narrowed, and in 2020, firearm-related injuries became the leading cause of death in that age group.” Guns are now the leading cause of death for children in the United States.</p><p><a href=\"https://apnews.com/article/last-salem-witch-pardoned-3cff0a6a8dfcd81f7d6ac9e049a410ba\">329 years later, last Salem 'witch' who wasn't is pardoned.</a> “Massachusetts lawmakers on Thursday formally exonerated Elizabeth Johnson Jr., clearing her name 329 years after she was convicted of witchcraft in 1693 and sentenced to death at the height of the Salem Witch Trials.”</p><p><a href=\"https://19thnews.org/2022/05/supreme-court-decisions-overturned-poll/\">Vast majority of Americans don’t want Supreme Court decisions on marriage, contraception overturned, new poll shows.</a> “An exclusive The 19th/Momentive poll of more than 8,000 Americans revealed strongly held opinions on maintaining Supreme Court precedent on cases rooted in the 14th Amendment’s guarantee of personal liberty.”</p><p><a href=\"https://19thnews.org/2022/05/abortion-rights-restrictions-laws-in-your-state/\">What abortion restrictions and laws look like in every state in the US - right now.</a> “The 19th created this dashboard to centralize updates on the status of abortion rights in each state in this moment. While we will continue our extensive, in-depth coverage of the shifting abortion access landscape, this tool provides us with a way to share breaking news and how it affects access in each state.”</p><p><a href=\"https://www.vanityfair.com/news/2022/05/bill-cassidy-maternal-mortality-rates\">Louisiana Senator Bill Cassidy: Our Maternal Death Rates Are Only Bad If You Count Black Women.</a> “In an interview with Politico, the following words came out of Cassidy’s mouth: “About a third of our population is African American; African Americans have a higher incidence of maternal mortality. So, if you correct our population for race, we’re not as much of an outlier as it’d otherwise appear. Now, I say that not to minimize the issue but to focus the issue as to where it would be. For whatever reason, people of color have a higher incidence of maternal mortality.””</p><p><a href=\"https://www.salon.com/2022/05/19/fetus-powered-street-lamps-ramp-up-outrageous-anti-abortion-lies-ahead-of-roes-demise/\">Fetus-powered street lamps? Republicans ramp up outrageous anti-abortion lies ahead of Roe's demise.</a> ““In places like Washington D.C.,” fetuses are “burned to power the light’s of the city’s homes and streets,” claimed Catherine Glenn Foster, who had, just minutes before, sworn not to lie under oath. The GOP-summoned witness let loose the wild and utterly false accusation that municipal electrical companies are powered by incinerated fetuses.”</p><p><a href=\"https://19thnews.org/2022/05/baby-formula-shortage-crisis-carla-cevasco/\">How inequities make the baby formula shortage worse for many families.</a> “In the meantime, parents have begun stockpiling if they can – and rationing when they can’t. Much of the burden is falling on households that need financial assistance: The White House noted that people on the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC) account for about half of all infant formula purchases. Parents who work lower-income jobs often need to rely on formula more because their jobs do not allow for them to establish breastfeeding easily – assuming a parent can produce enough milk to begin with.”</p><p><a href=\"https://americandragnet.org/\">American Dragnet: Data-Driven Deportation in the 21st Century.</a> “ICE has used face recognition technology to search through the driver’s license photographs of around 1 in 3 (32%) of all adults in the U.S. The agency has access to the driver’s license data of 3 in 4 (74%) adults and tracks the movements of cars in cities home to nearly 3 in 4 (70%) adults. When 3 in 4 (74%) adults in the U.S. connected the gas, electricity, phone or internet in a new home, ICE was able to automatically learn their new address. Almost all of that has been done warrantlessly and in secret.”</p><p><a href=\"https://19thnews.org/2022/05/how-people-with-disabilities-feel-abortion/\">New poll captures how people with disabilities feel about abortion.</a> “The Data for Progress national poll indicates that 55 percent of non-disabled people and 53 percent of people with disabilities believe that abortion should be legal in most circumstances, which largely reflects recent data from other polling firms.”</p><p><a href=\"https://19thnews.org/2022/05/leaked-supreme-court-decision-abortion-roe-v-wade-impact/\">Leaked Supreme Court draft abortion decision could stop patients from seeking the procedure.</a> “The leaked ruling is certain to embolden conservative-led states eager to restrict access to the procedure. And it will discourage patients from seeking abortions that, under current law, they are constitutionally entitled to, experts said.”</p><p><a href=\"https://www.politico.com/news/2022/05/02/supreme-court-abortion-draft-opinion-00029473\">Supreme Court has voted to overturn abortion rights, draft opinion shows.</a> “No draft decision in the modern history of the court has been disclosed publicly while a case was still pending. The unprecedented revelation is bound to intensify the debate over what was already the most controversial case on the docket this term.”</p><p><a href=\"https://nationalpost.com/news/canada/canadian-astronauts-2022-federal-budget\">Canadian astronauts no longer free to rob and kill with abandon in space or on the moon.</a> “The amendment explicitly states that Canadian criminal jurisdiction will apply to the lunar station itself, and any “means of transportation” to the station. And just in case, “on the surface of the moon.””</p><h4>Technology</h4><p><a href=\"https://www.protocol.com/bulletins/microsoft-verified-id-digital-privacy\">Microsoft’s Verified ID could create digital privacy issues.</a> “As part of Verified ID, individuals would be able to get digital credentials that prove where they work, what school they graduated from, which bank account they have — and, perhaps more controversially, whether they’re in good health according to their doctor.” It supports DIDs, interestingly.</p><p><a href=\"https://www.wired.com/story/technology-design-marginalized-communities/\">If Tech Fails to Design for the Most Vulnerable, It Fails Us All.</a> “The reality is that making better, safer, less harmful tech requires design based on the lived realities of those who are most marginalized. These “edge cases” are frequently ignored as being outside of the scope of a typical user’s likely experiences. Yet they are powerful indicators for understanding the flaws in our technologies.”</p><p><a href=\"https://futurism.com/confusing-facebook-not-building-metaverse\">In Extremely Confusing Twist, Facebook Says It Isn’t Building a Metaverse After All.</a> “Facebook’s dream of the metaverse, a VR hellscape stuffed with annoying ads and screeching children, is as incoherent and confusing as ever after reading an 8,000 word essay by Nick Clegg, the president of global affairs at Facebook’s parent company Meta.” Honestly can’t believe I’m living in a reality where Nick Clegg of all people is in a position to describe the future.</p><p><a href=\"https://citizenlab.ca/2022/05/bada-bing-bada-boom-microsoft-bings-chinese-political-censorship-autosuggestions-north-america/\">Bada Bing, Bada Boom: Microsoft Bing’s Chinese Political Censorship of Autosuggestions in North America.</a> “We analyzed Microsoft Bing’s autosuggestion system for censorship of the names of individuals, finding that, outside of names relating to eroticism, the second largest category of names censored from appearing in autosuggestions were those of Chinese party leaders, dissidents, and other persons considered politically sensitive in China.” Including here in the US.</p><p><a href=\"https://www.nytimes.com/2022/05/19/opinion/privacy-technology-data.html\">We Need to Take Back Our Privacy.</a> “That data becomes an even more powerful form of surveillance when it is combined with other data. A woman who regularly eats sushi and suddenly stops, or stops taking Pepto-Bismol, or starts taking vitamin B6 may be easily identified as someone following guidelines for pregnancy. If that woman doesn’t give birth she might find herself being questioned by the police, who may think she had an abortion.”</p><p><a href=\"https://www.calnewport.com/blog/2022/05/16/taking-a-break-from-social-media-makes-you-happier-and-less-anxious/\">Taking a Break from Social Media Makes you Happier and Less Anxious.</a> “At the end of this week, the researchers found “significant between-group differences” in well-being, depression, and anxiety, with the intervention group faring much better on all three metrics. These results held even after control for baseline scores, as well as age and gender.”</p><p><a href=\"https://www.theverge.com/2022/5/10/23065412/apple-ipod-touch-canceled-discontinued\">Apple discontinues the iPod after 20 years.</a> “While Apple may be done with making dedicated music players, the company says that “the spirit of iPod lives on” in all of its devices that play music, such as the iPhone, iPad, and HomePod Mini.”</p><p><a href=\"https://www.usnews.com/news/world/articles/2022-05-10/israel-arrests-9-for-airdrop-of-crash-images-aboard-plane\">Israel Arrests 9 for 'AirDrop' of Crash Images Aboard Plane.</a> “A taxiing plane returned to the gate at Tel Aviv’s Ben Gurion Airport on Tuesday after photos of aviation disasters popped up on passengers’ phones - sent, Israeli authorities believe, by nine people on board using the iPhone “AirDrop” function.”</p><p><a href=\"https://www.vice.com/en/article/m7vzjb/location-data-abortion-clinics-safegraph-planned-parenthood\">Data Broker Is Selling Location Data of People Who Visit Abortion Clinics.</a> “A location data firm is selling information related to visits to clinics that provide abortions including Planned Parenthood facilities, showing where groups of people visiting the locations came from, how long they stayed there, and where they then went afterwards, according to sets of the data purchased by Motherboard.”</p></div>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Ben Werdmüller",
    "url": "https://werd.io/feed/"
  },
  "discussionUrl": "https://werd.io/2022/reading-watching-playing-using-may-2022",
  "sameAs": "https://werd.io/2022/reading-watching-playing-using-may-2022",
  "dateCreated": "2022-06-11T17:56:21.349Z",
  "datePublished": "2022-06-02T00:43:34.000Z",
  "dateModified": "2022-06-11T17:56:21.349Z",
  "interactionStatistic": [],
  "headline_zh-Hans": "阅读、观看、玩耍、使用。5月，2022年\n",
  "headline_zh-Hant": "閱讀、觀看、玩耍、使用。5月，2022年\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<div class=\"e-content entry-content\">\n<p>This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for May, 2022.</p><h3>Books</h3><p><a href=\"https://bookshop.org/books/beyond-magenta-transgender-teens-speak-out/9780763673680\">Beyond Magenta: Transgender Teens Speak Out, by Susan Kuklin.</a> I wanted to like this, but I can’t recommend it. Granted, it’s almost a decade old, and the discourse has evolved since then. But the author leaves gender essentialism and some stories that verge on abuse unaddressed. It’s great that these teenagers’ stories are told verbatim, but it’s not great to miss out on the nuanced commentary that they demand. I love the idea and I hope someone executes it better than this.</p><p><a href=\"https://bookshop.org/a/7949/9780525560548\">Hood Feminism: Notes from the Women That a Movement Forgot, by Mikki Kendall.</a> A heartfelt argument for truly intersectional feminism. Occasionally challenging in the way that helps you stretch and learn, and overall a vision of what the politics of the future need to look like. As an introduction, it’s near-perfect, and I want to send it to quite a few people I know.</p><h3>Notable Articles</h3><h4>Business</h4><p><a href=\"https://www.huffpost.com/entry/mass-shootings-work_l_628e6c73e4b0cda85db97dcd\">The Worst Thing You Can Do At Work After Another Mass Shooting Is Nothing. </a> ““You can’t do ‘business as usual’ after a tragic event, which is something that many employers do and fail to prioritize the needs of their staff during such a difficult time,” said Katheryn Perez, a California-based psychotherapist. “The needs and humanity of your staff should take priority over anything.””</p><p><a href=\"https://www.businessinsider.com/spacex-paid-250000-to-a-flight-attendant-who-accused-elon-musk-of-sexual-misconduct-2022-5\">SpaceX Paid $250,000 to a Flight Attendant Who Accused Elon Musk of Sexual Misconduct.</a> “The flight attendant told her friend that the billionaire SpaceX and Tesla founder asked her to come to his room during a flight in late 2016 “for a full body massage,” the declaration says. When she arrived, the attendant found that Musk “was completely naked except for a sheet covering the lower half of his body.” During the massage, the declaration says, Musk “exposed his genitals” and then “touched her and offered to buy her a horse if she would ‘do more,’ referring to the performance of sex acts.””</p><p><a href=\"https://www.nature.com/articles/s41586-022-04643-y\">Virtual communication curbs creative idea generation.</a> “In a laboratory study and a field experiment across five countries (in Europe, the Middle East and South Asia), we show that videoconferencing inhibits the production of creative ideas. By contrast, when it comes to selecting which idea to pursue, we find no evidence that videoconferencing groups are less effective (and preliminary evidence that they may be more effective) than in-person groups.” Flaring? Bad over video. Focusing? Just fine.</p><h4>Climate</h4><p><a href=\"https://www.axios.com/2022/05/04/april-sets-record-highest-co2-levels\">April sets record for highest CO2 levels in human history.</a> “Levels of carbon dioxide in the atmosphere reached the highest levels on record for any calendar month during April, averaging 420 parts per million (ppm) for the first time since observations began in 1958, according to new data. ”</p><h4>Covid</h4><p><a href=\"https://annehelen.substack.com/p/the-normalization-of-working-through\">The Normalization of \"Working Through Covid\".</a> “But I am here to say — to myself as much as any of you faced with this decision — that this is line of thinking is morally bankrupt. It has productivity culture brainworms. It is evidence of the most toxic scarcity mindset, and one of the most pernicious side-effects of the spread of “flexible” work.”</p><p><a href=\"https://www.nbcnews.com/news/us-news/covids-toll-us-reaches-1-million-deaths-unfathomable-number-rcna22105?cid=sm_npd_nn_tw_ma\">Covid's toll in U.S. reaches 1 million deaths, a once unfathomable number. </a> “The United States on Wednesday surpassed 1 million Covid-19 deaths, according to data compiled by NBC News — a once unthinkable scale of loss even for the country with the world’s highest recorded toll from the virus.”</p><h4>Crypto</h4><p><a href=\"https://restofworld.org/2022/argentina-nigeria-terra-crash/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=feeds\">From Argentina to Nigeria, \n",
  "description_zh-Hant": "<div class=\"e-content entry-content\">\n<p>This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for May, 2022.</p><h3>Books</h3><p><a href=\"https://bookshop.org/books/beyond-magenta-transgender-teens-speak-out/9780763673680\">Beyond Magenta: Transgender Teens Speak Out, by Susan Kuklin.</a> I wanted to like this, but I can’t recommend it. Granted, it’s almost a decade old, and the discourse has evolved since then. But the author leaves gender essentialism and some stories that verge on abuse unaddressed. It’s great that these teenagers’ stories are told verbatim, but it’s not great to miss out on the nuanced commentary that they demand. I love the idea and I hope someone executes it better than this.</p><p><a href=\"https://bookshop.org/a/7949/9780525560548\">Hood Feminism: Notes from the Women That a Movement Forgot, by Mikki Kendall.</a> A heartfelt argument for truly intersectional feminism. Occasionally challenging in the way that helps you stretch and learn, and overall a vision of what the politics of the future need to look like. As an introduction, it’s near-perfect, and I want to send it to quite a few people I know.</p><h3>Notable Articles</h3><h4>Business</h4><p><a href=\"https://www.huffpost.com/entry/mass-shootings-work_l_628e6c73e4b0cda85db97dcd\">The Worst Thing You Can Do At Work After Another Mass Shooting Is Nothing. </a> ““You can’t do ‘business as usual’ after a tragic event, which is something that many employers do and fail to prioritize the needs of their staff during such a difficult time,” said Katheryn Perez, a California-based psychotherapist. “The needs and humanity of your staff should take priority over anything.””</p><p><a href=\"https://www.businessinsider.com/spacex-paid-250000-to-a-flight-attendant-who-accused-elon-musk-of-sexual-misconduct-2022-5\">SpaceX Paid $250,000 to a Flight Attendant Who Accused Elon Musk of Sexual Misconduct.</a> “The flight attendant told her friend that the billionaire SpaceX and Tesla founder asked her to come to his room during a flight in late 2016 “for a full body massage,” the declaration says. When she arrived, the attendant found that Musk “was completely naked except for a sheet covering the lower half of his body.” During the massage, the declaration says, Musk “exposed his genitals” and then “touched her and offered to buy her a horse if she would ‘do more,’ referring to the performance of sex acts.””</p><p><a href=\"https://www.nature.com/articles/s41586-022-04643-y\">Virtual communication curbs creative idea generation.</a> “In a laboratory study and a field experiment across five countries (in Europe, the Middle East and South Asia), we show that videoconferencing inhibits the production of creative ideas. By contrast, when it comes to selecting which idea to pursue, we find no evidence that videoconferencing groups are less effective (and preliminary evidence that they may be more effective) than in-person groups.” Flaring? Bad over video. Focusing? Just fine.</p><h4>Climate</h4><p><a href=\"https://www.axios.com/2022/05/04/april-sets-record-highest-co2-levels\">April sets record for highest CO2 levels in human history.</a> “Levels of carbon dioxide in the atmosphere reached the highest levels on record for any calendar month during April, averaging 420 parts per million (ppm) for the first time since observations began in 1958, according to new data. ”</p><h4>Covid</h4><p><a href=\"https://annehelen.substack.com/p/the-normalization-of-working-through\">The Normalization of \"Working Through Covid\".</a> “But I am here to say — to myself as much as any of you faced with this decision — that this is line of thinking is morally bankrupt. It has productivity culture brainworms. It is evidence of the most toxic scarcity mindset, and one of the most pernicious side-effects of the spread of “flexible” work.”</p><p><a href=\"https://www.nbcnews.com/news/us-news/covids-toll-us-reaches-1-million-deaths-unfathomable-number-rcna22105?cid=sm_npd_nn_tw_ma\">Covid's toll in U.S. reaches 1 million deaths, a once unfathomable number. </a> “The United States on Wednesday surpassed 1 million Covid-19 deaths, according to data compiled by NBC News — a once unthinkable scale of loss even for the country with the world’s highest recorded toll from the virus.”</p><h4>Crypto</h4><p><a href=\"https://restofworld.org/2022/argentina-nigeria-terra-crash/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=feeds\">From Argentina to Nigeria, \n"
}