{
  "@type": "NewsArticle",
  "identifier": "2022--06--29--en--myfeed--HackerNews--NewsArticle--31925898",
  "url": "https://news.ycombinator.com/item?id=31925898",
  "headline": "Where can I find a good tribe / community for myself?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I love technology, I care about myself and others, mentally, physically and spiritually. Invested in growth on every life vertical, I do sports, I meditate, I read a lot, I made sure I have proper financial education, I try to properly take care of my kids knowing all subtle things that can influence them, etc. Basically I am pretty self aware and I care about improving my life and others' as much as I can. And I very actively do something about it, not just care.<p>But I find myself in the capital of an European country, with not that many that share same interests, most, of course share just a few, or understand the utility of just few of them, etc. Few have a real drive for living, even if they have money. Most of those who do just party hard, seek validation, etc. The other few that share ambition to grow or do interesting things, are burnt out or depressed.<p>I plan to take my family this summer and move somewhere where I can encounter on a daily basis people that share same values and what I consider a healthy approach on life. But I don't know how can I find a place - city, community, island - that meets my needs.<p>Any clue?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "questionmania",
    "url": "https://news.ycombinator.com/user?id=questionmania"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31925898",
  "sameAs": "https://news.ycombinator.com/item?id=31925898",
  "dateCreated": "2022-06-29T22:25:23.683Z",
  "datePublished": "2022-06-29T21:24:32.000Z",
  "dateModified": "2022-06-29T22:25:23.683Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "我在哪里可以为自己找到一个好的部落/社区？\n",
  "headline_zh-Hant": "我在哪裡可以為自己找到一個好的部落/社區？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我热爱技术，我关心自己和他人，在精神上、身体上和心灵上。我在每一个生命的垂直方向上投资成长，我做运动，我冥想，我大量阅读，我确保我有适当的金融教育，我努力适当地照顾我的孩子，知道所有可能影响他们的微妙事情，等等。基本上，我有很强的自我意识，我关心如何尽可能地改善自己和他人的生活。但我发现自己身处一个欧洲国家的首都，与我有相同兴趣的人并不多，大多数人当然只是分享一些，或者只是了解其中一些的效用，等等。很少有人有真正的生活动力，即使他们有钱。这些人中的大多数人只是努力聚会，寻求确认，等等。<p>我计划今年夏天带着我的家人搬到一个地方，在那里我可以每天遇到拥有相同价值观和我认为健康的生活方式的人。但我不知道如何才能找到一个符合我需求的地方--城市、社区、岛屿。<p>有什么线索吗？\n",
  "description_zh-Hant": "我熱愛技術，我關心自己和他人，在精神上、身體上和心靈上。我在每一個生命的垂直方向上投資成長，我做運動，我冥想，我大量閱讀，我確保我有適當的金融教育，我努力適當地照顧我的孩子，知道所有可能影響他們的微妙事情，等等。基本上，我有很強的自我意識，我關心如何儘可能地改善自己和他人的生活。但我發現自己身處一個歐洲國家的首都，與我有相同興趣的人並不多，大多數人當然只是分享一些，或者只是瞭解其中一些的效用，等等。很少有人有真正的生活動力，即使他們有錢。這些人中的大多數人只是努力聚會，尋求確認，等等。<p>我計劃今年夏天帶著我的家人搬到一個地方，在那裡我可以每天遇到擁有相同價值觀和我認為健康的生活方式的人。但我不知道如何才能找到一個符合我需求的地方--城市、社區、島嶼。<p>有什麼線索嗎？\n"
}