{
  "@type": "NewsArticle",
  "identifier": "2022--07--16--en--myfeed--HackerNews--NewsArticle--32119724",
  "url": "https://news.ycombinator.com/item?id=32119724",
  "headline": "Dependent on Deep Learning Models",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have a startup idea which is heavily dependent on sophisticated machine learning models. I’ve come across API vendors that offer the ML models I need as a service and perform the function I need perfectly. However, they are incredibly expensive, so expensive that my product is no longer feasible from a cost perspective, a user would never buy it at this price.<p>This can be circumvented by building out the ML models myself, however, the money required to train the models is huge (multiple millions). What should I be doing in this situation?<p>Here are my options as I see them, if you feel there’s another route please don’t hesitate to add:<p>- Leverage the expensive APIs until I raise enough money to train my own models.<p>- Start with a subpar model that is trained on a limited dataset (this runs the risk of damaging the perception of how good the product can be).<p>- Create a landing page, gather interest, raise money and then train my own model.<p>From this experience, I’m starting to think once a competitor has an ML model trained and developed to catch up would be insanely difficult. How do other startups that are dependent on ML get started given the costs are so high to train models to be effective?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "chronicler",
    "url": "https://news.ycombinator.com/user?id=chronicler"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32119724",
  "sameAs": "https://news.ycombinator.com/item?id=32119724",
  "dateCreated": "2022-07-16T17:02:32.671Z",
  "datePublished": "2022-07-16T16:45:13.000Z",
  "dateModified": "2022-07-16T17:02:32.671Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "依赖于深度学习模型\n",
  "headline_zh-Hant": "依賴於深度學習模型\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我有一个创业的想法，它在很大程度上依赖于复杂的机器学习模型。我遇到了一些API供应商，他们以服务的形式提供我需要的ML模型，并完美地执行我需要的功能。然而，他们的价格非常昂贵，以至于我的产品从成本角度来看不再可行，用户绝不会以这种价格购买。<p>这可以通过自己构建ML模型来规避，然而，训练模型所需的资金是巨大的（数百万）。在这种情况下，我应该怎么做？<p>以下是我所看到的选择，如果你觉得有其他的路线，请不要犹豫地补充：<p>- 充分利用昂贵的API，直到我筹集到足够的资金来训练我自己的模型。<p>- 从一个不合格的模型开始，在有限的数据集上训练（这有可能破坏人们对产品的好感）。 <p>- 创建一个登陆页面，收集兴趣，筹集资金，然后训练我自己的模型。<p>从这个经验来看，我开始认为，一旦竞争对手有了训练和开发的ML模型，要追赶就会非常困难。鉴于训练模型的成本如此之高，其他依赖ML的初创公司是如何开始的？\n",
  "description_zh-Hant": "我有一個創業的想法，它在很大程度上依賴於複雜的機器學習模型。我遇到了一些API供應商，他們以服務的形式提供我需要的ML模型，並完美地執行我需要的功能。然而，他們的價格非常昂貴，以至於我的產品從成本角度來看不再可行，用戶絕不會以這種價格購買。<p>這可以通過自己構建ML模型來規避，然而，訓練模型所需的資金是巨大的（數百萬）。在這種情況下，我應該怎麼做？<p>以下是我所看到的選擇，如果你覺得有其他的路線，請不要猶豫地補充：<p>- 充分利用昂貴的API，直到我籌集到足夠的資金來訓練我自己的模型。<p>- 從一個不合格的模型開始，在有限的數據集上訓練（這有可能破壞人們對產品的好感）。 <p>- 創建一個登陸頁面，收集興趣，籌集資金，然後訓練我自己的模型。<p>從這個經驗來看，我開始認為，一旦競爭對手有了訓練和開發的ML模型，要追趕就會非常困難。鑑於訓練模型的成本如此之高，其他依賴ML的初創公司是如何開始的？\n"
}