{
  "@type": "NewsArticle",
  "identifier": "2022--04--28--en--myfeed--HackerNews--NewsArticle--31191555",
  "url": "https://news.ycombinator.com/item?id=31191555",
  "headline": "Thougths on SW development leadership and workaholism",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello dear reader,\nTLDR: Learn to make time to consider things properly.\nmy name is Iivo Huttunen (not really) and I am workaholic in withdrawal.\n(Hello Iivo)<p>I have word hard for 14 years now. I fucked up and now I wonder what to do with all this time \nunemployed people have. So, I practice typing, a thing I never found time for.<p>But why I am talking about that, instead of telling you how great things I did through my career, list my successes and so on?<p>Lessons learned – best lessons are learned by witnessing, experiencing things which go wrong. \nWisdom is often acquired the hard way.<p>Honesty is the basis of trust, and trust is the basis of any meaningful communication, and \nmeaningful communication is the basis of awareness, and awareness is the basis of success.\nHow could I expect honesty, if I do not practice it myself?<p>How can one judge risks and make informed decisions if another is deceiving by omission (or worse)?<p>So to “speed things” up, I’ll fast forward to the part of what a good leader is in my opinion. The \nleader I strive to be.<p>Before everything, a leader must be aware – or strive to be as aware as possible. Aware of the \ncommon issues with the industry. Aware of existing ways to mitigate them. Aware if the method is yielding the intended result. Aware of the team capabilities, morale and general situation.<p>Considerate of things and people. “Barking up the wrong tree” is rarely a wining move. It is not \nenough to be aware and have access to information. The information must be given due \nconsideration, and discussion. Of course, time is limited, we must be considerate of that as well.<p>Reasonable. People often try to “renegotiate reality”. Thus, they often dismiss truthful, important (but “uncomfortable”) - information having effect on outcome. This \ninevitably leads to decrease in awareness as people communicate what others want to hear. \nI believe that “yesmanship” is highly harmful to a product and organization.<p>Open minded – that helps immensely with above mentioned points. Technology is complex – people \neven more so. A good leader must be ready to consider unorthodox approach, sometimes.<p>To “quickly” mention few common problems I am painfully aware of, have explored, discussed and \nconsidered for years, have reasonable expectations towards, and remained open minded to new solutions. Things which are often sacrificed on the altar of “timely delivery” – yet essential for said delivery, general productivity, cost and so on.<p>Continuous skill development. Tech skills have a rather short expiration date. Many possible ways to mitigate that, but an eternal struggle – especially who will bear the costs of it. The “company” always end up paying the lion’s share of it indirectly. I think accepting that and having a coherent approach to that is better.<p>Onboarding. You can have person with decades of experience fail miserably due to improper \nonboarding. Improper onboarding can be horribly costly. Very complex topic, but documentation, \ntest coverage, building trust helps.<p>Maintenance, testing and maintainability – another thing which is often neglected, as its value is not immediate obvious. It is somehow assumed developers take care of it “on the side” at no cost.<p>Scope management – this is probably the holy grail of software development. Plans and estimations will eventually need to survive contact with reality. They will need to be adjusted; this is something we simply must accept.<p>Team morale and communication – impatient often goes with unreasonable and unfair. Even the \nmost cooperative people have their limits. In my experience it’s not so much about how good or bad \ncommunicators people are, but what information they are willing to communicate.  Some of the least structured “messy” communications often yield the most valuable insight.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "iivorator",
    "url": "https://news.ycombinator.com/user?id=iivorator"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31191555",
  "sameAs": "https://news.ycombinator.com/item?id=31191555",
  "dateCreated": "2022-04-28T13:01:58.723Z",
  "datePublished": "2022-04-28T12:13:01.000Z",
  "dateModified": "2022-04-28T13:01:58.723Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "关于SW发展领导力和工作狂的思考",
  "headline_zh-Hant": "關於SW發展領導力和工作狂的思考",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "亲爱的读者您好。\nTLDR：学会腾出时间来好好考虑问题。\n我的名字是Iivo Huttunen（不是真的），我是戒烟的工作狂。\n(Hello Iivo)<p>我已经努力工作了14年了。我搞砸了，现在我不知道该怎么处理这些时间了 \n失业的人有。所以，我练习打字，这是我从来没有找到时间的事情。<p>但是，为什么我在谈论这个，而不是告诉你我在职业生涯中做了多么伟大的事情，列出我的成功等等？<p>经验教训--最好的经验教训是通过见证、体验出错的事情来学习。\n智慧往往是通过艰苦的方式获得的。<p>诚实是信任的基础，而信任是任何有意义的沟通的基础，有意义的沟通是认识的基础。\n有意义的沟通是意识的基础，而意识是成功的基础。\n如果我自己不实行诚实，我怎么能期望诚实呢？<p>如果另一个人以不作为的方式欺骗（或更糟），一个人怎么能判断风险并做出明智的决定呢？<p>所以为了 \"加快进度\"，我将快进到我认为的好领导是什么的部分。我努力成为的领导人。\n<p>在一切之前，领导者必须意识到--或努力尽可能地意识到。意识到 \n行业的常见问题。意识到缓解这些问题的现有方法。意识到该方法是否产生了预期的结果。意识到团队的能力、士气和总体情况。<p>考虑到事情和人。\"在错误的树上吠叫 \"很少是明智之举。这并不是 \n仅仅了解和获得信息是不够的。必须对这些信息进行适当的 \n考虑和讨论。当然，时间是有限的，我们也必须考虑到这一点。<p>合理的。人们经常试图 \"重新谈判现实\"。因此，他们经常拒绝真实的、重要的（但 \"不舒服 \"的）--对结果有影响的信息。这 \n这不可避免地导致人们的意识下降，因为人们传达的是别人想听的话。\n我相信 \"唯我独尊 \"对产品和组织来说是非常有害的。<p>开放的心态--这对上述几点有很大帮助。技术是复杂的，人 \n更是如此。一个好的领导者必须准备好考虑非正统的方法，有时。<p>为了 \"快速 \"提到我痛苦地意识到的几个常见问题，我已经探索、讨论和考虑了多年。\n几年来，我一直在探索、讨论和考虑一些常见问题，对这些问题有合理的期望，并对新的解决方案保持开放的心态。在 \"及时交付 \"的祭坛上经常被牺牲的东西--但对上述交付、一般生产力、成本等来说是必不可少的。技术技能有一个相当短的失效期。有许多可能的方法来缓解这一问题，但这是一个永恒的斗争--特别是谁将承担其成本。公司 \"最终总是间接地支付其中的大部分费用。我认为接受这一点并有一个连贯的方法会更好。<p>入职。你可以让有几十年经验的人因为不恰当的入职培训而惨遭失败。\n入职培训。不当的入职培训会造成可怕的损失。这是一个非常复杂的话题，但是文档、测试覆盖率和建立信任都有帮助。\n<p>维护、测试和可维护性--这是另一个经常被忽视的问题，因为它的价值并不直接明显。<p>范围管理 - 这可能是软件开发的圣杯。计划和估算最终将需要在与现实的接触中生存下来。他们将需要调整；这是我们必须接受的。<p>团队士气和沟通--不耐烦往往与不合理和不公平相伴。即使是 \n最具合作精神的人也有其极限。根据我的经验，人们的沟通能力好坏并不重要。\n沟通者，而是他们愿意沟通什么信息。 一些结构化程度最低的 \"混乱 \"沟通往往能产生最有价值的见解。",
  "description_zh-Hant": "親愛的讀者您好。\nTLDR：學會騰出時間來好好考慮問題。\n我的名字是Iivo Huttunen（不是真的），我是戒菸的工作狂。\n(Hello Iivo)<p>我已經努力工作了14年了。我搞砸了，現在我不知道該怎麼處理這些時間了 \n失業的人有。所以，我練習打字，這是我從來沒有找到時間的事情。<p>但是，為什麼我在談論這個，而不是告訴你我在職業生涯中做了多麼偉大的事情，列出我的成功等等？<p>經驗教訓--最好的經驗教訓是通過見證、體驗出錯的事情來學習。\n智慧往往是通過艱苦的方式獲得的。<p>誠實是信任的基礎，而信任是任何有意義的溝通的基礎，有意義的溝通是認識的基礎。\n有意義的溝通是意識的基礎，而意識是成功的基礎。\n如果我自己不實行誠實，我怎麼能期望誠實呢？<p>如果另一個人以不作為的方式欺騙（或更糟），一個人怎麼能判斷風險並做出明智的決定呢？<p>所以為了 \"加快進度\"，我將快進到我認為的好領導是什麼的部分。我努力成為的領導人。\n<p>在一切之前，領導者必須意識到--或努力盡可能地意識到。意識到 \n行業的常見問題。意識到緩解這些問題的現有方法。意識到該方法是否產生了預期的結果。意識到團隊的能力、士氣和總體情況。<p>考慮到事情和人。\"在錯誤的樹上吠叫 \"很少是明智之舉。這並不是 \n僅僅瞭解和獲得信息是不夠的。必須對這些信息進行適當的 \n考慮和討論。當然，時間是有限的，我們也必須考慮到這一點。<p>合理的。人們經常試圖 \"重新談判現實\"。因此，他們經常拒絕真實的、重要的（但 \"不舒服 \"的）--對結果有影響的信息。這 \n這不可避免地導致人們的意識下降，因為人們傳達的是別人想聽的話。\n我相信 \"唯我獨尊 \"對產品和組織來說是非常有害的。<p>開放的心態--這對上述幾點有很大幫助。技術是複雜的，人 \n更是如此。一個好的領導者必須準備好考慮非正統的方法，有時。<p>為了 \"快速 \"提到我痛苦地意識到的幾個常見問題，我已經探索、討論和考慮了多年。\n幾年來，我一直在探索、討論和考慮一些常見問題，對這些問題有合理的期望，並對新的解決方案保持開放的心態。在 \"及時交付 \"的祭壇上經常被犧牲的東西--但對上述交付、一般生產力、成本等來說是必不可少的。技術技能有一個相當短的失效期。有許多可能的方法來緩解這一問題，但這是一個永恆的鬥爭--特別是誰將承擔其成本。公司 \"最終總是間接地支付其中的大部分費用。我認為接受這一點並有一個連貫的方法會更好。<p>入職。你可以讓有幾十年經驗的人因為不恰當的入職培訓而慘遭失敗。\n入職培訓。不當的入職培訓會造成可怕的損失。這是一個非常複雜的話題，但是文檔、測試覆蓋率和建立信任都有幫助。\n<p>維護、測試和可維護性--這是另一個經常被忽視的問題，因為它的價值並不直接明顯。<p>範圍管理 - 這可能是軟件開發的聖盃。計劃和估算最終將需要在與現實的接觸中生存下來。他們將需要調整；這是我們必須接受的。<p>團隊士氣和溝通--不耐煩往往與不合理和不公平相伴。即使是 \n最具合作精神的人也有其極限。根據我的經驗，人們的溝通能力好壞並不重要。\n溝通者，而是他們願意溝通什麼信息。 一些結構化程度最低的 \"混亂 \"溝通往往能產生最有價值的見解。"
}