{
  "@type": "NewsArticle",
  "identifier": "2022--04--20--en--myfeed--HackerNews--NewsArticle--31096921",
  "url": "https://news.ycombinator.com/item?id=31096921",
  "headline": "What solutions to content moderation would be better than Elon Musk’s?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "It seems a lot of people in tech believe the ability for anybody to share largely unmoderated content on large social media platforms is very important for free/open online communication. At the same time you could argue there is a desire/need to combat spam, disinformation campaigns, propaganda, hate speech, AI generated content, etc.<p>Much of the discussion around content moderation is about the many challenges, sometimes suggesting it is an impossible problem to solve. A lot of discussion also suggests content moderation is inherently bad because “free speech”. However, lots of problems are technically challenging and/or ethically challenging (e.g., self driving cars), but are not discussed the same way.<p>A perfect solution to content moderation likely does not exist, but I am curious what companies are working solely on providing content moderation as a service and what innovative solutions are being proposed. Also, what is the state of the art in content moderation research assuming such a thing exists?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "sepiasaucer",
    "url": "https://news.ycombinator.com/user?id=sepiasaucer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31096921",
  "sameAs": "https://news.ycombinator.com/item?id=31096921",
  "dateCreated": "2022-04-20T13:57:07.844Z",
  "datePublished": "2022-04-20T13:49:19.000Z",
  "dateModified": "2022-04-20T13:57:07.844Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "哪些内容审核的解决方案会比埃隆-马斯克的更好？",
  "headline_zh-Hant": "哪些內容審核的解決方案會比埃隆-馬斯克的更好？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "似乎很多科技界人士认为，任何人在大型社交媒体平台上分享基本未经审核的内容的能力，对于自由/开放的在线交流非常重要。同时，你可以说，人们希望/需要打击垃圾邮件、虚假信息活动、宣传、仇恨言论、人工智能生成的内容等。<p>围绕内容审核的许多讨论是关于许多挑战，有时表明这是一个不可能解决的问题。很多讨论还表明，由于 \"言论自由\"，内容节制本质上是不好的。然而，很多问题在技术上具有挑战性和/或在道德上具有挑战性（例如，自动驾驶汽车），但没有以同样的方式进行讨论。<p>内容审核的完美解决方案可能不存在，但我很好奇有哪些公司正致力于将内容审核作为一项服务来提供，以及正在提出哪些创新的解决方案。此外，假设存在这样的东西，那么内容审核研究的现状如何？",
  "description_zh-Hant": "似乎很多科技界人士認為，任何人在大型社交媒體平臺上分享基本未經審核的內容的能力，對於自由/開放的在線交流非常重要。同時，你可以說，人們希望/需要打擊垃圾郵件、虛假信息活動、宣傳、仇恨言論、人工智能生成的內容等。<p>圍繞內容審核的許多討論是關於許多挑戰，有時表明這是一個不可能解決的問題。很多討論還表明，由於 \"言論自由\"，內容節制本質上是不好的。然而，很多問題在技術上具有挑戰性和/或在道德上具有挑戰性（例如，自動駕駛汽車），但沒有以同樣的方式進行討論。<p>內容審核的完美解決方案可能不存在，但我很好奇有哪些公司正致力於將內容審核作為一項服務來提供，以及正在提出哪些創新的解決方案。此外，假設存在這樣的東西，那麼內容審核研究的現狀如何？"
}