{
  "@type": "NewsArticle",
  "identifier": "2022--07--16--en--myfeed--HackerNews--NewsArticle--32121568",
  "url": "https://news.ycombinator.com/item?id=32121568",
  "headline": "Facebook hacked and accounts on FB and IG now banned",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "It's been one frustrating week! Got banned after being hacked on facebook. I have a page with over 20k followers on our IG account and close to 20k likes on our FB page and all IG accounts linked to my personal account have been disabled. Not only that, I was banned from advertising and the hackers used $4000-$5000 ish in ads that was funneled out of the PayPal account connected to it. I want to dispute it with PayPal and the bank but have no one of seeing what was exactly &quot;advertised&quot; with the spending costs because I cannot log in. Ridiculous. We've spent well over 6-figures in advertising over the last decade or so and the business pages being disabled cripples our online presence (not to mention, losing photos and connections from my own personal account I've been using since 2006-2007).  This is also a family business that is our livelihood.<p>If you know anyone from Meta/Facebook/Instagram that can have some empathy and a heart to help (or if you know someone you can forward this to), please reach out to me at roger@petzonesd.com.\nI feel everyone's suffering and frustration here. Account got disabled for going against community standards by the hackers and not a single thing can be done as &quot;their decision is final and cannot be reversed.&quot;",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "lifeenjoyer",
    "url": "https://news.ycombinator.com/user?id=lifeenjoyer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32121568",
  "sameAs": "https://news.ycombinator.com/item?id=32121568",
  "dateCreated": "2022-07-16T20:46:50.971Z",
  "datePublished": "2022-07-16T20:18:51.000Z",
  "dateModified": "2022-07-16T20:46:50.971Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "脸书被黑，FB和IG上的账户现在被禁了\n",
  "headline_zh-Hant": "臉書被黑，FB和IG上的賬戶現在被禁了\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这是个令人沮丧的一周! 在facebook上被黑客攻击后被禁言了。我有一个页面，在我们的IG账户上有超过2万名追随者，在我们的FB页面上有接近2万个赞，所有与我个人账户相连的IG账户都被禁用。不仅如此，我还被禁止做广告，黑客使用了4000-5000美元左右的广告，这些广告是从与之相连的贝宝账户中漏出的。我想与贝宝和银行提出争议，但没有人看到到底是什么&quot;广告&quot;与支出费用，因为我不能登录。荒谬的是。在过去十年左右的时间里，我们已经花费了超过6位数的广告费，而业务页面被禁用，使我们的在线存在受到影响（更不用说，从我自己的个人账户丢失照片和连接，我从2006-2007年就一直在使用）。 这也是我们的家族企业，是我们的生计。<p>如果你认识Meta/Facebook/Instagram的任何人，能够有一些同情心和帮助之心（或者如果你认识可以转发此文的人），请与我联系，roger@petzonesd.com。\n我感受到大家的痛苦和挫折。帐户因违反社区标准而被黑客禁用，没有任何事情可以做，因为他们的决定是最终的，不能被推翻。\n",
  "description_zh-Hant": "這是個令人沮喪的一週! 在facebook上被黑客攻擊後被禁言了。我有一個頁面，在我們的IG賬戶上有超過2萬名追隨者，在我們的FB頁面上有接近2萬個贊，所有與我個人賬戶相連的IG賬戶都被禁用。不僅如此，我還被禁止做廣告，黑客使用了4000-5000美元左右的廣告，這些廣告是從與之相連的貝寶賬戶中漏出的。我想與貝寶和銀行提出爭議，但沒有人看到到底是什麼&quot;廣告&quot;與支出費用，因為我不能登錄。荒謬的是。在過去十年左右的時間裡，我們已經花費了超過6位數的廣告費，而業務頁面被禁用，使我們的在線存在受到影響（更不用說，從我自己的個人賬戶丟失照片和連接，我從2006-2007年就一直在使用）。 這也是我們的家族企業，是我們的生計。<p>如果你認識Meta/Facebook/Instagram的任何人，能夠有一些同情心和幫助之心（或者如果你認識可以轉發此文的人），請與我聯繫，roger@petzonesd.com。\n我感受到大家的痛苦和挫折。帳戶因違反社區標準而被黑客禁用，沒有任何事情可以做，因為他們的決定是最終的，不能被推翻。\n"
}