{
  "@type": "NewsArticle",
  "identifier": "2022--07--27--en--myfeed--HackerNews--NewsArticle--32256651",
  "url": "https://news.ycombinator.com/item?id=32256651",
  "headline": "Co-founder of Bubble on the benefits of being broke",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I interviewed Emmanuel Straschnov, the co-founder of the nocode platform [Bubble](https://bubble.io/) a while back. At the time, they were pulling in about $150k/mo.<p>TL;DR: Entrepreneurship is not glamorous, but it's worth it. And being broke can actually light a fire under you.<p>&quot;If you become an entrepreneur after having had the comfort of a nice salary, it is costly. Personally costly, in terms of comfort. I survived on a combination of savings and a cheap lifestyle — I managed to live on less than $28,000 a year. My first room was less than 8 square meters. I had roommates. You don't want to do that for ten years, but for a year? I actually enjoyed it. And I wanted a little discomfort in my life to make me work harder. The biggest challenge was social. Most of my friends from business school had highly-paid jobs so the fun that they wanted to have was not at the same price point as the fun I wanted to have. Like, I didn't know when I'd get paid again, I couldn't put 80 dollars into dinner. So the people I hung out with changed, but a few very good friends would regularly just pay for me and say, 'You'll buy me dinner when you're rich.' I'm very grateful for that. Three years in, we still weren't making real salaries, we had no vertical traction, we were working a lot, and I was getting too old for the college lifestyle. It was a little tough. I started looking at the opportunity costs and it got to a point where I was like, 'Is this really what I should be doing with my life during my most productive years?' People around me were doing great things and I felt the clock ticking. It actually made me work a little bit harder and scale more aggressively. Soon, the business was making enough money for us to take a decent salary. It wasn't the kind of life I would have had in the corporate world, but it actually felt cooler.&quot;",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jamesofthedrum",
    "url": "https://news.ycombinator.com/user?id=jamesofthedrum"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32256651",
  "sameAs": "https://news.ycombinator.com/item?id=32256651",
  "dateCreated": "2022-07-27T20:58:01.697Z",
  "datePublished": "2022-07-27T20:43:18.000Z",
  "dateModified": "2022-07-27T20:58:01.697Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "泡沫公司联合创始人谈破产的好处\n",
  "headline_zh-Hant": "泡沫公司聯合創始人談破產的好處\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "前段时间，我采访了nocode平台[Bubble]（https://bubble.io/）的联合创始人Emmanuel Straschnov。当时，他们的收入约为15万美元/月。<p>TL;DR: 创业并不迷人，但它是值得的。<p>&quot;如果你在享受了丰厚的薪水后成为一名企业家，那代价是很高的。就个人而言，就舒适度而言，成本很高。我是靠储蓄和廉价的生活方式生存的--我每年的生活费不到28,000美元。我的第一个房间还不到8平方米。我有室友。你不想十年都这样做，但一年呢？我实际上很喜欢这样。我希望我的生活中有一点不舒服，使我更努力工作。最大的挑战是社交。我在商学院的大多数朋友都有高薪的工作，所以他们想要的乐趣和我想要的乐趣不在一个价位上。比如，我不知道我什么时候能再拿到工资，我不能把80美元放在晚餐上。所以和我一起玩的人都变了，但有几个非常好的朋友会定期为我付钱，说：\"等你有钱了，你会请我吃饭。我非常感谢这一点。三年来，我们仍然没有赚到真正的工资，我们没有垂直的牵引力，我们工作很多，而且我已经太老了，不适合大学的生活方式。这有点困难。我开始考虑机会成本，到了一个地步，我想，'这真的是我在我最有成就感的几年里应该做的事吗？我周围的人都在做伟大的事情，我感到时间在流逝。这实际上使我更努力地工作，更积极地扩展。很快，企业就赚到了足够的钱，让我们可以拿一份体面的薪水。这不是我在企业界的那种生活，但它实际上感觉更酷。\n",
  "description_zh-Hant": "前段時間，我採訪了nocode平臺[Bubble]（https://bubble.io/）的聯合創始人Emmanuel Straschnov。當時，他們的收入約為15萬美元/月。<p>TL;DR: 創業並不迷人，但它是值得的。<p>&quot;如果你在享受了豐厚的薪水後成為一名企業家，那代價是很高的。就個人而言，就舒適度而言，成本很高。我是靠儲蓄和廉價的生活方式生存的--我每年的生活費不到28,000美元。我的第一個房間還不到8平方米。我有室友。你不想十年都這樣做，但一年呢？我實際上很喜歡這樣。我希望我的生活中有一點不舒服，使我更努力工作。最大的挑戰是社交。我在商學院的大多數朋友都有高薪的工作，所以他們想要的樂趣和我想要的樂趣不在一個價位上。比如，我不知道我什麼時候能再拿到工資，我不能把80美元放在晚餐上。所以和我一起玩的人都變了，但有幾個非常好的朋友會定期為我付錢，說：\"等你有錢了，你會請我吃飯。我非常感謝這一點。三年來，我們仍然沒有賺到真正的工資，我們沒有垂直的牽引力，我們工作很多，而且我已經太老了，不適合大學的生活方式。這有點困難。我開始考慮機會成本，到了一個地步，我想，'這真的是我在我最有成就感的幾年裡應該做的事嗎？我周圍的人都在做偉大的事情，我感到時間在流逝。這實際上使我更努力地工作，更積極地擴展。很快，企業就賺到了足夠的錢，讓我們可以拿一份體面的薪水。這不是我在企業界的那種生活，但它實際上感覺更酷。\n"
}