{
  "@type": "NewsArticle",
  "identifier": "2022--06--29--en--myfeed--HackerNews--NewsArticle--31921313",
  "url": "https://news.ycombinator.com/item?id=31921313",
  "headline": "Show HN: Infracost (YC W21): Cloud Costs for Terraform in VSCode",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey, Hugo from Infracost (https://www.infracost.io) here. Infracost shows engineers the cost of each Terraform change in CI/CD before launching resources. When something changes, it posts a comment with the cloud cost impact. e.g. you’ve added two instances and volumes and have changed an instance type from medium to large; this will increase your bill by 25% next month from $1000 to $1250 per month.<p>Over the last few months, I've been working on a native evaluation for Terraform. Previously we relied on the Terraform CLI to fetch cloud resource information, which was a little slow and cumbersome.<p>Native parsing is not only lightning-fast, but it means we have contextual file information, which allows us to try a load of cool new things. For example, we could provide real-time suggestions to optimise your cloud costs as you write your infrastructure code! This VSCode extension is the result of a few weeks of hacking away whilst I should have been relaxing in the sun in Italy... time better spent, I think!<p>We're excited about the possibilities of directly integrating with editors. There is so much we can do to make DevOps lives easier when optimising cloud spend. Right now, we're looking for your feedback on this initial version of the extension. It currently ships with:<p>1. Show a snapshot of the total cost of resources right above their Terraform definitions. Updated on file save.<p>2. Resource and module blocks support showing cost estimates, including 3rd party module blocks.<p>3. A cost overview web-view shows a detailed breakdown of what components affect the price.<p>Please note this is an early release of the VSCode extension, so there will likely be bugs. If you get stuck, please raise an issue (https://github.com/infracost/vscode-infracost/issues), and we'll help you out asap.<p>We’d love to get your feedback on this extension, mainly what you think it’s missing and would help your workflow. Head over to the GitHub repo (https://github.com/infracost/vscode-infracost) for more information and installation instructions.",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "hugorut",
    "url": "https://news.ycombinator.com/user?id=hugorut"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31921313",
  "sameAs": "https://news.ycombinator.com/item?id=31921313",
  "dateCreated": "2022-06-29T16:00:35.860Z",
  "datePublished": "2022-06-29T15:12:24.000Z",
  "dateModified": "2022-06-29T16:00:35.860Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 15
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: Infracost（YC W21）。VSCode中Terraform的云成本\n",
  "headline_zh-Hant": "Show HN: Infracost（YC W21）。VSCode中Terraform的雲成本\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，我是来自Infracost（https://www.infracost.io）的Hugo。在启动资源之前，Infracost向工程师显示CI/CD中每个Terraform变化的成本。例如，你增加了两个实例和卷，并将一个实例类型从中型改为大型；这将使你下个月的账单增加25%，从每月1000美元增加到1250美元。以前我们依靠Terraform CLI来获取云资源信息，这有点慢，而且很麻烦。<p>原生解析不仅快如闪电，而且意味着我们有上下文文件信息，这让我们可以尝试很多很酷的新东西。例如，我们可以在你编写基础设施代码时提供实时建议，以优化你的云计算成本。这个VSCode扩展是几个星期的黑客行动的结果，而我本应该在意大利的阳光下放松......我想，时间花得更好！<p>我们对直接与编辑器整合的可能性感到兴奋。在优化云计算支出时，我们可以做很多事情来使 DevOps 的生活更轻松。现在，我们正在寻找您对这个初始版本的扩展的反馈。它目前有：<p>1. 在Terraform定义的正上方显示资源的总成本快照。<p>2.资源和模块块支持显示成本估算，包括第三方模块块。<p>3.成本概述网络视图显示了影响价格的组件的详细分类。<p>请注意这是VSCode扩展的早期版本，所以可能会有一些错误。如果你遇到问题，请提出问题（https://github.com/infracost/vscode-infracost/issues），我们会尽快帮助你解决。<p>我们希望得到你对这个扩展的反馈，主要是你认为它缺少什么，对你的工作流程有帮助。请到GitHub repo（https://github.com/infracost/vscode-infracost）了解更多信息和安装说明。\n",
  "description_zh-Hant": "嘿，我是來自Infracost（https://www.infracost.io）的Hugo。在啟動資源之前，Infracost向工程師顯示CI/CD中每個Terraform變化的成本。例如，你增加了兩個實例和卷，並將一個實例類型從中型改為大型；這將使你下個月的賬單增加25%，從每月1000美元增加到1250美元。以前我們依靠Terraform CLI來獲取雲資源信息，這有點慢，而且很麻煩。<p>原生解析不僅快如閃電，而且意味著我們有上下文文件信息，這讓我們可以嘗試很多很酷的新東西。例如，我們可以在你編寫基礎設施代碼時提供實時建議，以優化你的雲計算成本。這個VSCode擴展是幾個星期的黑客行動的結果，而我本應該在意大利的陽光下放鬆......我想，時間花得更好！<p>我們對直接與編輯器整合的可能性感到興奮。在優化雲計算支出時，我們可以做很多事情來使 DevOps 的生活更輕鬆。現在，我們正在尋找您對這個初始版本的擴展的反饋。它目前有：<p>1. 在Terraform定義的正上方顯示資源的總成本快照。<p>2.資源和模塊塊支持顯示成本估算，包括第三方模塊塊。<p>3.成本概述網絡視圖顯示了影響價格的組件的詳細分類。<p>請注意這是VSCode擴展的早期版本，所以可能會有一些錯誤。如果你遇到問題，請提出問題（https://github.com/infracost/vscode-infracost/issues），我們會盡快幫助你解決。<p>我們希望得到你對這個擴展的反饋，主要是你認為它缺少什麼，對你的工作流程有幫助。請到GitHub repo（https://github.com/infracost/vscode-infracost）瞭解更多信息和安裝說明。\n"
}