{
  "@type": "NewsArticle",
  "identifier": "2022--07--28--en--myfeed--HackerNews--NewsArticle--32261464",
  "url": "https://news.ycombinator.com/item?id=32261464",
  "headline": "My Criteria for Picking Startup Ideas",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "After having failed with more than seven startups and finally achieved some success with my latest one Proxies API, here are a bunch of criteria I follow when picking a startup idea to bootstrap from the website<p>1. I am a bootstrapper, so I am interested in making recurring revenue and build an asset. So it has to be a SAAS idea. No consumer internet.<p>2. It has to have a competition. Again, I want to make money, not be a pioneer.<p>3. It need not be a multi-million dollar potential startup. I prefer it if it’s possible never exceeds a million dollars at its peak. It is because I don’t want to offer a platform, but a small subset of features that people find useful and the big guys find too small a market niche to address.<p>4. I prefer it if it does not need any design skills. With Proxies API, it is all about technology and how it works. I am in my element when I can run with just code and not have to pause for ‘prettifying stuff.’<p>5. I want a self-serve model. It is because I want to acquire customers by marketing rather than by sales. I have nothing against sales. I prefer this as I like to code, and I am a bit shy and introverted. I can write, in any case.<p>6. I want a field where I can write a lot about it. Just by looking at the area, I should be able to imagine what my first ten blog posts will be. If I can’t write, I can’t market. So I would slightly not touch it as I am not good at the rest of them.<p>7. The product should not be commoditized. It’s happening in almost any market after about five years. Social media tools are an example. They were selling at $100 pm a few years back now people are offering it free.<p>8. The technology should provide a moat against every amateur trying to start a company. That’s why there are a million to-do list apps. That’s practically the first thing they teach in any course.<p>9. I want to identify the primary keyword that drives traffic and search for that keyword on Google Trends. Google Trends should show the keyword gaining in popularity ideally, or at least it should be a flat line for the last five years. I will stay away from anything that is on its way out.\n10. I want the users to get the AHA moment in one line or one image and not in multiple steps or after they “add 18 friends and two monkeys” rubbish. Just one look and the value prop is right there. With Proxies API, it was always this image and line. In essence, it immediately drove home this visceral power of using a single API call to solve an entire gamut of problem-related to scaling web crawling.\nThe author is the founder of Proxies API the rotating proxies service.\nThis article originally appeared here: https://www.proxiesapi.com/blog/My-Criteria-For-Picking-Startup-Ideas.php",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "prasenjit_pro",
    "url": "https://news.ycombinator.com/user?id=prasenjit_pro"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32261464",
  "sameAs": "https://news.ycombinator.com/item?id=32261464",
  "dateCreated": "2022-07-28T07:56:23.667Z",
  "datePublished": "2022-07-28T07:35:23.000Z",
  "dateModified": "2022-07-28T07:56:23.667Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "我挑选初创企业想法的标准\n",
  "headline_zh-Hant": "我挑選初創企業想法的標準\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在经历了七家以上的创业公司的失败，并最终在我最新的一家代理API上取得了一些成功之后，以下是我在挑选创业想法时遵循的一堆标准，以便从网站上进行引导<p>1. 我是一个引导者，所以我对赚取经常性收入和建立一个资产感兴趣。所以它必须是一个SAAS的想法。<p>2.它必须有一个竞争。同样，我想赚钱，而不是做先锋。<p>3.它不需要是一个具有数百万美元潜力的创业公司。如果有可能的话，我更希望它在高峰期永远不超过一百万美元。这是因为我不想提供一个平台，而是提供人们认为有用的一小部分功能，而大伙儿觉得这个市场利基太小，无法解决。<p>4.如果它不需要任何设计技巧，我更喜欢它。对于Proxies API来说，所有的事情都是关于技术和它如何工作的。当我可以只用代码运行，而不必为 \"美化的东西 \"而暂停时，我就有了自己的想法。我想要一个自我服务的模式。这是因为我想通过营销而不是销售来获得客户。我并不反对销售。我更喜欢这样，因为我喜欢编码，而我有点害羞和内向。无论如何，我都能写。<p>6.我想要一个我可以写很多东西的领域。只要看看这个领域，我就应该能想象出我的前十篇博文会是什么。如果我不能写，我就不能营销。所以我稍微不碰它，因为我不擅长其他方面。<p>7.产品不应该被商品化。几乎任何市场在五年后都会发生这种情况。社会媒体工具就是一个例子。几年前，它们的售价为100美元，现在人们开始免费提供。<p>8.技术应该提供一条护城河，抵御所有试图创办公司的业余人员。这就是为什么有一百万个待办事项列表应用程序。这实际上是他们在任何课程中教授的第一件事。<p>9. 我想确定驱动流量的主要关键词，并在谷歌趋势上搜索该关键词。谷歌趋势应该显示该关键词的受欢迎程度在增加，或者至少在过去五年里应该是一条平线。我将远离任何即将被淘汰的东西。\n10. 我希望用户能在一行或一张图片中获得AHA时刻，而不是在多个步骤或在他们 \"添加18个朋友和两只猴子 \"的垃圾之后。只要看一眼，价值就在那里。有了Proxies API，它始终是这个图像和线条。从本质上讲，它立即将这种使用单一API调用来解决与扩展网络抓取有关的整个问题的内涵力量带回家。\n作者是旋转代理服务Proxies API的创始人。\n这篇文章最初出现在这里：https://www.proxiesapi.com/blog/My-Criteria-For-Picking-Startup-Ideas.php\n",
  "description_zh-Hant": "在經歷了七家以上的創業公司的失敗，並最終在我最新的一家代理API上取得了一些成功之後，以下是我在挑選創業想法時遵循的一堆標準，以便從網站上進行引導<p>1. 我是一個引導者，所以我對賺取經常性收入和建立一個資產感興趣。所以它必須是一個SAAS的想法。<p>2.它必須有一個競爭。同樣，我想賺錢，而不是做先鋒。<p>3.它不需要是一個具有數百萬美元潛力的創業公司。如果有可能的話，我更希望它在高峰期永遠不超過一百萬美元。這是因為我不想提供一個平臺，而是提供人們認為有用的一小部分功能，而大夥兒覺得這個市場利基太小，無法解決。<p>4.如果它不需要任何設計技巧，我更喜歡它。對於Proxies API來說，所有的事情都是關於技術和它如何工作的。當我可以只用代碼運行，而不必為 \"美化的東西 \"而暫停時，我就有了自己的想法。我想要一個自我服務的模式。這是因為我想通過營銷而不是銷售來獲得客戶。我並不反對銷售。我更喜歡這樣，因為我喜歡編碼，而我有點害羞和內向。無論如何，我都能寫。<p>6.我想要一個我可以寫很多東西的領域。只要看看這個領域，我就應該能想象出我的前十篇博文會是什麼。如果我不能寫，我就不能營銷。所以我稍微不碰它，因為我不擅長其他方面。<p>7.產品不應該被商品化。幾乎任何市場在五年後都會發生這種情況。社會媒體工具就是一個例子。幾年前，它們的售價為100美元，現在人們開始免費提供。<p>8.技術應該提供一條護城河，抵禦所有試圖創辦公司的業餘人員。這就是為什麼有一百萬個待辦事項列表應用程序。這實際上是他們在任何課程中教授的第一件事。<p>9. 我想確定驅動流量的主要關鍵詞，並在谷歌趨勢上搜索該關鍵詞。谷歌趨勢應該顯示該關鍵詞的受歡迎程度在增加，或者至少在過去五年裡應該是一條平線。我將遠離任何即將被淘汰的東西。\n10. 我希望用戶能在一行或一張圖片中獲得AHA時刻，而不是在多個步驟或在他們 \"添加18個朋友和兩隻猴子 \"的垃圾之後。只要看一眼，價值就在那裡。有了Proxies API，它始終是這個圖像和線條。從本質上講，它立即將這種使用單一API調用來解決與擴展網絡抓取有關的整個問題的內涵力量帶回家。\n作者是旋轉代理服務Proxies API的創始人。\n這篇文章最初出現在這裡：https://www.proxiesapi.com/blog/My-Criteria-For-Picking-Startup-Ideas.php\n"
}