{
  "@type": "NewsArticle",
  "identifier": "2022--08--05--en--myfeed--HackerNews--NewsArticle--32353824",
  "url": "https://news.ycombinator.com/item?id=32353824",
  "headline": "What are the best books or resources on SRE automation that are also practical?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I’m bought in on the need for automation in SRE, now how do I do it? An SRE team I’m on is making a big push to automate, and I want to make sure we do this right. I also don’t need theoretical SRE books right now, I need some books or resources with case studies of things automated and ideally some code to boot. I’m looking mostly for the “HOW”, but I’m also interested in books to help think about “WHO/WHAT/WHERE/WHEN.” I’m _not_ interested in books that delve deeply into the WHY for either SRE or automation. I’m looking for resources practical applications, ideally with  pitfalls to avoid, on how to build a world class DevOps organization and automate the right things on my team. I’m thinking API construction, design patterns to Use/Avoid, fully autonomous systems vs self-service tooling, and SLI construction and measurements. Sorry, this is a lot, but I might be helping to lead this team so I have a lot of questions on the implementation of this (not to mention how to steer office politics) and I’m feeling a bit out of my depth. Any advice on good resources to pursue is most appreciated!!!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "abbadadda",
    "url": "https://news.ycombinator.com/user?id=abbadadda"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32353824",
  "sameAs": "https://news.ycombinator.com/item?id=32353824",
  "dateCreated": "2022-08-05T10:29:47.001Z",
  "datePublished": "2022-08-05T09:50:16.000Z",
  "dateModified": "2022-08-05T10:29:47.001Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "有哪些关于SRE自动化的最好的书籍或资源，也是实用的？\n",
  "headline_zh-Hant": "有哪些關於SRE自動化的最好的書籍或資源，也是實用的？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在SRE中，我已经相信了自动化的必要性，现在我该如何做？我所在的SRE团队正在大力推动自动化，我想确保我们做得对。我现在也不需要理论性的SRE书籍，我需要一些有自动化案例研究的书籍或资源，最好是一些代码。我主要在寻找 \"如何\"，但我也对帮助思考 \"谁/什么/哪里/何时 \"的书籍感兴趣。我对那些深入研究SRE或自动化的原因的书不感兴趣。我正在寻找资源的实际应用，最好是有陷阱可避免的，关于如何建立一个世界级的DevOps组织和在我的团队中实现正确的自动化。我在想API的构建，使用/避免的设计模式，完全自主的系统与自助服务工具，以及SLI的构建和测量。对不起，这太多了，但我可能会帮助领导这个团队，所以我有很多关于实施的问题（更不用说如何引导办公室政治了），我感觉有点力不从心。如果有什么好的资源建议，我们将不胜感激！!\n",
  "description_zh-Hant": "在SRE中，我已經相信了自動化的必要性，現在我該如何做？我所在的SRE團隊正在大力推動自動化，我想確保我們做得對。我現在也不需要理論性的SRE書籍，我需要一些有自動化案例研究的書籍或資源，最好是一些代碼。我主要在尋找 \"如何\"，但我也對幫助思考 \"誰/什麼/哪裡/何時 \"的書籍感興趣。我對那些深入研究SRE或自動化的原因的書不感興趣。我正在尋找資源的實際應用，最好是有陷阱可避免的，關於如何建立一個世界級的DevOps組織和在我的團隊中實現正確的自動化。我在想API的構建，使用/避免的設計模式，完全自主的系統與自助服務工具，以及SLI的構建和測量。對不起，這太多了，但我可能會幫助領導這個團隊，所以我有很多關於實施的問題（更不用說如何引導辦公室政治了），我感覺有點力不從心。如果有什麼好的資源建議，我們將不勝感激！!\n"
}