{
  "@type": "NewsArticle",
  "identifier": "2022--06--30--en--myfeed--HackerNews--NewsArticle--31928266",
  "url": "https://news.ycombinator.com/item?id=31928266",
  "headline": "Tell HN: Worst AWS service and support team experience",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Its been about 10 hours now that our core business operations is down because AWS security system decided that our account has unauthorized service usage and place a restriction on some part of services we can have access to.<p>One of them is obviously AWS Lambda. Two weeks ago we started processing large volume of transactions (We provide wallet and digital assets infrastructure for businesses) and needed to increase our services performance from request time out to memory to even our RDS instance to be able to accommodate the kind of requests we are currently processing.<p>However yesterday (29th of July) at around 5:04PM we got an email from AWS about unautorized service charges due to some unauthorized activity and could be a potential account hack or compromise.<p>My heart first sank because I was just waking up from a nap after reviewing the new lambda functions the teams worked on and planning to promote to production and staging server.<p>The second is this is a very high risk security issues and could be a potential hack. We primarily use MPC base vault to securely store and process transactions. Regardless, this is a very a big issue and had to respond by first of all changing the root passwords, deactivating all API keys, disabling console login access for all other users and removing any type of old keys.<p>After doing this will at least help secure our account for the main time. But then I was curious as well since the suspected activity is because of the unauthorized service charge, decided to go check all services from each region and end up checking our AWS Bill and carefully looking at the bill.<p>At the end it's a bill the team expected following our new changes from increasing our lambda function memory to time out and upgrading our RDS instance, the bill basically makes sense. AWS must have mistakenly detected this as unauthorized charge.<p>However the issue here is it's been 10 hours, and we have literally lost access to AWS Lambda functions the moment they notified us of this issues and one of our core business solutions is down because AWS shut it down.<p>The customer support experience from the AWS support team is the worst I have seen in my entire life. This is outrageous and never wished anyone to experience this. For over 10 hours, our customers (businesses such as payment gateway and exchanges) can't run some business operations because the lambda service (which cant be easily migrated to another alternative service) is down.<p>Their team keep saying they are waiting for their internal team response for over hours and no good response yet. They didn't provide a valid reason nor why this is taking too much time to fix. Its like they are lack of empathy and just robots behind the keyboards.<p>The AWS Support team are very heartless with no sense of urgency and this is not the first time such encounter is happening.<p>This has taught us a lesson not to build our product to be tightly locked with a cloud provider as migrating would be like starting from scratch and be more complicated.<p>If you work in AWS, the technical support team or customer support team and you would like to help us get past this. Please you can reach out here: hi[[at]]powr[[dot]]finance.<p>Thanks.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "citguru",
    "url": "https://news.ycombinator.com/user?id=citguru"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31928266",
  "sameAs": "https://news.ycombinator.com/item?id=31928266",
  "dateCreated": "2022-06-30T03:53:17.350Z",
  "datePublished": "2022-06-30T02:47:49.000Z",
  "dateModified": "2022-06-30T03:53:17.350Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "告诉HN：最糟糕的AWS服务和支持团队经历\n",
  "headline_zh-Hant": "告訴HN：最糟糕的AWS服務和支持團隊經歷\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们的核心业务运营已经有10个小时了，因为AWS安全系统认为我们的账户有未经授权的服务使用，并对我们可以访问的部分服务设置了限制。两周前，我们开始处理大量的交易（我们为企业提供钱包和数字资产基础设施），并需要提高我们的服务性能，从请求超时到内存，甚至是我们的RDS实例，以便能够适应我们目前处理的那种请求。 <p>然而，昨天（7月29日）下午5:04左右，我们收到了一封来自AWS的电子邮件，内容是由于一些未经授权的活动而导致的未授权服务费用，并且可能是潜在的账户黑客或妥协。<p>我的心首先沉了下来，因为我在回顾了团队工作的新lambda功能并计划推广到生产和暂存服务器后，刚刚从午睡中醒来。我们主要使用MPC基础金库来安全地存储和处理交易。不管怎么说，这是一个非常大的问题，不得不作出反应，首先改变根密码，停用所有API密钥，禁止所有其他用户的控制台登录访问，并删除任何类型的旧密钥。<p>这样做后，至少可以在主要时间内帮助保护我们的账户。但后来我也很好奇，因为疑似活动是因为未经授权的服务费，决定去检查每个地区的所有服务，最后检查了我们的AWS账单，仔细看了看账单。<p>最后，这是一个团队预期的账单，在我们的新变化之后，从增加我们的lambda函数内存到超时和升级我们的RDS实例，账单基本上是合理的。<p>然而，这里的问题是已经过了10个小时，从他们通知我们这个问题的那一刻起，我们实际上已经失去了对AWS Lambda功能的访问，我们的一个核心业务解决方案因为AWS的关闭而瘫痪了。<p>来自AWS支持团队的客户支持经验是我一生中见过的最糟糕的。这真是太离谱了，绝不希望任何人有这样的经历。在超过10个小时的时间里，我们的客户（支付网关和交易所等业务）无法运行一些业务操作，因为lambda服务（不能轻易迁移到其他替代服务）已经停机。<p>他们的团队一直说他们在等待内部团队的回应，已经超过几个小时了，还没有好的回应。他们没有提供一个有效的理由，也没有说明为什么要花这么多时间来解决这个问题。<p>AWS支持团队非常无情，没有紧迫感，这已经不是第一次发生这样的情况了。<p>这给我们上了一课，不要把我们的产品紧紧锁定在一个云供应商上，因为迁移就像从头开始，而且更复杂。<p>如果你在AWS工作，技术支持团队或客户支持团队，你想帮助我们度过难关。请你在这里联系：hi[[at]]powr[[dot]]finance。<p>谢谢。\n",
  "description_zh-Hant": "我們的核心業務運營已經有10個小時了，因為AWS安全系統認為我們的賬戶有未經授權的服務使用，並對我們可以訪問的部分服務設置了限制。兩週前，我們開始處理大量的交易（我們為企業提供錢包和數字資產基礎設施），並需要提高我們的服務性能，從請求超時到內存，甚至是我們的RDS實例，以便能夠適應我們目前處理的那種請求。 <p>然而，昨天（7月29日）下午5:04左右，我們收到了一封來自AWS的電子郵件，內容是由於一些未經授權的活動而導致的未授權服務費用，並且可能是潛在的賬戶黑客或妥協。<p>我的心首先沉了下來，因為我在回顧了團隊工作的新lambda功能並計劃推廣到生產和暫存服務器後，剛剛從午睡中醒來。我們主要使用MPC基礎金庫來安全地存儲和處理交易。不管怎麼說，這是一個非常大的問題，不得不作出反應，首先改變根密碼，停用所有API密鑰，禁止所有其他用戶的控制檯登錄訪問，並刪除任何類型的舊密鑰。<p>這樣做後，至少可以在主要時間內幫助保護我們的賬戶。但後來我也很好奇，因為疑似活動是因為未經授權的服務費，決定去檢查每個地區的所有服務，最後檢查了我們的AWS賬單，仔細看了看賬單。<p>最後，這是一個團隊預期的賬單，在我們的新變化之後，從增加我們的lambda函數內存到超時和升級我們的RDS實例，賬單基本上是合理的。<p>然而，這裡的問題是已經過了10個小時，從他們通知我們這個問題的那一刻起，我們實際上已經失去了對AWS Lambda功能的訪問，我們的一個核心業務解決方案因為AWS的關閉而癱瘓了。<p>來自AWS支持團隊的客戶支持經驗是我一生中見過的最糟糕的。這真是太離譜了，絕不希望任何人有這樣的經歷。在超過10個小時的時間裡，我們的客戶（支付網關和交易所等業務）無法運行一些業務操作，因為lambda服務（不能輕易遷移到其他替代服務）已經停機。<p>他們的團隊一直說他們在等待內部團隊的回應，已經超過幾個小時了，還沒有好的回應。他們沒有提供一個有效的理由，也沒有說明為什麼要花這麼多時間來解決這個問題。<p>AWS支持團隊非常無情，沒有緊迫感，這已經不是第一次發生這樣的情況了。<p>這給我們上了一課，不要把我們的產品緊緊鎖定在一個雲供應商上，因為遷移就像從頭開始，而且更復雜。<p>如果你在AWS工作，技術支持團隊或客戶支持團隊，你想幫助我們度過難關。請你在這裡聯繫：hi[[at]]powr[[dot]]finance。<p>謝謝。\n"
}