{
  "@type": "NewsArticle",
  "identifier": "2022--07--30--en--myfeed--HackerNews--NewsArticle--32284353",
  "url": "https://news.ycombinator.com/item?id=32284353",
  "headline": "You need to fail fast (Startups create a ton of anxiety)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "A few years back I started a company with the hopes of automating most ETL/Datapipeline work. It was right around the time Hadoop was the latest buzzword and most of my consulting engagements included discussions or implementations around this. I thought data and data movement should be made as simple as possible. Many of my engagements were in the healthcare industry. The amount of time and money that was wasted doing simple things wrong, seemed like something that was contributing significantly to the fraud, waste and abuse everyone talks about in health care.<p>Most &quot;implementation partners&quot; really didn't care that the same mistakes were being made over and over again. I thought why not just utilize automation to make this easy. I built a prototype and landed customer 1 in year 1. Amazing! right?<p>What I failed to take into account was the life-stage I was currently in. I chose to get married and have kids at a very young age(20), and ultimately it resulted in a situation where the financial risk we were willing to take wasn't much without putting everything we had on the line. I've come to realize this is why starting a business is a young person's game.<p>When I first got started, I knew that this was not something I was going to be able to do on my own. So I found partners that would fill the skill gaps that I believed I had. This was a COMPLETE DISASTER. I was working consulting engagements during the day while working nights and all weekend trying to build a usable software product. I asked my partners at the time if they would be willing to try out something like Y-Combinator and applying, I thought it would help give us the connections and training we needed to really grow. Unfortunately, moving cross country for a period of time was something they couldn't do.<p>Ultimately, after a couple of years I had to throw in the towel with my partners, I was losing every last penny I had in savings and was staring at my oldest child going to college in the next 18 months. (I really didn't want to put his future at risk for a pipe dream of mine). \nAs part of our amicable split, we forked the software and I kept the first customer. Over the next couple of years I worked my butt off to create a practical data engineering (ELT) platform for them. Along the way, they had quite a few wins as an organization, I landed customer number 2 and learned that this type of product becomes a critical component of any organizations infrastructure( enter the anxiety attacks).<p>What I still didn't have was any sort of marketing, branding or sales channel. These pieces are probably more critical than an MVP in my opinion, Without them it's impossible to show what the market interest is.\nOne year out of the split, I had a product that customers 1 and 2 seemed to really like but had no one else to show it too.<p>At the same time, my oldest child was now entering college. I'm sure folks who are much smarter than me would say I should have planned better, but to be honest, trying to raise kids before you go to college and give them the best education you can is like sprinting a marathon.<p>The revenue from the first couple customers, plus the consulting was enough for my family to get by and turned out to be a great college fund. At the same time, there is a ton of pressure and anxiety to not to screw up. After all, I now have my kids future, and my customers day to day operations all reliant on the fact that a software product continues to deliver value.<p>I have also hit a wall, I'm burnt out,  no longer enjoy the consulting work(no more challenges), dread going back to being an FTE anywhere, and at the same time know it is in the best interest of my customers to try and figure out a way to scale a business (plan 1 never had me doing this part, I was going to be the tech guy).<p>I'll share more later on recent suggestions I have had from my customers who are beginning to realize their risk.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "anon_j1435",
    "url": "https://news.ycombinator.com/user?id=anon_j1435"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32284353",
  "sameAs": "https://news.ycombinator.com/item?id=32284353",
  "dateCreated": "2022-07-30T05:35:32.464Z",
  "datePublished": "2022-07-30T04:45:12.000Z",
  "dateModified": "2022-07-30T05:35:32.464Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "你需要快速失败（初创企业会产生大量的焦虑）。\n",
  "headline_zh-Hant": "你需要快速失敗（初創企業會產生大量的焦慮）。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几年前，我创办了一家公司，希望能将大部分ETL/数据管道工作自动化。那时候，Hadoop是最新的流行语，我的大部分咨询工作都包括围绕这个问题的讨论或实施。我认为数据和数据移动应该尽可能的简单。我的许多工作都是在医疗行业进行的。浪费了大量的时间和金钱来做一些简单的事情，这似乎是对每个人都在谈论的医疗保健中的欺诈、浪费和滥用的重大贡献。<p>大多数实施伙伴真的不在乎同样的错误被反复犯。我想为什么不利用自动化来使之变得简单。我建立了一个原型，并在第一年就获得了第一个客户。令人惊讶！对吗？<p>我没有考虑到的是我目前所处的生活阶段。我在很年轻的时候（20岁）就选择了结婚和生孩子，最终导致我们愿意承担的财务风险不大，而不需要把我们的一切都押上。我已经意识到这就是为什么创业是年轻人的游戏。<p>当我第一次开始的时候，我知道这不是我自己能够做到的事情。因此，我找到了合作伙伴，以填补我认为自己的技能差距。这是个大灾难。我白天从事咨询工作，晚上和整个周末都在工作，试图建立一个可用的软件产品。我问当时的合伙人，他们是否愿意尝试像Y-Combinator那样的东西，并提出申请，我认为这将有助于为我们提供真正成长所需的联系和培训。<p>最终，几年后，我不得不和我的伙伴们一起放弃了，我失去了我的最后一分钱的储蓄，并眼睁睁地看着我最大的孩子在未来18个月内去上大学。(我真的不想为了我的一个空想而把他的未来置于危险之中）。\n作为我们友好分手的一部分，我们将软件分叉，我保留了第一个客户。在接下来的几年里，我拼命工作，为他们创造一个实用的数据工程（ELT）平台。在这一过程中，他们作为一个组织取得了一些胜利，我找到了第二位客户，并了解到这种类型的产品成为任何组织基础设施的重要组成部分（进入焦虑攻击）。<p>我仍然没有任何形式的营销、品牌或销售渠道。在我看来，这些部分可能比MVP更关键，没有它们，就不可能显示出市场的兴趣所在。\n分开一年后，我有一个产品，客户1和2似乎非常喜欢，但没有其他人可以展示它。<p>与此同时，我最大的孩子现在正进入大学。我相信那些比我聪明得多的人都会说我应该计划得更好，但说实话，在你上大学之前就想把孩子养大，给他们最好的教育，就像冲刺马拉松一样。<p>来自前几个客户的收入，加上咨询，足以让我的家人过上好日子，而且变成了一笔很好的大学基金。同时，也有大量的压力和焦虑，不能把事情搞砸。毕竟，我现在有我孩子的未来，我的客户的日常运作都依赖于一个软件产品持续提供价值的事实。 <p>我也碰壁了，我已经精疲力尽，不再喜欢咨询工作（没有更多的挑战），害怕回到任何地方成为一个全职员工，同时也知道为了我的客户的最佳利益，要努力找出一种方法来扩大业务（计划1从来没有让我做这一部分，我将是一个技术人员）。\n",
  "description_zh-Hant": "幾年前，我創辦了一家公司，希望能將大部分ETL/數據管道工作自動化。那時候，Hadoop是最新的流行語，我的大部分諮詢工作都包括圍繞這個問題的討論或實施。我認為數據和數據移動應該儘可能的簡單。我的許多工作都是在醫療行業進行的。浪費了大量的時間和金錢來做一些簡單的事情，這似乎是對每個人都在談論的醫療保健中的欺詐、浪費和濫用的重大貢獻。<p>大多數實施夥伴真的不在乎同樣的錯誤被反覆犯。我想為什麼不利用自動化來使之變得簡單。我建立了一個原型，並在第一年就獲得了第一個客戶。令人驚訝！對嗎？<p>我沒有考慮到的是我目前所處的生活階段。我在很年輕的時候（20歲）就選擇了結婚和生孩子，最終導致我們願意承擔的財務風險不大，而不需要把我們的一切都押上。我已經意識到這就是為什麼創業是年輕人的遊戲。<p>當我第一次開始的時候，我知道這不是我自己能夠做到的事情。因此，我找到了合作伙伴，以填補我認為自己的技能差距。這是個大災難。我白天從事諮詢工作，晚上和整個週末都在工作，試圖建立一個可用的軟件產品。我問當時的合夥人，他們是否願意嘗試像Y-Combinator那樣的東西，並提出申請，我認為這將有助於為我們提供真正成長所需的聯繫和培訓。<p>最終，幾年後，我不得不和我的夥伴們一起放棄了，我失去了我的最後一分錢的儲蓄，並眼睜睜地看著我最大的孩子在未來18個月內去上大學。(我真的不想為了我的一個空想而把他的未來置於危險之中）。\n作為我們友好分手的一部分，我們將軟件分叉，我保留了第一個客戶。在接下來的幾年裡，我拼命工作，為他們創造一個實用的數據工程（ELT）平臺。在這一過程中，他們作為一個組織取得了一些勝利，我找到了第二位客戶，並瞭解到這種類型的產品成為任何組織基礎設施的重要組成部分（進入焦慮攻擊）。<p>我仍然沒有任何形式的營銷、品牌或銷售渠道。在我看來，這些部分可能比MVP更關鍵，沒有它們，就不可能顯示出市場的興趣所在。\n分開一年後，我有一個產品，客戶1和2似乎非常喜歡，但沒有其他人可以展示它。<p>與此同時，我最大的孩子現在正進入大學。我相信那些比我聰明得多的人都會說我應該計劃得更好，但說實話，在你上大學之前就想把孩子養大，給他們最好的教育，就像衝刺馬拉松一樣。<p>來自前幾個客戶的收入，加上諮詢，足以讓我的家人過上好日子，而且變成了一筆很好的大學基金。同時，也有大量的壓力和焦慮，不能把事情搞砸。畢竟，我現在有我孩子的未來，我的客戶的日常運作都依賴於一個軟件產品持續提供價值的事實。 <p>我也碰壁了，我已經精疲力盡，不再喜歡諮詢工作（沒有更多的挑戰），害怕回到任何地方成為一個全職員工，同時也知道為了我的客戶的最佳利益，要努力找出一種方法來擴大業務（計劃1從來沒有讓我做這一部分，我將是一個技術人員）。\n"
}