{
  "@type": "NewsArticle",
  "identifier": "2022--06--04--en--myfeed--HackerNews--NewsArticle--31623538",
  "url": "https://news.ycombinator.com/item?id=31623538",
  "headline": "I think I found a perfect project for myself",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm a developer, a good one and that is what I do the best. I have had several projects, but I've always had a chicken-egg problem (how to get customers when there are no suppliers and vice versa), how to generate content... On top of all of that, I need something that I like to work on regarding development...<p>A year ago I found that project but I dropped it because people told me: &quot;Don't do it, not worth it&quot;. I mean I did launch it but for my own country which is really small.<p>The project is about summarizing news articles, you know pulling out the most relevant information from Bible-sized articles, saving people's time, and solving clickbait problems. With that, I solved the supplier problem, I just need to scrape news sites and have a supply. Thus it makes it easier to drive customers.<p>Also from a development perspective, it is super fun, I can keep improving my original summarization algorithm. So I'm bringing that project back to life",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "superdario",
    "url": "https://news.ycombinator.com/user?id=superdario"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31623538",
  "sameAs": "https://news.ycombinator.com/item?id=31623538",
  "dateCreated": "2022-06-04T19:21:04.042Z",
  "datePublished": "2022-06-04T18:19:21.000Z",
  "dateModified": "2022-06-04T19:21:04.042Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "我想我为自己找到了一个完美的项目\n",
  "headline_zh-Hant": "我想我為自己找到了一個完美的項目\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个开发者，一个优秀的开发者，这也是我最擅长的事情。我有几个项目，但我一直有一个鸡肋的问题（当没有供应商时如何获得客户，反之亦然），如何产生内容...... 在所有这些之上，我需要一些我喜欢的关于发展的工作......<p>一年前我发现了那个项目，但我放弃了，因为人们告诉我：&quot;不要做，不值得&quot;。我的意思是，我确实启动了它，但只是为我自己的国家，这真的很小。<p>该项目是关于总结新闻文章，你知道从圣经大小的文章中提取最相关的信息，节省人们的时间，并解决点击率问题。有了这个，我解决了供应商的问题，我只需要搜刮新闻网站，就有了供应。因此，它使我更容易驱动客户。<p>另外从开发的角度来看，它超级有趣，我可以不断改进我的原始总结算法。因此，我把这个项目带回来了\n",
  "description_zh-Hant": "我是一個開發者，一個優秀的開發者，這也是我最擅長的事情。我有幾個項目，但我一直有一個雞肋的問題（當沒有供應商時如何獲得客戶，反之亦然），如何產生內容...... 在所有這些之上，我需要一些我喜歡的關於發展的工作......<p>一年前我發現了那個項目，但我放棄了，因為人們告訴我：&quot;不要做，不值得&quot;。我的意思是，我確實啟動了它，但只是為我自己的國家，這真的很小。<p>該項目是關於總結新聞文章，你知道從聖經大小的文章中提取最相關的信息，節省人們的時間，並解決點擊率問題。有了這個，我解決了供應商的問題，我只需要搜刮新聞網站，就有了供應。因此，它使我更容易驅動客戶。<p>另外從開發的角度來看，它超級有趣，我可以不斷改進我的原始總結算法。因此，我把這個項目帶回來了\n"
}