{
  "@type": "NewsArticle",
  "identifier": "2022--07--13--en--myfeed--HackerNews--NewsArticle--32082935",
  "url": "https://news.ycombinator.com/item?id=32082935",
  "headline": "Salary Re-Negotiation Strategy",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN.\nI'm a 49 yo in an emergent economy country. I've been working for 26\nyears in the same company, a ~200 emp. regional leader in it's core\nbusiness.<p>Since 2011 I've got a remuneration which is tied to the price of the\nbase main service the company provides, so my salary has been the same\nbut my income has increased as the price of this particular service\nvaried with the years. I've got no other benefits beyond the granted by\nworking law in this country (vacations, etc.). My salary is roughly\n10-12x the base salary of a non-professional employee, and 3x the median\nIT &amp; Telco salary in the country, although I live and work on a second\ntier city of ~1M people, so perhaps 3.5-4x the median here.<p>The company has grown and expanded it's businesses since I've entered\nat an early stage and I was instrumental in every aspect of\nthe company development (modulo finances) implementing most of the\nprocesses and operations that are running the company to this day; for\nexample, but not limited to: implementation of core technical\nprocedures, develop of administrative and CRM software, main mission\ncritical service software, security, communication networks deployment and integration (from analog RF to mesh network), fleet tracking and location (AVL) with driver\nregistration, maps and dispatch, several\nmobile apps for internal use (tech/support staff, sales team, etc.),\nmain app for customers, networking, communications and IT\ninstallations in several buildings, sysadmin, DB admin, a myriad of\nother tasks from key strategy and technology selection and deployment\nfor multi million dollar projects to problem resolution in every\ntechnical concern, while also providing support in a very demanding 24/7\nenvironment. Much of this was made by myself up to 2013, since then I've\nlead a small team of developers and technical staff. I'm generally\nresponsible for the whole operation running smoothly 24/7 (main business is 24/7 service).<p>I think I'm not being payed adequately for my work and the value I've\nmade for the company through the years.  I have a very good and friendly relation with one of the owners (nominally my boss), and I'm about to open a negotiation with him about\nthis.<p>I think the company will offer me some money (not more than 10% increase\nover my base salary) and some promise for the future tied to some\ndiffuse and subjective metric of their own, which I will reject as a\nmatter of course.<p>What do you think will be my best strategy from that point on? It's\npossible that my strongest point is that there are no one person that\ncan take over if I left, so they would need to get two to three\npeople. There are key security implications on this scenario too.<p>I need the work to support my family, and with my savings and my spouse\nincome I could live perhaps for one to two years educing\nour expenditure; there are some difficult decisions to be made in this\nregard too, like firing our domestic employee of 12 years, not going on\nvacations with the kids, no upgrading our cars or selling some property, etc.<p>I have a little side project but it's not enough money and I'm not sure if it can success.\nThanks a lot.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "alerolp",
    "url": "https://news.ycombinator.com/user?id=alerolp"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32082935",
  "sameAs": "https://news.ycombinator.com/item?id=32082935",
  "dateCreated": "2022-07-13T14:25:52.566Z",
  "datePublished": "2022-07-13T14:08:04.000Z",
  "dateModified": "2022-07-13T14:25:52.566Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "薪资再谈判策略\n",
  "headline_zh-Hant": "薪資再談判策略\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN。\n我是一个新兴经济国家的49岁的人。我已经在同一家公司工作了26年。\n我在同一家公司工作了26年，这家公司有大约200名员工，是其核心业务的区域领导者。\n<p>自2011年以来，我的薪酬与公司提供的基本主要服务的价格挂钩。\n自2011年以来，我的薪酬与公司提供的基本主要服务的价格挂钩，所以我的工资一直是一样的\n但我的收入却随着这一特定服务价格的变化而增加\n随着时间的推移而变化。除了这个国家的工作法规定的福利外，我没有其他福利。\n在这个国家，我没有其他的福利（假期等）。我的工资大约是\n10-12倍于非专业雇员的基本工资，3倍于美国IT和电信公司的中位数。\n虽然我生活和工作的地方是一个人口约100万的二线城市，但我的工资是全国IT和电信公司工资的3倍。\n<p>自从我进入公司以来，公司的业务不断增长和扩大。\n在早期阶段，我在公司发展的每个方面都发挥了作用（除财务外）。\n我在公司发展的各个方面都发挥了作用（除财务外），实施了大部分的\n我在公司发展的各个方面（除财务外）都发挥了作用，实施了大部分的流程和操作，使公司至今仍在运行；例如，但不限于：实施\n例如，但不限于：核心技术程序的实施\n例如，但不限于：实施核心技术程序，开发行政管理和客户关系管理软件，主要的关键服务软件，安全，通信网络。\n例如，不限于：实施核心技术程序，开发行政和CRM软件，主要的关键服务软件，安全，通信网络的部署和整合（从模拟射频到网状网络），车队跟踪和定位（AVL）与司机\n追踪和定位（AVL），包括司机登记、地图和调度、几个\n供内部使用的移动应用程序（技术/支持人员、销售团队等）。\n为客户提供的主要应用程序，网络、通信和IT系统。\n在几座大楼里安装系统管理员、数据库管理员，以及无数的其他任务。\n其他任务，从关键战略和技术选择和部署\n从数百万美元的项目的关键战略和技术选择和部署，到每一个技术问题的解决。\n同时还在一个非常苛刻的24/7环境中提供支持。\n的环境中提供支持。在2013年之前，大部分工作都是由我自己完成的。\n领导一个由开发人员和技术人员组成的小团队。我一般负责\n<p>我认为我的工作没有得到足够的报酬，我多年来为公司创造的价值也没有得到回报。\n我认为我的工作和我多年来为公司创造的价值没有得到足够的报酬。 我和其中一个老板（名义上是我的老板）关系非常好，而且很友好，我正准备和他就此事进行谈判。\n<p>我认为公司会给我一些钱（不超过基本工资的10%的增长）和一些承诺。\n我认为公司会给我一些钱（比我的基本工资增加不超过10%）和一些未来的承诺，这些承诺与一些\n我认为公司会给我一些钱（不超过基本工资的10%）和对未来的一些承诺，并与他们自己的一些模糊的主观指标挂钩，我当然会拒绝。\n<p>你认为从那时起，我的最佳策略是什么？有可能\n可能我最强的一点是，如果我离开，没有一个人\n如果我离开，没有一个人可以接管，所以他们需要找两到三个人\n人。这种情况也有关键的安全问题。<p>我需要工作来支持我的家庭，凭借我的储蓄和我的配偶\n我需要工作来支持我的家庭，凭借我的储蓄和我配偶的收入，我也许可以在教育方面生活一到两年。\n我们的开支；在这方面也有一些困难的决定要做。\n在这方面也有一些困难的决定，比如解雇我们的12年家政员工，不和孩子们一起去度假，不升级改造。\n<p>我有一个小的副业，但钱不够用，我不知道它是否能成功。\n非常感谢。\n",
  "description_zh-Hant": "嗨，HN。\n我是一個新興經濟國家的49歲的人。我已經在同一家公司工作了26年。\n我在同一家公司工作了26年，這家公司有大約200名員工，是其核心業務的區域領導者。\n<p>自2011年以來，我的薪酬與公司提供的基本主要服務的價格掛鉤。\n自2011年以來，我的薪酬與公司提供的基本主要服務的價格掛鉤，所以我的工資一直是一樣的\n但我的收入卻隨著這一特定服務價格的變化而增加\n隨著時間的推移而變化。除了這個國家的工作法規定的福利外，我沒有其他福利。\n在這個國家，我沒有其他的福利（假期等）。我的工資大約是\n10-12倍於非專業僱員的基本工資，3倍於美國IT和電信公司的中位數。\n雖然我生活和工作的地方是一個人口約100萬的二線城市，但我的工資是全國IT和電信公司工資的3倍。\n<p>自從我進入公司以來，公司的業務不斷增長和擴大。\n在早期階段，我在公司發展的每個方面都發揮了作用（除財務外）。\n我在公司發展的各個方面都發揮了作用（除財務外），實施了大部分的\n我在公司發展的各個方面（除財務外）都發揮了作用，實施了大部分的流程和操作，使公司至今仍在運行；例如，但不限於：實施\n例如，但不限於：核心技術程序的實施\n例如，但不限於：實施核心技術程序，開發行政管理和客戶關係管理軟件，主要的關鍵服務軟件，安全，通信網絡。\n例如，不限於：實施核心技術程序，開發行政和CRM軟件，主要的關鍵服務軟件，安全，通信網絡的部署和整合（從模擬射頻到網狀網絡），車隊跟蹤和定位（AVL）與司機\n追蹤和定位（AVL），包括司機登記、地圖和調度、幾個\n供內部使用的移動應用程序（技術/支持人員、銷售團隊等）。\n為客戶提供的主要應用程序，網絡、通信和IT系統。\n在幾座大樓裡安裝系統管理員、數據庫管理員，以及無數的其他任務。\n其他任務，從關鍵戰略和技術選擇和部署\n從數百萬美元的項目的關鍵戰略和技術選擇和部署，到每一個技術問題的解決。\n同時還在一個非常苛刻的24/7環境中提供支持。\n的環境中提供支持。在2013年之前，大部分工作都是由我自己完成的。\n領導一個由開發人員和技術人員組成的小團隊。我一般負責\n<p>我認為我的工作沒有得到足夠的報酬，我多年來為公司創造的價值也沒有得到回報。\n我認為我的工作和我多年來為公司創造的價值沒有得到足夠的報酬。 我和其中一個老闆（名義上是我的老闆）關係非常好，而且很友好，我正準備和他就此事進行談判。\n<p>我認為公司會給我一些錢（不超過基本工資的10%的增長）和一些承諾。\n我認為公司會給我一些錢（比我的基本工資增加不超過10%）和一些未來的承諾，這些承諾與一些\n我認為公司會給我一些錢（不超過基本工資的10%）和對未來的一些承諾，並與他們自己的一些模糊的主觀指標掛鉤，我當然會拒絕。\n<p>你認為從那時起，我的最佳策略是什麼？有可能\n可能我最強的一點是，如果我離開，沒有一個人\n如果我離開，沒有一個人可以接管，所以他們需要找兩到三個人\n人。這種情況也有關鍵的安全問題。<p>我需要工作來支持我的家庭，憑藉我的儲蓄和我的配偶\n我需要工作來支持我的家庭，憑藉我的儲蓄和我配偶的收入，我也許可以在教育方面生活一到兩年。\n我們的開支；在這方面也有一些困難的決定要做。\n在這方面也有一些困難的決定，比如解僱我們的12年家政員工，不和孩子們一起去度假，不升級改造。\n<p>我有一個小的副業，但錢不夠用，我不知道它是否能成功。\n非常感謝。\n"
}