{
  "@type": "NewsArticle",
  "identifier": "2022--06--19--en--myfeed--HackerNews--NewsArticle--31804519",
  "url": "https://news.ycombinator.com/item?id=31804519",
  "headline": "Bitcoin was doomed from the start, now 19M+ of its 21M max supply are mined",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Bitcoin aims to give people self sovereignty and financial freedom (who otherwise couldn't attain it). That's a noble goal, but the project has always had a fundamental problem:<p>Bitcoin only survives if enough miners continue to participate, who spend on electricity to keep the network's total hash rate high (enough to fend off a determined foe). Miners do this in exchange for new bitcoin. Though miners' profitability has recently been challenged by the latest downturn, the market can adjust and is not in immediate jeopardy of collapse. But it will be.<p>The total supply of bitcoin is 21M. Less than 2M remain to be mined in the project's lifetime.<p>Eventually the # of bitcoins produced per year will be too low to maintain miner incentives. [Every four years moving forward, half as many bitcoins will be produced. The so-called &quot;halvening&quot; has generally been seen by investors as a positive thing, b/c it implies continued scarcity, but they miss the forest for the trees.]<p>Transaction fees would need to increase to pick up the slack (of lower mining profits). Ever-higher transaction fees will kill the cryptocurrency's potential for mass appeal (which companies like Square(Block) have bet big on).<p>The only way that none of this is an issue is if bitcoin continues increasing in value inexorably. To be fair, I'd say that's Bitcoin's #1 use case so far has been: a speculative vehicle that consistently rises in value. That will inevitably come to an end, if for no other reason than there isn't enough money in the world to sustain its historic rate of climb. It's also dubious for something to be branded as digital gold if it requires more new money coming into the system to be viable, in that respect it's closer to a Ponzi scheme.<p>Another &quot;out&quot; is if all of the miners can agree to increase the project's total supply, something I imagine will be attempted. That will be a huge shit show though, as the brand of bitcoin revolves entirely around scarcity.<p>That's the project's basic flaw. I set aside bitcoin's less-existential problems: extreme energy demands, failure to act as an inflationary hedge, disproportionate use by ransomware gangs, potential vulnerability to quantum crypto-breaking computing, and existence in a space rife with scams (from USDT to UST and all the under-regulated web3 banks and securities-sellers in between, like Celsius).",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "projectsforlife",
    "url": "https://news.ycombinator.com/user?id=projectsforlife"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31804519",
  "sameAs": "https://news.ycombinator.com/item?id=31804519",
  "dateCreated": "2022-06-19T23:56:13.270Z",
  "datePublished": "2022-06-19T23:25:03.000Z",
  "dateModified": "2022-06-19T23:56:13.270Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "比特币从一开始就注定要失败，现在2,100万的最大供应量中，有1,900多万被开采出来了。\n",
  "headline_zh-Hant": "比特幣從一開始就註定要失敗，現在2,100萬的最大供應量中，有1,900多萬被開採出來了。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "比特币的目的是给人们提供自我主权和财务自由（否则他们无法实现）。这是一个崇高的目标，但该项目一直有一个基本问题：<p>只有当足够多的矿工继续参与时，比特币才能生存，他们花费电力来保持网络的总哈希率高（足以抵御一个坚定的敌人）。矿工们这样做是为了换取新的比特币。虽然矿工的盈利能力最近受到了最新的衰退的挑战，但市场可以调整，并没有立即陷入崩溃的危险。但它会的。<p>比特币的总供应量是21M。<p>最终，每年生产的比特币数量将太少，无法维持矿工的积极性。[今后每四年，将有一半的比特币被生产出来。所谓的 \"减半 \"通常被投资者视为积极的事情，因为它意味着持续的稀缺性，但他们错过了树木的森林。]<p>交易费用将需要增加以填补（较低的采矿利润）的空白。越来越高的交易费用将扼杀加密货币对大众的吸引力（像Square(Block)这样的公司在这方面下了很大的赌注）。<p>这些都不是问题的唯一方法是如果比特币继续不可阻挡地增值。公平地说，我想说的是，到目前为止，比特币的第一大使用情况是：一个持续升值的投机工具。这将不可避免地走到尽头，如果没有其他原因，世界上没有足够的钱来维持其历史性的攀升速度。如果一个东西需要更多的新钱进入系统才能生存，那么它被打上数字黄金的标签也是值得怀疑的，在这方面，它更接近于庞氏骗局。这将是一个巨大的狗屎秀，因为比特币的品牌完全围绕着稀缺性。<p>这就是项目的基本缺陷。我把比特币的一些不太重要的问题放在一边：极端的能源需求，不能作为通货膨胀的对冲，勒索软件团伙的过度使用，对量子加密计算的潜在脆弱性，以及存在于一个充斥着骗局的空间（从USDT到UST，以及中间所有监管不足的网络3银行和证券销售商，如Celsius）。\n",
  "description_zh-Hant": "比特幣的目的是給人們提供自我主權和財務自由（否則他們無法實現）。這是一個崇高的目標，但該項目一直有一個基本問題：<p>只有當足夠多的礦工繼續參與時，比特幣才能生存，他們花費電力來保持網絡的總哈希率高（足以抵禦一個堅定的敵人）。礦工們這樣做是為了換取新的比特幣。雖然礦工的盈利能力最近受到了最新的衰退的挑戰，但市場可以調整，並沒有立即陷入崩潰的危險。但它會的。<p>比特幣的總供應量是21M。<p>最終，每年生產的比特幣數量將太少，無法維持礦工的積極性。[今後每四年，將有一半的比特幣被生產出來。所謂的 \"減半 \"通常被投資者視為積極的事情，因為它意味著持續的稀缺性，但他們錯過了樹木的森林。]<p>交易費用將需要增加以填補（較低的採礦利潤）的空白。越來越高的交易費用將扼殺加密貨幣對大眾的吸引力（像Square(Block)這樣的公司在這方面下了很大的賭注）。<p>這些都不是問題的唯一方法是如果比特幣繼續不可阻擋地增值。公平地說，我想說的是，到目前為止，比特幣的第一大使用情況是：一個持續升值的投機工具。這將不可避免地走到盡頭，如果沒有其他原因，世界上沒有足夠的錢來維持其歷史性的攀升速度。如果一個東西需要更多的新錢進入系統才能生存，那麼它被打上數字黃金的標籤也是值得懷疑的，在這方面，它更接近於龐氏騙局。這將是一個巨大的狗屎秀，因為比特幣的品牌完全圍繞著稀缺性。<p>這就是項目的基本缺陷。我把比特幣的一些不太重要的問題放在一邊：極端的能源需求，不能作為通貨膨脹的對沖，勒索軟件團伙的過度使用，對量子加密計算的潛在脆弱性，以及存在於一個充斥著騙局的空間（從USDT到UST，以及中間所有監管不足的網絡3銀行和證券銷售商，如Celsius）。\n"
}