{
  "@type": "NewsArticle",
  "identifier": "2022--08--03--en--myfeed--HackerNews--NewsArticle--32333417",
  "url": "https://news.ycombinator.com/item?id=32333417",
  "headline": "Launch HN: Iollo (YC S22) – At-home metabolomics test to extend healthy lifespan",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi Hacker News! We’re Dan, Jan, and Brent from iollo (<a href=\"https://www.iollo.com/\" rel=\"nofollow\">https://www.iollo.com/</a>). We’re developing an at-home metabolomics test that measures hundreds of “metabolites” in blood, which studies have shown can inform about health status, disease risk, dietary patterns, and physical activity. We will then provide evidence-based dietary, behavioral, and therapeutic treatments to help extend the number of years you’re disease-free (your “healthspan”).<p>Today’s healthcare system is reactive, meaning diseases are treated only after symptoms are present. By the time they are detected, they’re often already serious issues that require irreversible interventions, like taking lifelong medications and living with their side effects. Collectively, we end up spending trillions of dollars treating diseases reactively that can often be prevented with good health monitoring and management. Also, a lot of age-related diseases develop as a result of molecular imbalances that accumulate over years.<p>One scientific field where many of these molecules can be measured is called metabolomics. Having worked in this field for more than a decade, we know that the technology exists to detect potential signs of chronic conditions at the earliest stages, when they are most actionable. Dan has a PhD and did his postdoctoral research at Stanford in computational biology and metabolomics. His work covers healthspan extension, lifespan extension and machine learning-based tools for drug repurposing. Jan, who was Dan’s PhD thesis supervisor, is a professor of computational biomedicine and metabolomics at Cornell. He has published over 90 metabolomics-related papers, with a focus on age-related chronic diseases, such as cancer, type 2 diabetes, and Alzheimer’s disease. Brent was the co-founder of Circle Medical, a primary care provider via video and in-person.<p>The “metabolome” is defined as the complete set of small molecules found in biological organisms with a size of &lt;1,500 Dalton, also known as metabolites [1][2]. This comprises biochemical substances such as amino acids, nucleic acids, fatty acids, vitamins, and hormones, as well as external chemicals like drugs, environmental contaminants, food additives, toxins [3][4] and metabolites produced by the gut microbiome. As of 2022, over 200,000 metabolites have been identified in nature, 40,000 of which are in blood, and over 1,500,000 are expected to still be identified (what we call the dark metabolome) [5].<p>The same way that fasting glucose has a baseline, other metabolites in blood, like the ~600 that we measure, also have their own baseline and deviations from these baselines have implications for your overall health and aging [6]. Compared to genetic testing, which tells people what might happen to their health, metabolomics tells us exactly what is happening in a body right now. Recent studies have shown links between blood metabolites and the risk or presence of various systemic diseases, including diabetes, heart disease, and Alzheimer’s disease; see for example [7].<p>Here are a few examples of what the first generation of iollo reports will include:<p>(1) The food a person eats and what actually ends up in their blood are not always the same thing. This is related to the concept of “bioavailability”, which differs from person to person. For example, people with impaired sugar transporters in the gut will not experience the same spike of blood sugar as people with a normal receptor (side note: this is not always a good thing, since sugars that remain in the gut lead to IBD-like problems). Our technology measures various markers of food intake, for example of red meat and plant-based diets, that can show what actually ended up in your blood. This can help guide dietary recommendations and healthy lifestyles.<p>(2) Your personal rate of aging. Research has shown that there is a “biological age”, which might differ from a person’s actual, chronological age. People who are biologically older than their real age tend to develop more health-related issues and age-related problems compared to people who are biologically young. Our platform will provide the users with estimates of their biological age, as well as their personal rate of aging across repeated time points and potential recommendations to slow down this rate.<p>(3) Our technology measures so-called “polyamines”, a group of molecules that regular lab tests do not capture today. Polyamines have been shown to improve the immune system in aging individuals, and appear to have protective properties against various diseases. Moreover, recent studies have demonstrated that a long-term, polyamine-rich diet can increase blood levels of these molecules. Hence, polyamines provide an interesting angle of dietary interventions, and the success of this intervention can be monitored with our technology.<p>(4) We also find some interesting, unexpected metabolites in certain people. For example in one of our pilot studies, one of our participants had a high level of phthalic acid, which can be found in plastics and cosmetics and is a chemical known to disrupt hormones in the body.<p>The next generation of our technology is expected to provide additional information about mental health markers, metabolic disorders, inflammation and allergies, and many more.<p>How it works: We send you a blood collection device, the same one we use at Stanford for research studies. After an overnight fasting period, you stick this device to your arm and press a button. A vacuum forms and a lancet (virtually!) painlessly pricks the surface of the skin to  collect a small amount (~80uL) of blood over a couple of minutes. The faint feeling is similar to when you attach the new generation of glucose monitors, if you’ve ever used one. The device contains a sponge designed to stabilize the biochemical molecules in blood at room temperature. You package the device with a prepaid return label, and it gets express-shipped directly to the metabolomics lab.<p>As soon as we receive your sample, we store it at -80°C. Samples are defrosted, centrifuged to collect the desired blood extracts, and the extract is then dried under liquid nitrogen. These blood extracts that contain metabolites are then subjected to two different mass-spectrometry analysis step: first through an ultra-performance liquid chromatography coupled with tandem mass-spectrometry (UPLC-MS/MS), and second through a flow injection analysis tandem mass-spectrometry (FIA-MS/MS) on the same instrument to specifically extract lipids. The measured mass-spectra from the machines are then analyzed using specialized software to obtain quantification values of all metabolites.<p>Here is a short video of our lab process: <a href=\"https://youtu.be/Jm3mCfHJjX8\" rel=\"nofollow\">https://youtu.be/Jm3mCfHJjX8</a><p>The resulting data is then securely sent over to us (we’re HIPAA compliant), and we perform statistical analysis and machine learning to generate an individualized report. Depending on the number of tests you do, the same procedure is repeated after a few weeks or months. This allows the user to build their own, individualized longitudinal metabolic monitoring.<p>We will associate metabolite profiles with wearables data, diet, supplement and medication intake, and potentially health conditions based on current research, and provide recommendations based on these.<p>This process also shows the difference between us and the infamous Theranos (a common question we get!) Instead of building our own machines that might end up not working, we rely on decades of research in the mass-spectrometry field and work with established metabolomics labs to ensure the quality of our measurements. Moreover, every bit of information that we communicate to the users will be heavily backed by scientific evidence which we disclose in the delivered reports.<p>One of the more exciting things we'll be able to do as our metabolomics database grows is to look for new signatures of age-related diseases at earlier and earlier stages. (Such analysis will only be done on de-identified data, only with consent, and only for our work towards extending healthspan.) One example of this is being able to detect early signatures of type 2 diabetes with metabolomics data, up to 12 years in advance, even when someone has a normal fasting glucose [8][9]! Once we’re able to detect these early disease signatures, it is much easier to find interventions to treat them and extend healthy lifespan, especially if they are still very early in development.<p>We are currently running an internal pilot and taking preorders: <a href=\"https://www.iollo.com/plans\" rel=\"nofollow\">https://www.iollo.com/plans</a>. We will be offering a beta version to users who’ve signed up in the coming months. Tests can be pre-ordered at $50, but we won’t charge the full subscription, which is around $212-$276 per test, until your first kit is shipped to you. If you decide to pre-order, we’ll additionally provide you with your entire metabolomics data so that you can run your own association experiments. Just type in the code HNLAUNCH with your pre-order so that we can send you your data. Right now we only ship in the US.<p>We believe we have a real chance to change the standard of care in health while developing more understanding of human health, physiology, and aging. We hope to expand metabolomics test access to users and patients, and give providers a new way to help treat age-related diseases. We really look forward to your questions and comments and feedback!<p>Thanks everyone! - Dan, Jan, and Brent.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "danielgomari",
    "url": "https://news.ycombinator.com/user?id=danielgomari"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32333417",
  "sameAs": "https://news.ycombinator.com/item?id=32333417",
  "dateCreated": "2022-08-03T16:36:54.776Z",
  "datePublished": "2022-08-03T15:56:41.000Z",
  "dateModified": "2022-08-03T16:36:54.776Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 21
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 12
    }
  ],
  "headline_zh-Hans": "启动HN：Iollo (YC S22) - 延长健康寿命的家用代谢组学测试\n",
  "headline_zh-Hant": "啟動HN：Iollo (YC S22) - 延長健康壽命的家用代謝組學測試\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hi Hacker News! We’re Dan, Jan, and Brent from iollo (<a href=\"https://www.iollo.com/\" rel=\"nofollow\">https://www.iollo.com/</a>). We’re developing an at-home metabolomics test that measures hundreds of “metabolites” in blood, which studies have shown can inform about health status, disease risk, dietary patterns, and physical activity. We will then provide evidence-based dietary, behavioral, and therapeutic treatments to help extend the number of years you’re disease-free (your “healthspan”).<p>Today’s healthcare system is reactive, meaning diseases are treated only after symptoms are present. By the time they are detected, they’re often already serious issues that require irreversible interventions, like taking lifelong medications and living with their side effects. Collectively, we end up spending trillions of dollars treating diseases reactively that can often be prevented with good health monitoring and management. Also, a lot of age-related diseases develop as a result of molecular imbalances that accumulate over years.<p>One scientific field where many of these molecules can be measured is called metabolomics. Having worked in this field for more than a decade, we know that the technology exists to detect potential signs of chronic conditions at the earliest stages, when they are most actionable. Dan has a PhD and did his postdoctoral research at Stanford in computational biology and metabolomics. 他的工作涵盖了健康跨度延长、寿命延长和基于机器学习的药物再利用工具。扬是丹的博士论文导师，是康奈尔大学计算生物医学和代谢组学的教授。他已经发表了90多篇与代谢组学有关的论文，重点是与年龄有关的慢性疾病，如癌症、2型糖尿病和阿尔茨海默氏病。布伦特是Circle Medical的联合创始人，Circle Medical是一个通过视频和面对面的初级保健提供者。<p>\"代谢组 \"被定义为在生物体内发现的大小为&lt;1,500道尔顿的小分子的完整集合，也被称为代谢物[1][2]。这包括生化物质，如氨基酸、核酸、脂肪酸、维生素和激素，以及外部化学品，如药物、环境污染物、食品添加剂、毒素[3][4]和肠道微生物组产生的代谢物。截至2022年，自然界中已经确定了20多万种代谢物，其中4万种在血液中，预计还有150多万种被确定（我们称之为暗代谢组）[5]。<p>与空腹血糖有一个基线一样，血液中的其他代谢物，如我们测量的约600种，也有自己的基线，这些基线的偏差对你的整体健康和衰老有影响[6]。与告诉人们他们的健康可能发生什么的基因测试相比，代谢组学准确地告诉我们现在身体里正在发生什么。最近的研究表明，血液中的代谢物与各种系统性疾病的风险或存在之间存在联系，包括糖尿病、心脏病和阿尔茨海默病；例如见[7]。<p>以下是第一代iollo报告将包括的几个例子：<p>（1）一个人吃的食物和实际最终进入他们血液的东西并不总是同一回事。这与 \"生物利用度 \"的概念有关，它因人而异。例如，肠道内糖分运输器受损的人将不会像受体正常的人那样经历血糖飙升（附带说明：这并不总是一件好事，因为留在肠道内的糖分会导致类似IBD的问题）。我们的技术测量食物摄入的各种标志物，例如红肉和植物性饮食，可以显示哪些东西实际上最终进入了你的血液。这可以帮助指导饮食建议和健康的生活方式。<p>（2）你个人的衰老速度。研究表明，有一个 \"生物年龄\"，它可能与一个人的实际年龄不同。与生物学上年轻的人相比，生物学上比实际年龄大的人往往会出现更多与健康有关的问题和与年龄有关的问题。我们的平台将为用户提供对其生物年龄的估计，以及他们在重复的时间点上的个人衰老速度和减缓这一速度的潜在建议。<p>（3）我们的技术测量所谓的 \"多胺\"，这是一组目前常规实验室测试无法捕获的分子。泊\n",
  "description_zh-Hant": "Hi Hacker News! We’re Dan, Jan, and Brent from iollo (<a href=\"https://www.iollo.com/\" rel=\"nofollow\">https://www.iollo.com/</a>). We’re developing an at-home metabolomics test that measures hundreds of “metabolites” in blood, which studies have shown can inform about health status, disease risk, dietary patterns, and physical activity. We will then provide evidence-based dietary, behavioral, and therapeutic treatments to help extend the number of years you’re disease-free (your “healthspan”).<p>Today’s healthcare system is reactive, meaning diseases are treated only after symptoms are present. By the time they are detected, they’re often already serious issues that require irreversible interventions, like taking lifelong medications and living with their side effects. Collectively, we end up spending trillions of dollars treating diseases reactively that can often be prevented with good health monitoring and management. Also, a lot of age-related diseases develop as a result of molecular imbalances that accumulate over years.<p>One scientific field where many of these molecules can be measured is called metabolomics. Having worked in this field for more than a decade, we know that the technology exists to detect potential signs of chronic conditions at the earliest stages, when they are most actionable. Dan has a PhD and did his postdoctoral research at Stanford in computational biology and metabolomics. 他的工作涵蓋了健康跨度延長、壽命延長和基於機器學習的藥物再利用工具。揚是丹的博士論文導師，是康奈爾大學計算生物醫學和代謝組學的教授。他已經發表了90多篇與代謝組學有關的論文，重點是與年齡有關的慢性疾病，如癌症、2型糖尿病和阿爾茨海默氏病。布倫特是Circle Medical的聯合創始人，Circle Medical是一個通過視頻和麵對面的初級保健提供者。<p>\"代謝組 \"被定義為在生物體內發現的大小為&lt;1,500道爾頓的小分子的完整集合，也被稱為代謝物[1][2]。這包括生化物質，如氨基酸、核酸、脂肪酸、維生素和激素，以及外部化學品，如藥物、環境汙染物、食品添加劑、毒素[3][4]和腸道微生物組產生的代謝物。截至2022年，自然界中已經確定了20多萬種代謝物，其中4萬種在血液中，預計還有150多萬種被確定（我們稱之為暗代謝組）[5]。<p>與空腹血糖有一個基線一樣，血液中的其他代謝物，如我們測量的約600種，也有自己的基線，這些基線的偏差對你的整體健康和衰老有影響[6]。與告訴人們他們的健康可能發生什麼的基因測試相比，代謝組學準確地告訴我們現在身體里正在發生什麼。最近的研究表明，血液中的代謝物與各種系統性疾病的風險或存在之間存在聯繫，包括糖尿病、心臟病和阿爾茨海默病；例如見[7]。<p>以下是第一代iollo報告將包括的幾個例子：<p>（1）一個人吃的食物和實際最終進入他們血液的東西並不總是同一回事。這與 \"生物利用度 \"的概念有關，它因人而異。例如，腸道內糖分運輸器受損的人將不會像受體正常的人那樣經歷血糖飆升（附帶說明：這並不總是一件好事，因為留在腸道內的糖分會導致類似IBD的問題）。我們的技術測量食物攝入的各種標誌物，例如紅肉和植物性飲食，可以顯示哪些東西實際上最終進入了你的血液。這可以幫助指導飲食建議和健康的生活方式。<p>（2）你個人的衰老速度。研究表明，有一個 \"生物年齡\"，它可能與一個人的實際年齡不同。與生物學上年輕的人相比，生物學上比實際年齡大的人往往會出現更多與健康有關的問題和與年齡有關的問題。我們的平臺將為用戶提供對其生物年齡的估計，以及他們在重複的時間點上的個人衰老速度和減緩這一速度的潛在建議。<p>（3）我們的技術測量所謂的 \"多胺\"，這是一組目前常規實驗室測試無法捕獲的分子。泊\n"
}