{
  "@type": "NewsArticle",
  "identifier": "2022--07--03--en--myfeed--HackerNews--NewsArticle--31964234",
  "url": "https://news.ycombinator.com/item?id=31964234",
  "headline": "Harnessing telepathy using quantum mechanics",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The book 'Think and Grow Rich' is partially premised on a person's thoughts influencing her environment by altering the 'ether' that surrounds it.<p>This, he later extends to directly making arguments for telepathy, even citing a scientific study claiming to conclusively demonstrate telepathy.<p>I found the basis of his book to be true, ultra successful people do seem to have a level of obsession and drive influence over every action, which led me to question the scientific basis of it, which seems today to be various laws of quantum mechanics.<p>If one accepts that the laws of quantum mechanics influence matter undetectable to humans (e.g. our sensory perception does not interpret the 'frequency') There is evidence of this in nature, commonly represented by the feeling one gets if another person is watching them.<p>The book implies human brains are able to communicate some degree of information through what today I suspect we refer to as quantum entanglement. Humans, as a species, potentially primarily communicated this way before language developed and has been slowly removed from the human evolution tree as was replaced with brain more configured for verbal language.<p>In a separate case, there are instances people cite positive and negative energy 'vibes' which one may argue are also evolutionary communication mechanisms, possibly developed to detect threats or mating. This is more present likely because these traits are still useful today. This may be influenced by a body's quantum field or some other quantum event releasing information. Mammals communicate differently. For instance, dogs primarily use scent to detect the same threat or mating signals, something humans are not evolutionarily equipped to do.<p>In perhaps its most controversial claim, the book seems to imply the possibility of being clairvoyant, citing instances of impending danger or even opportunity. At the time of the writing, did not understand the laws of quantum mechanics. Today, these rules are aligned with our elementary understanding of time as a dimension. If the universe is deterministic, which is an implied possibility with our understanding of time as a dimension, then knowledge of these future events would be one of many other dimensions humans do not have the evolutionarily capability to sense, possibility because its evolutionary value was limited compared to the body's energy being applied to  alternative senses.<p>However, Darwin argued novel evolutionary traits are potentially 1 in 1 M or more, which if were true, suggests that clairvoyance is actually a rare trait of an early trait for detecting alternate dimensions, similar to that of the early teeth of a shark or eyes of an amphibian.<p>Im not implying these these are true, but it is interesting to see how they formed several arguments describing events today we have a more sophisticated understanding of.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "digitcatphd",
    "url": "https://news.ycombinator.com/user?id=digitcatphd"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31964234",
  "sameAs": "https://news.ycombinator.com/item?id=31964234",
  "dateCreated": "2022-07-03T03:46:24.090Z",
  "datePublished": "2022-07-03T01:34:38.000Z",
  "dateModified": "2022-07-03T03:46:24.090Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "利用量子力学驾驭心灵感应\n",
  "headline_zh-Hant": "利用量子力學駕馭心靈感應\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "思考与致富》一书的部分前提是，一个人的思想通过改变周围的'乙醚'来影响她的环境。<p>这一点，他后来延伸到直接提出心灵感应的论点，甚至引用了一项科学研究，声称确凿地证明了心灵感应。<p>我发现他书中的基础是真实的，超级成功人士似乎确实对每个行动都有一定程度的执着和推动影响，这使我质疑其科学基础，今天看来是量子力学的各种规律。 <p>如果人们接受量子力学定律影响人类无法察觉的物质（例如，我们的感官知觉不能解释'频率'），在自然界中就有这样的证据，通常表现为如果另一个人在看他们的感觉。<p>这本书暗示人类的大脑能够通过今天我怀疑我们称之为量子纠缠的东西来沟通某种程度的信息。人类作为一个物种，在语言发展之前，可能主要是通过这种方式进行交流，但随着大脑被更多的口头语言所取代，这种方式已经慢慢地从人类的进化树上消失了。<p>在另一个案例中，有一些例子，人们引用了积极和消极的能量 \"氛围\"，人们可以认为这也是进化的交流机制，可能是为了检测威胁或交配。这更有可能是因为这些特质在今天仍然有用。这可能是受身体的量子场或其他一些释放信息的量子事件的影响。哺乳动物的交流方式不同。例如，狗主要使用气味来探测相同的威胁或交配信号，而人类在进化过程中并不具备这样的条件。<p>在也许是最有争议的说法中，这本书似乎暗示了成为千里眼的可能性，引用了即将发生的危险甚至机会的实例。在写作的时候，并不了解量子力学的规律。今天，这些规则与我们对时间这个维度的基本理解是一致的。如果宇宙是决定性的，这与我们对时间作为一个维度的理解是一种隐含的可能性，那么对这些未来事件的了解将是人类在进化上没有能力感知的许多其他维度之一，这种可能性是因为与身体的能量被应用于其他感官相比，其进化价值有限。 <p>然而，达尔文认为，新的进化特征可能是一百万分之一或更多，如果这是真的，这表明千里眼实际上是一种罕见的早期特征，用于探测其他维度，类似于鲨鱼的早期牙齿或两栖动物的眼睛。<p>我并不是在暗示这些都是真的，但看到他们如何形成几个论点，描述今天我们对事件有更复杂的理解，这很有趣。\n",
  "description_zh-Hant": "思考與致富》一書的部分前提是，一個人的思想通過改變周圍的'乙醚'來影響她的環境。<p>這一點，他後來延伸到直接提出心靈感應的論點，甚至引用了一項科學研究，聲稱確鑿地證明了心靈感應。<p>我發現他書中的基礎是真實的，超級成功人士似乎確實對每個行動都有一定程度的執著和推動影響，這使我質疑其科學基礎，今天看來是量子力學的各種規律。 <p>如果人們接受量子力學定律影響人類無法察覺的物質（例如，我們的感官知覺不能解釋'頻率'），在自然界中就有這樣的證據，通常表現為如果另一個人在看他們的感覺。<p>這本書暗示人類的大腦能夠通過今天我懷疑我們稱之為量子糾纏的東西來溝通某種程度的信息。人類作為一個物種，在語言發展之前，可能主要是通過這種方式進行交流，但隨著大腦被更多的口頭語言所取代，這種方式已經慢慢地從人類的進化樹上消失了。<p>在另一個案例中，有一些例子，人們引用了積極和消極的能量 \"氛圍\"，人們可以認為這也是進化的交流機制，可能是為了檢測威脅或交配。這更有可能是因為這些特質在今天仍然有用。這可能是受身體的量子場或其他一些釋放信息的量子事件的影響。哺乳動物的交流方式不同。例如，狗主要使用氣味來探測相同的威脅或交配信號，而人類在進化過程中並不具備這樣的條件。<p>在也許是最有爭議的說法中，這本書似乎暗示了成為千里眼的可能性，引用了即將發生的危險甚至機會的實例。在寫作的時候，並不瞭解量子力學的規律。今天，這些規則與我們對時間這個維度的基本理解是一致的。如果宇宙是決定性的，這與我們對時間作為一個維度的理解是一種隱含的可能性，那麼對這些未來事件的瞭解將是人類在進化上沒有能力感知的許多其他維度之一，這種可能性是因為與身體的能量被應用於其他感官相比，其進化價值有限。 <p>然而，達爾文認為，新的進化特徵可能是一百萬分之一或更多，如果這是真的，這表明千里眼實際上是一種罕見的早期特徵，用於探測其他維度，類似於鯊魚的早期牙齒或兩棲動物的眼睛。<p>我並不是在暗示這些都是真的，但看到他們如何形成幾個論點，描述今天我們對事件有更復雜的理解，這很有趣。\n"
}