{
  "@type": "NewsArticle",
  "identifier": "2022--07--26--en--myfeed--HackerNews--NewsArticle--32233903",
  "url": "https://news.ycombinator.com/item?id=32233903",
  "headline": "What it’s like working in Crypto",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "What it’s like working in crypto\nI’ve worked in crypto professionally for the last few years and wanted to shed some light on what it’s like as I’ve seen people mentioning it’s the best thing since sliced bread. Though, true for some people, it’s not as easy a ride as what it seems to be. Be prepared to work HARD<p>Given most companies in this space are still very new in comparison to other industries, most things you would be accustomed to at a similar company in traditional finance (software, processes, procedures, etc…) doesn’t necessarily exist in this space yet. Regardless of your role, you’ll need to understand how various other departments work. (I.e your in operations but you also need to know about legal/compliance/tech) If you don’t know how these other verticals work within the org your joining, be prepared to spend your time on the clock and off the clock learning about that.<p>THERE IS A LOT OF TECH DEBT. If the position your going into requires tech help and your not an engineer, good luck getting that. Most of these engineers are hired to fix current systems and keep them running until someone builds up enough courage to put in the time to rebuild and/or you get a competent engineering manager/team that holds up the rest of the team. Id you know how to code and build/deploy simple systems this help a ton build doesn’t completely solve your problem.<p>Going back to you’ll be working hard, average workday is 12hrs and you’ll constantly be playing the game of “catch-up” because chances are you’ll be short-staffed so nights and weekends are a game changer to get things done.<p>Unlimited vacation is not unlimited because you most likely won’t be taking one because there’s too much to do. Your manager will be like you should take one but deep down they don’t want you to because they’ll be even shorter handed than when you were present. Also, companies will pay you less $ and try to compensate you with stock thinking you actually care about that but in reality, all the valuations are so inflated because everyone was raising money at 100x revenue at the peak of the bull market you need a company to IPO/exit at $10 billion to get a decent return.<p>Nonetheless, I love this space and can’t picture myself anywhere else (call me crazy) but just wanted to set some expectations that it’s not an easy ride but it’s well worth the struggle/pain to build something great and accomplish things you couldn’t think you could do.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "arseniciv",
    "url": "https://news.ycombinator.com/user?id=arseniciv"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32233903",
  "sameAs": "https://news.ycombinator.com/item?id=32233903",
  "dateCreated": "2022-07-26T04:21:46.860Z",
  "datePublished": "2022-07-26T03:26:10.000Z",
  "dateModified": "2022-07-26T04:21:46.860Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "在加密货币领域工作是什么感觉？\n",
  "headline_zh-Hant": "在加密貨幣領域工作是什麼感覺？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在加密货币领域工作是什么感觉\n在过去的几年里，我一直在专业地从事加密货币工作，我想了解一下它是什么样子的，因为我看到人们提到它是自切片面包以来最好的东西。虽然，对一些人来说，它并不像它看起来那么容易。准备好努力工作<p>鉴于这个领域的大多数公司与其他行业相比仍然非常新，大多数你在传统金融领域的类似公司所习惯的东西（软件、流程、程序等）在这个领域还不一定存在。无论你的角色是什么，你都需要了解其他各个部门是如何工作的。(如果你不知道这些其他垂直部门是如何在你加入的组织内工作的，请准备好花时间在时钟上和时钟外学习这些知识。如果你要进入的职位需要技术帮助，而你又不是工程师，那么祝你好运。这些工程师大多是被雇来修复当前的系统并保持其运行，直到有人鼓起足够的勇气投入时间进行重建，并且/或者你得到了一个有能力的工程经理/团队，从而拖累了团队的其他成员。如果你知道如何编码和建立/部署简单的系统，这对建立的帮助很大，但并不能完全解决你的问题。<p>回到你将努力工作，平均工作日是12小时，你将不断地玩 \"追赶 \"游戏，因为你有可能人手不足，所以晚上和周末是改变游戏规则来完成事情。你的经理会说你应该休一次，但在内心深处，他们不希望你这样做，因为他们的手脚会比你在的时候还要短。另外，公司会付给你较少的美元，并试图用股票来补偿你，以为你真的关心这个，但实际上，所有的估值都是如此膨胀，因为在牛市的高峰期，每个人都在以100倍的收入筹集资金，你需要一个公司以100亿美元的价格IPO/退出，才能获得一个体面的回报。 <p>尽管如此，我喜欢这个领域，无法想象自己会在其他地方工作（说我疯了），但我只想设定一些期望，即这不是一次轻松的旅程，但为了建立一些伟大的东西，完成你无法想象的事情，这些挣扎/痛苦是非常值得的。\n",
  "description_zh-Hant": "在加密貨幣領域工作是什麼感覺\n在過去的幾年裡，我一直在專業地從事加密貨幣工作，我想了解一下它是什麼樣子的，因為我看到人們提到它是自切片面包以來最好的東西。雖然，對一些人來說，它並不像它看起來那麼容易。準備好努力工作<p>鑑於這個領域的大多數公司與其他行業相比仍然非常新，大多數你在傳統金融領域的類似公司所習慣的東西（軟件、流程、程序等）在這個領域還不一定存在。無論你的角色是什麼，你都需要了解其他各個部門是如何工作的。(如果你不知道這些其他垂直部門是如何在你加入的組織內工作的，請準備好花時間在時鐘上和時鐘外學習這些知識。如果你要進入的職位需要技術幫助，而你又不是工程師，那麼祝你好運。這些工程師大多是被僱來修復當前的系統並保持其運行，直到有人鼓起足夠的勇氣投入時間進行重建，並且/或者你得到了一個有能力的工程經理/團隊，從而拖累了團隊的其他成員。如果你知道如何編碼和建立/部署簡單的系統，這對建立的幫助很大，但並不能完全解決你的問題。<p>回到你將努力工作，平均工作日是12小時，你將不斷地玩 \"追趕 \"遊戲，因為你有可能人手不足，所以晚上和週末是改變遊戲規則來完成事情。你的經理會說你應該休一次，但在內心深處，他們不希望你這樣做，因為他們的手腳會比你在的時候還要短。另外，公司會付給你較少的美元，並試圖用股票來補償你，以為你真的關心這個，但實際上，所有的估值都是如此膨脹，因為在牛市的高峰期，每個人都在以100倍的收入籌集資金，你需要一個公司以100億美元的價格IPO/退出，才能獲得一個體面的回報。 <p>儘管如此，我喜歡這個領域，無法想象自己會在其他地方工作（說我瘋了），但我只想設定一些期望，即這不是一次輕鬆的旅程，但為了建立一些偉大的東西，完成你無法想象的事情，這些掙扎/痛苦是非常值得的。\n"
}