{
  "@type": "NewsArticle",
  "identifier": "2022--07--06--en--myfeed--HackerNews--NewsArticle--31997963",
  "url": "https://news.ycombinator.com/item?id=31997963",
  "headline": "Its not the weapons, stupidity of the people is the problem",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Claims of the Americans who support the rights -<p>* guns are not causing the violence, the person is causing it.<p>* my guns makes me more secure because other people around me have them<p>* its a foundational law, you can't change it<p>Common-sense disproval of the above myths to follow.<p>1. Look at the countries which don't allow each of their citizen to own dozens of guns. Do you now believe that rate of violence directly relates to presnce of guns?<p>2. Take out the guns from you and the people around you, does that make you any less secure?<p>3. Your foundational laws were made by the people, for the people as they made sense in those times, centuries ago. They can be changed by the people, for the people. The fore-fathers expected you to monitor the validity of these laws as the times change, and make necessary changes. And you thought these are unchangeable.<p>Since you can't even use common sense to think of this simple ways of disproving your myths, you deserve to be called a stupid. And you probably deserve the deterioration of the quality of life and social conditions around you.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "bluefone",
    "url": "https://news.ycombinator.com/user?id=bluefone"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31997963",
  "sameAs": "https://news.ycombinator.com/item?id=31997963",
  "dateCreated": "2022-07-06T08:32:39.287Z",
  "datePublished": "2022-07-06T07:46:38.000Z",
  "dateModified": "2022-07-06T08:32:39.287Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "问题不在于武器，而在于人们的愚蠢。\n",
  "headline_zh-Hant": "問題不在於武器，而在於人們的愚蠢。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "支持权利的美国人的主张--<p>*枪支没有造成暴力，是人造成的。<p>*我的枪让我更安全，因为我周围的人都有枪<p>*它是一个基础法律，你不能改变它<p>对上述神话的常识性反驳如下：<p>1. 看看那些不允许每个公民拥有几十把枪的国家。<p>2.把你和你周围的人的枪拿出来，你的安全感会降低吗？ <p>3.你的基本法律是由人民制定的，为了人民，因为它们在几个世纪前的那个时代是有意义的。它们可以由人民来改变，为人民服务。先辈们希望你们能随着时代的变化监督这些法律的有效性，并做出必要的修改。而你认为这些是不可改变的。<p>既然你甚至不能用常识来思考这种简单的方法来反驳你的神话，你就应该被称为傻瓜。而且你可能应该得到你周围生活质量和社会条件的恶化。\n",
  "description_zh-Hant": "支持權利的美國人的主張--<p>*槍支沒有造成暴力，是人造成的。<p>*我的槍讓我更安全，因為我周圍的人都有槍<p>*它是一個基礎法律，你不能改變它<p>對上述神話的常識性反駁如下：<p>1. 看看那些不允許每個公民擁有幾十把槍的國家。<p>2.把你和你周圍的人的槍拿出來，你的安全感會降低嗎？ <p>3.你的基本法律是由人民制定的，為了人民，因為它們在幾個世紀前的那個時代是有意義的。它們可以由人民來改變，為人民服務。先輩們希望你們能隨著時代的變化監督這些法律的有效性，並做出必要的修改。而你認為這些是不可改變的。<p>既然你甚至不能用常識來思考這種簡單的方法來反駁你的神話，你就應該被稱為傻瓜。而且你可能應該得到你周圍生活質量和社會條件的惡化。\n"
}