{
  "@type": "NewsArticle",
  "identifier": "2022--06--27--en--myfeed--HackerNews--NewsArticle--31896688",
  "url": "https://news.ycombinator.com/item?id=31896688",
  "headline": "What do you tell people when they ask how the startup is going?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm currently working on a startup with no revenue and very little traction. I'm running out of money and will likely have to stop soon and go back to work.<p>I'm scrambling trying to figure out how to save the company in it's last days but I mostly just have no idea what I'm doing and will probably just have to get a job and try again later.<p>Most of my days are filled with stress and dread.<p>In spite of that I still love working on it and if I can find any way to continue that's what I plan to do.<p>My question is, for people who have been in this situation, what do you tell friends and family when they ask &quot;how the startup is going?&quot;<p>Sometimes this question feels passive agressive but more often people are just genuinely curious. It's really a pretty reasonable question.<p>But I don't have reasonable answers. It's both great and terrible in ways that are hard to get across in a short conversation. I don't have the time to fully explain it. Do you go with a broad &quot;it has it's ups and downs&quot; or something like that? Or try to explain some specific part? I find this tends to bore people.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "f0e4c2f7",
    "url": "https://news.ycombinator.com/user?id=f0e4c2f7"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31896688",
  "sameAs": "https://news.ycombinator.com/item?id=31896688",
  "dateCreated": "2022-06-27T16:40:09.187Z",
  "datePublished": "2022-06-27T16:15:06.000Z",
  "dateModified": "2022-06-27T16:40:09.187Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "当人们问起创业的进展如何时，你会怎么说？\n",
  "headline_zh-Hant": "當人們問起創業的進展如何時，你會怎麼說？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我目前正在为一家初创公司工作，没有收入，也没有什么牵引力。我的钱快用完了，很可能很快就得停下来回去工作。<p>我正忙着想办法在公司最后的日子里拯救它，但我主要是不知道自己在做什么，可能只能找一份工作，以后再试。 <p>尽管如此，我仍然喜欢在上面工作，如果我能找到任何方法继续下去，这就是我打算做的。<p>我的问题是，对于那些曾经处于这种情况的人，当朋友和家人问&quot;创业公司进展如何时，你会怎么回答？这确实是一个相当合理的问题。<p>但我没有合理的答案。它既伟大又可怕，在简短的对话中很难表达出来。我没有时间去充分解释它。你是用一个广泛的&quot;它有它的起伏&quot;或类似的说法？还是试着解释一些具体的部分？我发现这往往会让人感到厌烦。\n",
  "description_zh-Hant": "我目前正在為一家初創公司工作，沒有收入，也沒有什麼牽引力。我的錢快用完了，很可能很快就得停下來回去工作。<p>我正忙著想辦法在公司最後的日子裡拯救它，但我主要是不知道自己在做什麼，可能只能找一份工作，以後再試。 <p>儘管如此，我仍然喜歡在上面工作，如果我能找到任何方法繼續下去，這就是我打算做的。<p>我的問題是，對於那些曾經處於這種情況的人，當朋友和家人問&quot;創業公司進展如何時，你會怎麼回答？這確實是一個相當合理的問題。<p>但我沒有合理的答案。它既偉大又可怕，在簡短的對話中很難表達出來。我沒有時間去充分解釋它。你是用一個廣泛的&quot;它有它的起伏&quot;或類似的說法？還是試著解釋一些具體的部分？我發現這往往會讓人感到厭煩。\n"
}