{
  "@type": "NewsArticle",
  "identifier": "2022--06--26--en--myfeed--HackerNews--NewsArticle--31879981",
  "url": "https://news.ycombinator.com/item?id=31879981",
  "headline": "What startup snakery have you experienced as a developer / employee?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm a senior developer with 15+ years of experience. I've experienced anything from senior management asking me to hire a senior developer for 6 months to develop core features then have a meeting after his probation to tell him why he isn't good enough by nitpicking minor mistakes in his overall communication, coding, PR styles to laying off entire US / UK teams when they prefer offshore ones. Needless to say I quit said companies and moved on as I find this disgusting.<p>I've also experienced interviews where I had to develop a core feature for them as a coding test to see if im good enough, or even advise (as part of the coding test) a junior/mid-level developer (who was the interviewer) on how to scale their backend for GPU processing and how to design the database before he told me I'm not good enough for the job as I told him he is fishing for the solution he doesn't even have.<p>The point of this point is I want to bring to light immoral shit that startups do and possibly have a platform where we suffered from their 'scams' and at least bring those to light. I want to hear more of what you have experienced with startups.<p>Were you dismissed for &quot;poor performance&quot; for reasons that do not make sense? Did your colleagues betray you or suddenly become cold and distant? what happened? This is the thread to show all the evil bullshit that startups have done to you or colleagues. How would you hold them accountable?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Brogrammer69",
    "url": "https://news.ycombinator.com/user?id=Brogrammer69"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31879981",
  "sameAs": "https://news.ycombinator.com/item?id=31879981",
  "dateCreated": "2022-06-26T03:49:25.122Z",
  "datePublished": "2022-06-26T00:42:02.000Z",
  "dateModified": "2022-06-26T03:49:25.122Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "作为一名开发者/员工，你经历过哪些创业公司的蛇蝎心肠？\n",
  "headline_zh-Hant": "作為一名開發者/員工，你經歷過哪些創業公司的蛇蠍心腸？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个拥有15年以上经验的高级开发人员。我经历过各种情况，从高级管理层要求我雇用一个高级开发人员开发6个月的核心功能，然后在他试用期结束后开会告诉他为什么他不够好，对他的整体沟通、编码、公关风格中的小错误吹毛求疵，到在他们喜欢离岸团队的时候裁掉整个美国/英国团队。<p>我也经历过这样的面试：我必须为他们开发一个核心功能作为编码测试，以了解我是否足够好，或者甚至建议（作为编码测试的一部分）一个初级/中级开发人员（他是面试官）如何为GPU处理扩展他们的后端以及如何设计数据库，然后他告诉我我不适合这份工作，因为我告诉他他在寻找他甚至没有的解决方案。 <p>这一点是我想把创业公司所做的不道德的事情曝光，可能有一个平台，我们遭受了他们的'骗局'，至少把这些事情曝光。我想多听听你在创业公司的经历。<p>你是否因为&quot;表现不佳&quot;而被解雇，理由也说不通？你的同事是否背叛了你，或者突然变得冷漠和疏远？发生了什么？这是一个展示创业公司对你或同事所做的所有邪恶的废话的主题。你会如何追究他们的责任？\n",
  "description_zh-Hant": "我是一個擁有15年以上經驗的高級開發人員。我經歷過各種情況，從高級管理層要求我僱用一個高級開發人員開發6個月的核心功能，然後在他試用期結束後開會告訴他為什麼他不夠好，對他的整體溝通、編碼、公關風格中的小錯誤吹毛求疵，到在他們喜歡離岸團隊的時候裁掉整個美國/英國團隊。<p>我也經歷過這樣的面試：我必須為他們開發一個核心功能作為編碼測試，以瞭解我是否足夠好，或者甚至建議（作為編碼測試的一部分）一個初級/中級開發人員（他是面試官）如何為GPU處理擴展他們的後端以及如何設計數據庫，然後他告訴我我不適合這份工作，因為我告訴他他在尋找他甚至沒有的解決方案。 <p>這一點是我想把創業公司所做的不道德的事情曝光，可能有一個平臺，我們遭受了他們的'騙局'，至少把這些事情曝光。我想多聽聽你在創業公司的經歷。<p>你是否因為&quot;表現不佳&quot;而被解僱，理由也說不通？你的同事是否背叛了你，或者突然變得冷漠和疏遠？發生了什麼？這是一個展示創業公司對你或同事所做的所有邪惡的廢話的主題。你會如何追究他們的責任？\n"
}