{
  "@type": "NewsArticle",
  "identifier": "2022--08--04--en--myfeed--HackerNews--NewsArticle--32349725",
  "url": "https://news.ycombinator.com/item?id=32349725",
  "headline": "AirPods Suck in Video Conferences",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Am I the only one that has trouble understanding people that use Airpods on video conferences?  Overall I think I can understand over 95% of what someone using Airpods says, but it takes so much more mental energy and focus, compared to the people that have a little boom mic on a legit headset or have a desktop mic.  If someone using Airpods has a non-native-English accent, then my comprehension drops even more and I find it really taxing to piece together what they are saying.  In 2022, I really started struggling with so-called Zoom-fatigue and I've narrowed down the biggest factor to struggling to understand what people are saying with Airpods (combined with having to crank the volume of my headphones on my end).<p>I have dug into the issue with specific people and often we discover that they were inadvertently using the mic from their laptop or webcam.  When we restored audio input to the Airpods, there was an improvement, but the audio quality still, for the most part, kind of, just ... sucks.<p>Is it just me?  If not, can this serve as a PSA to Airpod users to upgrade to a simple, legit headset or desktop mic for the benefit of your fellow employees?<p>Airpod users: \nDo you find people asking you to repeat yourself in meetings?  \nHave you tested out your set up (where the video conf app records your voice and plays it back to you)?\nSide question: Do you have any health concerns about making wireless earbuds your long-term choice of audio hardware, given we're going to be using video conferences for the foreseeable future?  I'm sure Bluetooth is generally &quot;safe,&quot; but what of the health effects of long-term (3-8 hours per day for the next 5+ years) use of two wireless radio transmitters so close to your brain?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jh00ker",
    "url": "https://news.ycombinator.com/user?id=jh00ker"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32349725",
  "sameAs": "https://news.ycombinator.com/item?id=32349725",
  "dateCreated": "2022-08-04T23:58:04.702Z",
  "datePublished": "2022-08-04T23:42:50.000Z",
  "dateModified": "2022-08-04T23:58:04.702Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "空气耳机在视频会议中很糟糕\n",
  "headline_zh-Hant": "空氣耳機在視頻會議中很糟糕\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是唯一一个在视频会议上难以理解使用Airpods的人吗？ 总的来说，我认为我可以理解使用Airpods的人所说的95%以上的话，但与那些在合法耳机上有一个小吊杆麦克风或有一个桌面麦克风的人相比，它需要更多的精神和注意力。 如果使用Airpods的人有非英语母语的口音，那么我的理解力就会下降得更多，我发现要把他们说的话拼凑起来真的很费力。 在2022年，我真的开始挣扎于所谓的Zoom-fatigue，我已经把最大的因素缩小到挣扎于理解人们用Airpods说的话（加上我不得不在我的终端上提高耳机的音量）。<p>我已经对特定的人进行了调查，我们经常发现他们无意中使用了他们的笔记本电脑或网络摄像头的麦克风。 当我们将音频输入恢复到Airpods时，情况有所改善，但在大多数情况下，音频质量仍然有点，只是......很糟糕。<p>只是我的问题吗？ 如果不是，这是否可以作为对Airpod用户的公益广告，让他们升级到一个简单、合法的耳机或桌面麦克风，以利于你的员工？\n你是否发现人们要求你在会议上重复自己的讲话？ \n你是否测试过你的设置（视频保密应用程序记录你的声音并回放给你）？\n题外话。鉴于我们将在可预见的未来使用视频会议，你对将无线耳塞作为音频硬件的长期选择是否有任何健康顾虑？ 我确信蓝牙通常是安全的，但长期（在未来5年多的时间里，每天3-8小时）使用两个离你的大脑如此近的无线发射器会对健康产生什么影响？\n",
  "description_zh-Hant": "我是唯一一個在視頻會議上難以理解使用Airpods的人嗎？ 總的來說，我認為我可以理解使用Airpods的人所說的95%以上的話，但與那些在合法耳機上有一個小吊杆麥克風或有一個桌面麥克風的人相比，它需要更多的精神和注意力。 如果使用Airpods的人有非英語母語的口音，那麼我的理解力就會下降得更多，我發現要把他們說的話拼湊起來真的很費力。 在2022年，我真的開始掙扎於所謂的Zoom-fatigue，我已經把最大的因素縮小到掙扎於理解人們用Airpods說的話（加上我不得不在我的終端上提高耳機的音量）。<p>我已經對特定的人進行了調查，我們經常發現他們無意中使用了他們的筆記本電腦或網絡攝像頭的麥克風。 當我們將音頻輸入恢復到Airpods時，情況有所改善，但在大多數情況下，音頻質量仍然有點，只是......很糟糕。<p>只是我的問題嗎？ 如果不是，這是否可以作為對Airpod用戶的公益廣告，讓他們升級到一個簡單、合法的耳機或桌面麥克風，以利於你的員工？\n你是否發現人們要求你在會議上重複自己的講話？ \n你是否測試過你的設置（視頻保密應用程序記錄你的聲音並回放給你）？\n題外話。鑑於我們將在可預見的未來使用視頻會議，你對將無線耳塞作為音頻硬件的長期選擇是否有任何健康顧慮？ 我確信藍牙通常是安全的，但長期（在未來5年多的時間裡，每天3-8小時）使用兩個離你的大腦如此近的無線發射器會對健康產生什麼影響？\n"
}