{
  "@type": "NewsArticle",
  "identifier": "2022--06--19--en--myfeed--HackerNews--NewsArticle--31797995",
  "url": "https://news.ycombinator.com/item?id=31797995",
  "headline": "A new word, a new concept",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi everyone, I want to tell you about a new concept, a new word, a new idea.<p>I have been talking for years about a new social construct, a new structure of conduct. Things like Facebook, the Internet, and Bitcoin are the those that make it possible.<p>For several years I have been trying to tell people about this new construct that I envision - and each time using all sorts of terms that I find appropriate at that moment, depending on the listener, or depending on our geopolitical and socioeconomic situation at the time.<p>And I have realized in recent months that one of my mistakes is that I am trying to explain something new with old terms. Then the listener hears a term he already knows, and gets a sense of what it is and what it is not, even before I have time to say one word about my new idea!<p>So today you are exposed to a new word in Hebrew and English, this word is: &quot;שבד&quot; (Sheved) in Hebrew and &quot;Tride&quot; in English.<p>What is a Tride? Hopefully this already lights up some associations - by and large this is a Digital Tribe - as well as in Hebrew: שבט דיגטלי.<p>What does it mean? This means, as mentioned, a new social structure. I feed this structure between our private homes, and up to a city and maybe even a country further down the road - that is, on the order of people involved. The tride is designed to provide a cultural response to a number of unmet needs in our current society, including:<p>Community - people want to belong, but with our constant movement in space, moving from apartment to apartment, from city to city, from country to country we have a hard time finding the relevant community - community is in my opinion a very important element in our daily lives that we all miss, and there are cultures - like the religious and the ultra-orthodox, for who it is easier first of all under the auspices of the community, thanks to the fact that they have a rabbi who knows how to take responsibility and tell everyone in the community what he thinks, and help the community develop and grow.<p>==== CONTINUING IN COMMENTS ===",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "elisk",
    "url": "https://news.ycombinator.com/user?id=elisk"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31797995",
  "sameAs": "https://news.ycombinator.com/item?id=31797995",
  "dateCreated": "2022-06-19T10:26:42.918Z",
  "datePublished": "2022-06-19T10:19:24.000Z",
  "dateModified": "2022-06-19T10:26:42.918Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "一个新词，一个新概念\n",
  "headline_zh-Hant": "一個新詞，一個新概念\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，我想告诉你们一个新的概念，一个新的词，一个新的想法。<p>多年来，我一直在谈论一个新的社会结构，一个新的行为结构。像Facebook、互联网和比特币这样的东西使它成为可能。<p>几年来，我一直试图告诉人们我所设想的这种新的结构--每次都使用各种我认为在当时合适的术语，这取决于听众，或者取决于我们当时的地缘政治和社会经济状况。<p>最近几个月，我意识到我的一个错误是，我试图用旧的术语来解释新的东西。然后，听众听到一个他已经知道的术语，甚至在我有时间说一个关于我的新想法的词之前，就能感觉到它是什么，它不是什么！<p>所以今天你会接触到一个希伯来语和英语的新词，这个词是：希伯来语的&quot;שבד&quot;（Sheved）和英语的&quot;Tride&quot;。<p>什么是Tride？希望这已经点亮了一些联想--总的来说，这是一个数字部落--以及在希伯来语中：ש ב דיגטלי.<p>它是什么意思？这意味着，如前所述，一个新的社会结构。我把这个结构放在我们的私人住宅之间，一直到一个城市，甚至更远的一个国家--也就是说，在参与的人的顺序上。这条线路旨在为我们当前社会中一些未满足的需求提供文化回应，包括。 <p>社区--人们希望有归属感，但随着我们在空间上的不断移动，从公寓到公寓，从城市到城市，从国家到国家，我们很难找到相关的社区--在我看来，社区是我们日常生活中一个非常重要的元素，我们都错过了。而有些文化--比如宗教和极端正统派，对他们来说，首先在社区的支持下更容易，这要归功于他们有一个拉比，他知道如何承担责任，告诉社区里的每个人他的想法，并帮助社区发展和成长。 <p>==== 继续评论 ===\n",
  "description_zh-Hant": "大家好，我想告訴你們一個新的概念，一個新的詞，一個新的想法。<p>多年來，我一直在談論一個新的社會結構，一個新的行為結構。像Facebook、互聯網和比特幣這樣的東西使它成為可能。<p>幾年來，我一直試圖告訴人們我所設想的這種新的結構--每次都使用各種我認為在當時合適的術語，這取決於聽眾，或者取決於我們當時的地緣政治和社會經濟狀況。<p>最近幾個月，我意識到我的一個錯誤是，我試圖用舊的術語來解釋新的東西。然後，聽眾聽到一個他已經知道的術語，甚至在我有時間說一個關於我的新想法的詞之前，就能感覺到它是什麼，它不是什麼！<p>所以今天你會接觸到一個希伯來語和英語的新詞，這個詞是：希伯來語的&quot;שבד&quot;（Sheved）和英語的&quot;Tride&quot;。<p>什麼是Tride？希望這已經點亮了一些聯想--總的來說，這是一個數字部落--以及在希伯來語中：ש ב דיגטלי.<p>它是什麼意思？這意味著，如前所述，一個新的社會結構。我把這個結構放在我們的私人住宅之間，一直到一個城市，甚至更遠的一個國家--也就是說，在參與的人的順序上。這條線路旨在為我們當前社會中一些未滿足的需求提供文化回應，包括。 <p>社區--人們希望有歸屬感，但隨著我們在空間上的不斷移動，從公寓到公寓，從城市到城市，從國家到國家，我們很難找到相關的社區--在我看來，社區是我們日常生活中一個非常重要的元素，我們都錯過了。而有些文化--比如宗教和極端正統派，對他們來說，首先在社區的支持下更容易，這要歸功於他們有一個拉比，他知道如何承擔責任，告訴社區裡的每個人他的想法，並幫助社區發展和成長。 <p>==== 繼續評論 ===\n"
}