{
  "@type": "NewsArticle",
  "identifier": "2022--06--23--en--myfeed--HackerNews--NewsArticle--31854837",
  "url": "https://news.ycombinator.com/item?id=31854837",
  "headline": "Seeking advice from a senior engineer type",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Bit of background: Went to an okay uni, got decent grades, and have about 3 1/2 years of industry experience. 2 1/2 of those years were spent working on low level C stuff (a few device drivers) and a bit of C++/Python application work (largely for system level tools - think PCIe device access and NIC configuration). After producing a few solid deliverables I figured it'd be good to make a horizontal move towards C++ application development and get broader experience. That ended up moving me to a FAANG subsidiary where I was bait and switched. A bit more on the bait and switch- the conversation (before I was hired) started as:<p>- We need a C++ person to develop applications<p>to (after I was hired)<p>- We need a C++ person to maintain our soon to be depreciated C++ apps<p>to (after I was being underutilized due to no real need for maintenance)<p>- We expect you to adapt and take on JavaScript/React/Next.JS work to help depreciate the C++ apps<p>This all happened in ~2 months.<p>Given that this company made a sizeable investment in me I agreed to take on some of the work (I was thinking maybe 6-8 months to try it out) and then wanted to transition to some back end service work using Go. They outlined a need for this and agreed to make some kind of transition, eventually.<p>Flash forward 6-8 months later:<p>- I'm producing half of what the junior front end engineers are producing<p>- After getting my head wrapped around the front end space and their tech stack I'm realizing it's not for me<p>- I'm not generating any notable projects that could help me adopt more responsibility in the space (likely due to my first point)<p>So I gave them a hardball and threatened to quit. I outlined my major concern: I wasn't hired to do front end work. They suggested I try to transfer teams internally- gave that a whirl and got absolutely jebaited with another team (ended up having to do a full 8 hour panel just to be rejected on something that wasn't outlined in their job description). Asked more about the back end work they initially offered to which they responded by sending some crude unfinished docs... This really highlighted that the work, more or less, wasn't really scoped or understood. To me, all this seemed like a losing situation. So... I quit and not in such a graceful fashion.<p>As a side note: while I was quitting I found out ~85% of the previous C++ team quit due to a similar bait and switch. Smells like ugly politics to me which really pushed me to leave sooner than my two weeks.<p>So now I'm in this weird position of having some interest in the front end space but not enough decent experience to actually do anything with it. I have enough low level experience to attract decent work but would have to likely relocate (which I'd like to not do unless I have to). And, sadly, I don't have any bridge to connect these two skill sets.<p>I tried getting back into the interview loop and flopped pretty badly- mainly for back end work.<p>So what are the next steps? I'm definitely planning on taking some time off. I figured getting some opensource work knocked out in a more upcoming language could be good. Doing some leet code practicing, maybe? In either case I would love to get some input to help navigate this mess.<p>Also, I've started using some platforms to look for more work (namely LinkedIn) and I'm discovering how awful the recruiter spam is- any suggestions on better job boards would also be greatly appreciated.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "arrjayh",
    "url": "https://news.ycombinator.com/user?id=arrjayh"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31854837",
  "sameAs": "https://news.ycombinator.com/item?id=31854837",
  "dateCreated": "2022-06-23T21:24:04.377Z",
  "datePublished": "2022-06-23T20:38:52.000Z",
  "dateModified": "2022-06-23T21:24:04.377Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "寻求高级工程师类型的建议\n",
  "headline_zh-Hant": "尋求高級工程師類型的建議\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "有一点背景。上过一所不错的大学，成绩还不错，有三年半的行业经验。其中有两年半的时间是在做低级别的C语言工作（一些设备驱动）和一些C++/Python应用工作（主要是系统级工具--考虑PCIe设备访问和网卡配置）。在产生了一些可靠的交付物之后，我想应该向C++应用开发横向发展并获得更广泛的经验。结果我被调到了一家FAANG的子公司，在那里我被诱骗了。关于诱饵和交换，对话（在我被雇用之前）开始是：<p>- 我们需要一个C++的人去开发应用程序<p>到（在我被雇用之后）<p>- 我们需要一个C++的人去维护我们即将折旧的C++应用程序<p>到（在我由于没有真正需要维护而被充分利用之后）<p>- 我们希望你能够适应并承担JavaScript/React/Next. <p>鉴于这家公司对我进行了相当大的投资，我同意承担一些工作（我想也许是6-8个月的尝试），然后想过渡到使用Go的一些后端服务工作。<p>6-8个月后的今天：<p>- 我的工作量只有初级前端工程师的一半<p>- 在我了解了前端领域和他们的技术栈后，我意识到这并不适合我<p>- 我没有产生任何可以帮助我在这个领域承担更多责任的显著项目（可能是由于我的第一点）<p> 所以我给了他们一个硬球，威胁说要辞职。我概述了我的主要担忧：我不是被雇佣来做前端工作的。他们建议我尝试在内部调换团队--我试了一下，结果被另一个团队耍得团团转（最后不得不做了整整8个小时的小组讨论，就因为他们工作描述中没有列出的东西而被拒绝）。我问了更多关于他们最初提供的后端工作的情况，他们的回答是发送了一些粗糙的未完成的文件...。这确实强调了这项工作，或多或少，并没有真正的范围或理解。对我来说，这一切似乎是一个失败的局面。所以......我辞职了，而且辞职的方式并不优雅。<p>附带说明一下：在我辞职的时候，我发现以前的C++团队中有85%的人是由于类似的诱饵和开关而辞职的。对我来说，这闻起来像是丑陋的政治，这真的促使我在两周内就离开了。<p>所以现在我处于这样一个奇怪的位置：对前端领域有一些兴趣，但没有足够的像样的经验来真正做一些事情。我有足够的低级经验来吸引体面的工作，但很可能要搬迁（除非必要，否则我不想搬迁）。而且，可悲的是，我没有任何桥梁来连接这两套技能。<p>我试图重新进入面试圈，但失败得很厉害--主要是后端工作。<p>那么，下一步是什么？我肯定打算休息一段时间。我想，用一种即将到来的语言完成一些开放源码的工作可能会很好。也许是在做一些简单的代码练习？<p>此外，我已经开始使用一些平台来寻找更多的工作（即LinkedIn），我发现招聘人员的垃圾邮件是多么可怕--如果有任何关于更好的招聘网站的建议，我也会非常感激的。\n",
  "description_zh-Hant": "有一點背景。上過一所不錯的大學，成績還不錯，有三年半的行業經驗。其中有兩年半的時間是在做低級別的C語言工作（一些設備驅動）和一些C++/Python應用工作（主要是系統級工具--考慮PCIe設備訪問和網卡配置）。在產生了一些可靠的交付物之後，我想應該向C++應用開發橫向發展並獲得更廣泛的經驗。結果我被調到了一家FAANG的子公司，在那裡我被誘騙了。關於誘餌和交換，對話（在我被僱用之前）開始是：<p>- 我們需要一個C++的人去開發應用程序<p>到（在我被僱用之後）<p>- 我們需要一個C++的人去維護我們即將折舊的C++應用程序<p>到（在我由於沒有真正需要維護而被充分利用之後）<p>- 我們希望你能夠適應並承擔JavaScript/React/Next. <p>鑑於這家公司對我進行了相當大的投資，我同意承擔一些工作（我想也許是6-8個月的嘗試），然後想過渡到使用Go的一些後端服務工作。<p>6-8個月後的今天：<p>- 我的工作量只有初級前端工程師的一半<p>- 在我瞭解了前端領域和他們的技術棧後，我意識到這並不適合我<p>- 我沒有產生任何可以幫助我在這個領域承擔更多責任的顯著項目（可能是由於我的第一點）<p> 所以我給了他們一個硬球，威脅說要辭職。我概述了我的主要擔憂：我不是被僱傭來做前端工作的。他們建議我嘗試在內部調換團隊--我試了一下，結果被另一個團隊耍得團團轉（最後不得不做了整整8個小時的小組討論，就因為他們工作描述中沒有列出的東西而被拒絕）。我問了更多關於他們最初提供的後端工作的情況，他們的回答是發送了一些粗糙的未完成的文件...。這確實強調了這項工作，或多或少，並沒有真正的範圍或理解。對我來說，這一切似乎是一個失敗的局面。所以......我辭職了，而且辭職的方式並不優雅。<p>附帶說明一下：在我辭職的時候，我發現以前的C++團隊中有85%的人是由於類似的誘餌和開關而辭職的。對我來說，這聞起來像是醜陋的政治，這真的促使我在兩週內就離開了。<p>所以現在我處於這樣一個奇怪的位置：對前端領域有一些興趣，但沒有足夠的像樣的經驗來真正做一些事情。我有足夠的低級經驗來吸引體面的工作，但很可能要搬遷（除非必要，否則我不想搬遷）。而且，可悲的是，我沒有任何橋樑來連接這兩套技能。<p>我試圖重新進入面試圈，但失敗得很厲害--主要是後端工作。<p>那麼，下一步是什麼？我肯定打算休息一段時間。我想，用一種即將到來的語言完成一些開放源碼的工作可能會很好。也許是在做一些簡單的代碼練習？<p>此外，我已經開始使用一些平臺來尋找更多的工作（即LinkedIn），我發現招聘人員的垃圾郵件是多麼可怕--如果有任何關於更好的招聘網站的建議，我也會非常感激的。\n"
}