{
  "@type": "NewsArticle",
  "identifier": "2022--06--27--en--myfeed--HackerNews--NewsArticle--31897851",
  "url": "https://news.ycombinator.com/item?id=31897851",
  "headline": "DSLR to mirrorless migration – what to buy?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Camera manufacturers seem to be moving at speed from DSLRs to mirrorless. In case of Canon, that means a different lens mount. Since I'll need to use an adapter for my current lenses anyway, it seems like a good time to re-evaluate brands. Some questions after using a Canon 7D:<p>- Is keeping my lenses and moving to a different brand of mirrorless a dumb idea in the first place?<p>- Can EF mount lenses be fully utilised with mirrorless cameras? That is, can I shoot pretty much the same pictures, or am I going to lose significant light/zoom/other?<p>- The raw image format is completely proprietary and only used by Canon. Are any of the other vendors better at making life easier for photo editing programs?<p>- The original firmware is not very flexible. For example, requiring an external device for continuous shooting seems crazy. Magic Lantern[1], as impressive as it is, seems to suck battery and the UI is less friendly than the original. And if I understand correctly Canon is making it harder, not easier, for third party firmware with newer models. Are there any particularly good brands for moddability (without having to be a firmware engineer myself)?<p>- The image quality is decent. Within similar price brackets it seems like most cameras are too similar to be a deal breaker. Is that a reasonable view?<p>- Light sensitivity is not great. I don't like using flash, which means pretty much anything indoors needs to be fully open and slow. Do any brands/cameras stand out in this category?<p>- It works decently as a webcam, except that it outputs a weird format which doesn't include microphone audio. Is this still a problem with mirrorless cameras?<p>[1] https://magiclantern.fm/",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "l0b0",
    "url": "https://news.ycombinator.com/user?id=l0b0"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31897851",
  "sameAs": "https://news.ycombinator.com/item?id=31897851",
  "dateCreated": "2022-06-27T18:34:45.995Z",
  "datePublished": "2022-06-27T17:33:14.000Z",
  "dateModified": "2022-06-27T18:34:45.995Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "单反相机向无反光镜迁移--买什么？\n",
  "headline_zh-Hant": "單反相機向無反光鏡遷移--買什麼？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "相机制造商似乎正在从单反相机向无反光镜快速发展。就佳能而言，这意味着不同的镜头支架。由于我需要为我目前的镜头使用适配器，这似乎是重新评估品牌的好时机。使用佳能7D后的一些问题：<p>- 保留我的镜头并转向不同品牌的无反相机，首先是一个愚蠢的想法吗？<p>- EF卡口镜头可以完全利用无反相机吗？也就是说，我可以拍摄几乎相同的照片，或者我将失去重要的光线/变焦/其他？<p>- 原始图像格式是完全专有的，只有佳能使用。是否有其他供应商在为照片编辑程序提供生活便利方面做得更好？<p>- 原始固件不是很灵活。例如，要求外部设备进行连续拍摄似乎很疯狂。Magic Lantern[1]，虽然令人印象深刻，但似乎很耗电池，而且用户界面不如原来的友好。而且，如果我没有理解错的话，佳能正在使第三方固件在较新的机型上变得更难，而不是更容易。有什么特别好的品牌可供修改（无需自己成为固件工程师）？在类似的价格范围内，似乎大多数相机都太相似了，不能成为交易的障碍。这是一个合理的观点吗？<p>- 感光度不是很好。我不喜欢使用闪光灯，这意味着几乎所有的室内活动都需要完全打开，而且速度要慢。有什么品牌/相机在这一类别中脱颖而出吗？<p>- 它作为网络摄像头工作得不错，只是它输出的格式很奇怪，不包括麦克风音频。这仍然是无反相机的一个问题吗？<p>[1] https://magiclantern.fm/\n",
  "description_zh-Hant": "相機制造商似乎正在從單反相機向無反光鏡快速發展。就佳能而言，這意味著不同的鏡頭支架。由於我需要為我目前的鏡頭使用適配器，這似乎是重新評估品牌的好時機。使用佳能7D後的一些問題：<p>- 保留我的鏡頭並轉向不同品牌的無反相機，首先是一個愚蠢的想法嗎？<p>- EF卡口鏡頭可以完全利用無反相機嗎？也就是說，我可以拍攝幾乎相同的照片，或者我將失去重要的光線/變焦/其他？<p>- 原始圖像格式是完全專有的，只有佳能使用。是否有其他供應商在為照片編輯程序提供生活便利方面做得更好？<p>- 原始固件不是很靈活。例如，要求外部設備進行連續拍攝似乎很瘋狂。Magic Lantern[1]，雖然令人印象深刻，但似乎很耗電池，而且用戶界面不如原來的友好。而且，如果我沒有理解錯的話，佳能正在使第三方固件在較新的機型上變得更難，而不是更容易。有什麼特別好的品牌可供修改（無需自己成為固件工程師）？在類似的價格範圍內，似乎大多數相機都太相似了，不能成為交易的障礙。這是一個合理的觀點嗎？<p>- 感光度不是很好。我不喜歡使用閃光燈，這意味著幾乎所有的室內活動都需要完全打開，而且速度要慢。有什麼品牌/相機在這一類別中脫穎而出嗎？<p>- 它作為網絡攝像頭工作得不錯，只是它輸出的格式很奇怪，不包括麥克風音頻。這仍然是無反相機的一個問題嗎？<p>[1] https://magiclantern.fm/\n"
}