{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--myfeed--ben-werdmuller--NewsArticle--2dc21d1a482f2fad5e2025eec99d56a5",
  "url": "https://werd.io/2022/reading-watching-playing-using-july-2022",
  "headline": "Reading, watching, playing, using: July, 2022",
  "publisher": {
    "@type": "Organization",
    "name": "werd.io",
    "url": "https://werd.io/feed/"
  },
  "description": "<div class=\"e-content entry-content\">\n<p>This is my monthly roundup of the articles I found interesting. Here's my list for July, 2022.</p><h3>Notable Articles</h3><h4>Business</h4><p><a href=\"https://theintercept.com/2022/07/29/bank-of-america-worker-conditions-worse/\">Bank of America Memo: “We Hope” Worker Power Worsens.</a> “A Bank of America executive stated that “we hope” working Americans will lose leverage in the labor market in a recent private memo obtained by The Intercept. Making predictions for clients about the U.S. economy over the next several years, the memo also noted that changes in the percentage of Americans seeking jobs “should help push up the unemployment rate.””</p><p><a href=\"https://www.nytimes.com/2022/07/21/business/amazon-one-medical-deal.html?smtyp=cur&amp;smid=tw-nytimes\">Amazon to Acquire One Medical Clinics in Latest Push Into Health Care.</a> “One Medical, which is based in San Francisco, operates a network of primary care providers that offer in-office and virtual medical services, and is one of the leading competitors to a similar but smaller service Amazon had started to offer.” Exercise for the reader: should end-user healthcare provision be a place where you can make a lot of profit?</p><h4>Climate</h4><p><a href=\"https://grist.org/culture/when-time-is-short-review-timothy-beal-climate-doomer-religion/\">Is accepting the end of humanity the key to climate action? This scholar thinks so.</a> “Accepting that human civilization is finite, he says, will challenge us to change our priorities, from worshiping extraction and growth to uplifting the most marginalized in society.”</p><p><a href=\"https://www.vice.com/en/article/4axwe3/wildfires-are-setting-off-100-year-old-bombs-on-wwi-battlefields\">Wildfires Are Setting Off 100-Year-Old Bombs on WWI Battlefields.</a> “The area where the fire rages was the site of 12 battles during World War I. More than 200,000 people died and untold numbers of explosives were used. It’s a major problem across Europe that lingers to this day. The Royal Air Force and U.S. Army Air Force dropped 2.7 million tons of bombs on Europe during World War II alone. Seventy years later, those bombs are still killing people.”</p><p><a href=\"https://www.protocol.com/bulletins/extreme-heat-weather-noaa-site\">NOAA introduces heat.gov as climate change worsens.</a> “<a class=\"autolink\" href=\"https://Heat.gov\">Heat.gov</a> is geared toward a wide range of decision makers, from companies to local governments to individuals, Spinrad told Protocol, “whether it’s a mom trying to decide whether it’s safe for kids to play outside, or a construction foreman trying to decide if it’s OK for their workers to be out on the job, or a public works manager trying to figure out when road repairs can be undertaken.””</p><p><a href=\"https://grist.org/technology/carbon-removal-business-council-trade-group-launches-with-ethical-oath/\">Carbon removal trade group launches with ‘Hippocratic oath’ for the industry.</a> “The statement is brief, just 15 sentences, and commits signatories to abstract ideals like acting with humility and honesty, being guided by science, and recognizing the value of “including voices from all backgrounds in conversations” about carbon removal.”</p><p><a href=\"https://www.techdirt.com/2022/07/14/north-carolina-republicans-push-bill-forcing-towns-to-destroy-electric-car-chargers/\">North Carolina Republicans Push Bill Forcing Towns To Destroy Electric Car Chargers.</a> “In North Carolina, Trump GOP lawmaker Ben Moss has pushed forward a ridiculous bill (HB 1049) that would require towns and cities use up to $50,000 in taxpayer funds to destroy free electric vehicle stations on public land, if local authorities don’t build free gas and diesel pumps alongside them. There’s, of course, no provision included in the bill that works in the opposite direction.”</p><h4>Covid</h4><p><a href=\"https://www.science.org/doi/10.1126/science.abp8715\">The Huanan Seafood Wholesale Market in Wuhan was the early epicenter of the COVID-19 pandemic.</a> “While there is insufficient evidence to define upstream events, and exact circumstances remain obscure, our analyses indicate that the emergence of SARS-CoV-2 occurred via the live wildlife trade in China, and show that the Huanan market was the epicenter of the COVID-19 pandemic.”</p><p><a href=\"https://19thnews.org/2022/07/covid-surge-nursing-home-residents-aarp/\">COVID cases and deaths are spiking in nursing homes, AARP data shows.</a> “One in 35 nursing home residents tested positive for COVID-19 in June, a 27 percent increase from the previous month. The death rate from COVID between May and June of this year nearly doubled, from 0.04 deaths per hundred residents to 0.07 deaths per hundred residents.”</p><h4>Crypto</h4><p><a href=\"https://venturebeat.com/2022/07/29/web3-the-hope-for-protocols-over-platforms/\">Web3: The hope for protocols over platforms.</a> “Let’s experiment in ways that let us slowly deconstruct platforms, by replacing some of the core primitives that they own with open protocols that are collectively owned and governed by their own communities.”</p><p><a href=\"https://ez.substack.com/p/the-consequences-of-silence\">The Consequences of Silence.</a> On the Celsius freeze: “My entire business is secured and backed by these funds. If they are not returned, my business would go bankrupt, my 15 employees would be let go, and 14 years of my life’s work lost and at the age of 49 years old, I would have to start over with nothing.” “Having my funds frozen has been devastating to me and my family both financially, mentally, and physically. I cannot sleep most nights and am over-whelmed with worry and dread for my family’s future. I have two small children. A 3-year-old daughter and a 2-year-old son. I am the sole bread winner for my family, and I pride myself on making smart financial and parental decisions for them to provide a better life and a bright/positive future.”</p><p><a href=\"https://www.esquire.com/entertainment/books/a40654712/crypto-books-future/\">How Crypto Is Evolving the Future of Books and Publishing.</a> ““Imagine when all of an author’s readers can suddenly make money as well,” says Margarita Guerrero, head of partner and publishing relations at the publishing startup Readl. “How much more would they be engaged?”” Seems like a complete misunderstanding of why people like books to me.</p><p><a href=\"https://startupstrats.substack.com/p/lost-at-opensea?utm_source=email\">Lost at OpenSea.</a> “Like social audio, NFTs were a pandemic fad. This fad, however, was aimed at allowing kids who were too young to buy bitcoin when it first launched to pretend to be savvy investors. The results, when the market crashes further, will be catastrophic.”</p><p><a href=\"https://www.coppolacomment.com/2022/07/the-sinking-of-voyager.html\">The sinking of Voyager.</a> “I have no problem with a hedge fund lending only to seven counterparties, if it is lending its own funds or those of professional investors who understand the risks they are taking. But Voyager marketed high-risk investments to retail depositors with promises of safety and (non-existent) insurance. To my mind, this isn’t just bad, it is criminal. But crypto is an unregulated, borderless space. Even if Voyager has lied to its customers and embezzled their funds, it is unclear what if any power national authorities have to hold it to account. And even though there will undoubtedly be a forest of lawsuits, the money is gone.”</p><p><a href=\"https://www.ft.com/content/47d338e2-3d3c-40ce-8a09-abfa25c16a7f\">Crypto collapse reverberates widely among black American investors.</a> “A quarter of black American investors owned cryptocurrencies at the start of the year, compared with only 15 per cent of white investors, according to a survey by Ariel Investments and Charles Schwab. Black Americans were more than twice as likely to purchase cryptocurrency as their first investment. The value of those investments has imploded. The total market capitalisation of cryptocurrencies has plunged below $1tn from more than $3.2tn last year. The fall in digital assets comes alongside a bear market in US stocks.”</p><h4>Culture</h4><p><a href=\"https://www.atlasobscura.com/articles/hot-air-balloon-restaurant\">Aboard the World's First Hot-Air Balloon Restaurant.</a> “During the flight, Schmeinck serves wine and gives more information about her dishes. Standing-room only encourages interactions between the chef, pilot, and other diners as the balloon sails above the countryside, taking in the view from a cruising altitude that ranges 500 to 2,500 feet. “Sometimes when the clouds are low, we can go right through them,” says Schmeinck. “It’s a little bit misty. Then we’re above the clouds and see the sun shining. That moment is unforgettable. It’s amazing for me, after all these years.”” Bucket list.</p><p><a href=\"https://www.atlasobscura.com/articles/what-is-horse-bread\">For Centuries, English Bakers' Biggest Customers Were Horses.</a> “But in pre-industrial England, horse bread carried the taste of shame. The dark bran bread sat at the bottom of a hierarchy that gave brown bread to farmers and servants and reserved white bread for the elite. Indeed, Englishpeople turned to horse bread during times of strife, and the abject poor likely ate it year round. And since horse bread was fed to laboring animals, humans who ate it were looked upon with disdain.”</p><p><a href=\"https://www.nytimes.com/2022/07/28/arts/television/neighbours-end.html\">After 37 Years, the Sunny World of ‘Neighbours’ Comes to an End.</a> “At that time, the world of “Neighbours” offered an antidote to the contentious impact of conservative, Thatcherite legislation in Britain, Carr said, which supported “do it yourself” economic policies that its opponents said widened inequality. “Neighbours” offered “a different, wildly positive vision of what a community could be,” Carr said. “Everyone tends to work together rather than be adversarial.”” As a kid, I loved it.</p><p><a href=\"https://electricliterature.com/announcing-the-shortlist-for-the-inaugural-ursula-k-le-guin-fiction-prize/\">Announcing the Shortlist for the Inaugural Ursula K. Le Guin Prize for Fiction.</a> “The nine shortlisted books will be considered by a panel of five jurors—adrienne maree brown, Becky Chambers, Molly Gloss, David Mitchell, and Luis Alberto Urrea. The winner will be announced later this year on October 21st, 2022, Ursula K. Le Guin’s birthday.”</p><p><a href=\"https://www.tor.com/2022/07/25/erotica-author-chuck-tingle-has-some-of-the-best-writing-advice/\">Erotica Author Chuck Tingle Has Some of the Best Writing Advice.</a> “Having spent the last few days with Tingle’s voice in my head, the only way I can describe the experience is that it feels like the sun has come out after days of rain. To have a voice that is relentlessly upbeat and positive, telling me I can do anything I try to, and that my best efforts will be enough? It’s like my brain was just, I don’t know, pressure washed?”</p><p><a href=\"https://librarianshipwreck.wordpress.com/2022/07/26/all-white-supremacist-capitalist-patriarchy-is-local/\">All [White Supremacist Capitalist Patriarchy] is Local.</a> Words of warning from Librarian Shipwreck: “What about books banned for depicting people of color and queers in a positive light, providing accurate information about health and sexuality, or for acknowledging the truth about American history? Bills (that thankfully didn’t pass) to fine and jail librarians for “obscene” (read: queer, comprehensive sex education, anatomy) books? Or librarians being told they can’t help patrons find information about abortion, or even say the word?”</p><p><a href=\"https://www.inquirer.com/food/james-beard-award-cristina-martinez-barbacoa-20220613.html\">James Beard Awards 2022: Cristina Martinez brings the best Mid-Atlantic chef prize to Philadelphia.</a> “Chef Cristina Martinez, an advocate for immigrants’ rights and an undocumented immigrant herself, was named the best chef for the Mid-Atlantic region Monday by the James Beard Foundation, in its first black-tie ceremony since 2019.” I just ate at South Philly Barbacoa and it was fantastic.</p><p><a href=\"https://winnielim.org/journal/representation-matters/\">representation matters.</a> Winne Lim’s blog is one of the best things I read. This is a great example of why.</p><p><a href=\"https://www.thejc.com/news/world/netflix-criticised-for-shooting-stranger-things-in-nazi-prison-and-marketing-it-as-hotel-2HR0uEe1q63xzItO8xkc23\">Netflix criticised for shooting Stranger Things in Nazi prison and marketing it as hotel.</a> “Internet streaming giant Netflix and hit show Stranger Things are facing criticism for shooting part of its new season in an infamous Lithuanian concentration camp and making plans to convert the site into a hotel in collaboration with Airbnb.” Combined with it resharing photos of serial number tattoos fans are getting on their wrists, it’s not a great look, to say the least.</p><p><a href=\"https://twitter.com/Azure_Husky/status/1420177932518137862\">Unknown Number by Azure.</a> A beautifully-written story told through text messages and published as a Twitter thread. Now nominated for a Hugo.</p><p><a href=\"https://www.theatlantic.com/ideas/archive/2022/07/top-gun-maverick-tom-cruise-us-military/661472/\">Hell Yeah, Tom Cruise.</a> “So, 45 seconds in, I realized what Top Gun really was: propaganda. Never again tell me you can’t make a conservative movie in Hollywood. After its release there was a 500 percent increase in applications to the Navy’s flight program.”</p><h4>Democracy</h4><p><a href=\"https://www.techdirt.com/2022/07/29/san-francisco-mayor-wants-pd-to-be-able-to-commandeer-cameras-owned-by-residents-because-reasons/\">San Francisco Mayor Wants PD To Be Able To Commandeer Cameras Owned By Residents Because Reasons.</a> “Having dumped its “progressive” District Attorney, Chesa Boudin, the city of San Francisco has decided it’s going to be far more Dirty Harry in the future. The alleged justification is (perhaps temporary and anomalous) increases in crime. It’s time to run roughshod over constitutional rights again.”</p><p><a href=\"https://popular.info/p/a-radical-attack-on-the-first-amendment\">A radical attack on the First Amendment.</a> “Prohibited topics include endorsing the concepts of white privilege or male privilege. Specifically, employers cannot conduct trainings that state an individual can be “privileged” or “oppressed” due to their “race, color, sex, or national origin.” Further, trainings cannot suggest that anyone should “feel guilt, anguish, or other forms of psychological distress because of actions, in which the individual played no part, committed in the past by other members of the same race, color, sex, or national origin.””</p><p><a href=\"https://popular.info/p/the-billionaires-buying-the-midterm?utm_source=email\">The billionaires buying the midterm elections.</a> “The largest donor to the main Republican super PACs is billionaire Ken Griffin, owner of Citadel, a hedge fund. Griffin donated $28.5 million to the SLF and CLF through the end of March. In a 2012 interview, Griffin was asked if “the ultrawealthy have an inordinate or inappropriate amount of influence on the political process.” “I think they actually have an insufficient influence,” he replied.”</p><p><a href=\"https://19thnews.org/2022/07/arizona-election-official-leslie-hoffman/\">‘There are a lot of people who don’t want to know the truth’: Why an Arizona election official is leaving her job.</a> “The impact of lies about America’s most secure election is still taking shape around the country but has included harassment and threats of violence aimed at a women-led workforce. A survey of election workers conducted by the Brennan Center for Justice earlier this year showed 30 percent of poll respondents said they knew of one or more elec­tion work­ers who had left their jobs at least in part because of fear for their safety, increased threats or intim­id­a­tion. Twenty percent said they planned to leave before the 2024 elec­tion.”</p><p><a href=\"https://www.azcentral.com/story/news/local/arizona/2022/07/14/arizona-cities-would-collapse-without-prison-labor/10062910002/\">Correction director: Arizona cities would collapse without prison labor.</a> “There are services that this department provides to city, county, local jurisdictions, that simply can’t be quantified at a rate that most jurisdictions could ever afford. If you were to remove these folks from that equation, things would collapse in many of your counties, for your constituents.” The 13th Amendment abolished slavery except for people convicted of crimes. And here we are.</p><p><a href=\"https://www.propublica.org/article/vallejo-police-killing-investigations\">The City Where Investigations of Police Take So Long, Officers Kill Again Before Reviews Are Done.</a> “Now, Open Vallejo and ProPublica have looked at what happens inside the department after those killings occur, examining more than 15,000 pages of police, forensic, and court files related to the city’s 17 fatal police shootings since 2011. Based on records that emerged after dozens of public records requests and two lawsuits filed by Open Vallejo, the news organizations found a pattern of delayed and incomplete investigations, with dire consequences.” Remarkable reporting.</p><p><a href=\"https://19thnews.org/2022/07/indiana-doctor-performed-abortion-for-a-10-year-old-girl-document-shows/\">Indiana doctor performed abortion for a 10-year-old girl, document shows.</a> “For the past two weeks, the veracity of a story of a 10-year-old girl who was raped and got an abortion has been debated in the media. But a document reviewed by The 19th shows that the Indiana physician who performed the abortion submitted record of it to the Indiana Department of Health and the Department of Child Services.”</p><p><a href=\"https://19thnews.org/2022/07/pharmacies-birth-control-prescriptions-emergency-contraception/\">Pharmacies can’t deny prescription birth control or emergency contraception, HHS says.</a> “Pharmacists cannot deny people prescribed medication — including hormonal birth control or emergency contraception — because those people are pregnant or might become pregnant, per new guidance from the Biden administration.”</p><p><a href=\"https://www.azmirror.com/2022/03/17/republican-backed-measure-to-restrict-filming-of-police-officers-passes-senate-committee/\">Republican-backed measure to restrict filming of police officers passes Senate committee.</a> ““We believe that this bill stacks the deck against the public check on officer misconduct,” Timothy Sparling, a lawyer and legislative advocate for Arizona Attorneys for Criminal Justice, said during a Senate Judiciary Committee hearing on Tuesday.”</p><p><a href=\"https://news.bloomberglaw.com/health-law-and-business/biden-team-rejected-emergency-declaration-over-roe-decision?context=search&amp;index=0\">Biden Team Rejected Emergency Declaration Over Roe Decision.</a> “The Biden administration considered declaring a public health emergency to preserve broad access to abortion services following the US Supreme Court’s decision last month to overturn Roe v. Wade, but officials ultimately decided against the move, according to people familiar with the matter.”</p><p><a href=\"https://19thnews.org/2022/07/biden-executive-order-abortion/\">Biden to sign executive order on abortion access, legal backing, privacy.</a> “The executive order will direct the White House counsel and the U.S. attorney general to coordinate volunteer lawyers who will defend patients and medical providers facing state-based charges for “lawfully seeking or offering reproductive health care services throughout the country.” Those lawyers could, the White House suggested, defend people who are prosecuted for traveling from a state that has banned abortion to one where it remains legal.”</p><p><a href=\"https://www.washingtonpost.com/magazine/2022/03/08/they-are-preparing-war-an-expert-civil-wars-discusses-where-political-extremists-are-taking-this-country/\">‘They are preparing for war’: An expert on civil wars discusses where political extremists are taking this country.</a> “That’s when I started to follow the data. And then, watching what happened to the Republican Party really was the bigger surprise — that, wow, they’re doubling down on this almost white supremacist strategy. That’s a losing strategy in a democracy. So why would they do that? Okay, it’s worked for them since the ’60s and ’70s, but you can’t turn back demographics. And then I was like, Oh my gosh. The only way this is a winning strategy is if you begin to weaken the institutions; this is the pattern we see in other countries. And, as an American citizen I’m like, These two factors are emerging here, and people don’t know.”</p><p><a href=\"https://www.rollingstone.com/politics/politics-features/roe-supreme-court-justices-1378046/\">Supreme Court Justices 'Prayed With' Anti-Roe Activist Before Ruling.</a> “At an evangelical victory party in front of the Supreme Court to celebrate the downfall of Roe v. Wade last week, a prominent Capitol Hill religious leader was caught on a hot mic making a bombshell claim: that she prays with sitting justices inside the high court. “We’re the only people who do that,” Peggy Nienaber said. […] In other words: Sitting Supreme Court justices have prayed together with evangelical leaders whose bosses were bringing cases and arguments before the high court.”</p><p><a href=\"https://www.nytimes.com/2022/07/05/opinion/dobbs-christian-nationalism.html\">Christian Nationalists Are Excited About What Comes Next.</a> “It is also a mistake to imagine that Christian nationalism is a social movement arising from the grassroots and aiming to satisfy the real needs of its base. It isn’t. This is a leader-driven movement. The leaders set the agenda, and their main goals are power and access to public money. They aren’t serving the interests of their base; they are exploiting their base as a means of exploiting the rest of us.”</p><p><a href=\"https://www.salon.com/2021/06/23/desantis-signs-bill-requiring-florida-students-professors-to-register-political-views-with-state/\">DeSantis signs bill requiring Florida students, professors to register political views with state.</a> “Public universities in Florida will be required to survey both faculty and students on their political beliefs and viewpoints, with the institutions at risk of losing their funding if the responses are not satisfactory to the state’s Republican-led legislature. […] Based on the bill’s language, survey responses will not necessarily be anonymous — sparking worries among many professors and other university staff that they may be targeted, held back in their careers or even fired for their beliefs.”</p><p><a href=\"https://www.theatlantic.com/ideas/archive/2022/07/mitt-romney-republican-denial-biden-election/661468/\">Mitt Romney: America Is In Denial.</a> “I hope for a president who can rise above the din to unite us behind the truth. Several contenders with experience and smarts stand in the wings.” I wonder who he means.</p><p><a href=\"https://19thnews.org/2022/07/florida-dont-say-gay-other-anti-lgbtq-bills-take-effect/\">Florida's 'Don't Say Gay' bill isn't the only anti-LGBTQ+ bill taking effect today.</a> “Collectively, the bills build toward an atmosphere of silence around LGBTQ+ people and restrict how LGBTQ+ youth can learn about themselves and participate at school, advocates say.”</p><p><a href=\"https://www.vice.com/en/article/qjkpa7/students-fear-going-to-college-in-red-states-after-roe\">‘It’s Scary’: Students Fear Going to College in Red States After Roe.</a> “After the overturning of Roe, millions of college students found themselves attending institutions where they would no longer have access to certain types of reproductive healthcare. Now, students who had committed to attending colleges or universities in majority conservative states are rethinking their decisions. Meanwhile, rising high school seniors say they now have something new to consider when compiling their lists of prospective schools: the access and right to an abortion.”</p><h4>Media</h4><p><a href=\"https://www.axios.com/2022/07/28/meta-publishers-news-funding-cut\">Meta officially cuts funding for U.S. news publishers.</a> “As the company moves forward with sweeping changes to the Facebook experience, news has become less of a priority.”</p><p><a href=\"https://www.scientificamerican.com/article/how-florence-nightingale-changed-data-visualization-forever/\">How Florence Nightingale Changed Data Visualization Forever.</a> “Recognizing that few people actually read statistical tables, Nightingale and her team designed graphics to attract attention and engage readers in ways that other media could not. Their diagram designs evolved over two batches of publications, giving them opportunities to react to the efforts of other parties also jockeying for influence. […] The reforms Nightingale fought for […] would be driving forces—along with the development of vaccines that conferred immunity to diseases and artificial fertilizer that boosted crop yields—in doubling the average human life span during the following century.”</p><p><a href=\"https://www.timeout.com/news/edinburgh-is-officially-the-best-city-in-the-world-in-2022-071222\">Edinburgh is the Best City in the World in 2022, According to Time Out Index.</a> “The Scottish capital scored high across the board, and performed exceptionally high for walkability (93 percent) and being ‘easy to express who you are’ (88 percent) – better than basically everywhere else in the world. It also scored 95 percent for being beautiful – and with an ancient castle slap-bang in the city centre and loads of green space, it’s hard to argue with that.” I miss it!</p><p><a href=\"https://19thnews.org/2022/07/tiktok-influencer-abortion-rights-sponsored-content/\">Influencers take to TikTok for abortion-related paid partnerships.</a> “The company decided to use its entire influencer marketing budget for May 15 to July 15 on sponsored content on TikTok, asking influencers and micro-influencers on the platform to talk about what overturning Roe could mean for people’s access to health care. Favor declined to share the total dollar amount spent on influencer marketing during this period.”</p><p><a href=\"https://micahsifry.medium.com/the-knight-foundation-is-betraying-its-mission-302d5d496c53\">The Knight Foundation is Betraying its Mission.</a> “By sponsoring a journalism event featuring Tucker Carlson, the philanthropy is mistaking openness for strengthening democracy.”</p><p><a href=\"https://www.insider.com/wisconsin-school-district-book-japanese-american-incarceration-throughout-wwii-2022-6\">Wisconsin School District Bans Book on Japanese-American WWII Internment.</a> “Ann Zielke, a parent of a student in the district, told NBC News that School Board Vice President Terri Boyer claimed the book offered an “unbalanced” account of historical events. “What she said to me was that we actually need an ‘American’ perspective,’” Zielke said, adding that the people in the internment camps were Americans.”</p><p><a href=\"https://inews.co.uk/news/media/when-truth-is-another-casualty-why-ukraine-is-losing-ground-in-the-war-by-not-telling-the-whole-story-1720772?fbclid=IwAR30n7ZsNubqtcpHTR5laG8OYEUU3Ht5ZTKH0a4yrpFLDQWMDtNie-BhrDA\">When truth is another casualty: Why Ukraine is losing ground in the war by not telling the whole story.</a> “John Mair, co-editor of the book, says we should not confuse the proximity of this war with ease of access to information, saying: “The challenge for British journalists… is not just safety but keeping the right side of the so far invisible Ukrainian censorship machine.””</p><h4>Science</h4><p><a href=\"https://www.dailykos.com/story/2022/7/22/2111914/-Two-decades-of-Alzheimer-s-research-may-be-based-on-deliberate-fraud-that-has-cost-millions-of-lives\">Two decades of Alzheimer's research may be based on deliberate fraud that has cost millions of lives.</a> “[…] it looks like the original paper that established the amyloid plaque model as the foundation of Alzheimer’s research over the last 16 years might not just be wrong, but a deliberate fraud.”</p><p><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7156656/?fbclid=IwAR1fssaXb4HloLf_k-d0opO_ZMGXrtEw31CP_uJ-c4zbJSra0Fvb7cph0vc\">Habitual use of GPS negatively impacts spatial memory during self-guided navigation .</a> “Although the longitudinal sample was small, we observed an important effect of GPS use over time, whereby greater GPS use since initial testing was associated with a steeper decline in hippocampal-dependent spatial memory.” Using GPS regularly makes you worse at finding your own way to places shocker.</p><h4>Society</h4><p><a href=\"https://19thnews.org/2022/07/kamala-harris-blue-suit-ada-anniversary/\">Vice President Kamala Harris was criticized for using visual descriptors. Why?</a> “The ongoing dustup over Vice President Kamala Harris describing herself during a meeting with disability rights leaders this week is much ado about an increasingly common practice and a distraction from the substance of the gathering, advocates say.”</p><p><a href=\"https://www.newstatesman.com/society/2022/07/exclusive-should-class-snobbery-be-banned\">Should class snobbery be banned under the Equality Act?</a> “One experiment cited in the report found teachers “give grades according to class”, explained Rickett. “When the pieces of work were identical, they’d give lower marks to children perceived to be working class.””</p><p><a href=\"https://www.reuters.com/world/us/exclusive-hyundai-subsidiary-has-used-child-labor-alabama-factory-2022-07-22/\">Hyundai subsidiary has used child labor at Alabama factory.</a> “A subsidiary of Hyundai Motor Co has used child labor at a plant that supplies parts for the Korean carmaker’s assembly line in nearby Montgomery, Alabama, according to area police, the family of three underage workers, and eight former and current employees of the factory.”</p><p><a href=\"https://www.nytimes.com/2022/07/15/opinion/doctors-roe-v-wade-ohio-10-year-old.html\">Dr. Caitlin Bernard Was Meant to Write This With Me Before She Was Attacked for Doing Her Job.</a> “On Wednesday night, our state’s attorney general said his office would be investigating Dr. Bernard. So I’m writing this essay myself, not only to bring attention to the chilling effect on medicine we’re seeing at this moment — but also because I’m terrified that I or any one of our colleagues could soon face what Dr. Bernard is going through after delivering care to our patients.”</p><p><a href=\"https://www.inquirer.com/news/inq2/more-perfect-union-maternal-morbidity-philadelphia-medicine-history-racism-20220712.html\">Philadelphia created American obstetrics. Black women were exploited from the start.</a> “America’s maternal mortality crisis traces back to Philadelphia, home to the nation’s first delivery wards. From the start, Black people received unequal treatment and were exploited for science.”</p><p><a href=\"https://www.damemagazine.com/2022/07/06/pet-rent-is-the-newest-tool-of-housing-discrimination/\">Pet Rent Is the Newest Tool of Housing Discrimination.</a> “To no one’s surprise, the burden falls heaviest on those least able to bear it. In a recent paper, “Pet Friendly For Whom?” Jennifer W. Applebaum, a Ph.D candidate at the University of Florida and data researcher Kevin Horecka, Ph.D., reported the results of their survey of pet friendly housing across Texas. The conclusion was stark: “Low-income communities and communities of color were more likely than higher income and predominantly white communities to pay disproportionately higher fees to keep pets in their homes.””</p><p><a href=\"https://forward.com/news/508979/highland-park-shooter-visited-chabad-this-year-synagogue-crimo-july-4/\">Security director: Suspect in July 4 Highland Park shooting was ‘sizing up’ synagogue.</a> “Authorities have not yet attributed a motive to the shooting that killed seven and injured dozens at a Fourth of July parade. Highland Park has a significant Jewish population and is home to several other synagogues and Jewish institutions.”</p><p><a href=\"https://19thnews.org/2022/07/abortion-transgender-men-nonbinary-reproductive-rights/\">Abuse, discrimination, exclusion: Transgender men explain domino effect of losing reproductive care post-Roe.</a> “The 2015 U.S. Trans Survey found that nonbinary people and trans men report being sexually assaulted at a higher rate than other LGBTQ+ people. Fifty-one percent of trans men and 55 percent of nonbinary people out of over 27,000 respondents said they had been assaulted in their lifetime. […] “It’s just become a pure rape culture out there for trans men in particular. This law will be horrific.””</p><p><a href=\"https://www.nytimes.com/2022/07/02/us/jayland-walker-akron-police-shooting.html\">Akron Police Officers Placed on Leave After Fatal Shooting of Jayland Walker.</a> “A lawyer for the family of Mr. Walker said the footage shows that he was running away, unarmed, when police officers fired at him more than 90 times. The lawyer, Bobby DiCello, reviewed footage of the shooting on Thursday. His legal team also visited the medical examiner’s office on Friday and reviewed the autopsy, which has not been finalized. Mr. DiCello said it showed that Mr. Walker had been struck at least 60 times.”</p><p><a href=\"https://apnews.com/article/science-health-education-california-5197d3c602b0497d60c15d0bae20ad94\">California late start law aims to make school less of a yawn.</a> “Beginning this fall high schools in the nation’s most populous state can’t start before 8:30 a.m. and middle schools can’t start before 8 a.m. under a 2019 first-in-the-nation law forbidding earlier start times. Similar proposals are before lawmakers in New Jersey and Massachusetts.” This is a big deal. I can’t believe they were making teenagers go to school before 8am.</p><h4>Technology</h4><p><a href=\"https://themarkup.org/the-breakdown/2022/07/27/who-is-collecting-data-from-your-car\">Who Is Collecting Data from Your Car?</a> “The Markup has identified 37 companies that are part of the rapidly growing connected vehicle data industry that seeks to monetize such data in an environment with few regulations governing its sale or use.”</p><p><a href=\"https://19thnews.org/2022/07/abortion-access-activists-google-keywords-seo/\">Abortion rights supporters are trying to reduce barriers to access through search keywords.</a> “Anti-abortion activists have long dominated the online search strategy game, driving traffic to crisis pregnancy centers. Post-Roe, that’s starting to change.”</p><p><a href=\"https://www.lawfareblog.com/open-source-security-how-digital-infrastructure-built-house-cards\">Open-Source Security: How Digital Infrastructure Is Built on a House of Cards.</a> “As is characteristic of public goods, market participants lack incentives to correct this inefficiency. Companies can profit from open source without expending any resources to improve it. Psychologists call this the bystander effect. When multiple parties have the capacity to solve a problem, each individual party feels less responsibility to take action. Although securing this public good is in every company’s self-interest, very few companies want to be the ones to take on that burden. There is little reason to think the market will correct itself without intervention.”</p><p><a href=\"https://www.axios.com/2022/07/25/sunset-social-network-facebook-tiktok\">Facebook's TikTok-like redesign marks sunset of social networking era.</a> “The leadership of Meta and Facebook now views the entire machine of Facebook’s social network as a legacy operation. They aim to keep cranking it to generate the cash they need to subsidize their decade-long plan to build the metaverse — where, maybe, social networking will be reborn in a 3D interface.”</p><p><a href=\"https://lawprofessors.typepad.com/business_law/2022/07/the-entire-world-is-about-to-get-a-lesson-in-revlon.html\">The entire world is about to get a lesson in Revlon.</a> “I claim no insight into the personal feelings of the board members, their fears, their hopes, their dreams, but their legal obligation here is to maximize stockholder wealth, and though they could, consistent with those duties, decide that in the long term Twitter is more valuable as a standalone company than the $44 billion Musk agreed to pay right now, that seems … unlikely … and so their legal obligation is to pursue that $44 billion. And if investors can win in a courtroom, there is absolutely a benefit to fighting with Musk about it. The $1 billion dollar break fee won’t begin to compensate the company for the damage Musk has done, but more importantly, $1 billion is less than $44 billion.”</p><p><a href=\"https://www.theverge.com/2022/7/14/23219419/amazon-ring-law-enforcement-no-warrant-no-consent\">Today I learned Amazon has a form so police can get my data without permission or a warrant.</a> “Here is something I didn’t know when I purchased Amazon Ring cameras and Amazon Echo Dots: there is a webpage where law enforcement can fill out a form, say there’s a life-threatening emergency, and get access to your data without your consent, a court order, or any kind of warrant. There’s nothing in the Terms of Service about this, and the company has maintained for years that it helps police get consent first, but it’s happening anyhow.”</p><p><a href=\"https://restofworld.org/2022/uber-files-rest-of-world/\">“We’re just fucking illegal”: Uber Files reveal a pattern of shady behavior around the world.</a> “The documents lay out how the company’s deep pockets during this era — Uber’s lobbying and PR budget was $90 million in 2016 alone — was used to secretly influence politicians, oligarchs, and regulators around the world, and even sometimes break local laws. Dozens of stories about the contents of the leak have been published since the documents surfaced. Rest of World compiled the most glaring findings from the leak concerning Uber’s operations in non-Western countries, including South Africa, India, Nigeria, and Russia.”</p><p><a href=\"https://www.techdirt.com/2022/07/15/microsoft-mapped-broadband-affordability-gaps-because-the-u-s-government-couldnt-be-bothered-to/\">Microsoft Mapped Broadband Affordability Gaps Because The U.S. Government Couldn’t Be Bothered To.</a> “The FCC’s maps historically also haven’t been willing to map broadband prices and affordability. To that end, the NTIA has been doing some good work trying to illustrate broadband affordability gaps, again caused by regional monopolization. As has Microsoft, which, last week, offered an updated look at digital equity, a measurement that heavily integrates broadband availability and affordability.” Click through to the dashboard, which is illuminating.</p><p><a href=\"https://webdevlaw.uk/2022/07/15/the-week-the-open-web-won/\">The week the open web won.</a> “I want to address a few suggestions that have been made to me implying that my recent blogging had been the final shove which yeeted this Bill over the edge. […] I’m just…well, me. A random and rapidly ageing Scottish woman with a vegetable garden, albeit a woman who has been Extremely Online since 1994 and Extremely Perturbed by this Bill since 2019, blogging in a personal capacity, in my spare time, 400 miles away from the centre of power.”</p><p><a href=\"https://www.wired.com/story/web-deanonymization-side-channel-attack-njit/?redirectURL=/story/web-deanonymization-side-channel-attack-njit/\">A New Attack Can Unmask Anonymous Users on Any Major Browser.</a> “When you visit a website, the page can capture your IP address, but this doesn’t necessarily give the site owner enough information to individually identify you. Instead, the hack analyzes subtle features of a potential target’s browser activity to determine whether they are logged into an account for an array of services, from YouTube and Dropbox to Twitter, Facebook, TikTok, and more. Plus the attacks work against every major browser, including the anonymity-focused Tor Browser.”</p><p><a href=\"https://www-politico-eu.cdn.ampproject.org/c/s/www.politico.eu/article/europe-faces-facebook-blackout-instagram-meta-data-protection/amp/\">Europe faces Facebook blackout.</a> “The Irish Data Protection Commission on Thursday informed its counterparts in Europe that it will block Facebook-owner Meta from sending user data from Europe to the U.S.”</p><p><a href=\"https://www.brookings.edu/techstream/how-china-uses-search-engines-to-spread-propaganda/\">How China uses search engines to spread propaganda.</a> “[…] as authoritarian states like China increasingly use online platforms to disseminate narratives aimed at weakening their democratic competitors, these search engines represent a crucial battleground in their information war with rivals. For Beijing, search engines represent a key—and underappreciated vector—to spread propaganda to audiences around the world.”</p><p><a href=\"https://www.wsj.com/articles/vast-cache-of-chinese-police-files-offered-for-sale-in-alleged-hack-11656940488\">Vast Cache of Chinese Police Files Offered for Sale in Alleged Hack.</a> “A vast trove of data on Chinese citizens allegedly siphoned from a police database, some of which checks out as legitimate, is being offered for sale by an anonymous hacker or hacking group. If confirmed, it would mark one of history’s largest leaks of personal data.”</p><p><a href=\"https://time.com/6193231/facebook-crack-whip-black-whistleblower/\">Facebook Asks Judge to 'Crack the Whip' in Attempt to Silence a Black Whistleblower.</a> “He was fired by Facebook’s outsourcing partner, Sama, in 2019 after he led more than 100 of his colleagues in a unionization effort for better pay and working conditions. He suffers from post-traumatic stress disorder as a result of his work, and is now suing both Meta and Sama in a Nairobi court, alleging that he and his former colleagues are victims of forced labor, human trafficking and union-busting.”</p><p><a href=\"https://www.protocol.com/bulletins/google-delete-health-clinic-data\">Google will start auto-deleting health clinic location data.</a> “Jen Fitzpatrick, SVP of Core Systems at Google, wrote in a blog post that the company will start deleting visit data from facilities like abortion clinics, fertility centers, counseling centers, domestic violence shelters, addiction treatment facilities and weight loss clinics “soon after” the visits take place when its system identifies that a visit has taken place.”</p><p><a href=\"https://ssir.org/articles/entry/the_good_web\">Social Media Can Be Reimagined for the Good of Society.</a> “Yet what well-meaning regulatory proposals lack is a vision of social media that could be good for society. At best, these regulatory approaches seek to make existing social media less awful. But an emerging movement that we might call “the Good Web” envisions the possibility of social media that has a salutary role in a public sphere. What’s less clear is which of several dueling visions of the Good Web might lead us to a healthy social media environment.”</p></div>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Ben Werdmüller",
    "url": "https://werd.io/feed/"
  },
  "discussionUrl": "https://werd.io/2022/reading-watching-playing-using-july-2022",
  "sameAs": "https://werd.io/2022/reading-watching-playing-using-july-2022",
  "dateCreated": "2022-07-31T15:26:23.959Z",
  "datePublished": "2022-07-31T15:18:09.000Z",
  "dateModified": "2022-07-31T15:26:23.959Z",
  "interactionStatistic": [],
  "headline_zh-Hans": "阅读、观看、玩耍、使用。7月，2022年\n",
  "headline_zh-Hant": "閱讀、觀看、玩耍、使用。7月，2022年\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<div class=\"e-content entry-content\">\n<p>This is my monthly roundup of the articles I found interesting. Here's my list for July, 2022.</p><h3>Notable Articles</h3><h4>Business</h4><p><a href=\"https://theintercept.com/2022/07/29/bank-of-america-worker-conditions-worse/\">Bank of America Memo: “We Hope” Worker Power Worsens.</a> “A Bank of America executive stated that “we hope” working Americans will lose leverage in the labor market in a recent private memo obtained by The Intercept. Making predictions for clients about the U.S. economy over the next several years, the memo also noted that changes in the percentage of Americans seeking jobs “should help push up the unemployment rate.””</p><p><a href=\"https://www.nytimes.com/2022/07/21/business/amazon-one-medical-deal.html? smtyp=cur&amp;smid=tw-nytimes\">Amazon to Acquire One Medical Clinics in Latest Push Into Health Care.</a> “One Medical, which is based in San Francisco, operates a network of primary care providers that offer in-office and virtual medical services, and is one of the leading competitors to a similar but smaller service Amazon had started to offer.” Exercise for the reader: should end-user healthcare provision be a place where you can make a lot of profit?</p><h4>Climate</h4><p><a href=\"https://grist.org/culture/when-time-is-short-review-timothy-beal-climate-doomer-religion/\">Is accepting the end of humanity the key to climate action? This scholar thinks so.</a> “Accepting that human civilization is finite, he says, will challenge us to change our priorities, from worshiping extraction and growth to uplifting the most marginalized in society.”</p><p><a href=\"https://www.vice.com/en/article/4axwe3/wildfires-are-setting-off-100-year-old-bombs-on-wwi-battlefields\">Wildfires Are Setting Off 100-Year-Old Bombs on WWI Battlefields.</a> “The area where the fire rages was the site of 12 battles during World War I. More than 200,000 people died and untold numbers of explosives were used. It’s a major problem across Europe that lingers to this day. The Royal Air Force and U.S. Army Air Force dropped 2.7 million tons of bombs on Europe during World War II alone. Seventy years later, those bombs are still killing people.”</p><p><a href=\"https://www.protocol.com/bulletins/extreme-heat-weather-noaa-site\">NOAA introduces heat.gov as climate change worsens.</a> “<a class=\"autolink\" href=\"https://Heat.gov\">Heat. gov</a> is geared toward a wide range of decision makers, from companies to local governments to individuals, Spinrad told Protocol, “whether it’s a mom trying to decide whether it’s safe for kids to play outside, or a construction foreman trying to decide if it’s OK for their workers to be out on the job, or a public works manager trying to figure out when road repairs can be undertaken.””</p><p><a href=\"https://grist.org/technology/carbon-removal-business-council-trade-group-launches-with-ethical-oath/\">Carbon removal trade group launches with ‘Hippocratic oath’ for the industry. </a> “The statement is brief, just 15 sentences, and commits signatories to abstract ideals like acting with humility and honesty, being guided by science, and recognizing the value of “including voices from all backgrounds in conversations” about carbon removal.”</p><p><a href=\"https://www.techdirt. com/2022/07/14/north-carolina-republicans-push-bill-forcing-towns-to-destroy-electric-car-chargers/\">North Carolina Republicans Push Bill Forcing Towns To Destroy Electric Car Chargers. </a> “In North Carolina, Trump GOP lawmaker Ben Moss has pushed forward a ridiculous bill (HB 1049) that would require towns and cities use up to $50,000 in taxpayer funds to destroy free electric vehicle stations on public land, if local authorities don’t build free gas and diesel pumps alongside them. There’s, of course, no provision included in the bill that works in the opposite direction.”</p><h4>Covid</h4><p><a href=\"https://www.science.org/doi/10.1126/science.abp8715\">The Huanan Seafood Wholesale Market in Wuhan was the early epicenter of the COVID-19 pandemic. </a> “While there is insufficient evidence to define upstream events, and exact circumstances remain obscure, our analyses indicate that the emergence of SARS-CoV-2 occurred via the live wildlife trade in China, and show that the Huanan market was the epicenter of the COVID-19 pandemic.”</p><p><a href=\"https://19thnews.org/2022/07/covid-surge-nursing-home-residents-aarp/\">COVID cases and deaths are spiking in nursing homes, AARP data shows.</a> \n",
  "description_zh-Hant": "<div class=\"e-content entry-content\">\n<p>This is my monthly roundup of the articles I found interesting. Here's my list for July, 2022.</p><h3>Notable Articles</h3><h4>Business</h4><p><a href=\"https://theintercept.com/2022/07/29/bank-of-america-worker-conditions-worse/\">Bank of America Memo: “We Hope” Worker Power Worsens.</a> “A Bank of America executive stated that “we hope” working Americans will lose leverage in the labor market in a recent private memo obtained by The Intercept. Making predictions for clients about the U.S. economy over the next several years, the memo also noted that changes in the percentage of Americans seeking jobs “should help push up the unemployment rate.””</p><p><a href=\"https://www.nytimes.com/2022/07/21/business/amazon-one-medical-deal.html? smtyp=cur&amp;smid=tw-nytimes\">Amazon to Acquire One Medical Clinics in Latest Push Into Health Care.</a> “One Medical, which is based in San Francisco, operates a network of primary care providers that offer in-office and virtual medical services, and is one of the leading competitors to a similar but smaller service Amazon had started to offer.” Exercise for the reader: should end-user healthcare provision be a place where you can make a lot of profit?</p><h4>Climate</h4><p><a href=\"https://grist.org/culture/when-time-is-short-review-timothy-beal-climate-doomer-religion/\">Is accepting the end of humanity the key to climate action? This scholar thinks so.</a> “Accepting that human civilization is finite, he says, will challenge us to change our priorities, from worshiping extraction and growth to uplifting the most marginalized in society.”</p><p><a href=\"https://www.vice.com/en/article/4axwe3/wildfires-are-setting-off-100-year-old-bombs-on-wwi-battlefields\">Wildfires Are Setting Off 100-Year-Old Bombs on WWI Battlefields.</a> “The area where the fire rages was the site of 12 battles during World War I. More than 200,000 people died and untold numbers of explosives were used. It’s a major problem across Europe that lingers to this day. The Royal Air Force and U.S. Army Air Force dropped 2.7 million tons of bombs on Europe during World War II alone. Seventy years later, those bombs are still killing people.”</p><p><a href=\"https://www.protocol.com/bulletins/extreme-heat-weather-noaa-site\">NOAA introduces heat.gov as climate change worsens.</a> “<a class=\"autolink\" href=\"https://Heat.gov\">Heat. gov</a> is geared toward a wide range of decision makers, from companies to local governments to individuals, Spinrad told Protocol, “whether it’s a mom trying to decide whether it’s safe for kids to play outside, or a construction foreman trying to decide if it’s OK for their workers to be out on the job, or a public works manager trying to figure out when road repairs can be undertaken.””</p><p><a href=\"https://grist.org/technology/carbon-removal-business-council-trade-group-launches-with-ethical-oath/\">Carbon removal trade group launches with ‘Hippocratic oath’ for the industry. </a> “The statement is brief, just 15 sentences, and commits signatories to abstract ideals like acting with humility and honesty, being guided by science, and recognizing the value of “including voices from all backgrounds in conversations” about carbon removal.”</p><p><a href=\"https://www.techdirt. com/2022/07/14/north-carolina-republicans-push-bill-forcing-towns-to-destroy-electric-car-chargers/\">North Carolina Republicans Push Bill Forcing Towns To Destroy Electric Car Chargers. </a> “In North Carolina, Trump GOP lawmaker Ben Moss has pushed forward a ridiculous bill (HB 1049) that would require towns and cities use up to $50,000 in taxpayer funds to destroy free electric vehicle stations on public land, if local authorities don’t build free gas and diesel pumps alongside them. There’s, of course, no provision included in the bill that works in the opposite direction.”</p><h4>Covid</h4><p><a href=\"https://www.science.org/doi/10.1126/science.abp8715\">The Huanan Seafood Wholesale Market in Wuhan was the early epicenter of the COVID-19 pandemic. </a> “While there is insufficient evidence to define upstream events, and exact circumstances remain obscure, our analyses indicate that the emergence of SARS-CoV-2 occurred via the live wildlife trade in China, and show that the Huanan market was the epicenter of the COVID-19 pandemic.”</p><p><a href=\"https://19thnews.org/2022/07/covid-surge-nursing-home-residents-aarp/\">COVID cases and deaths are spiking in nursing homes, AARP data shows.</a> \n"
}