{
  "@type": "NewsArticle",
  "identifier": "2022--04--28--en--myfeed--HackerNews--NewsArticle--31188732",
  "url": "https://news.ycombinator.com/item?id=31188732",
  "headline": "Need advice: A precarious situation in my polymath career",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Fellow hackers,<p>Ola from a neurodivergent, ADHD polymath. I am in need of some advice, or crowd sourced ideas on what I can be doing or should be doing with my skills &amp; experience in life. I will quickly lay down some of the things I have worked on:<p>- 5X founder: Education, Organic Farming, Startup Festivals + Media, Outdoor travel, Virtual venture education (micro-accelerators). None of them have given me an exit still or any sort of reasonable financial return. Some of them are active but COVID mostly has made it hard to see it yielding any results in the near future.<p>15yrs of startup ecosystem building experience in developing &amp; developed economies. Things i have built &amp; part of:\n- Ran the office creating mentoring, funding &amp; market development activities for startups at a time when there were 2 VCs operating, now is a thriving ecosystem (probably 4th largest in the world)\n- Developed entrepreneurships events at the intersection of disciplines (art+tech, Media+Finance etc) was a huge hit but financially not viable in the part of the world I come from, so shut it down\n- Public policy work to develop startup ecosystems \n-  Various committees &amp; think tanks &amp; advisory work for various communities working in entrepreneurship\n- Launched and ran angel syndicates, accelerator programs etc.. as consulting gigs.<p>Now. I am 41 and have had the greatest opportunity to work on some diverse and impactful projects in my life. I am skilled to manage a board instead of teams, I am killer in strategies not operations. I can work on things that come to fruition in the long run instead of immediate gratification.<p>I just got diagnosed ADHD, which explains why I am the way I am. :-P. I have come to the cross roads of my life, I need to pick something that keeps me in the world of entrepreneurship &amp; innovation because I am such a fan &amp; a cheer leader &amp; truly believe in the power it has to change people's lives (I have witnessed that in my country from the work we have done).<p>Anybody here been in this place before, have any ideas or inputs on how you creatively solved this? :-)<p>Please send me all you can think of what I can do, I am waiting :-) .",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "adhdpolymath",
    "url": "https://news.ycombinator.com/user?id=adhdpolymath"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31188732",
  "sameAs": "https://news.ycombinator.com/item?id=31188732",
  "dateCreated": "2022-04-28T05:36:24.741Z",
  "datePublished": "2022-04-28T04:26:55.000Z",
  "dateModified": "2022-04-28T05:36:24.741Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "需要建议。我的多面手生涯中的一个不稳定的情况",
  "headline_zh-Hant": "需要建議。我的多面手生涯中的一個不穩定的情況",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "各位黑客，<p>Ola来自一个神经分歧者、多动症多面手。我需要一些建议，或者从众人那里得到一些想法，了解我可以做什么，或者应该用我的技能和amp做什么；生活中的经验。我将迅速列出我所从事的一些工作：<p>- 5X创始人。教育、有机农业、创业节+媒体、户外旅行、虚拟风险教育（微型加速器）。他们都没有给我一个退出的机会，或任何形式的合理财务回报。他们中的一些人很活跃，但COVID的出现使其很难在不久的将来产生任何结果。<p>在发展中和发达经济体有15年的创业生态系统建设经验。我曾建立和参与的事情。\n- 管理办公室，为初创企业提供指导、资金和市场开发活动，当时只有两家风险投资公司在运营，现在已经成为一个繁荣的生态系统（可能是世界第四大）。\n- 在各学科（艺术+技术、媒体+金融等）的交叉点上开展创业活动，获得了巨大的成功，但在我所处的世界范围内财务上不可行，所以关闭了它。\n- 发展初创企业生态系统的公共政策工作 \n- 各种委员会和智囊团以及为从事创业的各种团体提供咨询工作\n- 发起并管理天使集团、加速器项目等，作为咨询工作。我已经41岁了，在我的生活中，我有最大的机会从事一些多样化和有影响的项目。我熟练地管理董事会而不是团队，我是战略的杀手而不是运营的杀手。我可以在长期的工作中取得成果，而不是立即满足。<p>我刚刚被诊断为多动症，这解释了为什么我是这样的人。我已经走到了人生的十字路口，我需要选择一个能让我留在创业和创新世界里的东西，因为我是这样一个粉丝，一个啦啦队队长，一个真正相信它能改变人们生活的力量（我从我们所做的工作中见证了这一点）。.",
  "description_zh-Hant": "各位黑客，<p>Ola來自一個神經分歧者、多動症多面手。我需要一些建議，或者從眾人那裡得到一些想法，瞭解我可以做什麼，或者應該用我的技能和amp做什麼；生活中的經驗。我將迅速列出我所從事的一些工作：<p>- 5X創始人。教育、有機農業、創業節+媒體、戶外旅行、虛擬風險教育（微型加速器）。他們都沒有給我一個退出的機會，或任何形式的合理財務回報。他們中的一些人很活躍，但COVID的出現使其很難在不久的將來產生任何結果。<p>在發展中和發達經濟體有15年的創業生態系統建設經驗。我曾建立和參與的事情。\n- 管理辦公室，為初創企業提供指導、資金和市場開發活動，當時只有兩家風險投資公司在運營，現在已經成為一個繁榮的生態系統（可能是世界第四大）。\n- 在各學科（藝術+技術、媒體+金融等）的交叉點上開展創業活動，獲得了巨大的成功，但在我所處的世界範圍內財務上不可行，所以關閉了它。\n- 發展初創企業生態系統的公共政策工作 \n- 各種委員會和智囊團以及為從事創業的各種團體提供諮詢工作\n- 發起並管理天使集團、加速器項目等，作為諮詢工作。我已經41歲了，在我的生活中，我有最大的機會從事一些多樣化和有影響的項目。我熟練地管理董事會而不是團隊，我是戰略的殺手而不是運營的殺手。我可以在長期的工作中取得成果，而不是立即滿足。<p>我剛剛被診斷為多動症，這解釋了為什麼我是這樣的人。我已經走到了人生的十字路口，我需要選擇一個能讓我留在創業和創新世界裡的東西，因為我是這樣一個粉絲，一個啦啦隊隊長，一個真正相信它能改變人們生活的力量（我從我們所做的工作中見證了這一點）。."
}