{
  "@type": "NewsArticle",
  "identifier": "2022--06--17--en--myfeed--HackerNews--NewsArticle--31781613",
  "url": "https://news.ycombinator.com/item?id=31781613",
  "headline": "Tell HN: Trivially bot banned from Google Play Store twice in a year",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "How you can help:\nIf you know someone working at the Google Play Store tell them to add warning emails 1 month before bots remove apps!<p>Story:\nIt's the second time in a year our Android app gets removed from the Google Play Store by bot without warning.\n1 year ago we got removed because the Amharic title for the app was not confirming the store guidelines. (Our app is translated in 40+ languages). It had been the same for 4+ years but suddenly someone wrote a bot to just remove all apps that didn't pass that guideline without any email notification.\nWe modified the metadata, appealed and resubmitted and our app was re-added with reviews with a 7 days downtime costing us thousands of dollars in revenues. The level of stress was VERY HIGH.\nYesterday again our app was removed.\nThis time the culprit guideline is not providing email/password for the reviewers to use.\nThe app has been the same for 9 years.\nSomeone added that to the guidelines 2+ years ago.\nAnd then now someone wrote a bot to enforce that.\nThe bot just removes the apps without any warning.<p>Let's be clear.\nI'm not against the guidelines. The problem is there are 100+ pages of guidelines and they get updated all the time.\nEngineers at the Google Play Store need to STOP IMMEDIATELY this kill-bots that ban straight away without an email notification.\nPlease build in a grace period where you notify developers 1-4 weeks before you are going to remove their apps.<p>BUT WE WARNED YOU IN THE GOOGLE PLAY STORE CONSOLE...\nWe don't check the Google Play Store Console very often and pretending millions of developers to be on the edge all the time reading manuals of dozens of pages updated monthly and checking compulsively UIs warning that matters once a year is just a cruel dystopia.<p>Please stop the killbots and add the warn-bots followed by killbots.\nThis bots have seriously damaged the brand of Google in my eyes and have forced us to change marketing strategy from the app stores to SEO/content marketing to be less dependent on the whims of bots developers.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "giorgioz",
    "url": "https://news.ycombinator.com/user?id=giorgioz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31781613",
  "sameAs": "https://news.ycombinator.com/item?id=31781613",
  "dateCreated": "2022-06-17T17:58:39.888Z",
  "datePublished": "2022-06-17T17:39:44.000Z",
  "dateModified": "2022-06-17T17:58:39.888Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "告诉HN：Trivially机器人在一年内两次被Google Play Store禁止使用\n",
  "headline_zh-Hant": "告訴HN：Trivially機器人在一年內兩次被Google Play Store禁止使用\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你可以如何帮助。\n如果你认识在Google Play商店工作的人，告诉他们在机器人删除应用程序前一个月增加警告邮件！<p>故事。\n这是一年内我们的安卓应用第二次在没有警告的情况下被机器人从Google Play Store删除。\n1年前，我们被删除了，因为应用程序的阿姆哈拉语标题不符合商店指南的要求。(我们的应用程序被翻译成40多种语言）。4年多来一直如此，但突然有人写了一个机器人，在没有任何电子邮件通知的情况下，直接删除所有不符合该准则的应用程序。\n我们修改了元数据，提出上诉并重新提交，我们的应用程序被重新添加了评论，7天的停机时间使我们损失了数千美元的收入。这种压力是非常大的。\n昨天，我们的应用程序再次被删除。\n这一次的罪魁祸首是没有提供电子邮件/密码给审查员使用。\n这个应用程序9年来一直是这样的。\n有人在2年多前就把这一点加入了准则。\n然后现在有人写了一个机器人来执行这个规定。\n该机器人在没有任何警告的情况下删除了这些应用程序。<p>让我们说清楚。\n我并不反对这些准则。问题是，有100多页的准则，而且它们一直在更新。\nGoogle Play Store的工程师们需要立即停止这种没有邮件通知就直接禁止的杀毒机器人。\n请建立一个宽限期，在你要删除他们的应用程序前1-4周通知开发者。<p>但我们在Google Play STORE控制台中警告过你。\n我们并不经常检查Google Play商店控制台，假装数百万的开发者一直在阅读每月更新的几十页的手册，并强迫性地检查每年一次的UI警告，这只是一个残酷的二维码。<p>请停止杀毒机器人，并添加警告机器人，然后是杀毒机器人。\n在我眼里，这种机器人已经严重损害了谷歌的品牌，并迫使我们改变营销策略，从应用商店转向SEO/内容营销，以减少对机器人开发者的奇思妙想的依赖。\n",
  "description_zh-Hant": "你可以如何幫助。\n如果你認識在Google Play商店工作的人，告訴他們在機器人刪除應用程序前一個月增加警告郵件！<p>故事。\n這是一年內我們的安卓應用第二次在沒有警告的情況下被機器人從Google Play Store刪除。\n1年前，我們被刪除了，因為應用程序的阿姆哈拉語標題不符合商店指南的要求。(我們的應用程序被翻譯成40多種語言）。4年多來一直如此，但突然有人寫了一個機器人，在沒有任何電子郵件通知的情況下，直接刪除所有不符合該準則的應用程序。\n我們修改了元數據，提出上訴並重新提交，我們的應用程序被重新添加了評論，7天的停機時間使我們損失了數千美元的收入。這種壓力是非常大的。\n昨天，我們的應用程序再次被刪除。\n這一次的罪魁禍首是沒有提供電子郵件/密碼給審查員使用。\n這個應用程序9年來一直是這樣的。\n有人在2年多前就把這一點加入了準則。\n然後現在有人寫了一個機器人來執行這個規定。\n該機器人在沒有任何警告的情況下刪除了這些應用程序。<p>讓我們說清楚。\n我並不反對這些準則。問題是，有100多頁的準則，而且它們一直在更新。\nGoogle Play Store的工程師們需要立即停止這種沒有郵件通知就直接禁止的殺毒機器人。\n請建立一個寬限期，在你要刪除他們的應用程序前1-4周通知開發者。<p>但我們在Google Play STORE控制檯中警告過你。\n我們並不經常檢查Google Play商店控制檯，假裝數百萬的開發者一直在閱讀每月更新的幾十頁的手冊，並強迫性地檢查每年一次的UI警告，這只是一個殘酷的二維碼。<p>請停止殺毒機器人，並添加警告機器人，然後是殺毒機器人。\n在我眼裡，這種機器人已經嚴重損害了谷歌的品牌，並迫使我們改變營銷策略，從應用商店轉向SEO/內容營銷，以減少對機器人開發者的奇思妙想的依賴。\n"
}