{
  "@type": "NewsArticle",
  "identifier": "2022--06--11--en--myfeed--ben-werdmuller--NewsArticle--e82c8fd4b56802969ee738f9aeeffef0",
  "url": "https://werd.io/2022/explaining-american-guns-to-an-outsider",
  "headline": "Explaining American guns to an outsider",
  "publisher": {
    "@type": "Organization",
    "name": "werd.io",
    "url": "https://werd.io/feed/"
  },
  "description": "<div class=\"e-content entry-content\">\n<p>A British friend asked me what the deal with the American attitude towards guns was. To an outside eye, and to many inside eyes, it’s ludicrous. A lot of people, quite reasonably, can’t understand why Americans won’t come together and pass gun control legislation - particularly now that guns are the largest cause of death for children.</p><p>This was my answer. I’d love to read yours:</p><p>It's a great question, and one I struggle with too, even after living here for 11 years. Here's my take. Sorry for Bensplaining, but this is also helping me sort out my own thoughts.</p><p>The first thing to understand about America is that it's best thought of as 50 countries federated together into a union of rough consensus, rather than one coherent nation. If they were independent, gun control would be relatively easy in 60-70% of them. New York and California: fine. Texas: not so much.</p><p>But that's not how it was set up. And in particular, the constitution of the union had a badly-worded amendment (15 years after the original document) that can be construed to codify gun ownership. Not only that, but because America had a kind of colonizer attitude from the beginning, taking land both from indigenous people and from other colonies, as well as hunting for food in newly-established settlements, guns became a core part of American culture. Movies and advertising helped cement the idea that you need a gun for self-defense. </p><p>(Defense against whom in the 20th century, one might ask? There's a racist component here for sure. Even now, when violence is brought up, people talk about places like the south side of Chicago. Hey, who lives there?)</p><p>More recently, since Reagan or so, gun control has become a part of the Republican platform, alongside issues like abortion, because they've found it's a way to rile up the base. Even though, like abortion, a majority of Americans go the other way on it, there's enough legislative friction to make it an issue - and enough Americans who feel strongly about it, mostly in rural-dominated states, to drive more electoral support. Unlike abortion, that second amendment means it's almost impossible to enact real legislation.</p><p>I don't think we can repeal the second amendment in my lifetime. I do think we can re-enact an assault weapons ban and create stronger controls akin to having a driving license. I think that will help. But changing the culture completely is a generational effort.</p></div>",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Ben Werdmüller",
    "url": "https://werd.io/feed/"
  },
  "discussionUrl": "https://werd.io/2022/explaining-american-guns-to-an-outsider",
  "sameAs": "https://werd.io/2022/explaining-american-guns-to-an-outsider",
  "dateCreated": "2022-06-11T17:56:21.367Z",
  "datePublished": "2022-05-28T19:00:53.000Z",
  "dateModified": "2022-06-11T17:56:21.367Z",
  "interactionStatistic": [],
  "headline_zh-Hans": "向外人解释美国枪支\n",
  "headline_zh-Hant": "向外人解釋美國槍支\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<div class=\"e-content entry-content\">。\n<p>一位英国朋友问我，美国人对枪支的态度是什么情况。在外人看来，在许多内行人看来，这是很可笑的。很多人，很有理由，不明白为什么美国人不愿意团结起来，通过枪支管制立法--尤其是现在枪支是儿童死亡的最大原因。我很想知道你的答案：</p><p>这是一个很好的问题，我也在为这个问题而挣扎，即使在这里生活了11年。以下是我的看法。对不起，我说错话了，但这也有助于我理清自己的思路。</p><p>关于美国，首先要了解的是，最好把它看作是50个国家联合起来组成的粗略共识的联盟，而不是一个统一的国家。如果它们是独立的，那么其中60-70%的国家对枪支的控制就会相对容易。纽约和加利福尼亚：很好。</p><p>但是，它不是这样建立的。而且特别是，联邦的宪法有一个措辞糟糕的修正案（在原始文件的15年后），可以被理解为编纂枪支所有权。不仅如此，由于美国从一开始就有一种殖民者的态度，既从原住民手中夺取土地，又从其他殖民地夺取土地，还在新建立的定居点打猎获取食物，因此枪支成为美国文化的核心部分。电影和广告帮助巩固了你需要用枪自卫的想法。</p><p>（有人会问，在20世纪防卫谁？这里肯定有种族主义的成分。即使是现在，当暴力被提起时，人们会谈论像芝加哥南部这样的地方。嘿，谁住在那里？）</p><p>最近，自从里根左右，枪支管制已经成为共和党平台的一部分，与堕胎等问题并列，因为他们发现这是一种激怒基础的方式。尽管像堕胎一样，大多数美国人在这个问题上持反对意见，但有足够的立法摩擦使其成为一个问题--有足够的美国人对此有强烈的感受，他们大多在农村为主的州，以推动更多的选举支持。与堕胎不同，第二修正案意味着几乎不可能制定真正的立法。</p><p>我不认为我们能在我的有生之年废除第二修正案。我确实认为我们可以重新制定攻击性武器禁令，并建立类似于驾驶执照的更强有力的控制。我认为这将有所帮助。但彻底改变文化是一代人的努力。</p></div>\n",
  "description_zh-Hant": "<div class=\"e-content entry-content\">。\n<p>一位英國朋友問我，美國人對槍支的態度是什麼情況。在外人看來，在許多內行人看來，這是很可笑的。很多人，很有理由，不明白為什麼美國人不願意團結起來，通過槍支管制立法--尤其是現在槍支是兒童死亡的最大原因。我很想知道你的答案：</p><p>這是一個很好的問題，我也在為這個問題而掙扎，即使在這裡生活了11年。以下是我的看法。對不起，我說錯話了，但這也有助於我理清自己的思路。</p><p>關於美國，首先要了解的是，最好把它看作是50個國家聯合起來組成的粗略共識的聯盟，而不是一個統一的國家。如果它們是獨立的，那麼其中60-70%的國家對槍支的控制就會相對容易。紐約和加利福尼亞：很好。</p><p>但是，它不是這樣建立的。而且特別是，聯邦的憲法有一個措辭糟糕的修正案（在原始文件的15年後），可以被理解為編纂槍支所有權。不僅如此，由於美國從一開始就有一種殖民者的態度，既從原住民手中奪取土地，又從其他殖民地奪取土地，還在新建立的定居點打獵獲取食物，因此槍支成為美國文化的核心部分。電影和廣告幫助鞏固了你需要用槍自衛的想法。</p><p>（有人會問，在20世紀防衛誰？這裡肯定有種族主義的成分。即使是現在，當暴力被提起時，人們會談論像芝加哥南部這樣的地方。嘿，誰住在那裡？）</p><p>最近，自從里根左右，槍支管制已經成為共和黨平臺的一部分，與墮胎等問題並列，因為他們發現這是一種激怒基礎的方式。儘管像墮胎一樣，大多數美國人在這個問題上持反對意見，但有足夠的立法摩擦使其成為一個問題--有足夠的美國人對此有強烈的感受，他們大多在農村為主的州，以推動更多的選舉支持。與墮胎不同，第二修正案意味著幾乎不可能制定真正的立法。</p><p>我不認為我們能在我的有生之年廢除第二修正案。我確實認為我們可以重新制定攻擊性武器禁令，並建立類似於駕駛執照的更強有力的控制。我認為這將有所幫助。但徹底改變文化是一代人的努力。</p></div>\n"
}