{
  "@type": "NewsArticle",
  "identifier": "2022--07--14--en--myfeed--HackerNews--NewsArticle--32097293",
  "url": "https://news.ycombinator.com/item?id=32097293",
  "headline": "Web3 is about introducing yet another layer of financialisation to the web (FT)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "(1)\nYou have probably, unless you’ve been unusually fortunate, been schooled in the wonders of Web3. For the remaining lucky few, allow me to explain. Web3 is the inexorable destiny of the internet — the magical fabric from which blockchain-based decentralised dreams are made and dystopian big-tech nightmares destroyed. The future is bright; the future is “append-only” databases.<p>The central thesis of Web3 is that because the internet has become so centralised — with power concentrated in the hands of a few, and users powerless over their own data — we need a more distributed, egalitarian, open system. So far, so reasonable.<p>But the minute you look beneath the surface, gaping holes appear in the Web3 vision. Its techno-utopian advocates say they want to harness the alleged power of blockchains — the immutable databases that underpin bitcoin and other tokens — to create a democratised internet where you control your own data and are no longer reliant on the big tech giants. Web3, the argument goes, will allow you to “own a piece of the internet”. Naturally, the “decentralised” apps and organisations that operate in this brave new world are powered by crypto tokens: all you need to do is buy them.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "cwwc",
    "url": "https://news.ycombinator.com/user?id=cwwc"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32097293",
  "sameAs": "https://news.ycombinator.com/item?id=32097293",
  "dateCreated": "2022-07-14T15:50:46.241Z",
  "datePublished": "2022-07-14T15:29:31.000Z",
  "dateModified": "2022-07-14T15:50:46.241Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Web3是为了给网络引入另一层金融化（FT）。\n",
  "headline_zh-Hant": "Web3是為了給網絡引入另一層金融化（FT）。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "(1)\n除非你特别幸运，否则你可能已经接受了关于Web3奇迹的教育。 对于剩下的少数幸运者，请允许我解释一下。Web3是互联网不可阻挡的命运--基于区块链的去中心化的梦想是由这种神奇的织物构成的，而反乌托邦式的大技术噩梦则是由这种织物摧毁的。<p>Web3的中心论点是，由于互联网已经变得如此集中--权力集中在少数人手中，而用户对自己的数据无能为力--我们需要一个更加分散、平等、开放的系统。到目前为止，还算合理。<p>但是，当你在表面下看时，Web3的愿景就会出现漏洞。它的技术乌托邦倡导者说，他们想利用区块链的所谓力量--支撑比特币和其他代币的不可改变的数据库--来创造一个民主化的互联网，让你控制自己的数据，不再依赖大型科技巨头。该观点认为，Web3将允许你 \"拥有互联网的一部分\"。自然，在这个勇敢的新世界中运作的 \"去中心化 \"应用程序和组织由加密代币驱动：你所需要做的就是购买它们。\n",
  "description_zh-Hant": "(1)\n除非你特別幸運，否則你可能已經接受了關於Web3奇蹟的教育。 對於剩下的少數幸運者，請允許我解釋一下。Web3是互聯網不可阻擋的命運--基於區塊鏈的去中心化的夢想是由這種神奇的織物構成的，而反烏托邦式的大技術噩夢則是由這種織物摧毀的。<p>Web3的中心論點是，由於互聯網已經變得如此集中--權力集中在少數人手中，而用戶對自己的數據無能為力--我們需要一個更加分散、平等、開放的系統。到目前為止，還算合理。<p>但是，當你在表面下看時，Web3的願景就會出現漏洞。它的技術烏托邦倡導者說，他們想利用區塊鏈的所謂力量--支撐比特幣和其他代幣的不可改變的數據庫--來創造一個民主化的互聯網，讓你控制自己的數據，不再依賴大型科技巨頭。該觀點認為，Web3將允許你 \"擁有互聯網的一部分\"。自然，在這個勇敢的新世界中運作的 \"去中心化 \"應用程序和組織由加密代幣驅動：你所需要做的就是購買它們。\n"
}