{
  "@type": "NewsArticle",
  "identifier": "2022--06--22--en--myfeed--HackerNews--NewsArticle--31838573",
  "url": "https://news.ycombinator.com/item?id=31838573",
  "headline": "On ‘Saving for a Rainy Day’",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Growing up in India, saving is second nature to me. It was so ingrained that I brought this to the States as my immigrant inheritance.<p>It is reflected in everything I do. I judge people who don’t ‘save for a rainy day’. I am fiscally conservative and I vote on this basis. I will totally jump entire oceans between political parties on this criteria alone. My political angst stems from mismanagement of state coffers rather than social issues.<p>I am risk averse and this too reflects in every aspect of my life..not just money. Although I can’t be accused of being ‘penny wise pound foolish’, I will walk away from adrenaline rush hooks. So I almost wear it like a badge of merit. Like it’s a secret I brought to this country and that I share with other immigrants.<p>Until it just struck me today..perhaps Americans ‘live pay check to pay check’ because they never had to save. Saving is an off shoot from uncertainty and instability. India when I was growing up was not a bed of political and economic stability. Even though we were comfortably middle class, the national anxiety seeps into homes. We also saw this here recently during the great covid toilet paper scarcity and hoarding phenomena.<p>Citizens of wealthy nations don’t save because they don’t have to as there is sufficient trust in the government. Saving is a reaction to scarcity.<p>I stopped saving a while ago, but now watching the interest rate goat rodeo, I have started thinking about it again.<p>Curious about other saving philosophies and how the latest bank shenanigans will influence ingrained stances about money at every level.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "jelliclesfarm",
    "url": "https://news.ycombinator.com/user?id=jelliclesfarm"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31838573",
  "sameAs": "https://news.ycombinator.com/item?id=31838573",
  "dateCreated": "2022-06-22T17:15:12.262Z",
  "datePublished": "2022-06-22T16:54:46.000Z",
  "dateModified": "2022-06-22T17:15:12.262Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "关于 \"为雨天储蓄\n",
  "headline_zh-Hant": "關於 \"為雨天儲蓄\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在印度长大的我，储蓄是我的第二天性。它是如此根深蒂固，以至于我把它作为我的移民遗产带到了美国。<p>它反映在我所做的一切中。我批评那些不 \"未雨绸缪 \"的人。我在财政上是保守的，我在这个基础上投票。仅凭这一标准，我完全可以在不同的政党之间跳过整个海洋。我的政治焦虑源于国库的管理不善，而不是社会问题。<p>我厌恶风险，这也反映在我生活的各个方面，而不仅仅是金钱。虽然我不能被指责为 \"一分钱一分货\"，但我还是会从肾上腺素激增的诱惑中走出来。因此，我几乎把它当作一个功绩的徽章。好像这是我带到这个国家的一个秘密，我与其他移民分享。<p>直到今天我突然想到......也许美国人 \"从头到尾都是靠工资支付\"，因为他们从来不需要储蓄。储蓄是不确定性和不稳定性的产物。在我成长的过程中，印度并不是一个政治和经济稳定的地方。即使我们是舒适的中产阶级，国家的焦虑也会渗入家庭。我们最近在大ovid卫生纸稀缺和囤积现象中也看到了这一点。<p>富裕国家的公民不储蓄是因为他们不必储蓄，因为他们对政府有足够的信任。<p>我不久前已经停止了储蓄，但现在看着利率大涨，我又开始考虑这个问题了。<p>我很好奇其他的储蓄理念，以及最新的银行诡计将如何影响各个层面对金钱根深蒂固的立场。\n",
  "description_zh-Hant": "在印度長大的我，儲蓄是我的第二天性。它是如此根深蒂固，以至於我把它作為我的移民遺產帶到了美國。<p>它反映在我所做的一切中。我批評那些不 \"未雨綢繆 \"的人。我在財政上是保守的，我在這個基礎上投票。僅憑這一標準，我完全可以在不同的政黨之間跳過整個海洋。我的政治焦慮源於國庫的管理不善，而不是社會問題。<p>我厭惡風險，這也反映在我生活的各個方面，而不僅僅是金錢。雖然我不能被指責為 \"一分錢一分貨\"，但我還是會從腎上腺素激增的誘惑中走出來。因此，我幾乎把它當作一個功績的徽章。好像這是我帶到這個國家的一個秘密，我與其他移民分享。<p>直到今天我突然想到......也許美國人 \"從頭到尾都是靠工資支付\"，因為他們從來不需要儲蓄。儲蓄是不確定性和不穩定性的產物。在我成長的過程中，印度並不是一個政治和經濟穩定的地方。即使我們是舒適的中產階級，國家的焦慮也會滲入家庭。我們最近在大ovid衛生紙稀缺和囤積現象中也看到了這一點。<p>富裕國家的公民不儲蓄是因為他們不必儲蓄，因為他們對政府有足夠的信任。<p>我不久前已經停止了儲蓄，但現在看著利率大漲，我又開始考慮這個問題了。<p>我很好奇其他的儲蓄理念，以及最新的銀行詭計將如何影響各個層面對金錢根深蒂固的立場。\n"
}