{
  "@type": "NewsArticle",
  "identifier": "2022--07--14--en--myfeed--HackerNews--NewsArticle--32098161",
  "url": "https://news.ycombinator.com/item?id=32098161",
  "headline": "Show HN: The Cloud Resume Challenge",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I initially created the Cloud Resume Challenge [0] a couple of years ago because I was seeing a huge wave of people trying to get &quot;six-figure cloud jobs&quot; off the back of little more than a couple of certifications. This is not sufficient and it contributes to the industry's bad attitude toward hiring and mentoring juniors.<p>The goal of the CRC was to set people new to cloud a REAL challenge: not to give them a paint-by-numbers tutorial, but to lay out a spec that would require them to open a bunch of search tabs, stay up late, go down rabbit holes, and learn through pain. It self-selects for people who are self-motivated and know how to learn.<p>If you try the Cloud Resume Challenge and can't complete it, or you hate it, then you'll have learned a valuable lesson about whether you really want a job in the cloud right now - because these are the type of problems that cloud teams really work on.<p>But if you can complete the Cloud Resume Challenge, you will learn something about:<p>Front end and back end software development<p>Cloud services and &quot;serverless&quot;<p>Cloud networking, particularly DNS and CDNs<p>Cloud security<p>DevOps principles (version control, infrastructure-as-code, CI/CD)<p>And you'll learn by doing, because the spec doesn't give you enough help to figure any of this out without a lot of trial and error. It's a messy way to learn, but reality is messy. That's why it works as a talking point in real-life job interviews.<p>People sometimes get hung up on the &quot;resume&quot; part of the Cloud Resume Challenge, saying &quot;who would be impressed by a resume site?&quot; Fine, whatever, put something else on your site, it doesn't have to be your resume. (Though I believe personal websites are underrated as learning tools, simply because they give you built-in motivation to keep maintaining and updating the site over time, which gives 90% of the value in any side project.) The important thing is to build something real, something with a purpose in the world - not a toy tutorial. That will give you a baptism by fire that you will not forget.<p>Last thing: though there is a guidebook [1] for the challenge that you can buy (actually 3, one for each cloud! I just updated them! They're great!) the challenge itself is and will remain free for everyone to do. Happy to answer any questions - the CRC is not my job, it's a passion project and I'm always open to suggestions for how to make it a better experience.<p>[0] https://cloudresumechallenge.dev/docs/the-challenge\n[1] https://cloudresumechallenge.dev/book/",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "forrestbrazeal",
    "url": "https://news.ycombinator.com/user?id=forrestbrazeal"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32098161",
  "sameAs": "https://news.ycombinator.com/item?id=32098161",
  "dateCreated": "2022-07-14T16:44:14.335Z",
  "datePublished": "2022-07-14T16:28:41.000Z",
  "dateModified": "2022-07-14T16:44:14.335Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 云简历的挑战\n",
  "headline_zh-Hant": "Show HN: 雲簡歷的挑戰\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几年前，我最初创建了云计算简历挑战赛[0]，因为我看到有一大批人试图通过几个证书就能获得六位数的云计算工作。<p>CRC的目标是为刚进入云计算领域的人设置一个真正的挑战：不是给他们一个逐字逐句的教程，而是制定一个规范，要求他们打开一堆搜索标签，熬夜，进入兔子洞，在痛苦中学习。<p>如果你尝试云计算简历挑战，但无法完成，或者你讨厌它，那么你将学到宝贵的一课，了解你现在是否真的想在云计算领域工作--因为这些是云计算团队真正致力于解决的问题类型。 <p>但是，如果你能完成云计算简历挑战，你将学到一些东西：<p>前端和后端软件开发<p>云服务和&quot;serverless&quot;<p>云网络，特别是DNS和CDN<p>云安全<p>DevOps原则（版本控制、基础设施即代码、CI/CD）<p>而且你将通过实践来学习，因为规范没有给你足够的帮助，没有大量的试验和错误就无法弄清这些。这是一种混乱的学习方式，但现实是混乱的。<p>人们有时会纠结于云简历挑战中的 \"简历 \"部分，说 \"谁会对简历网站印象深刻？(虽然我认为个人网站作为学习工具被低估了，只是因为它们给了你内在的动力，让你不断地维护和更新网站，这给了任何副业项目90%的价值）。重要的是建立真正的东西，在这个世界上有目的的东西--而不是一个玩具教程。<p>最后一件事：虽然有一本关于挑战的指南[1]可以购买（实际上是3本，每朵云都有一本！我刚刚更新了它们！它们很棒！），但挑战本身是免费的，而且将继续免费供大家使用。我很乐意回答任何问题--CRC不是我的工作，它是一个充满激情的项目，我总是愿意接受关于如何使它成为更好的体验的建议。<p>[0] https://cloudresumechallenge.dev/docs/the-challenge\n[1] https://cloudresumechallenge.dev/book/\n",
  "description_zh-Hant": "幾年前，我最初創建了雲計算簡歷挑戰賽[0]，因為我看到有一大批人試圖通過幾個證書就能獲得六位數的雲計算工作。<p>CRC的目標是為剛進入雲計算領域的人設置一個真正的挑戰：不是給他們一個逐字逐句的教程，而是制定一個規範，要求他們打開一堆搜索標籤，熬夜，進入兔子洞，在痛苦中學習。<p>如果你嘗試雲計算簡歷挑戰，但無法完成，或者你討厭它，那麼你將學到寶貴的一課，瞭解你現在是否真的想在雲計算領域工作--因為這些是雲計算團隊真正致力於解決的問題類型。 <p>但是，如果你能完成雲計算簡歷挑戰，你將學到一些東西：<p>前端和後端軟件開發<p>雲服務和&quot;serverless&quot;<p>雲網絡，特別是DNS和CDN<p>雲安全<p>DevOps原則（版本控制、基礎設施即代碼、CI/CD）<p>而且你將通過實踐來學習，因為規範沒有給你足夠的幫助，沒有大量的試驗和錯誤就無法弄清這些。這是一種混亂的學習方式，但現實是混亂的。<p>人們有時會糾結於雲簡歷挑戰中的 \"簡歷 \"部分，說 \"誰會對簡歷網站印象深刻？(雖然我認為個人網站作為學習工具被低估了，只是因為它們給了你內在的動力，讓你不斷地維護和更新網站，這給了任何副業項目90%的價值）。重要的是建立真正的東西，在這個世界上有目的的東西--而不是一個玩具教程。<p>最後一件事：雖然有一本關於挑戰的指南[1]可以購買（實際上是3本，每朵雲都有一本！我剛剛更新了它們！它們很棒！），但挑戰本身是免費的，而且將繼續免費供大家使用。我很樂意回答任何問題--CRC不是我的工作，它是一個充滿激情的項目，我總是願意接受關於如何使它成為更好的體驗的建議。<p>[0] https://cloudresumechallenge.dev/docs/the-challenge\n[1] https://cloudresumechallenge.dev/book/\n"
}