{
  "@type": "NewsArticle",
  "identifier": "2022--08--08--en--myfeed--HackerNews--NewsArticle--32381323",
  "url": "https://news.ycombinator.com/item?id=32381323",
  "headline": "Is-it-even-legal startup culture by LATOKEN CEO",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This story is widely discussed in the Russian-speaking tech community over the past few days.<p>It started with a video of LATOKEN zoom meetings where the CEO is shouting, cursing at and publicly humiliating company employees [1]. The video is mostly in Russian but auto-subtitles in English provide a good representation with all expletives replaced with &quot;[__]&quot;.<p>The video also alleges that the CEO takes away employee stock options for things like missing meetings or deadlines and provides a screenshot from company Slack for proof, because allegedly all of this is done in public.<p>In the last day or two CEO wrote public posts to defend his approach. Here is a translation of the beginning of one of the posts [2]:<p>BE PARANOIC - YOUR BUSINESS IS STEALING RIGHT NOW ON ZOOM Or how to survive in crypto and create a scalable product with an effective team of 100-300 people remotely?<p>Upd. The video can be compared to a torture tape from someone's bedroom. Well, ok, this is &quot;bdsm&quot; with the rules that everyone agreed on and the zoom out button. You need olympic-level bdsm in a startup, that's your only advantage over legacy companies that they can't copy. Did you see the reaction to the video? They cannot copy that.<p>Briefly: New rounds of evolution and products are created by non-standard individuals under the pressure of a threat to survival - open the eyes of the team to it. Build the culture of Olympic athletes with automatic up or out. Describe it and reward with options those who identify free riders who break your rules. Hire and train athletes with case studies, bringing problems and even spanking to the general discussion. Teach them to conflict openly in order to achieve a result. As long as your up or out doesn't work automatically, push as hard as you can to get the result or out so that the free riders don't decompose the athletes. But at the same time, guarantee the execution of contracts, and allow employees to swear at you, but in front of you, and not in the locker room behind the back of a “coach”.<p>You have to and you can afford it: in web3 channels this is a constant background - in any case, you will be attacked by free riders and thieves, and the public likes it. Think of these attacks as a publicity stunt to magnetize like-minded people who can create the future.<p>[1] https://www.youtube.com/watch?v=C3bKjgspTFk<p>[2] https://www.facebook.com/valentin.preobrazhenskiy/posts/pfbid02a1fTaakmSLia9mU3AP1C9e8eVhNy7qndbUnjEU33qvCMrpwGfXtt2QnzFLxoc1Zal",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "mikpanko",
    "url": "https://news.ycombinator.com/user?id=mikpanko"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32381323",
  "sameAs": "https://news.ycombinator.com/item?id=32381323",
  "dateCreated": "2022-08-08T02:16:33.505Z",
  "datePublished": "2022-08-08T00:37:17.000Z",
  "dateModified": "2022-08-08T02:16:33.505Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "LATOKEN首席执行官的Is-it-even-legal初创企业文化\n",
  "headline_zh-Hant": "LATOKEN首席執行官的Is-it-even-legal初創企業文化\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "过去几天，这个故事在讲俄语的科技界被广泛讨论。<p>它始于一段LATOKEN放大会议的视频，其中CEO对公司员工大喊大叫、咒骂并公开羞辱他们[1]。<p>该视频主要是俄语，但英语的自动字幕提供了一个很好的代表性，所有的脏话都被替换成了&quot;[__]&quot;。<p>该视频还指称，CEO会因为错过会议或最后期限等事情而剥夺员工的股票期权，并提供了公司Slack的截图作为证据，因为据称这些都是公开进行的。<p>在过去的一两天，CEO写公开文章为他的做法辩护。以下是其中一个帖子[2]的开头翻译：<p>警惕--你的业务现在正在ZOOM上偷窃，或者如何在加密货币中生存，并与100-300人的有效团队远程创建一个可扩展的产品？<p>更新。这段视频可以比作某人卧室里的酷刑录像。好吧，好吧，这是&quot;bdsm&quot;与每个人都同意的规则和放大的按钮。创业公司需要奥林匹克级别的bdsm，这是你对传统公司唯一的优势，他们无法复制。你看到人们对这段视频的反应了吗？他们无法复制。<p>简而言之。新一轮的进化和产品是由非标准的人在生存威胁的压力下创造出来的--让团队睁大眼睛看。建立奥林匹克运动员的文化，自动向上或向外。对它进行描述，并对那些发现破坏你的规则的自由骑手进行奖励。用案例研究来雇用和训练运动员，把问题甚至打屁股带到一般讨论中。教会他们公开冲突，以达到一个结果。只要你的上场或下场不能自动运作，就尽可能地推动结果或下场，这样自由人就不会分解运动员。但与此同时，要保证合同的执行，允许员工对你说脏话，但要在你面前说，而不是在更衣室里背着 \"教练 \"说。<p>你必须这样做，而且你也负担得起：在web3频道，这是一个持续的背景--无论如何，你会受到自由骑手和小偷的攻击，而公众喜欢这样。把这些攻击看作是一种宣传噱头，以吸引那些能够创造未来的志同道合者。<p>[1] https://www.youtube.com/watch?v=C3bKjgspTFk<p>[2] https://www.facebook.com/valentin.preobrazhenskiy/posts/pfbid02a1fTaakmSLia9mU3AP1C9e8eVhNy7qndbUnjEU33qvCMrpwGfXtt2QnzFLxoc1Zal\n",
  "description_zh-Hant": "過去幾天，這個故事在講俄語的科技界被廣泛討論。<p>它始於一段LATOKEN放大會議的視頻，其中CEO對公司員工大喊大叫、咒罵並公開羞辱他們[1]。<p>該視頻主要是俄語，但英語的自動字幕提供了一個很好的代表性，所有的髒話都被替換成了&quot;[__]&quot;。<p>該視頻還指稱，CEO會因為錯過會議或最後期限等事情而剝奪員工的股票期權，並提供了公司Slack的截圖作為證據，因為據稱這些都是公開進行的。<p>在過去的一兩天，CEO寫公開文章為他的做法辯護。以下是其中一個帖子[2]的開頭翻譯：<p>警惕--你的業務現在正在ZOOM上偷竊，或者如何在加密貨幣中生存，並與100-300人的有效團隊遠程創建一個可擴展的產品？<p>更新。這段視頻可以比作某人臥室裡的酷刑錄像。好吧，好吧，這是&quot;bdsm&quot;與每個人都同意的規則和放大的按鈕。創業公司需要奧林匹克級別的bdsm，這是你對傳統公司唯一的優勢，他們無法複製。你看到人們對這段視頻的反應了嗎？他們無法複製。<p>簡而言之。新一輪的進化和產品是由非標準的人在生存威脅的壓力下創造出來的--讓團隊睜大眼睛看。建立奧林匹克運動員的文化，自動向上或向外。對它進行描述，並對那些發現破壞你的規則的自由騎手進行獎勵。用案例研究來僱用和訓練運動員，把問題甚至打屁股帶到一般討論中。教會他們公開衝突，以達到一個結果。只要你的上場或下場不能自動運作，就儘可能地推動結果或下場，這樣自由人就不會分解運動員。但與此同時，要保證合同的執行，允許員工對你說髒話，但要在你面前說，而不是在更衣室裡揹著 \"教練 \"說。<p>你必須這樣做，而且你也負擔得起：在web3頻道，這是一個持續的背景--無論如何，你會受到自由騎手和小偷的攻擊，而公眾喜歡這樣。把這些攻擊看作是一種宣傳噱頭，以吸引那些能夠創造未來的志同道合者。<p>[1] https://www.youtube.com/watch?v=C3bKjgspTFk<p>[2] https://www.facebook.com/valentin.preobrazhenskiy/posts/pfbid02a1fTaakmSLia9mU3AP1C9e8eVhNy7qndbUnjEU33qvCMrpwGfXtt2QnzFLxoc1Zal\n"
}