{
  "@type": "NewsArticle",
  "identifier": "2022--08--15--en--myfeed--HackerNews--NewsArticle--32472713",
  "url": "https://news.ycombinator.com/item?id=32472713",
  "headline": "Tell HN: I am about to sue Apple for its service",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am from India. My 10 day old Macbook Pro died suddenly last week. In India we don't have Genius bars like in the States, what we have is a franchise model where in small repair shops are given the right to repair (only part to part replacement) and they probably get some commission. The guys in these shops are very afraid of Apple and its policies. Even things which normally would get fixed in Genius bars without any second thought, these shops will outright refuse to repair with the fear that Apple would revoke their license. Now this has directly affected the customers like me. Moreover, the staff in these shops are highly incompetent and do not have good knowledge about Apple in general.<p>In my case, the shop lady put a big scratch on the top of my Macbook while she was rotating it upside down to take pictures from all angle. Apparently it is required. Not sure if they have this procedure in the US when you go to submit the laptop. Now, the staff at the shop told me they do not want to involve the management and they would do something about it. Had this been completely managed by Apple, this wouldn't have made a single dent in Apple's profit if they just decided to give me a new laptop but since its a franchise model, they behave differently, and do not want to lose a single rupee and hence refuse to replace or even change the top case having the scratch caused by them.<p>Moreover, they will take around 2-3 weeks to replace your logic board / battery / screen / keyboard. Just about anything. I don't know if Apple will survive if they did this in the US.<p>Apple support informed me that they are waiting for a reply from the shop, about the scratch and status in general before they could take any action - its been 5 days (including the weekend) already.<p>I on the other do not want to get the laptop repaired by these guys who are not even capable of keeping the laptop scratch free, so if I do not get a new replacement laptop (machine assembled) from Apple - because I think they are the culprit here, I would be suing them. In the US, I don't think people would have to go to that length for something as simple as this, but here in India you have to fight for it. It will probably cost me lot of money and time but I am fed up being a consumer in India and being taken for a ride all the time.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "mkagenius",
    "url": "https://news.ycombinator.com/user?id=mkagenius"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32472713",
  "sameAs": "https://news.ycombinator.com/item?id=32472713",
  "dateCreated": "2022-08-15T17:42:17.069Z",
  "datePublished": "2022-08-15T17:34:46.000Z",
  "dateModified": "2022-08-15T17:42:17.069Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "告诉HN：我即将起诉苹果公司的服务\n",
  "headline_zh-Hant": "告訴HN：我即將起訴蘋果公司的服務\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我来自印度。我的10天的Macbook Pro上周突然死亡。在印度，我们没有像美国那样的天才酒吧，我们有的只是一种特许经营模式，在这种模式下，小的维修店被赋予了维修权（只有零件对零件的更换），他们可能得到一些佣金。这些商店里的人非常害怕苹果和它的政策。即使是通常会在天才酒吧修理的东西，这些商店也会直接拒绝修理，担心苹果会撤销他们的许可证。现在这已经直接影响到像我这样的客户。此外，这些商店的工作人员非常不称职，对苹果的总体知识不甚了解。<p>在我的案例中，商店的女士在我的Macbook顶部放了一个大划痕，当时她正把它倒转过来从各个角度拍照。显然，这是必须的。不知道在美国，当你去提交笔记本时，他们是否有这个程序。现在，店里的工作人员告诉我，他们不想涉及管理层，他们会做些什么。如果这完全由苹果公司管理，如果他们只是决定给我一台新的笔记本电脑，这不会对苹果公司的利润产生任何影响，但由于它是一个特许经营模式，他们的行为是不同的，不想失去一个卢比，因此拒绝更换或甚至改变有他们造成的划痕的顶部外壳。<p>此外，他们将需要大约2-3周来更换你的逻辑板/电池/屏幕/键盘。几乎所有的东西都是如此。我不知道如果苹果公司在美国这样做还能不能生存下去。<p>苹果公司的支持人员告诉我，他们正在等待商店的答复，关于划痕和一般状况，然后他们才能采取任何行动--已经过了5天（包括周末）。<p>另一方面，我不想让这些家伙修理笔记本，他们甚至没有能力保持笔记本无划痕，所以如果我没有从苹果公司得到一个新的替代笔记本（机器组装）--因为我认为他们是这里的罪魁祸首，我将起诉他们。在美国，我不认为人们会为了这么简单的事情去做那么久，但在印度，你必须为之奋斗。这可能会花费我大量的金钱和时间，但我已经厌倦了在印度做消费者，一直被人耍得团团转。\n",
  "description_zh-Hant": "我來自印度。我的10天的Macbook Pro上週突然死亡。在印度，我們沒有像美國那樣的天才酒吧，我們有的只是一種特許經營模式，在這種模式下，小的維修店被賦予了維修權（只有零件對零件的更換），他們可能得到一些佣金。這些商店裡的人非常害怕蘋果和它的政策。即使是通常會在天才酒吧修理的東西，這些商店也會直接拒絕修理，擔心蘋果會撤銷他們的許可證。現在這已經直接影響到像我這樣的客戶。此外，這些商店的工作人員非常不稱職，對蘋果的總體知識不甚瞭解。<p>在我的案例中，商店的女士在我的Macbook頂部放了一個大劃痕，當時她正把它倒轉過來從各個角度拍照。顯然，這是必須的。不知道在美國，當你去提交筆記本時，他們是否有這個程序。現在，店裡的工作人員告訴我，他們不想涉及管理層，他們會做些什麼。如果這完全由蘋果公司管理，如果他們只是決定給我一臺新的筆記本電腦，這不會對蘋果公司的利潤產生任何影響，但由於它是一個特許經營模式，他們的行為是不同的，不想失去一個盧比，因此拒絕更換或甚至改變有他們造成的劃痕的頂部外殼。<p>此外，他們將需要大約2-3周來更換你的邏輯板/電池/屏幕/鍵盤。幾乎所有的東西都是如此。我不知道如果蘋果公司在美國這樣做還能不能生存下去。<p>蘋果公司的支持人員告訴我，他們正在等待商店的答覆，關於劃痕和一般狀況，然後他們才能採取任何行動--已經過了5天（包括週末）。<p>另一方面，我不想讓這些傢伙修理筆記本，他們甚至沒有能力保持筆記本無劃痕，所以如果我沒有從蘋果公司得到一個新的替代筆記本（機器組裝）--因為我認為他們是這裡的罪魁禍首，我將起訴他們。在美國，我不認為人們會為了這麼簡單的事情去做那麼久，但在印度，你必須為之奮鬥。這可能會花費我大量的金錢和時間，但我已經厭倦了在印度做消費者，一直被人耍得團團轉。\n"
}