{
  "@type": "NewsArticle",
  "identifier": "2022--08--23--en--myfeed--HackerNews--NewsArticle--32562557",
  "url": "https://news.ycombinator.com/item?id=32562557",
  "headline": "Tell HN: Had to delete my YouTube account",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Personalization algorithm rant, no conclusion or insights.<p>Yesterday I deleted my youtube account and will never visit this site for quite some time.<p>The reason is its obnoxious algorithm which degraded to the point it annoys me more than I could stand. In recent years it got more and more “personalized” instead of explorable and I simply cannot discover content that fits my interests. Every time I watched &lt;topic&gt; video either out of short interest or accidentally, the feed got flooded with low-int clones (not that it was good before that, new nonsense simply replaced the old one). Not interested and don’t recommend channel buttons do not work anymore. Browse channels is full of generic attention seekers. Search is irrelevant. Out of desperation I tried to turn watch history on and off, that didn’t help. I then deleted my watch history, most playlists and subs and instead of becoming neutral, the feed is now full of korean girls day vlogs, cats and pseudophilosophy.<p>In previous few years yt felt like a dumb kid following you everywhere and presenting things similar to what you enjoyed yesterday and got enough of. You could yell at it sometimes, it was bearable but not funny. Now it’s full-on dementia and I can do nothing. It’s sad because I know that creators and topics I’d love (and maybe don’t know about yet) are out there somewhere, and the only barrier between me and them is this algorithmic prison.<p>I wanted to finish with some constructive discussion cues, but it made me too sad, hope HN will figure it out if needed.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "wruza",
    "url": "https://news.ycombinator.com/user?id=wruza"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32562557",
  "sameAs": "https://news.ycombinator.com/item?id=32562557",
  "dateCreated": "2022-08-23T10:30:52.044Z",
  "datePublished": "2022-08-23T10:00:25.000Z",
  "dateModified": "2022-08-23T10:30:52.044Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "告诉HN：不得不删除我的YouTube账户\n",
  "headline_zh-Hant": "告訴HN：不得不刪除我的YouTube賬戶\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "个性化算法的咆哮，没有结论或见解。<p>昨天我删除了我的youtube账户，并且在相当长的一段时间内不会访问这个网站。<p>原因是它令人厌恶的算法，它退化到让我恼火的地步，我无法忍受。近年来，它变得越来越 \"个性化\"，而不是可探索，我根本无法发现符合我兴趣的内容。每次我看&lt;topic&gt;视频时，要么是出于短暂的兴趣，要么是不小心，饲料就会被低端的克隆品淹没（并不是说之前就很好，新的胡说八道只是取代了旧的）。不感兴趣和不推荐频道的按钮已经不起作用了。浏览频道充斥着一般的注意力寻求者。搜索是不相关的。出于无奈，我试着打开和关闭观看历史，这没有帮助。然后我删除了我的观看历史、大多数播放列表和子频道，现在的频道不再是中性的，而是充满了韩国女孩的日常微博、猫和伪哲学。<p>在之前的几年里，yt感觉就像一个愚蠢的孩子到处跟着你，呈现的东西与你昨天喜欢的东西相似，而且已经足够了。你有时可以对它大喊大叫，它可以忍受，但不好笑。现在它是完全的痴呆症，我什么也做不了。这很可悲，因为我知道我喜欢的创作者和话题（也许还不知道）就在某个地方，而我和他们之间的唯一障碍就是这个算法监狱。<p>我想用一些建设性的讨论线索来结束，但这让我太伤心了，希望HN在需要时能想出办法。\n",
  "description_zh-Hant": "個性化算法的咆哮，沒有結論或見解。<p>昨天我刪除了我的youtube賬戶，並且在相當長的一段時間內不會訪問這個網站。<p>原因是它令人厭惡的算法，它退化到讓我惱火的地步，我無法忍受。近年來，它變得越來越 \"個性化\"，而不是可探索，我根本無法發現符合我興趣的內容。每次我看&lt;topic&gt;視頻時，要麼是出於短暫的興趣，要麼是不小心，飼料就會被低端的克隆品淹沒（並不是說之前就很好，新的胡說八道只是取代了舊的）。不感興趣和不推薦頻道的按鈕已經不起作用了。瀏覽頻道充斥著一般的注意力尋求者。搜索是不相關的。出於無奈，我試著打開和關閉觀看歷史，這沒有幫助。然後我刪除了我的觀看歷史、大多數播放列表和子頻道，現在的頻道不再是中性的，而是充滿了韓國女孩的日常微博、貓和偽哲學。<p>在之前的幾年裡，yt感覺就像一個愚蠢的孩子到處跟著你，呈現的東西與你昨天喜歡的東西相似，而且已經足夠了。你有時可以對它大喊大叫，它可以忍受，但不好笑。現在它是完全的痴呆症，我什麼也做不了。這很可悲，因為我知道我喜歡的創作者和話題（也許還不知道）就在某個地方，而我和他們之間的唯一障礙就是這個算法監獄。<p>我想用一些建設性的討論線索來結束，但這讓我太傷心了，希望HN在需要時能想出辦法。\n"
}