{
  "@type": "NewsArticle",
  "identifier": "2022--08--12--en--myfeed--HackerNews--NewsArticle--32434741",
  "url": "https://news.ycombinator.com/item?id=32434741",
  "headline": "Tell HN: An example of how A/B testing ruined everything",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "On paper the idea is so simple, try out new things and if they improve the product great, if not, undo them. You iteratively and gradually keep getting better. But I always felt in my gut it was wrong, and now I've an example to share:<p>Fortnite!<p>When it got popular around 2018, I got really into it and saw the progression of it getting &quot;better&quot;!<p>EPIC, the company who made fortnite, started to listen to gamers and it ruined the game. Game is pretty hard, it's not just a shooter game, it has building mechanics - you can build walls to protect yourself... an average good player (https://youtu.be/ajM4OifohOk?t=42), (the really good players are playing at 240hz and you can't even see all the moves in 60hz youtube video.)<p>I wanted a practice mode, they made it.<p>I wanted they'd give us unlimited resources to practice, they made it so. I wished they'd give us a way to edit map, they did.... and more.<p>Game mechanics are hard so it makes sense to have a way for players to practice.<p>Every time me and my friends cheered, but we couldn't see far ahead.<p>Game went from fun/somewhat challenging/social hangout time to toxic/grifting type of place. Where only people who spent 5+ hours, not playing, practicing could even survive. To have fun in a game you need to be at least little good. But practice mode and full freedom in it made it so that the only way to have fun was to live a unfulfilling life overall as you'd be dedicating every walking hour on practice.<p>The whole culture within the game changed, before if you got challenged, you would accept it openly and fight and have good time, after &quot;improvements&quot; people would hide and sit in corners for 15 minutes at a time, only to die. Because now fighting meant you could run into someone who has been practicing 8+ hours daily and has no life.<p>In 1 year the difference between good and bad player became so wide they had to introduce tiered matching. It tracks how you are doing and if you keep doing better you are put into lobbies consisting of generally better players. This made even worst, if you do start to win, then you get placed with people who 100/100 no-life practice mode habitants - the more you played the less fun it'd get.<p>A/B testing would have always given a signal that things are getting better, up until a year later, when everything started to go down hill. i.e. Practice mode = engagement++++ week over week!",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "techsin101",
    "url": "https://news.ycombinator.com/user?id=techsin101"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32434741",
  "sameAs": "https://news.ycombinator.com/item?id=32434741",
  "dateCreated": "2022-08-12T05:00:48.674Z",
  "datePublished": "2022-08-12T04:33:40.000Z",
  "dateModified": "2022-08-12T05:00:48.674Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "告诉HN：一个A/B测试毁掉一切的例子\n",
  "headline_zh-Hant": "告訴HN：一個A/B測試毀掉一切的例子\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "从纸面上看，这个想法非常简单，尝试新的东西，如果它们能改善产品，那就很好，如果不能，就撤消它们。你反复地、逐渐地不断地变得更好。但我总觉得我的直觉是错误的，现在我有一个例子可以分享：<p>《堡垒之夜》！<p>当它在2018年左右流行起来时，我真的进入了它，看到它的进展越来越&quot;好&quot;！<p>EPIC，制作《堡垒之夜》的公司，开始听取游戏玩家的意见，它毁了这个游戏。游戏相当难，它不仅仅是一个射击游戏，它有建筑机制--你可以建墙来保护自己。一个普通的好玩家（https://youtu.be/ajM4OifohOk?t=42），（真正的好玩家是在240hz下玩的，你甚至不能在60hz的YouTube视频中看到所有的动作。）<p>我想要一个练习模式，他们做到了。<p>我希望他们能给我们无限的资源来练习，他们做到了。我希望他们能给我们一个编辑地图的方法，他们做到了....，还有更多。<p>游戏机制很难，所以有一个让玩家练习的方法是有意义的。<p>每次我和我的朋友们都会欢呼，但我们无法看到前方的远方。<p>游戏从有趣/有点挑战性/社交聚会的时间变成了有毒/漂移类型的地方。只有那些花了5个多小时不玩的人，才有可能在这里生存。要在游戏中获得乐趣，你至少要有一点本事。但练习模式和充分的自由使它成为获得乐趣的唯一途径，因为你要把每一个小时的时间都用在练习上，所以你的生活总体上是不充实的。<p>游戏中的整个文化发生了变化，以前如果你受到挑战，你会坦然接受并战斗，享受美好的时光，在&quot;改进&quot;之后，人们会躲在角落里，每次坐15分钟，只能死。因为现在战斗意味着你可能会遇到一个每天练习8个小时以上而没有生命的人。<p>在1年内，好的和坏的玩家之间的差异变得如此之大，他们不得不引入分层匹配。它跟踪你的表现，如果你继续做得更好，你就会被放入由一般更好的玩家组成的大厅。这使得情况更加糟糕，如果你开始赢了，那么你就会和那些100/100没有生命的练习模式的人放在一起--你玩得越多，乐趣就越少。<p>A/B测试会一直给出一个信号，即事情正在变得更好，直到一年后，一切都开始走下坡路。也就是说，练习模式=参与++++，一周比一周好!\n",
  "description_zh-Hant": "從紙面上看，這個想法非常簡單，嘗試新的東西，如果它們能改善產品，那就很好，如果不能，就撤消它們。你反覆地、逐漸地不斷地變得更好。但我總覺得我的直覺是錯誤的，現在我有一個例子可以分享：<p>《堡壘之夜》！<p>當它在2018年左右流行起來時，我真的進入了它，看到它的進展越來越&quot;好&quot;！<p>EPIC，製作《堡壘之夜》的公司，開始聽取遊戲玩家的意見，它毀了這個遊戲。遊戲相當難，它不僅僅是一個射擊遊戲，它有建築機制--你可以建牆來保護自己。一個普通的好玩家（https://youtu.be/ajM4OifohOk?t=42），（真正的好玩家是在240hz下玩的，你甚至不能在60hz的YouTube視頻中看到所有的動作。）<p>我想要一個練習模式，他們做到了。<p>我希望他們能給我們無限的資源來練習，他們做到了。我希望他們能給我們一個編輯地圖的方法，他們做到了....，還有更多。<p>遊戲機制很難，所以有一個讓玩家練習的方法是有意義的。<p>每次我和我的朋友們都會歡呼，但我們無法看到前方的遠方。<p>遊戲從有趣/有點挑戰性/社交聚會的時間變成了有毒/漂移類型的地方。只有那些花了5個多小時不玩的人，才有可能在這裡生存。要在遊戲中獲得樂趣，你至少要有一點本事。但練習模式和充分的自由使它成為獲得樂趣的唯一途徑，因為你要把每一個小時的時間都用在練習上，所以你的生活總體上是不充實的。<p>遊戲中的整個文化發生了變化，以前如果你受到挑戰，你會坦然接受並戰鬥，享受美好的時光，在&quot;改進&quot;之後，人們會躲在角落裡，每次坐15分鐘，只能死。因為現在戰鬥意味著你可能會遇到一個每天練習8個小時以上而沒有生命的人。<p>在1年內，好的和壞的玩家之間的差異變得如此之大，他們不得不引入分層匹配。它跟蹤你的表現，如果你繼續做得更好，你就會被放入由一般更好的玩家組成的大廳。這使得情況更加糟糕，如果你開始贏了，那麼你就會和那些100/100沒有生命的練習模式的人放在一起--你玩得越多，樂趣就越少。<p>A/B測試會一直給出一個信號，即事情正在變得更好，直到一年後，一切都開始走下坡路。也就是說，練習模式=參與++++，一週比一週好!\n"
}