{
  "@type": "NewsArticle",
  "identifier": "2022--08--22--en--myfeed--HackerNews--NewsArticle--32553267",
  "url": "https://news.ycombinator.com/item?id=32553267",
  "headline": "Show HN: Turn spare cash into sustainable investments that directly change lives",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN! Anyone looking for ways to make a positive impact with their investments?<p>Nowala enables everyone to turn spare cash into sustainable investments that directly change lives. We’re making it easy to improve the world in ways that are simple, profitable, and fun.<p>In just a few steps, you can directly provide electricity to households in Sierra Leone, West Africa with your very own solar panel. Not only that, you’ll get back your money with interest as the households use the solar panels.<p>Unlike charities or crowdfunding projects, your investment is directly tied to a solar panel so it is super transparent on how your money is used as well as what kind of impact you are making on the ground. On our app, you can see the returns paid back on a monthly basis while also getting personalized impact updates to know how they’re changing the world.<p>We are now providing clean solar-powered electricity to households in Port Loko, Sierra Leone! Today, we are super excited to announce that we’re extending our early release program and accepting more investment for our popular solar panels. To join, download our app from https://nowala.io or reach out to either koya@nowala.io",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "koya_nowala",
    "url": "https://news.ycombinator.com/user?id=koya_nowala"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32553267",
  "sameAs": "https://news.ycombinator.com/item?id=32553267",
  "dateCreated": "2022-08-22T16:34:57.730Z",
  "datePublished": "2022-08-22T15:56:09.000Z",
  "dateModified": "2022-08-22T16:34:57.730Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 将闲置现金转化为直接改变生活的可持续投资\n",
  "headline_zh-Hant": "Show HN: 將閒置現金轉化為直接改變生活的可持續投資\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! 有人在寻找通过投资产生积极影响的方法吗？<p>Nowala使每个人都能将闲置现金转化为可持续的投资，直接改变生活。我们正在使改善世界的方式变得简单、有利可图和有趣。<p>只需几个步骤，你就可以用自己的太阳能电池板直接向西非塞拉利昂的家庭提供电力。<p>与慈善机构或众筹项目不同，您的投资直接与太阳能电池板挂钩，因此，您的资金如何使用以及您在当地产生的影响是超级透明的。在我们的应用程序上，你可以看到每月支付的回报，同时还可以获得个性化的影响更新，以了解他们是如何改变世界的。<p>我们现在正在为塞拉利昂洛科港的家庭提供清洁的太阳能电力 今天，我们超级兴奋地宣布，我们正在扩大我们的早期发布计划，并为我们受欢迎的太阳能板接受更多投资。要加入，请从https://nowala.io，或联系koya@nowala.io，下载我们的应用程序。\n",
  "description_zh-Hant": "嗨，HN! 有人在尋找通過投資產生積極影響的方法嗎？<p>Nowala使每個人都能將閒置現金轉化為可持續的投資，直接改變生活。我們正在使改善世界的方式變得簡單、有利可圖和有趣。<p>只需幾個步驟，你就可以用自己的太陽能電池板直接向西非塞拉利昂的家庭提供電力。<p>與慈善機構或眾籌項目不同，您的投資直接與太陽能電池板掛鉤，因此，您的資金如何使用以及您在當地產生的影響是超級透明的。在我們的應用程序上，你可以看到每月支付的回報，同時還可以獲得個性化的影響更新，以瞭解他們是如何改變世界的。<p>我們現在正在為塞拉利昂洛科港的家庭提供清潔的太陽能電力 今天，我們超級興奮地宣佈，我們正在擴大我們的早期發佈計劃，併為我們受歡迎的太陽能板接受更多投資。要加入，請從https://nowala.io，或聯繫koya@nowala.io，下載我們的應用程序。\n"
}