{
  "@type": "NewsArticle",
  "identifier": "2022--08--12--en--myfeed--HackerNews--NewsArticle--32441443",
  "url": "https://news.ycombinator.com/item?id=32441443",
  "headline": "Tell HN: My dad told me I'd be a high school dropout and I make 200k a year",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Before I start this.<p>I'm in therapy. I hit on a girl at a bar a few months ago and she finally convinced me to get therapy by saying everyone just needs it .<p>Everyone, especially all of you with your fabulous incomes, get some therapy.<p>I am so grateful to all of you, to every programmer who helped me on stack overflow. To everyone on on the Unity forums, who would help me with extremely basic programming questions. When I first started programming, I had no direction. I didn't even understand what an array was. Now, despite my dad being a psychotic violent monster, kicking me out, subjecting me to multiple evictions with my mom,I had actually gotten into a nice college after High School. I did go to community college first, and there. I met so many amazing great people.<p>One girl from high school who was actually extremely smart, she got into a really good school.\nBut unfortunately she had to drop out of her for your school and go to a community, because her mom was demoted at work.<p>I will say from my time in college, and meeting people there's one policy I hate with the most fervancy<p>And it's affirmative action by far, all of my Asian friends have lives which were way worse than mine. A Chinese friend was living in a homeless shelter at 19 because his dad was so f*** abusive. His dad would just beat him every single day<p>However, because my mother couldn't fill out a basic form. God bless her heart, I ended up dropping out.<p>But within about 3 years of dropping out of college I was already at 100k. By the time I applied for financial aid to finish up my last year of college, I didn't qualify for anything.<p>I absolutely love programming. As long as you have a used laptop, you could find one on eBay for $100. All right. Maybe the battery doesn't work good, you now have a portable desktop.<p>Install Ubuntu on that and start hacking. That's what I did, I was like oh cool. I can like get the terminal and stuff about buying a Mac because Macs are expensive.<p>Shout outs to Google, for making it possible for broke kids to develop for Android phones. That 40$ Walmart phone, you can learn to run applications on that. The phone I had, the phone I used to show off the early apps that got me my first salary job. Might have been worth $100, maybe $150 at most.<p>And, I carry on this tradition. Programmers are a very welcoming bunch. I was a silly college dropout, and just because I installed Ubuntu on my laptop , experienced software engineers on various forums would help me with so many issues.<p>I think for a lot of you neck beards, it's almost like a calling. You need to help a 19-year-old who tried out Ubuntu for the first time and all of a sudden she can't play League of Legends anymore. You need to help her figure out how to install Wine.<p>It's surreal, and I do the same thing. My time is worth a lot of money, but if I'm on a video game dev forum and some college kid is struggling with a concept, I'll stop and take 10 or 20 minutes to research the problem and provide a solution.<p>It's so amazing how free all of this education is.<p>Now that I'm a Senior Software Engineer, I've started to give back. I've written tutorials, and I think learning to program is one of the last career options when you don't have an educational background.<p>It's crazy, as long as you're motivated and you have an internet connection. You can do anything. You can program and program and program and program, create the best apps you can. Get into Dev groups, show off your stuff. Eventually. Someone's going to give you a shot<p>And if they don't, give yourself a shot. Put your apps up on Google Play. Just keep coding. No matter what, just keep coding. Early in my career. I had so many recruiters laugh and say I should just go back to college.<p>Why, just say I'm not qualified.<p>I will say this country is absolutely disgusting to people who come from unstable backgrounds .<p>I still have numerous medical issues. I've only recently started treating because my dad outright refused to treat them. My dad is often confused and hurt as to why I don't talk to him now.<p>Back when I didn't have health care, I would often have days where I felt horrible. But hey when you're broke you just drink another Red Bull and keep going. Later on, once I started making money, I found the keto diet and lost about 80 lb. And I'm working on managing my health conditions, although my dad 's actions have caused permanent damage.<p>And then I found it much easy to meet someone, of course. That's never been a priority to me, as when I was 19 my first girlfriend dumped me when I lost my job.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "999900000999",
    "url": "https://news.ycombinator.com/user?id=999900000999"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32441443",
  "sameAs": "https://news.ycombinator.com/item?id=32441443",
  "dateCreated": "2022-08-12T17:41:47.616Z",
  "datePublished": "2022-08-12T17:18:49.000Z",
  "dateModified": "2022-08-12T17:41:47.616Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "告诉HN：我父亲告诉我，我将是一个高中辍学者，而我每年赚20万。\n",
  "headline_zh-Hant": "告訴HN：我父親告訴我，我將是一個高中輟學者，而我每年賺20萬。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在我开始之前。<p>我正在接受治疗。几个月前，我在酒吧里勾搭了一个女孩，她终于说服我接受治疗，说每个人都需要治疗。<p>每个人，尤其是你们这些收入丰厚的人，都去接受治疗吧。<p>我非常感谢你们所有人，感谢每一个在stack overflow上帮助我的程序员。感谢Unity论坛上的每个人，他们会帮助我解决极其基本的编程问题。当我第一次开始编程时，我没有方向。我甚至不明白什么是数组。现在，尽管我的父亲是一个精神暴力的怪物，把我赶出家门，让我和我母亲多次被驱逐，但我在高中毕业后还是进入了一所不错的大学。我确实先上了社区大学，在那里。我遇到了很多了不起的好人。<p>高中时有一个女孩其实非常聪明，她进入了一所非常好的学校。\n但不幸的是，她不得不从她的学校辍学，去了社区，因为她的妈妈在工作中被降职了。<p>我要说的是，从我在大学的时间里，以及与人们的接触中，有一项政策是我最讨厌的<p>，这就是迄今为止的平权行动，我所有的亚洲朋友的生活都比我糟糕。一个中国朋友在19岁时住在一个无家可归的收容所里，因为他的父亲太他妈虐待人了。他的父亲每天都会打他<p>然而，由于我的母亲连一个基本的表格都不会填写。上帝保佑她的心，我最终退学了。<p>但在退学后的3年内，我的学费已经达到10万。当我申请财政援助来完成我最后一年的大学学业时，我没有任何资格。<p>我绝对喜欢编程。只要你有一台二手笔记本电脑，你可以在eBay上花100美元找到一台。好吧。也许电池不好用，你现在有一个便携式的桌面。<p>在上面安装Ubuntu，然后开始黑客攻击。这就是我所做的，我当时想，哦，酷。我可以得到终端和关于购买Mac的东西，因为Mac很贵。<p>向谷歌致敬，因为它使破产的孩子有可能为Android手机开发。那部40美元的沃尔玛手机，你可以学习在上面运行应用程序。我的那部手机，是我用来炫耀早期应用的手机，它让我得到了第一份薪水工作。可能值100美元，最多150美元。<p>而且，我还继承了这个传统。程序员是一群非常受欢迎的人。我是一个愚蠢的大学辍学生，仅仅因为我在笔记本上安装了Ubuntu ，各个论坛上有经验的软件工程师就会帮助我解决很多问题。<p>我想对于你们很多脖子上的胡子来说，这几乎就是一种召唤。你需要帮助一个19岁的孩子，她第一次尝试使用Ubuntu，突然间她就不能再玩英雄联盟了。你需要帮助她弄清楚如何安装Wine。<p>这是超现实的，我也在做同样的事情。我的时间很值钱，但如果我在一个视频游戏开发论坛上，一些大学生正在为一个概念而挣扎，我会停下来，花10或20分钟来研究这个问题并提供一个解决方案。<p>所有这些教育都是免费的，这太不可思议了。我写了一些教程，我认为当你没有教育背景时，学习编程是最后的职业选择之一。<p>这很疯狂，只要你有动力，你有一个互联网连接。你可以做任何事情。你可以编程，编程，编程，编程，创建你能做的最好的应用程序。进入开发小组，炫耀你的东西。最终。有人会给你一个机会<p>如果他们不这样做，就给自己一个机会。把你的应用程序放在Google Play上。继续编码。无论怎样，都要继续编码。在我职业生涯的早期。我有很多招聘人员笑着说我应该回到大学去。<p>为什么，就说我不合格。<p>我要说的是，这个国家对那些来自不稳定背景的人来说绝对是令人厌恶的。<p>我仍然有许多医疗问题。我最近才开始治疗，因为我爸爸断然拒绝治疗它们。我的父亲经常感到困惑和受伤，不知道为什么我现在不和他说话。<p>在我没有医疗保健的时候，我经常会有几天感觉很糟糕。但是，当你身无分文的时候，你就再喝一瓶红牛，继续前进。后来，一旦我开始赚钱，我发现了酮症饮食，并减掉了大约80磅。\n",
  "description_zh-Hant": "在我開始之前。<p>我正在接受治療。幾個月前，我在酒吧裡勾搭了一個女孩，她終於說服我接受治療，說每個人都需要治療。<p>每個人，尤其是你們這些收入豐厚的人，都去接受治療吧。<p>我非常感謝你們所有人，感謝每一個在stack overflow上幫助我的程序員。感謝Unity論壇上的每個人，他們會幫助我解決極其基本的編程問題。當我第一次開始編程時，我沒有方向。我甚至不明白什麼是數組。現在，儘管我的父親是一個精神暴力的怪物，把我趕出家門，讓我和我母親多次被驅逐，但我在高中畢業後還是進入了一所不錯的大學。我確實先上了社區大學，在那裡。我遇到了很多了不起的好人。<p>高中時有一個女孩其實非常聰明，她進入了一所非常好的學校。\n但不幸的是，她不得不從她的學校輟學，去了社區，因為她的媽媽在工作中被降職了。<p>我要說的是，從我在大學的時間裡，以及與人們的接觸中，有一項政策是我最討厭的<p>，這就是迄今為止的平權行動，我所有的亞洲朋友的生活都比我糟糕。一箇中國朋友在19歲時住在一個無家可歸的收容所裡，因為他的父親太他媽虐待人了。他的父親每天都會打他<p>然而，由於我的母親連一個基本的表格都不會填寫。上帝保佑她的心，我最終退學了。<p>但在退學後的3年內，我的學費已經達到10萬。當我申請財政援助來完成我最後一年的大學學業時，我沒有任何資格。<p>我絕對喜歡編程。只要你有一臺二手筆記本電腦，你可以在eBay上花100美元找到一臺。好吧。也許電池不好用，你現在有一個便攜式的桌面。<p>在上面安裝Ubuntu，然後開始黑客攻擊。這就是我所做的，我當時想，哦，酷。我可以得到終端和關於購買Mac的東西，因為Mac很貴。<p>向谷歌致敬，因為它使破產的孩子有可能為Android手機開發。那部40美元的沃爾瑪手機，你可以學習在上面運行應用程序。我的那部手機，是我用來炫耀早期應用的手機，它讓我得到了第一份薪水工作。可能值100美元，最多150美元。<p>而且，我還繼承了這個傳統。程序員是一群非常受歡迎的人。我是一個愚蠢的大學輟學生，僅僅因為我在筆記本上安裝了Ubuntu ，各個論壇上有經驗的軟件工程師就會幫助我解決很多問題。<p>我想對於你們很多脖子上的鬍子來說，這幾乎就是一種召喚。你需要幫助一個19歲的孩子，她第一次嘗試使用Ubuntu，突然間她就不能再玩英雄聯盟了。你需要幫助她弄清楚如何安裝Wine。<p>這是超現實的，我也在做同樣的事情。我的時間很值錢，但如果我在一個視頻遊戲開發論壇上，一些大學生正在為一個概念而掙扎，我會停下來，花10或20分鐘來研究這個問題並提供一個解決方案。<p>所有這些教育都是免費的，這太不可思議了。我寫了一些教程，我認為當你沒有教育背景時，學習編程是最後的職業選擇之一。<p>這很瘋狂，只要你有動力，你有一個互聯網連接。你可以做任何事情。你可以編程，編程，編程，編程，創建你能做的最好的應用程序。進入開發小組，炫耀你的東西。最終。有人會給你一個機會<p>如果他們不這樣做，就給自己一個機會。把你的應用程序放在Google Play上。繼續編碼。無論怎樣，都要繼續編碼。在我職業生涯的早期。我有很多招聘人員笑著說我應該回到大學去。<p>為什麼，就說我不合格。<p>我要說的是，這個國家對那些來自不穩定背景的人來說絕對是令人厭惡的。<p>我仍然有許多醫療問題。我最近才開始治療，因為我爸爸斷然拒絕治療它們。我的父親經常感到困惑和受傷，不知道為什麼我現在不和他說話。<p>在我沒有醫療保健的時候，我經常會有幾天感覺很糟糕。但是，當你身無分文的時候，你就再喝一瓶紅牛，繼續前進。後來，一旦我開始賺錢，我發現了酮症飲食，並減掉了大約80磅。\n"
}