{
  "@type": "NewsArticle",
  "identifier": "2022--08--15--en--myfeed--HackerNews--NewsArticle--32469633",
  "url": "https://news.ycombinator.com/item?id=32469633",
  "headline": "Tell HN: Amazon allows unauthorized parties to use credit cards",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "About three weeks ago I noticed an unauthorized charge on my Discover card from Amazon -- I have the Discover mobile app and get instant notifications for every transaction. I immediately froze my account. After contacting Amazon, they confirmed that the charge did not originate from my account and told me to contact Discover; I contacted Discover, got my card cancelled, and a week later had a new card with a different number.<p>That was the end of my problems. Or so I thought.<p>The day before yesterday I noticed a recent charge from Amazon. Upon calling Amazon, it appears that it was for the Prime subscription of another Amazon account, not mine. I put it very plainly that this charge was unauthorized, and that I do not want anyone else using my credit card with their Amazon account. To my surprise, they told me that they couldn't remove my credit card from another person's Amazon account as a form of payment. All they could do was refund the amount to me. I asked if that party would be able to continue to charge purchases to my credit card, and the customer service representative said yes. And there was nothing they could do about it.<p>Amazon, being a big company, I'm sure they somehow update credit card information from the credit card companies themselves. Thus, they were able to get the new number for my card after I cancelled the old one, and I assume they surreptitiously linked it to every account which had my old credit card linked.<p>I contacted Discover again and they're investigating it. I just can't believe Amazon is allowed to operate this way -- I assume it's illegal in some form. Do I have any form of legal recourse? Has anyone else experienced this?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "nateb2022",
    "url": "https://news.ycombinator.com/user?id=nateb2022"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32469633",
  "sameAs": "https://news.ycombinator.com/item?id=32469633",
  "dateCreated": "2022-08-15T14:28:01.691Z",
  "datePublished": "2022-08-15T13:47:38.000Z",
  "dateModified": "2022-08-15T14:28:01.691Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "告诉HN：亚马逊允许未授权方使用信用卡\n",
  "headline_zh-Hant": "告訴HN：亞馬遜允許未授權方使用信用卡\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大约三周前，我注意到我的Discover卡上有一笔来自亚马逊的未经授权的费用--我有Discover手机应用程序，每笔交易都会得到即时通知。我立即冻结了我的账户。在与亚马逊联系后，他们确认这笔费用并非来自我的账户，并告诉我与Discover联系；我与Discover联系，取消了我的卡，并在一周后拥有了一张号码不同的新卡。<p>前天，我注意到最近有一笔来自亚马逊的费用。给亚马逊打电话后，似乎是另一个亚马逊账户的Prime订阅费用，而不是我的。我非常明确地指出，这笔费用是未经授权的，而且我不希望其他人用我的信用卡来使用他们的亚马逊账户。令我惊讶的是，他们告诉我，他们不能从另一个人的亚马逊账户中删除我的信用卡作为支付方式。他们所能做的就是把金额退给我。我问那一方是否可以继续从我的信用卡上扣款，客户服务代表说可以。<p>亚马逊作为一家大公司，我相信他们会以某种方式从信用卡公司本身更新信用卡信息。因此，在我注销了旧卡后，他们能够得到我的新卡号，我想他们会偷偷地把它与每一个有我的旧信用卡链接的账户联系起来。<p>我再次联系了Discover，他们正在调查。我只是不相信亚马逊被允许以这种方式运作--我认为这在某种形式上是非法的。我有任何形式的法律追索权吗？还有人遇到过这种情况吗？\n",
  "description_zh-Hant": "大約三週前，我注意到我的Discover卡上有一筆來自亞馬遜的未經授權的費用--我有Discover手機應用程序，每筆交易都會得到即時通知。我立即凍結了我的賬戶。在與亞馬遜聯繫後，他們確認這筆費用並非來自我的賬戶，並告訴我與Discover聯繫；我與Discover聯繫，取消了我的卡，並在一週後擁有了一張號碼不同的新卡。<p>前天，我注意到最近有一筆來自亞馬遜的費用。給亞馬遜打電話後，似乎是另一個亞馬遜賬戶的Prime訂閱費用，而不是我的。我非常明確地指出，這筆費用是未經授權的，而且我不希望其他人用我的信用卡來使用他們的亞馬遜賬戶。令我驚訝的是，他們告訴我，他們不能從另一個人的亞馬遜賬戶中刪除我的信用卡作為支付方式。他們所能做的就是把金額退給我。我問那一方是否可以繼續從我的信用卡上扣款，客戶服務代表說可以。<p>亞馬遜作為一家大公司，我相信他們會以某種方式從信用卡公司本身更新信用卡信息。因此，在我註銷了舊卡後，他們能夠得到我的新卡號，我想他們會偷偷地把它與每一個有我的舊信用卡鏈接的賬戶聯繫起來。<p>我再次聯繫了Discover，他們正在調查。我只是不相信亞馬遜被允許以這種方式運作--我認為這在某種形式上是非法的。我有任何形式的法律追索權嗎？還有人遇到過這種情況嗎？\n"
}