{
  "@type": "NewsArticle",
  "identifier": "2022--08--21--en--myfeed--HackerNews--NewsArticle--32539657",
  "url": "https://news.ycombinator.com/item?id=32539657",
  "headline": "Show HN: Place to support and validate early startup ideas",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I made this for people like myself who keep a list of ideas for apps / startups.<p>I also made it for people who are curious to see what projects others have &quot;in their drawer&quot;... and who may want to have a say in which idea should see the light of day.<p><a href=\"https://ideas.dynamate.io/\" rel=\"nofollow\">https://ideas.dynamate.io/</a><p>The site allows creators to anonymously showcase their idea:<p>Title. Description text. Maybe some mockups...<p>I've tried to make it so that it's quick and easy to just dump an idea in there that's been sitting on some list of yours for months - and hopefully get some feedback on it.<p>If someone else on the site sees your idea and likes it, they have various choices of showing support:<p>They can upvote.<p>They can subscribe to progress updates.<p>They can tell you why they want it (there's a questionaire that is loosely based on &quot;The Mom Test&quot;).<p>And they can even send you money as encouragement.<p>As the owner of an idea, you can see how many unique upvotes, subscriptions, etc. your idea has received. You get a nice table of all the ideas you have on the site, sorted by feedback score. Also, in the case of non-anonymous subscriptions or donations, you can get in touch with early supporters.<p>Publicly, though, neither upvotes nor any other form of support for an idea are shown. This is so you cannot go to the site and just grab the most popular ideas from there. And also so that each idea can get the same amount of exposure and attention.<p>There are many great books out there on validating startup ideas. And my site won't be a replacement for those. Rather, it's designed as a low hanging fruit to get your idea out there.<p>I hope some of you find it useful. Feel free to test it out on the ideas I've posted on there. And perhaps share some of your own!<p>Also curious to hear your feedback both on the idea itself and the execution so far.<p>The site is still early beta. Please let me know if you run into any bugs. Also, and ideas how I can make it better would be greatly appreciated.<p>Thanks!",
  "keywords": [
    "Show HN"
  ],
  "genre": "Show HN",
  "author": {
    "@type": "Person",
    "name": "leobg",
    "url": "https://news.ycombinator.com/user?id=leobg"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32539657",
  "sameAs": "https://ideas.dynamate.io/",
  "dateCreated": "2022-08-21T14:23:21.409Z",
  "datePublished": "2022-08-21T12:54:07.000Z",
  "dateModified": "2022-08-21T14:23:21.409Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Show HN: 支持和验证早期创业者想法的地方\n",
  "headline_zh-Hant": "Show HN: 支持和驗證早期創業者想法的地方\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我为像我这样的人做了这个，他们保留了一个应用程序/创业公司的想法清单。<p>我也为那些好奇的人做了这个，看看其他人有什么项目&quot;在他们的抽屉里&quot;......以及谁可能想在哪个想法应该看到光明方面有发言权。<p><a href=\"https://ideas.dynamate.io/\" rel=\"nofollow\">https://ideas.dynamate.io/</a><p>该网站允许创造者匿名展示他们的想法：<p>标题。说明文字。<p>我试图让它变得快速而简单，以便将一个在你的清单上放置了几个月的想法倾倒在那里--并希望得到一些反馈。<p>如果网站上的其他人看到你的想法并喜欢它，他们有各种选择来表示支持：<p>他们可以加注。 <p>他们可以订阅最新进展。<p>他们可以告诉你他们为什么想要它（有一个大致基于 \"妈妈测试 \"的问卷调查）。<p>他们甚至可以给你寄钱作为鼓励。你会得到一个很好的表格，列出你在网站上的所有想法，按反馈分数排序。另外，在非匿名订阅或捐赠的情况下，你可以与早期的支持者取得联系。<p>不过，公开的情况下，对一个想法的赞成票或任何其他形式的支持都不会被显示。这样做是为了让你不能去网站上随便抓取最受欢迎的想法。这也是为了让每个想法都能得到同样多的曝光和关注。<p>有很多关于验证创业想法的好书。我的网站不会取代这些书。相反，它被设计成一个低垂的果实，以使你的想法得到推广。<p>我希望你们中的一些人觉得它有用。我希望你们中的一些人发现它是有用的，请随意测试我在上面发布的想法。也许还可以分享一些你自己的想法！<p>我也很想听到你对这个想法本身和目前的执行情况的反馈。<p>这个网站仍然是早期测试版。如果你遇到任何错误，请让我知道。另外，如果有什么想法可以让它变得更好，我将非常感激。<p>谢谢!\n",
  "description_zh-Hant": "我為像我這樣的人做了這個，他們保留了一個應用程序/創業公司的想法清單。<p>我也為那些好奇的人做了這個，看看其他人有什麼項目&quot;在他們的抽屜裡&quot;......以及誰可能想在哪個想法應該看到光明方面有發言權。<p><a href=\"https://ideas.dynamate.io/\" rel=\"nofollow\">https://ideas.dynamate.io/</a><p>該網站允許創造者匿名展示他們的想法：<p>標題。說明文字。<p>我試圖讓它變得快速而簡單，以便將一個在你的清單上放置了幾個月的想法傾倒在那裡--並希望得到一些反饋。<p>如果網站上的其他人看到你的想法並喜歡它，他們有各種選擇來表示支持：<p>他們可以加註。 <p>他們可以訂閱最新進展。<p>他們可以告訴你他們為什麼想要它（有一個大致基於 \"媽媽測試 \"的問卷調查）。<p>他們甚至可以給你寄錢作為鼓勵。你會得到一個很好的表格，列出你在網站上的所有想法，按反饋分數排序。另外，在非匿名訂閱或捐贈的情況下，你可以與早期的支持者取得聯繫。<p>不過，公開的情況下，對一個想法的贊成票或任何其他形式的支持都不會被顯示。這樣做是為了讓你不能去網站上隨便抓取最受歡迎的想法。這也是為了讓每個想法都能得到同樣多的曝光和關注。<p>有很多關於驗證創業想法的好書。我的網站不會取代這些書。相反，它被設計成一個低垂的果實，以使你的想法得到推廣。<p>我希望你們中的一些人覺得它有用。我希望你們中的一些人發現它是有用的，請隨意測試我在上面發佈的想法。也許還可以分享一些你自己的想法！<p>我也很想聽到你對這個想法本身和目前的執行情況的反饋。<p>這個網站仍然是早期測試版。如果你遇到任何錯誤，請讓我知道。另外，如果有什麼想法可以讓它變得更好，我將非常感激。<p>謝謝!\n"
}