{
  "@type": "NewsArticle",
  "identifier": "2022--08--14--en--myfeed--HackerNews--NewsArticle--32462742",
  "url": "https://news.ycombinator.com/item?id=32462742",
  "headline": "Was Charlie Chaplain prosecuted for being raped at gunpoint?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Charlie Chaplin lost a paternity trial where the mother was Joan Barry (an alias), despite blood group tests excluding Chaplin as father. He was charged with several criminal charges relating to Barry. According to the 1946 appeal (also lost):<p>“She testified that she and defendant had four acts of sexual intercourse at or about the date when, in the ordinary course of nature, the child must have been begotten. These acts occurred on the 10th, 23rd, 24th and 30th days of December, 1942.” [1]<p>—-<p>Apparently not examined at trial was December 19th 1942, when according to Chaplin’s FBI file[2] (part 02, page 166), Barry also told the FBI she had an “affair”. At the time, Chaplin’s children Sydney &amp; Charles Jr were 13 and 14.<p>According to the record of Barry’s interview, she says the affair with Chaplin turned sexual after signing a contract with his studio on June 1 1941. Not recounted is how the pair originally met. Very little is known about her life pre-1941 and less post 1953.<p>Paulette was his long term partner. Wikipedia reveals she was granted a Mexican divorce in June 1942[3]. The marriage was apparently never official, so it is unclear why she travelled for a legal procedure. Later she would move to Switzerland, nearby to where Chaplin was living after being banned from America.<p>Edward was Chaplin’s butler.<p>Barry’s abridged account of December 19 from the FBI file follows. The reader is invited to peruse the actual file to check whether my editing is reasonable.<p>I then bought another gun at the Hollywood Gun Shop, just a day or so before I went up to Chaplin’s on this date which I believe to be about December 19.\n…\nI finally resolved to see Charles, thinking that when I got up there I would kill myself right in front of him.\n…\nI went around in back and knocked on the door and when nobody came, I broke the glass and went in.\n…\nWhen I got upstairs he was on the telephone talking to someone in affectionate tones.  I listened for five minutes or so to him from the dressing room and became jealous and took the gun out of my pocket and pointed it at him as I came into the room.\n…\nThen we sat on the bed together and Charles took hold of my hand in which I was holding the gun and told me not to be foolish. He told me that I should stay all night\n…\nHowever, Charles’ two boys, Charles jr. and Sidney were out in the hall.\n…\nFrom what Edward has since told me of the conversation that night between him and Charles, Edward apparently asked him if everything  was all right and Charles told him he could handle the situation. … the boys also asked him at the same time and he told them to go on back to bed. Charles then came back into the room and locked both doors into the hall and another door which led to the bathroom, which connects Paulette’s bedroom with Charles'. We then had an affair, during which time the gun was on the night stand between the two beds where I could reach it with my right hand.\n…\nAfterwards we both tried to go to sleep and I found his snoring irritating and I called him and told him I was going into the next room. I took the gun with me, though he said &quot;leave it with me” and I said no. It was probably around 4:00AM that I went into Paulette’s room, but I did not get to sleep until around 6:00. Charles came in a couple of times and tried to get the gun from me, but I did not give it to him.\n…\nThe next morning Charles came into my room and wanted to have another affair. I told him no. Edward later told me that he had heard CHAPLIN say that. It was probably 11:00 that morning that I got up. Edward came up that morning and tried to talk me into  giving him the gun and said that Charlie had sent him there for that purpose. Later Charles came up and I gave him the gun, along with the bill of sale.<p>[1] https://law.justia.com/cases/california/court-of-appeal/2d/74/652.html\n[2] https://vault.fbi.gov/charlie-chaplin\n[3] https://en.m.wikipedia.org/wiki/Paulette_Goddard",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "danfickle",
    "url": "https://news.ycombinator.com/user?id=danfickle"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32462742",
  "sameAs": "https://news.ycombinator.com/item?id=32462742",
  "dateCreated": "2022-08-14T20:58:25.668Z",
  "datePublished": "2022-08-14T20:39:51.000Z",
  "dateModified": "2022-08-14T20:58:25.668Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "查理-查普兰是否因在枪口下被强奸而被起诉？\n",
  "headline_zh-Hant": "查理-查普蘭是否因在槍口下被強姦而被起訴？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "查理-卓别林在一次亲子鉴定中败诉，母亲是琼-巴里（化名），尽管血型测试排除了卓别林是父亲。他被指控与巴里有关的几项刑事指控。根据1946年的上诉（也是败诉）：<p>\"她作证说，她和被告在正常的自然过程中，在孩子出生的那一天或前后，有四次性交行为。这些行为发生在1942年12月10日、23日、24日和30日\"。[1]<p>--<p>显然在审判中没有审查的是1942年12月19日，根据卓别林的联邦调查局档案[2]（第02部分，第166页），巴里还告诉联邦调查局她有一个 \"外遇\"。当时，卓别林的孩子悉尼&amp；小查尔斯分别是13岁和14岁。<p>根据巴里的采访记录，她说在1941年6月1日与卓别林的工作室签订合同后，与卓别林的关系变成了性关系。没有记述的是这对夫妇最初是如何相遇的。关于她在1941年之前的生活，人们知之甚少，1953年之后更少。<p>波莱特是他的长期伴侣。维基百科显示，她在1942年6月获得了墨西哥的离婚许可[3]。这段婚姻显然从未正式生效，所以不清楚她为什么要去办理法律手续。后来她搬到了瑞士，离卓别林被禁止进入美国后居住的地方很近。<p>爱德华是卓别林的管家。<p>巴里从联邦调查局的档案中节选了12月19日的叙述。<p>我在好莱坞枪械店又买了一把枪，就在我去卓别林家的前一天左右，我认为这一天大概是12月19日。\n...\n我终于下定决心去见查尔斯，我想当我上去后，我会在他面前自杀。\n...\n我绕到后面，敲了敲门，没人来，我就打碎玻璃，走了进去。\n...\n当我上楼时，他正在用电话和某人亲切地交谈。 我在更衣室里听了他五分钟左右，变得很嫉妒，从口袋里拿出枪，在我进入房间时对准了他。\n...\n然后我们一起坐在床上，查尔斯握住我握着枪的手，告诉我不要犯傻。他告诉我，我应该呆上一整夜\n...\n然而，查尔斯的两个儿子，小查尔斯和西德尼在大厅里。\n...\n从爱德华后来告诉我的他和查尔斯那晚的对话来看，爱德华显然问他是否一切都好，查尔斯告诉他他能处理好这个情况。......男孩们也同时问他，他让他们继续回去睡觉。然后查尔斯回到房间，把进入大厅的两扇门和另一扇通往浴室的门都锁上，这扇门连接着波莱特的卧室和查尔斯的卧室。然后我们发生了关系，在此期间，枪放在两张床之间的床头柜上，我的右手可以够到它。\n...\n之后我们都想睡觉，我发现他的鼾声很烦人，于是我叫他，告诉他我要去隔壁房间。我把枪带走了，虽然他说&quot;把它放在我这里\"，我说不。大概是在凌晨4点左右，我进了波莱特的房间，但我直到6点左右才入睡。查尔斯进来过几次，试图从我这里拿到枪，但我没有给他。\n...\n第二天早上，查尔斯来到我的房间，想再来一次偷情。我告诉他不要。爱德华后来告诉我，他听到查普林这么说。那天早上大概是11点，我起床了。爱德华那天早上上来，试图说服我把枪给他，并说查理派他来就是为了这个目的。后来查尔斯来了，我把枪给了他，还有销售单据。<p>[1] https://law.justia.com/cases/california/court-of-appeal/2d/74/652.html\n[2] https://vault.fbi.gov/charlie-chaplin\n[3] https://en.m.wikipedia.org/wiki/Paulette_Goddard\n",
  "description_zh-Hant": "查理-卓別林在一次親子鑑定中敗訴，母親是瓊-巴里（化名），儘管血型測試排除了卓別林是父親。他被指控與巴里有關的幾項刑事指控。根據1946年的上訴（也是敗訴）：<p>\"她作證說，她和被告在正常的自然過程中，在孩子出生的那一天或前後，有四次性交行為。這些行為發生在1942年12月10日、23日、24日和30日\"。[1]<p>--<p>顯然在審判中沒有審查的是1942年12月19日，根據卓別林的聯邦調查局檔案[2]（第02部分，第166頁），巴里還告訴聯邦調查局她有一個 \"外遇\"。當時，卓別林的孩子悉尼&amp；小查爾斯分別是13歲和14歲。<p>根據巴里的採訪記錄，她說在1941年6月1日與卓別林的工作室簽訂合同後，與卓別林的關係變成了性關係。沒有記述的是這對夫婦最初是如何相遇的。關於她在1941年之前的生活，人們知之甚少，1953年之後更少。<p>波萊特是他的長期伴侶。維基百科顯示，她在1942年6月獲得了墨西哥的離婚許可[3]。這段婚姻顯然從未正式生效，所以不清楚她為什麼要去辦理法律手續。後來她搬到了瑞士，離卓別林被禁止進入美國後居住的地方很近。<p>愛德華是卓別林的管家。<p>巴里從聯邦調查局的檔案中節選了12月19日的敘述。<p>我在好萊塢槍械店又買了一把槍，就在我去卓別林家的前一天左右，我認為這一天大概是12月19日。\n...\n我終於下定決心去見查爾斯，我想當我上去後，我會在他面前自殺。\n...\n我繞到後面，敲了敲門，沒人來，我就打碎玻璃，走了進去。\n...\n當我上樓時，他正在用電話和某人親切地交談。 我在更衣室裡聽了他五分鐘左右，變得很嫉妒，從口袋裡拿出槍，在我進入房間時對準了他。\n...\n然後我們一起坐在床上，查爾斯握住我握著槍的手，告訴我不要犯傻。他告訴我，我應該呆上一整夜\n...\n然而，查爾斯的兩個兒子，小查爾斯和西德尼在大廳裡。\n...\n從愛德華後來告訴我的他和查爾斯那晚的對話來看，愛德華顯然問他是否一切都好，查爾斯告訴他他能處理好這個情況。......男孩們也同時問他，他讓他們繼續回去睡覺。然後查爾斯回到房間，把進入大廳的兩扇門和另一扇通往浴室的門都鎖上，這扇門連接著波萊特的臥室和查爾斯的臥室。然後我們發生了關係，在此期間，槍放在兩張床之間的床頭櫃上，我的右手可以夠到它。\n...\n之後我們都想睡覺，我發現他的鼾聲很煩人，於是我叫他，告訴他我要去隔壁房間。我把槍帶走了，雖然他說&quot;把它放在我這裡\"，我說不。大概是在凌晨4點左右，我進了波萊特的房間，但我直到6點左右才入睡。查爾斯進來過幾次，試圖從我這裡拿到槍，但我沒有給他。\n...\n第二天早上，查爾斯來到我的房間，想再來一次偷情。我告訴他不要。愛德華後來告訴我，他聽到查普林這麼說。那天早上大概是11點，我起床了。愛德華那天早上上來，試圖說服我把槍給他，並說查理派他來就是為了這個目的。後來查爾斯來了，我把槍給了他，還有銷售單據。<p>[1] https://law.justia.com/cases/california/court-of-appeal/2d/74/652.html\n[2] https://vault.fbi.gov/charlie-chaplin\n[3] https://en.m.wikipedia.org/wiki/Paulette_Goddard\n"
}