{
  "@type": "NewsArticle",
  "identifier": "2022--08--21--en--myfeed--HackerNews--NewsArticle--32535935",
  "url": "https://news.ycombinator.com/item?id=32535935",
  "headline": "Anyone want to help build an open source social media platform?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been finding my performance and motivation at my current web developer job has been declining over the years. I've been reading a lot of self help and psychology books lately, and I think that the problem is simply that I don't care about, or believe in, the company I work at. We exist to make money really. I mean we do provide a service, but so much of it is locked behind over priced paywalls, and my job consists of running experiments on users to essentially milk as much money from them as possible. It's like my mind wants to revolt because I don't think we're doing good for the world (at best neutral), and yet my main work in life is to help them.<p>So I think, what could I build on my own that impassions me? Well, anger is a great motivator. Find a problem that makes you angry, and that can inspire an entire company vision. For me, I truly think social media might lead to some sort of collapse of our society, in some form. Especially now with Horizon on the... horizon.. I'm just genuinely concerned that fuckerberg is going to turn our world into his own circus.<p>So why not an open source social media platform? The initial ideas from me:<p>* Create a discord so we can start talking and collaborating\n* 100% of the code (front and back end) would be hosted online for anyone to contribute to or fork, so full transparency\n* Eventually, there may be some salaries for whoever ends up maintaining it, but it will be strictly not-for-profit\n* Ideally completely donation supported with no ads, and the donated money details could be made public, so everyone could see what was in the bank, how long the service could keep live on donations, and some sort of ledger so any withdraws and their purpose were public as well\n* All features of a modern social media platform should be supported, so video (short and long), pictures, text posts, followers, friends, comments, explore, several different types of feeds. This could actually be a great opportunity to brainstorm how we could incorporate the best features from all the current major players and perhaps make something even better\n* We could start a kickstarter too!<p>This is my first post with this idea, so I'm partially just trying to see if it resonates with anyone else and if there's enough people who'd be willing to help with a cause like this. To me, social media is perhaps becoming too ubiquitous and influential to be for profit, and maybe it needs the Wikipedia treatment?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "abhpro",
    "url": "https://news.ycombinator.com/user?id=abhpro"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32535935",
  "sameAs": "https://news.ycombinator.com/item?id=32535935",
  "dateCreated": "2022-08-21T02:29:11.979Z",
  "datePublished": "2022-08-20T23:05:42.000Z",
  "dateModified": "2022-08-21T02:29:11.979Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "有人想帮助建立一个开源的社会媒体平台吗？\n",
  "headline_zh-Hant": "有人想幫助建立一個開源的社會媒體平臺嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我一直发现我在目前的网络开发工作中的表现和动力多年来一直在下降。我最近读了很多自我帮助和心理学的书，我认为问题仅仅在于我不关心，也不相信我工作的公司。我们的存在真的是为了赚钱。我的意思是，我们确实提供了一项服务，但其中很多内容都被锁在价格过高的付费墙后面，而我的工作包括对用户进行实验，以尽可能多地从他们身上榨取金钱。这就像我的思想要造反一样，因为我不认为我们对世界有什么好处（充其量是中性的），而我生活中的主要工作是帮助他们。<p>所以我想，我可以自己建立什么东西来激起我的热情？好吧，愤怒是一个很好的激励因素。找到一个让你愤怒的问题，就能激发整个公司的愿景。对我来说，我真的认为社交媒体可能会以某种形式导致我们社会的某种崩溃。特别是现在有了地平线在......地平线。我只是真正担心fuckerberg会把我们的世界变成他自己的马戏团。<p>那么，为什么不是一个开源的社会媒体平台呢？我的初步想法是：<p>* 创建一个discord，这样我们就可以开始讨论和合作了。\n* 100%的代码（前端和后端）将被托管在网上，任何人都可以贡献或分叉，因此完全透明。\n* 最终，无论谁来维护它，都可能会有一些工资，但它将是严格的非营利性的。\n* 理想的情况是，完全由捐款支持，没有广告，而且捐款的细节可以公开，所以每个人都可以看到银行里有什么，服务可以靠捐款维持多久，以及某种分类账，所以任何提款和他们的目的也是公开的。\n* 应该支持现代社会媒体平台的所有功能，所以视频（短和长）、图片、文本帖子、追随者、朋友、评论、探索、几种不同类型的馈送。这实际上可能是一个集思广益的好机会，我们可以把目前所有主要参与者的最佳功能纳入其中，也许能做出更好的东西。\n* 我们也可以启动一个kickstarter！<p>这是我第一次发表这个想法，所以我只是想看看是否有其他人产生共鸣，是否有足够的人愿意帮助这样的事业。对我来说，社交媒体也许正变得无处不在，影响巨大，不能用于盈利，也许它需要维基百科的处理？\n",
  "description_zh-Hant": "我一直髮現我在目前的網絡開發工作中的表現和動力多年來一直在下降。我最近讀了很多自我幫助和心理學的書，我認為問題僅僅在於我不關心，也不相信我工作的公司。我們的存在真的是為了賺錢。我的意思是，我們確實提供了一項服務，但其中很多內容都被鎖在價格過高的付費牆後面，而我的工作包括對用戶進行實驗，以儘可能多地從他們身上榨取金錢。這就像我的思想要造反一樣，因為我不認為我們對世界有什麼好處（充其量是中性的），而我生活中的主要工作是幫助他們。<p>所以我想，我可以自己建立什麼東西來激起我的熱情？好吧，憤怒是一個很好的激勵因素。找到一個讓你憤怒的問題，就能激發整個公司的願景。對我來說，我真的認為社交媒體可能會以某種形式導致我們社會的某種崩潰。特別是現在有了地平線在......地平線。我只是真正擔心fuckerberg會把我們的世界變成他自己的馬戲團。<p>那麼，為什麼不是一個開源的社會媒體平臺呢？我的初步想法是：<p>* 創建一個discord，這樣我們就可以開始討論和合作了。\n* 100%的代碼（前端和後端）將被託管在網上，任何人都可以貢獻或分叉，因此完全透明。\n* 最終，無論誰來維護它，都可能會有一些工資，但它將是嚴格的非營利性的。\n* 理想的情況是，完全由捐款支持，沒有廣告，而且捐款的細節可以公開，所以每個人都可以看到銀行裡有什麼，服務可以靠捐款維持多久，以及某種分類賬，所以任何提款和他們的目的也是公開的。\n* 應該支持現代社會媒體平臺的所有功能，所以視頻（短和長）、圖片、文本帖子、追隨者、朋友、評論、探索、幾種不同類型的饋送。這實際上可能是一個集思廣益的好機會，我們可以把目前所有主要參與者的最佳功能納入其中，也許能做出更好的東西。\n* 我們也可以啟動一個kickstarter！<p>這是我第一次發表這個想法，所以我只是想看看是否有其他人產生共鳴，是否有足夠的人願意幫助這樣的事業。對我來說，社交媒體也許正變得無處不在，影響巨大，不能用於盈利，也許它需要維基百科的處理？\n"
}