{
  "@type": "NewsArticle",
  "identifier": "2022--08--24--en--myfeed--HackerNews--NewsArticle--32573473",
  "url": "https://news.ycombinator.com/item?id=32573473",
  "headline": "Tell HN: I’ve had an offer pulled from under me",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey so, I rarely take the time and effort to post online because I don’t tend to have much to say but figured this would be a really ripe time to have a cheeky rant on the big orange internet forums.<p>On 25th May of this year I interviewed with a London-based gambling company for a full-time Scala role. It was a really compact process: 3x 1h interview all in one go, 1pm to 4pm. I was utterly cognitively ruined at the end by the tech drilling and the live coding but 2 days later an offer email with my exact expectation materialised: 26.7% payrise on base with a cherry on top. The best part? They were happy with a 12th September start! I could wrap up all the things I was working on at my current company and move on without leaving a smell! T’s crossed and i’s dotted.<p>At some point the recruiter asked me if I’m interviewing with any other companies, “honestly, no, I’m getting too old to be running multiple interviews at a time” I said smugly (which is funny because I’m 27). I already knew I was going to get what I want without having to complicate my life to get it, I was finally senior enough.<p>Turns out I was quite wrong. A week later it was announced that this company was acquired by a larger company but I didn’t learn about this until a week or two ago which I paid no mind to. On 23rd August, approaching 5pm I got a call from someone from HR at my future company informing me that the offer no longer stands. Turns out, following their acquisition they were doing a “review of their required skills and capabilities” and well, that was it. I was pretty annoyed but before long I was doubly annoyed about how long and apologetic the phonecall was getting. Must be a really hard job to deliver a batch of “your offer is no more” phone calls and waiting for the person on the other side to feel sufficiently informed to end the call even though there’s very little more to say once the intial news is given. Yikes<p>Anyway, I’m cynical enough to understand that no company owes me anything, especially not a job I haven’t started yet. It’s still a bit annoying, 3 weeks out from starting date.<p>Luckily I’m not above naming and shaming: the company in question is William Hill, following it’s acquisition by 888.<p>Some thoughts:<p>1. I appreciate this is an obnoxiously fortunate position to be in to begin with. As far as life drama goes, this is pretty constructed. Please excuse.<p>2. Is this what I get for taking an offer from a gambling company? My hunch was gambling means stability (especially an est. 1934 company)<p>3. Interviewing is such a performing act. How you feel that day can make such a difference, not looking forward to feeling like a performing monkey all over again.<p>Rant over,<p>MP",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "HighlandSpring",
    "url": "https://news.ycombinator.com/user?id=HighlandSpring"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32573473",
  "sameAs": "https://news.ycombinator.com/item?id=32573473",
  "dateCreated": "2022-08-24T02:38:52.516Z",
  "datePublished": "2022-08-24T00:25:31.000Z",
  "dateModified": "2022-08-24T02:38:52.516Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "告诉HN：我有一份报价从我下面拉走了\n",
  "headline_zh-Hant": "告訴HN：我有一份報價從我下面拉走了\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，我很少花时间和精力在网上发帖，因为我往往没有什么可说的，但我想这是一个非常成熟的时机，可以在大橙色的互联网论坛上厚颜无耻地咆哮。<p>今年5月25日，我在一家位于伦敦的赌博公司面试了一个全职Scala职位。这是一个非常紧凑的过程。3次1小时的面试，从下午1点到4点，一气呵成。最后，我被技术钻研和现场编码彻底毁了，但2天后，一封与我的期望完全一致的录用邮件出现了：在基础工资的基础上增加了26.7%，上面还加了个樱桃。最重要的是什么？他们对9月12日开始工作感到很满意！我可以把所有的事情都做完。我可以把我在当前公司的所有工作收尾，然后不留痕迹地继续工作。<p>在某个时候，招聘人员问我是否在面试其他公司，\"老实说，没有，我已经太老了，不可能同时进行多个面试\"，我得意地说（这很有趣，因为我已经27岁了）。我已经知道我将会得到我想要的东西，而不必为了得到它而使我的生活复杂化，我终于够资深了。<p>事实证明我大错特错。一个星期后，有人宣布这家公司被一家更大的公司收购，但我直到一两个星期前才知道这个消息，我没有在意。8月23日，接近下午5点的时候，我接到了我未来公司人力资源部门的电话，通知我这个工作不再有效。原来，在他们收购之后，他们正在做一个 \"对所需技能和能力的审查\"，嗯，就是这样。我当时很恼火，但没过多久，我就对电话中的冗长和歉意倍感恼火。一定是一个非常困难的工作，要打出一批 \"你的报价已经没有了 \"的电话，并等待另一边的人感到有足够的信息来结束电话，尽管一旦给出初步的消息，就没有什么可说的了。不管怎么说，我很愤世嫉俗，明白没有公司欠我什么，尤其是我还没有开始的工作。<p>幸运的是，我并不擅长指名道姓：有关公司是威廉希尔，在它被888收购之后。<p>一些想法：<p>1. 我知道这是个令人厌恶的幸运的位置。就生活剧而言，这是很有构造的。请原谅。<p>2.这就是我接受一家赌博公司的报价的结果吗？我的直觉是，赌博意味着稳定（尤其是一家成立于1934年的公司）<p>3.面试是一种表演行为。你那天的感觉会有很大的不同，我不希望再感觉自己像一只表演的猴子了。\n",
  "description_zh-Hant": "嘿，我很少花時間和精力在網上發帖，因為我往往沒有什麼可說的，但我想這是一個非常成熟的時機，可以在大橙色的互聯網論壇上厚顏無恥地咆哮。<p>今年5月25日，我在一家位於倫敦的賭博公司面試了一個全職Scala職位。這是一個非常緊湊的過程。3次1小時的面試，從下午1點到4點，一氣呵成。最後，我被技術鑽研和現場編碼徹底毀了，但2天后，一封與我的期望完全一致的錄用郵件出現了：在基礎工資的基礎上增加了26.7%，上面還加了個櫻桃。最重要的是什麼？他們對9月12日開始工作感到很滿意！我可以把所有的事情都做完。我可以把我在當前公司的所有工作收尾，然後不留痕跡地繼續工作。<p>在某個時候，招聘人員問我是否在面試其他公司，\"老實說，沒有，我已經太老了，不可能同時進行多個面試\"，我得意地說（這很有趣，因為我已經27歲了）。我已經知道我將會得到我想要的東西，而不必為了得到它而使我的生活複雜化，我終於夠資深了。<p>事實證明我大錯特錯。一個星期後，有人宣佈這家公司被一家更大的公司收購，但我直到一兩個星期前才知道這個消息，我沒有在意。8月23日，接近下午5點的時候，我接到了我未來公司人力資源部門的電話，通知我這個工作不再有效。原來，在他們收購之後，他們正在做一個 \"對所需技能和能力的審查\"，嗯，就是這樣。我當時很惱火，但沒過多久，我就對電話中的冗長和歉意倍感惱火。一定是一個非常困難的工作，要打出一批 \"你的報價已經沒有了 \"的電話，並等待另一邊的人感到有足夠的信息來結束電話，儘管一旦給出初步的消息，就沒有什麼可說的了。不管怎麼說，我很憤世嫉俗，明白沒有公司欠我什麼，尤其是我還沒有開始的工作。<p>幸運的是，我並不擅長指名道姓：有關公司是威廉希爾，在它被888收購之後。<p>一些想法：<p>1. 我知道這是個令人厭惡的幸運的位置。就生活劇而言，這是很有構造的。請原諒。<p>2.這就是我接受一家賭博公司的報價的結果嗎？我的直覺是，賭博意味著穩定（尤其是一家成立於1934年的公司）<p>3.面試是一種表演行為。你那天的感覺會有很大的不同，我不希望再感覺自己像一隻表演的猴子了。\n"
}