{
  "@type": "NewsArticle",
  "identifier": "2022--08--22--en--myfeed--HackerNews--NewsArticle--32558363",
  "url": "https://news.ycombinator.com/item?id=32558363",
  "headline": "Looking for a co-founder to change language learning forever",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I’m throwing this out because I’ve gone as far as I can as a solo founder without holding myself back.<p>I have an awesome prototype that re-imagines how people learn a language. I think this has a real chance to change the world by making language learning as achievable as learning to read in your first language and as predictable as following a recipe.<p>I applied to YC last year and got an interview, but it was still early enough in development that I needed to rely on instinct and intuition to answer questions. I’ve finished the initial R&amp;D and am building the final UI for the prototype. The prototype natively supports any pairing between 20+ languages, including English, Japanese, Korean, Chinese, Russian, and many European languages. Practically these pairs are limited by the availability of bilingual dictionaries.<p>I’ve been meeting with a couple of people a week, mostly language learners, teachers, and tech people, but finding people, perhaps unsurprisingly, have a lot of trouble seeing past the curse of knowledge. We’ve all learned a language, so most of us feel qualified to teach it to others without deeply examining our assumptions.<p>Meeting someone on HN isn’t ideal, but I’m determined to find the right people and I’m willing to improve my chances in any way that seems productive.<p>What’s my idea?<p>I’ve studied Japanese for years and constantly wonder,  “how close am I to being able to read and understand this book, academic paper, song, or show?” And there isn’t any tool that can answer that question for me.<p>Natural language processing (NLP) has advanced to the point where I can build something resembling abstract syntax trees (ASTs) for natural language sentences. By indexing the words and original sentences, I can easily track a user’s learning across any number of pieces of content, link to word references like dictionaries, cross-index words to show other examples of usage, create automatic exercises with full context, schedule reviews (SRS), tagging named entities (proper nouns and the like) and provide concrete guidance.<p>I want to build language servers (natural language LSPs) and integrated language environments (an IDE for language) for individuals. For any content a user adds she will have access to content reader, dictionaries, cross-references, character information (like kanji) if applicable, review exercises, parallel text tools (not machine translation), and sentence shadowing tools.<p>My prototype takes the books, articles, or web pages you would like to read and creates a detailed index of all the words and sentences; it then finds the fewest sentences that cover all the words and turns those into fill-in-the-blank exercises to study from. You are given real feedback and correction when answering exercises. It also includes an integrated e-reader and dictionaries.<p>Who do I want to meet?<p>You must be:<p>* Deeply curious and technical (but this need not be in programming);<p>* Willing to ignore established methods/ideas when reality doesn’t match;<p>* Deeply believe that at every level, the details matter;<p>* Able to say “No” in order to ship, even for things with obvious immediate value.<p>I'm currently preparing my YC application for the winter 2023 batch. \nIf interested, please email me at joshua@solarmist.net. Put &quot;co-founder&quot; somewhere in the subject and include:<p>1) something awesome you've built<p>2) why would you be right for this and<p>3) the best time and way to contact (FaceTime/Zoom/etc) you.<p>Even if you aren't the right person, please upvote this and help us meet.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "solarmist",
    "url": "https://news.ycombinator.com/user?id=solarmist"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32558363",
  "sameAs": "https://news.ycombinator.com/item?id=32558363",
  "dateCreated": "2022-08-22T22:59:24.843Z",
  "datePublished": "2022-08-22T22:57:14.000Z",
  "dateModified": "2022-08-22T22:59:24.843Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "寻找一位共同创始人，永远改变语言学习\n",
  "headline_zh-Hant": "尋找一位共同創始人，永遠改變語言學習\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我把这个问题抛出来，是因为我作为一个单独的创始人，已经走得很远了，没有拖累自己。<p>我有一个很棒的原型，重新想象人们如何学习语言。我认为这确实有机会改变世界，使语言学习像学习第一语言阅读一样可以实现，并像遵循食谱一样可以预测。<p>我去年申请了YC，并获得了面试机会，但它仍处于开发初期，我需要依靠本能和直觉来回答问题。我已经完成了初步的研发工作，正在为原型建立最终的用户界面。原型支持20多种语言之间的任何配对，包括英语、日语、韩语、汉语、俄语和许多欧洲语言。实际上，这些配对受限于双语词典的可用性。<p>我每周都会与几个人见面，大多数是语言学习者、教师和技术人员，但发现人们，也许并不奇怪，在看到知识的诅咒时有很多困难。我们都学过一种语言，所以我们中的大多数人都觉得有资格把它教给别人，而不去深入检查我们的假设。<p>在HN上与人见面并不理想，但我决心找到合适的人，我愿意以任何看起来有成效的方式提高我的机会。<p>我的想法是什么？<p>我学习日语多年，经常想，\"我离能够阅读和理解这本书、学术论文、歌曲或节目还有多远？\" 而没有任何工具可以为我回答这个问题。<p>自然语言处理（NLP）已经发展到我可以为自然语言句子建立类似于抽象语法树（AST）的东西。通过对单词和原始句子进行索引，我可以很容易地跟踪用户在任何数量的内容中的学习情况，链接到像字典这样的单词参考资料，交叉索引单词以显示其他用法的例子，创建具有完整上下文的自动练习，安排审查（SRS），标记命名实体（专有名词等）并提供具体指导。<p>我想为个人建立语言服务器（自然语言LSP）和综合语言环境（一个语言的IDE）。对于用户添加的任何内容，她都可以访问内容阅读器、字典、交叉引用、字符信息（如汉字）（如果适用）、复习练习、平行文本工具（不是机器翻译）和句子影子工具。<p>我的原型采用你想阅读的书籍、文章或网页，并创建一个所有单词和句子的详细索引；然后它找到涵盖所有单词的最少的句子，并将这些句子变成填空练习，以便学习。在回答练习时，你会得到真实的反馈和纠正。它还包括一个集成的电子阅读器和字典。<p>我想见见谁？ <p>你必须是：<p>* 深具好奇心和技术性（但这不一定是在编程方面）；<p>* 愿意在现实不匹配时忽略既定的方法/理念；<p>* 深信在每个层面上，细节都很重要；<p>* 能够为了出货而说 \"不\"，甚至对有明显直接价值的事情也是如此。<p>我目前正在准备2023年冬季的YC申请。\n如果感兴趣，请给我发电子邮件：joshua@solarmist.net。在主题中写上&quot;co-founder&quot;，并包括：<p>1）你所建立的一些很棒的东西<p>2）为什么你适合做这个，<p>3）联系你的最佳时间和方式（FaceTime/Zoom/etc）。<p>即使你不是合适的人选，请给这个投票，帮助我们见面。\n",
  "description_zh-Hant": "我把這個問題拋出來，是因為我作為一個單獨的創始人，已經走得很遠了，沒有拖累自己。<p>我有一個很棒的原型，重新想象人們如何學習語言。我認為這確實有機會改變世界，使語言學習像學習第一語言閱讀一樣可以實現，並像遵循食譜一樣可以預測。<p>我去年申請了YC，並獲得了面試機會，但它仍處於開發初期，我需要依靠本能和直覺來回答問題。我已經完成了初步的研發工作，正在為原型建立最終的用戶界面。原型支持20多種語言之間的任何配對，包括英語、日語、韓語、漢語、俄語和許多歐洲語言。實際上，這些配對受限於雙語詞典的可用性。<p>我每週都會與幾個人見面，大多數是語言學習者、教師和技術人員，但發現人們，也許並不奇怪，在看到知識的詛咒時有很多困難。我們都學過一種語言，所以我們中的大多數人都覺得有資格把它教給別人，而不去深入檢查我們的假設。<p>在HN上與人見面並不理想，但我決心找到合適的人，我願意以任何看起來有成效的方式提高我的機會。<p>我的想法是什麼？<p>我學習日語多年，經常想，\"我離能夠閱讀和理解這本書、學術論文、歌曲或節目還有多遠？\" 而沒有任何工具可以為我回答這個問題。<p>自然語言處理（NLP）已經發展到我可以為自然語言句子建立類似於抽象語法樹（AST）的東西。通過對單詞和原始句子進行索引，我可以很容易地跟蹤用戶在任何數量的內容中的學習情況，鏈接到像字典這樣的單詞參考資料，交叉索引單詞以顯示其他用法的例子，創建具有完整上下文的自動練習，安排審查（SRS），標記命名實體（專有名詞等）並提供具體指導。<p>我想為個人建立語言服務器（自然語言LSP）和綜合語言環境（一個語言的IDE）。對於用戶添加的任何內容，她都可以訪問內容閱讀器、字典、交叉引用、字符信息（如漢字）（如果適用）、複習練習、平行文本工具（不是機器翻譯）和句子影子工具。<p>我的原型採用你想閱讀的書籍、文章或網頁，並創建一個所有單詞和句子的詳細索引；然後它找到涵蓋所有單詞的最少的句子，並將這些句子變成填空練習，以便學習。在回答練習時，你會得到真實的反饋和糾正。它還包括一個集成的電子閱讀器和字典。<p>我想見見誰？ <p>你必須是：<p>* 深具好奇心和技術性（但這不一定是在編程方面）；<p>* 願意在現實不匹配時忽略既定的方法/理念；<p>* 深信在每個層面上，細節都很重要；<p>* 能夠為了出貨而說 \"不\"，甚至對有明顯直接價值的事情也是如此。<p>我目前正在準備2023年冬季的YC申請。\n如果感興趣，請給我發電子郵件：joshua@solarmist.net。在主題中寫上&quot;co-founder&quot;，幷包括：<p>1）你所建立的一些很棒的東西<p>2）為什麼你適合做這個，<p>3）聯繫你的最佳時間和方式（FaceTime/Zoom/etc）。<p>即使你不是合適的人選，請給這個投票，幫助我們見面。\n"
}