{
  "@type": "NewsArticle",
  "identifier": "2022--08--25--en--myfeed--HackerNews--NewsArticle--32587484",
  "url": "https://news.ycombinator.com/item?id=32587484",
  "headline": "CTO Quitting Immediately Before Bridge Financing Round – Bad or Anything to Do?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am 29 year CTO of a 25 person startup in a slow growth industry. We are pre-revenue but with a potential product and great support with strong previous raises. Think something like Pharma drug that require lot of testing. After going on a long vacation last month I realized:\n- I don't think the startup is going to ever have a big valuation, the best case is a long burn of many years to 50 millions.\n- I need to take a few months off and then switch to a low responsibility job. I am burnt out. I have been in this role for 3 years. I haven't been making enough money (although not terrible). I haven't been doing well in my job for 6 months now.<p>The thing is that we're about to do a bridge financing round next month, something I haven't paid attention to until right now due to being so burnt out. We should easily raise it from pre-existing institutional investors, according to the CEO. We still have a good amount of runway left.<p>I am scared that quitting now, right before the round, could put in danger the entire company. We pass the bus test at the tech level, but I'm not sure of the impacts on investors that me quitting could have. There are two individuals who could be interim CTO.<p>I am also scared that waiting until the round closes, optimistically 3-4 months and realistically 4-6 months, could have a serious negative impact on my mental health. I also want and need to go do other things with my 20s before responsibilities like children come along which should happen soon. Nevermind that 2-3 months after the bridge raise we're going to move right into series A raise so the situation doesn't necessarily even change...<p>The question: are there factors that I should be aware of to mitigate? Should I get a lawyer (too late for that before round is supposed to happen)? Anything I can do or avoid? Do I have to just wait it out? Can anyone recommend resources of someone to talk to?<p>Some other details\n- Bridge instead of series A is necessary for real reasons, no use arguing.\n- The plan has always been to replace me at Series A. That's already been delayed by a year.\n- I have mid-single digit stock options as an early employee with a long exercise window. I know there's many ways that these could be terminated. Is there something I can do about this? I am on good terms with 3.5/7 board members and the others are new.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "edana123",
    "url": "https://news.ycombinator.com/user?id=edana123"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32587484",
  "sameAs": "https://news.ycombinator.com/item?id=32587484",
  "dateCreated": "2022-08-25T02:39:49.441Z",
  "datePublished": "2022-08-24T23:52:47.000Z",
  "dateModified": "2022-08-25T02:39:49.441Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "CTO在过桥融资回合前立即辞职--是坏事还是什么都可以做？\n",
  "headline_zh-Hant": "CTO在過橋融資回合前立即辭職--是壞事還是什麼都可以做？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是29岁的首席技术官，在一个缓慢增长的行业中，有25人的创业公司。我们还没有收入，但我们有一个潜在的产品和巨大的支持，之前的融资也很有力。想想看，有些东西就像需要大量测试的药物。在上个月的一次长假之后，我意识到。\n- 我不认为这个创业公司会有一个大的估值，最好的情况是经过多年的长期燃烧，达到5000万。\n- 我需要休息几个月，然后换一个低责任的工作。我已经焦头烂额了。我在这个岗位上已经工作了3年。我没有赚到足够的钱（虽然不是很糟糕）。我已经有6个月没有做好我的工作了。<p>事情是，我们下个月要做一轮过桥融资，由于太过焦灼，我直到现在才注意到这个问题。根据首席执行官的说法，我们应该很容易从已有的机构投资者那里筹集到资金。<p>我很害怕现在辞职，就在这一轮融资之前，可能会使整个公司陷入危险。我们在技术层面上通过了公车测试，但我不确定我辞职可能对投资者产生的影响。有两个人可以担任临时CTO。<p>我也害怕等到本轮融资结束，乐观地说是3-4个月，实际是4-6个月，会对我的心理健康产生严重的负面影响。我也希望并需要在孩子等责任出现之前，去做其他20岁的事情，这应该很快就会发生。我想说的是，在加薪的2-3个月后，我们将直接进入A系列加薪，所以情况不一定会改变......<p>问题是：有什么因素是我应该注意到的，以减轻影响？我应该找律师吗（在本轮融资前找律师太晚了）？我可以做什么或避免什么？我是否必须等待它？谁能推荐一些可以交谈的资源？<p>一些其他细节\n- 由于真正的原因，用桥牌代替A系列是必要的，争论没有用。\n- 计划一直是在A轮时取代我，这已经被推迟了一年。\n- 我作为早期员工有中位数的股票期权，行使窗口很长。我知道有很多方法可以终止这些期权。对此我有什么办法吗？我与3.5/7名董事会成员关系良好，其他的是新成员。\n",
  "description_zh-Hant": "我是29歲的首席技術官，在一個緩慢增長的行業中，有25人的創業公司。我們還沒有收入，但我們有一個潛在的產品和巨大的支持，之前的融資也很有力。想想看，有些東西就像需要大量測試的藥物。在上個月的一次長假之後，我意識到。\n- 我不認為這個創業公司會有一個大的估值，最好的情況是經過多年的長期燃燒，達到5000萬。\n- 我需要休息幾個月，然後換一個低責任的工作。我已經焦頭爛額了。我在這個崗位上已經工作了3年。我沒有賺到足夠的錢（雖然不是很糟糕）。我已經有6個月沒有做好我的工作了。<p>事情是，我們下個月要做一輪過橋融資，由於太過焦灼，我直到現在才注意到這個問題。根據首席執行官的說法，我們應該很容易從已有的機構投資者那裡籌集到資金。<p>我很害怕現在辭職，就在這一輪融資之前，可能會使整個公司陷入危險。我們在技術層面上通過了公車測試，但我不確定我辭職可能對投資者產生的影響。有兩個人可以擔任臨時CTO。<p>我也害怕等到本輪融資結束，樂觀地說是3-4個月，實際是4-6個月，會對我的心理健康產生嚴重的負面影響。我也希望並需要在孩子等責任出現之前，去做其他20歲的事情，這應該很快就會發生。我想說的是，在加薪的2-3個月後，我們將直接進入A系列加薪，所以情況不一定會改變......<p>問題是：有什麼因素是我應該注意到的，以減輕影響？我應該找律師嗎（在本輪融資前找律師太晚了）？我可以做什麼或避免什麼？我是否必須等待它？誰能推薦一些可以交談的資源？<p>一些其他細節\n- 由於真正的原因，用橋牌代替A系列是必要的，爭論沒有用。\n- 計劃一直是在A輪時取代我，這已經被推遲了一年。\n- 我作為早期員工有中位數的股票期權，行使窗口很長。我知道有很多方法可以終止這些期權。對此我有什麼辦法嗎？我與3.5/7名董事會成員關係良好，其他的是新成員。\n"
}