{
  "@type": "NewsArticle",
  "identifier": "2022--08--22--en--myfeed--HackerNews--NewsArticle--32556095",
  "url": "https://news.ycombinator.com/item?id=32556095",
  "headline": "Are there some serial downvoters on Stack Overflow?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have a problem with this site: some people pay more attention to form than to content.<p>If I post a question which doesn't really follow the rules, I very quickly get downvotes. Not more than 7 in my case.<p>If I post a question which follows the rules, I may wait days for an answer, and I may never receive an answer, but I get no upvotes.<p>So I think there's something basically unfair about the system. If you get donwvotes for posting a question which is considered bad, shouldn't you also receive upvotes for a question which is considered good?<p>Please don't get me wrong, I think the vast majority of Stack Overflow users are either decent people or people who just mind their own business.<p>But I'm also beginning to suspect that there are people who enjoy hammering others. Giving upvotes is no fun to them, but giving down votes makes their day.<p>They seem to be online night and day - hey, get a life! - and to scan new questions, looking for one to downvote. This corrupts the whole voting system, which is supposed to be fair.<p>I think the fix would be easy: you cannot cast more downvotes than upvotes. Whatever your reputation is.<p>Some are also ferociously defending the system. It's some kind of religion to them, and they are fanatics. If you dare criticize it, you are immediately downvoted, whatever you're saying and however much you may have a reason of saying it.<p>If I posted this on meta stack overflow, it would immediately get downvoted. And my post would probably get closed.<p>Even constructive criticism seems to be illegal there.<p>The problem is, people can downvote or upvote anonymously and without saying why. And some people abuse that right. They're a small minority, sure, but they're an annoying minority and their behavior is highly offensive.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Alain_Reve",
    "url": "https://news.ycombinator.com/user?id=Alain_Reve"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32556095",
  "sameAs": "https://news.ycombinator.com/item?id=32556095",
  "dateCreated": "2022-08-22T19:56:58.922Z",
  "datePublished": "2022-08-22T19:31:32.000Z",
  "dateModified": "2022-08-22T19:56:58.922Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "在Stack Overflow上是否有一些连续的降权者？\n",
  "headline_zh-Hant": "在Stack Overflow上是否有一些連續的降權者？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我对这个网站有一个问题：有些人更注重形式，而不是内容。<p>如果我发布的问题没有真正遵守规则，我很快就会得到降分。<p>如果我发布一个符合规则的问题，我可能要等上好几天才能得到答案，也可能永远得不到答案，但我却没有得到赞许。<p>所以我认为这个系统基本上是不公平的。<p>请不要误会，我认为绝大多数Stack Overflow的用户都是正直的人，或者是只管自己事情的人。<p>但我也开始怀疑有些人喜欢敲打别人。<p>他们似乎夜以继日地在线--嘿，过好自己的生活吧！</p> <p>他们会扫描新的问题，寻找新的答案。- 他们似乎夜以继日地在线--嘿，过日子吧！并扫描新的问题，寻找一个可以降票的问题。这破坏了整个投票系统，而这个系统应该是公平的。<p>我认为解决的方法很简单：你不能投下调票多于上调票。不管你的声誉如何。<p>有些人还在凶猛地捍卫这个系统。这对他们来说是某种宗教，他们是狂热者。如果你敢于批评它，你就会立即被降级，不管你说什么，不管你有多大的理由。<p>如果我把这个贴在元堆栈溢出上，它将立即被降级。<p>即使是建设性的批评在那里也是不合法的。<p>问题是，人们可以匿名地降低或提高投票率，而且不说原因。有些人滥用这种权利。当然，他们是少数，但他们是令人讨厌的少数，他们的行为是非常令人反感的。\n",
  "description_zh-Hant": "我對這個網站有一個問題：有些人更注重形式，而不是內容。<p>如果我發佈的問題沒有真正遵守規則，我很快就會得到降分。<p>如果我發佈一個符合規則的問題，我可能要等上好幾天才能得到答案，也可能永遠得不到答案，但我卻沒有得到讚許。<p>所以我認為這個系統基本上是不公平的。<p>請不要誤會，我認為絕大多數Stack Overflow的用戶都是正直的人，或者是隻管自己事情的人。<p>但我也開始懷疑有些人喜歡敲打別人。<p>他們似乎夜以繼日地在線--嘿，過好自己的生活吧！</p> <p>他們會掃描新的問題，尋找新的答案。- 他們似乎夜以繼日地在線--嘿，過日子吧！並掃描新的問題，尋找一個可以降票的問題。這破壞了整個投票系統，而這個系統應該是公平的。<p>我認為解決的方法很簡單：你不能投下調票多於上調票。不管你的聲譽如何。<p>有些人還在兇猛地捍衛這個系統。這對他們來說是某種宗教，他們是狂熱者。如果你敢於批評它，你就會立即被降級，不管你說什麼，不管你有多大的理由。<p>如果我把這個貼在元堆棧溢出上，它將立即被降級。<p>即使是建設性的批評在那裡也是不合法的。<p>問題是，人們可以匿名地降低或提高投票率，而且不說原因。有些人濫用這種權利。當然，他們是少數，但他們是令人討厭的少數，他們的行為是非常令人反感的。\n"
}