{
  "@type": "NewsArticle",
  "identifier": "2022--08--24--en--myfeed--HackerNews--NewsArticle--32575770",
  "url": "https://news.ycombinator.com/item?id=32575770",
  "headline": "The Productivity Tip That Changed My Life – Proxies API",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "There is this weird chasm between thought and action where many dreams have died a sad death. I would, for years, get confused about handling tasks. If I have a list of tasks, I could either start without a plan and get some of them done haphazardly or sit down and come up with an idea and organize everything before I jumped into action. Both of these approaches had issues.<p>With the first method, I would get random stuff done, but they never added up to anything profound and valuable, and I would miss opportunities that I would have seen if I had taken time out to plan.<p>With the second way, I would freeze and would never get started and would soon begin procrastinating and would keep planning forever.<p>The 2-minute rule\nThis tip by David Allen, the author of getting things done, changed all that.<p>He argues that if I can do something in less than 2 minutes, I don’t have to put into a planning system like even a to-do list. The effort takes to put into a system and process. It is offset by the fact that I can do it not and finish it off. It never has to appear on paper anywhere.<p>Like just a while ago, I remembered that I had not paid my mobile phone provider bill. Instead of writing it down somewhere, I know that I could pay using the ISP’s app in under a minute. So I just went ahead and did that.<p>It turns out that many projects have a ton of “tasks” that take 2 minutes or less. Instead of making a “big deal” about them and putting them on a to-do list, you can do them when writing down the to-do list. So the act of writing the to-do list could be a trigger to finish a lot of 2-minute tasks.<p>It’s funny how many of my “Big projects” are held up because of this 2-minute task not done.<p>It happens especially when you start and also when you finish a project. These rules enabled me to code and launch my SAAS product, Proxies API in under a month. I teach this rule to every new hire I make in the company. It’s fun to get an instant boost in everyone’s productivity by showing them this. After all, it only takes 2 mins to teach them this.<p>The author is the founder of Proxies API (https://www.proxiesapi.com/), a proxy rotation api service.<p>This article originally appeared here:https://www.proxiesapi.com/blog/The-Productivity-Tip-That-Changed-My-Life.php",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "prasenjit_pro",
    "url": "https://news.ycombinator.com/user?id=prasenjit_pro"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32575770",
  "sameAs": "https://news.ycombinator.com/item?id=32575770",
  "dateCreated": "2022-08-24T07:27:53.341Z",
  "datePublished": "2022-08-24T06:57:42.000Z",
  "dateModified": "2022-08-24T07:27:53.341Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "改变我生活的生产力秘诀 - 代理服务器API\n",
  "headline_zh-Hant": "改變我生活的生產力秘訣 - 代理服務器API\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在思想和行动之间存在着这种奇怪的鸿沟，许多梦想在这里不幸夭折。多年来，我在处理任务方面会感到困惑。如果我有一个任务清单，我可以在没有计划的情况下开始工作，胡乱地完成一些任务，或者坐下来，想出一个主意，在我跳入行动之前组织好一切。这两种方法都有问题。<p>用第一种方法，我可以随机完成一些事情，但它们加起来从来没有什么深刻和有价值的东西，而且我会错过一些机会，如果我抽出时间来计划的话，我就会看到这些机会。<p>用第二种方法，我会僵住，永远不会开始，很快就会开始拖延，并且会永远保持计划。\n他认为，如果我可以在不到2分钟的时间内完成某件事情，我就没有必要投入一个计划系统，甚至是一个待办事项清单。需要花费精力投入到一个系统和流程中。它被一个事实所抵消，即我可以不做并完成它。<p>就像不久前，我记得我还没有支付我的移动电话供应商账单。我知道我可以在一分钟内用ISP的应用程序支付，而不是把它写在某个地方。<p>事实证明，许多项目都有大量需要2分钟或更短时间的 \"任务\"。你可以在写下待办事项清单时进行这些任务，而不是对它们大做文章，把它们放在待办事项清单上。因此，写待办事项清单的行为可以成为完成很多2分钟任务的触发器。<p>很有趣的是，我的很多 \"大项目 \"都因为这个2分钟的任务没有完成而被搁置了。<p>这种情况在你开始和完成一个项目时尤其多。这些规则使我能够在一个月内编码并推出我的SAAS产品，代理API。我把这个规则教给公司里的每一个新员工。通过向他们展示这一点，每个人的生产力都得到了瞬间的提升，这很有趣。毕竟，教他们这个只需要2分钟。<p>作者是Proxies API（https://www.proxiesapi.com/）的创始人，Proxies API是一个代理轮换api服务。<p>这篇文章最初出现在这里：https://www.proxiesapi.com/blog/The-Productivity-Tip-That-Changed-My-Life.php\n",
  "description_zh-Hant": "在思想和行動之間存在著這種奇怪的鴻溝，許多夢想在這裡不幸夭折。多年來，我在處理任務方面會感到困惑。如果我有一個任務清單，我可以在沒有計劃的情況下開始工作，胡亂地完成一些任務，或者坐下來，想出一個主意，在我跳入行動之前組織好一切。這兩種方法都有問題。<p>用第一種方法，我可以隨機完成一些事情，但它們加起來從來沒有什麼深刻和有價值的東西，而且我會錯過一些機會，如果我抽出時間來計劃的話，我就會看到這些機會。<p>用第二種方法，我會僵住，永遠不會開始，很快就會開始拖延，並且會永遠保持計劃。\n他認為，如果我可以在不到2分鐘的時間內完成某件事情，我就沒有必要投入一個計劃系統，甚至是一個待辦事項清單。需要花費精力投入到一個系統和流程中。它被一個事實所抵消，即我可以不做並完成它。<p>就像不久前，我記得我還沒有支付我的移動電話供應商賬單。我知道我可以在一分鐘內用ISP的應用程序支付，而不是把它寫在某個地方。<p>事實證明，許多項目都有大量需要2分鐘或更短時間的 \"任務\"。你可以在寫下待辦事項清單時進行這些任務，而不是對它們大做文章，把它們放在待辦事項清單上。因此，寫待辦事項清單的行為可以成為完成很多2分鐘任務的觸發器。<p>很有趣的是，我的很多 \"大項目 \"都因為這個2分鐘的任務沒有完成而被擱置了。<p>這種情況在你開始和完成一個項目時尤其多。這些規則使我能夠在一個月內編碼並推出我的SAAS產品，代理API。我把這個規則教給公司裡的每一個新員工。通過向他們展示這一點，每個人的生產力都得到了瞬間的提升，這很有趣。畢竟，教他們這個只需要2分鐘。<p>作者是Proxies API（https://www.proxiesapi.com/）的創始人，Proxies API是一個代理輪換api服務。<p>這篇文章最初出現在這裡：https://www.proxiesapi.com/blog/The-Productivity-Tip-That-Changed-My-Life.php\n"
}