{
  "@type": "NewsArticle",
  "identifier": "2022--08--16--en--myfeed--HackerNews--NewsArticle--32486011",
  "url": "https://news.ycombinator.com/item?id=32486011",
  "headline": "Launch HN: Viventum – Web3 ticketing compatible with legacy system",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, Cristian and Tudor here, co-founders of Viventum (<a href=\"https://viventum.xyz\" rel=\"nofollow\">https://viventum.xyz</a>). We're a team of 3: 2 engineers - Tudor is leading a team of students at Siemens, me (Cristian) am the co-author of a paper published at MIT &amp; a sales mastermind, Alex, who is a student at TU Munich.<p>We build a Web3 API based ticketing solution which can be integrated with legacy systems. The core of our product is Web3, and we put some sweet Web2 layers on top to make it user friendly.<p>To crack the ticketing market we build our solution to 1) be better at fulfilling the market needs than what is currently available, 2) solving the problems of fraud, scalping, lack of market control &amp; insights and 3) make using the blockchain frictionless. All these lead to having an at least 10x better product.<p>To better understand our approach, here is a quick overview of the ticketing market: ticketing is very similar with the airline industry - there are two sides 1) airplane builders (e.g. Boeing, Airbus) and 2) airlines (hundreds of them). Current implementations mainly want to build the plane and be the airline at the same time. You can already foresee the problems. Ticketing is a fragmented industry lacking an interoperable standard that can both satisfy the current needs and solve the problems of fraud, scalping and overall lack of control. Because such a standard has not been built yet, the market had to prioritize - it logically picked the flawed, but working, current implementations.<p>We're building Ticketing 3.0 and our thesis has two parts:\n1) Technology can finally provide a solution that satisfies the current needs &amp; solves the decades old problems.\n2) Primary ticket sellers (aka airlines) have a tough enough of a job already - they need to take care of organizers, promoters, artists, venues, fans and many others. If we add to this list also taking care of the tech, we end up with the mess of a market from today. It makes no sense for them to also do the tech - this adds a lot of complexity and a heap of additional problems.<p>BUT, if we remove the burden of tech from ticket sellers, everything works perfectly. Primary ticket sellers can focus on consumer satisfaction and tech providers (Viventum, aka the airplane builders) can focus on making the tech secure.<p>Our USP is focused on the following points:\n1) We have a tech-first approach. We want to unify and dominate the ticketing industry. For this to be possible, we need to make a product able to bridge all the hundreds of venues &amp; ticket sellers worldwide.\n2) We bring Web3 to ticketing, and not the other way around. 90% of the western population attends some kind of ticketed event. MetaMask has around 5 million users worldwide. This is means that from the 2B+ people attending events, almost nobody has a crypto wallet.\n3) This point is connected with the second one: we build for a seamless user journey, where our stakeholders will only reap the rewards and have to deal with the complications of using the latest tech.\n4) Right now the words of PG come into mind &quot;build things that don't scale&quot;. We stay true to those words, building our own marketplace to be our own first customer and integrate the APIs, focusing on getting fast feedback from the market.<p>We started Viventum a few months ago, two engineers excited to use the latest tech, and now we are three co-founders. We continue to improve our product and to better position it in the market by continuously getting feedback from our early customers. If you'd like to be part of our product feedback and iteration process, we'd love to have you onboard - get in touch at contact@viventum.xyz.<p>Tudor and I are excited build our solution which fully integrates Web3 and Web2 at the same time. We'd love to hear your ideas, experiences, and suggestions. Check out our current product at www.viventum.xyz. If you're fans, what do you think of the current product? If you are vendors or organizers, what are you're pain points?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "Coreezee",
    "url": "https://news.ycombinator.com/user?id=Coreezee"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32486011",
  "sameAs": "https://www.viventum.xyz/",
  "dateCreated": "2022-08-16T17:39:30.780Z",
  "datePublished": "2022-08-16T17:29:53.000Z",
  "dateModified": "2022-08-16T17:39:30.780Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "启动HN：Viventum - 与传统系统兼容的Web3票务系统\n",
  "headline_zh-Hant": "啟動HN：Viventum - 與傳統系統兼容的Web3票務系統\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，我是Cristian和Tudor，Viventum（<a href=\"https://viventum.xyz\" rel=\"nofollow\">https://viventum.xyz</a>）的共同创办人。我们是一个3人团队：2名工程师--Tudor正在领导西门子的一个学生团队，我（Cristian）是在麻省理工学院和amp发表的一篇论文的合著者；一个销售高手Alex，他是慕尼黑大学的学生。<p>我们建立一个基于Web3 API的票务解决方案，可以与传统系统集成。我们产品的核心是Web3，我们在上面放了一些贴心的Web2层，使其对用户友好。<p>为了破解票务市场，我们建立了我们的解决方案，以1）比目前可用的更好地满足市场需求，2）解决欺诈、黄牛、缺乏市场控制和洞察力的问题，3）使使用区块链无摩擦。<p>为了更好地理解我们的方法，这里有一个关于票务市场的快速概述：票务与航空业非常相似--有两个方面：1）飞机制造商（如波音、空客）和2）航空公司（有数百家）。目前的实施方案主要是想在建造飞机的同时成为航空公司。你已经可以预见这些问题了。票务是一个分散的行业，缺乏一个既能满足当前需求又能解决欺诈、黄牛和整体缺乏控制问题的互操作标准。由于这样的标准尚未建立，市场不得不优先考虑--它顺理成章地选择了有缺陷的、但能发挥作用的现有实施方案。<p>我们正在建立Ticketing 3.0，我们的论点有两个部分。\n1）技术最终可以提供一个解决方案，以满足当前的需求，并解决几十年的老问题。\n2）主要的票务销售商（又称航空公司）的工作已经很艰难了--他们需要照顾组织者、推广者、艺术家、场地、粉丝和许多其他人。如果我们在这个名单上再加上照顾技术，我们最终会得到今天这个混乱的市场。他们也做技术工作是没有意义的--这增加了很多复杂性和一堆额外的问题。<p>但是，如果我们把技术的负担从票贩子身上移开，一切都会完美地运作。初级售票商可以专注于消费者满意度，而技术供应商（Viventum，又称飞机制造商）可以专注于使技术安全。<p>我们的USP集中在以下几点。\n1）我们有一个技术至上的方法。我们希望统一并主宰票务行业。为了实现这一目标，我们需要制作一个能够连接全球数百个场馆和票务卖家的产品。\n2）我们将Web3带入票务，而不是相反的方式。90%的西方人都参加了某种售票活动。MetaMask在全球拥有约500万用户。这意味着，在参加活动的20多个人中，几乎没有人有加密货币钱包。\n3）这一点与第二点有关：我们为一个无缝的用户旅程而建设，我们的利益相关者将只收获回报，而不得不处理使用最新技术的复杂问题。\n4）现在，PG的话语出现在脑海中&quot;建立不具规模的东西&quot;。我们坚持这些话，建立我们自己的市场，成为我们自己的第一个客户，并整合API，专注于从市场上获得快速反馈。<p>我们在几个月前开始Viventum，两个工程师对使用最新技术感到兴奋，现在我们是三个联合创始人。我们继续改进我们的产品，并通过不断获得早期客户的反馈来更好地在市场上定位。如果你想成为我们产品反馈和迭代过程的一部分，我们非常欢迎你加入--请联系：contact@viventum.xyz。<p>Tudor和我很高兴建立我们的解决方案，它同时完全整合了Web3和Web2。我们很想听听你的想法、经验和建议。请在www.viventum.xyz 上查看我们目前的产品。如果你是粉丝，你对目前的产品有什么看法？如果你是供应商或组织者，你的痛点是什么？\n",
  "description_zh-Hant": "嗨，HN，我是Cristian和Tudor，Viventum（<a href=\"https://viventum.xyz\" rel=\"nofollow\">https://viventum.xyz</a>）的共同創辦人。我們是一個3人團隊：2名工程師--Tudor正在領導西門子的一個學生團隊，我（Cristian）是在麻省理工學院和amp發表的一篇論文的合著者；一個銷售高手Alex，他是慕尼黑大學的學生。<p>我們建立一個基於Web3 API的票務解決方案，可以與傳統系統集成。我們產品的核心是Web3，我們在上面放了一些貼心的Web2層，使其對用戶友好。<p>為了破解票務市場，我們建立了我們的解決方案，以1）比目前可用的更好地滿足市場需求，2）解決欺詐、黃牛、缺乏市場控制和洞察力的問題，3）使使用區塊鏈無摩擦。<p>為了更好地理解我們的方法，這裡有一個關於票務市場的快速概述：票務與航空業非常相似--有兩個方面：1）飛機制造商（如波音、空客）和2）航空公司（有數百家）。目前的實施方案主要是想在建造飛機的同時成為航空公司。你已經可以預見這些問題了。票務是一個分散的行業，缺乏一個既能滿足當前需求又能解決欺詐、黃牛和整體缺乏控制問題的互操作標準。由於這樣的標準尚未建立，市場不得不優先考慮--它順理成章地選擇了有缺陷的、但能發揮作用的現有實施方案。<p>我們正在建立Ticketing 3.0，我們的論點有兩個部分。\n1）技術最終可以提供一個解決方案，以滿足當前的需求，並解決幾十年的老問題。\n2）主要的票務銷售商（又稱航空公司）的工作已經很艱難了--他們需要照顧組織者、推廣者、藝術家、場地、粉絲和許多其他人。如果我們在這個名單上再加上照顧技術，我們最終會得到今天這個混亂的市場。他們也做技術工作是沒有意義的--這增加了很多複雜性和一堆額外的問題。<p>但是，如果我們把技術的負擔從票販子身上移開，一切都會完美地運作。初級售票商可以專注於消費者滿意度，而技術供應商（Viventum，又稱飛機制造商）可以專注於使技術安全。<p>我們的USP集中在以下幾點。\n1）我們有一個技術至上的方法。我們希望統一併主宰票務行業。為了實現這一目標，我們需要製作一個能夠連接全球數百個場館和票務賣家的產品。\n2）我們將Web3帶入票務，而不是相反的方式。90%的西方人都參加了某種售票活動。MetaMask在全球擁有約500萬用戶。這意味著，在參加活動的20多個人中，幾乎沒有人有加密貨幣錢包。\n3）這一點與第二點有關：我們為一個無縫的用戶旅程而建設，我們的利益相關者將只收獲回報，而不得不處理使用最新技術的複雜問題。\n4）現在，PG的話語出現在腦海中&quot;建立不具規模的東西&quot;。我們堅持這些話，建立我們自己的市場，成為我們自己的第一個客戶，並整合API，專注於從市場上獲得快速反饋。<p>我們在幾個月前開始Viventum，兩個工程師對使用最新技術感到興奮，現在我們是三個聯合創始人。我們繼續改進我們的產品，並通過不斷獲得早期客戶的反饋來更好地在市場上定位。如果你想成為我們產品反饋和迭代過程的一部分，我們非常歡迎你加入--請聯繫：contact@viventum.xyz。<p>Tudor和我很高興建立我們的解決方案，它同時完全整合了Web3和Web2。我們很想聽聽你的想法、經驗和建議。請在www.viventum.xyz 上查看我們目前的產品。如果你是粉絲，你對目前的產品有什麼看法？如果你是供應商或組織者，你的痛點是什麼？\n"
}