{
  "@type": "NewsArticle",
  "identifier": "2022--08--24--en--myfeed--HackerNews--NewsArticle--32580287",
  "url": "https://news.ycombinator.com/item?id=32580287",
  "headline": "Do you hide that you suffer from PASC (Long Covid)?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "At this point, more than two years from the original infection ( a so-called &quot;mild case&quot; ) I am essentially disabled, yet have found out that saying it out loud if asked why I'm sick or why I can't do this or that, etc, there are mostly two reactions when people hear it.<p>- They assume I have COVID right now, and I am walking around with the infection. Which naturallly freaks people out.<p>- They think I'm making things up. At most I may get the occasional &quot;oh yeah, I still get tired myself sometimes...&quot; but still a funny look nonetheless.<p>Being &quot;tired sometimes&quot; is not being unable to breathe and oxygen levels dropping like crazy for no reason, or having liver failure, or unexpected and sudden hemorrhages, heart disease that came out of nowhere ( 100% healthy and very fit before COVID ) and a million other things which make life very miserable and difficult. In short, being disabled.<p>And yet people react as if it's made up.<p>I know I am lucky as anxiety does not cause hemorrhages or unexplained liver failure, or a number of things that happen with this disease. I feel for those with &quot;simple&quot; migraines, or the like, who can't even find &quot;comfort&quot; in a doctor rushing them to the ER because clearly you need to be there right now -- no psychosomatic anything here, you get to the hospital or things get very ugly very quick.<p>How do you deal with this problem ? Have you been hiding it ?<p>Edit : Supposedly there is an incredible number of people affected by PASC. In two years I have never met one, no one other than me. It's beyond frustrating.",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "ananiochita",
    "url": "https://news.ycombinator.com/user?id=ananiochita"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32580287",
  "sameAs": "https://news.ycombinator.com/item?id=32580287",
  "dateCreated": "2022-08-24T15:48:58.318Z",
  "datePublished": "2022-08-24T14:57:54.000Z",
  "dateModified": "2022-08-24T15:48:58.318Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "你是否隐瞒了自己患有PASC（长寿）的事实？\n",
  "headline_zh-Hant": "你是否隱瞞了自己患有PASC（長壽）的事實？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在这一点上，距离最初的感染（所谓的 \"轻度病例\"）已经两年多了，我基本上是个残疾人，但我发现，如果被问及我为什么生病或为什么不能做这个或那个等等，大声说出来，人们听到后大多会有两种反应。这自然会把人们吓坏。<p>- 他们认为我在编造事情。最多，我可能会得到偶尔的&quot;哦，是的，我自己有时也会累......&quot;，但还是会有一个有趣的表情。<p>有时累&quot;并不是无法呼吸和氧气水平无缘无故地疯狂下降，也不是有肝衰竭，或意外和突然出血，心脏疾病突然出现（COVID之前100%健康和非常健康）以及其他无数使生活非常悲惨和困难的事情。简而言之，就是残疾。<p>但人们的反应却好像是编造的。<p>我知道我很幸运，因为焦虑不会导致出血或不明原因的肝衰竭，也不会导致这种疾病发生的一些事情。我为那些患有&quot;简单&quot;偏头痛或类似疾病的人感到难过，他们甚至无法在医生催促他们去急诊室时找到&quot;安慰&quot;，因为显然你现在就需要去那里--这里没有心理上的东西，你得去医院，否则事情很快就会变得非常糟糕。<p>你是如何处理这个问题的？你是否一直在隐藏它？<p>编辑：据说有大量的人受到PASC的影响。两年来，我从未见过一个人，除了我之外，没有其他人。这实在是太令人沮丧了。\n",
  "description_zh-Hant": "在這一點上，距離最初的感染（所謂的 \"輕度病例\"）已經兩年多了，我基本上是個殘疾人，但我發現，如果被問及我為什麼生病或為什麼不能做這個或那個等等，大聲說出來，人們聽到後大多會有兩種反應。這自然會把人們嚇壞。<p>- 他們認為我在編造事情。最多，我可能會得到偶爾的&quot;哦，是的，我自己有時也會累......&quot;，但還是會有一個有趣的表情。<p>有時累&quot;並不是無法呼吸和氧氣水平無緣無故地瘋狂下降，也不是有肝衰竭，或意外和突然出血，心臟疾病突然出現（COVID之前100%健康和非常健康）以及其他無數使生活非常悲慘和困難的事情。簡而言之，就是殘疾。<p>但人們的反應卻好像是編造的。<p>我知道我很幸運，因為焦慮不會導致出血或不明原因的肝衰竭，也不會導致這種疾病發生的一些事情。我為那些患有&quot;簡單&quot;偏頭痛或類似疾病的人感到難過，他們甚至無法在醫生催促他們去急診室時找到&quot;安慰&quot;，因為顯然你現在就需要去那裡--這裡沒有心理上的東西，你得去醫院，否則事情很快就會變得非常糟糕。<p>你是如何處理這個問題的？你是否一直在隱藏它？<p>編輯：據說有大量的人受到PASC的影響。兩年來，我從未見過一個人，除了我之外，沒有其他人。這實在是太令人沮喪了。\n"
}