{
  "@type": "NewsArticle",
  "identifier": "2022--04--06--en--askhn--HackerNews--NewsArticle--30936150",
  "url": "https://news.ycombinator.com/item?id=30936150",
  "headline": "Ask HN: Should I turn down an investment with an MFN clause for YC?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We've applied for YC for this upcoming batch, and have currently been talking to angels / pre-seed investors in the event we don't get in.<p>We currently have the ability to accept a $250K SAFE note with no discount/cap, but with a MFN clause. We've been told that SAFE notes with MFN clauses are now very common across a number of angels / earlier-stage funding sources. (For those that don't know what that means, an MFN clause basically says that the $250K will convert at the same discount/cap as any subsequent SAFE that has better terms.)<p>Does this mean if we accept the investment, and then get into YC, we would be giving up at least 21% of our company? (Because the $250K note gets the same terms as YC's $125K for 7%.)<p>That seems like a huge amount to give up, since we'll probably lose another 25% equity during our seed round, meaning we'll only have ~50% of the company left after just our seed round.<p>Am I looking at this right or am I missing something? Doesn't that mean anyone wanting to go through YC shouldn't raise any money that come with an MFN clause (which seems to be super common these day)?<p>The investors unfortunately can't invest without the MFN clause (it's standard), can't wait for 2 months for us to find out YC results, and can't invest any less than $250K.<p>Would love to hear your thoughts on how to think about this. I might be crazy, but I'm leaning towards turning down the funding in the event that we do get into YC.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mfn-throw",
    "url": "https://news.ycombinator.com/user?id=mfn-throw"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30936150",
  "sameAs": "https://news.ycombinator.com/item?id=30936150",
  "dateCreated": "2022-04-06T19:08:08.068Z",
  "datePublished": "2022-04-06T19:01:44.000Z",
  "dateModified": "2022-04-06T19:08:08.068Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该拒绝带有最惠国条款的YC投资吗？",
  "headline_zh-Hant": "Ask HN: 我應該拒絕帶有最惠國條款的YC投資嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们已经为即将到来的这一批申请了YC，目前正在与天使/预投资人商谈，以防我们无法进入。<p>我们目前有能力接受25万美元的SAFE票据，没有折扣/上限，但有一个最惠国条款。我们被告知，带有最惠国条款的SAFE票据现在在一些天使/早期阶段的资金来源中非常普遍。(对于那些不知道这意味着什么的人来说，最惠国条款基本上是说，25万美元将以与任何后续SAFE更好的条款相同的折扣/上限转换。) <p>这是否意味着如果我们接受投资，然后进入YC，我们将放弃至少21%的公司？(因为25万美元的票据与YC的12.5万美元的7%的条件相同。)<p>这似乎是一个巨大的放弃量，因为我们可能会在种子轮期间失去另外25%的股权，这意味着我们在种子轮之后只剩下公司的约50%。<p>这是否意味着任何想通过YC的人都不应该筹集任何带有最惠国条款的资金（这在今天似乎是非常普遍的）？<p>不幸的是，投资者不能在没有最惠国条款的情况下投资（这是标准），不能等待两个月让我们知道YC的结果，而且不能投资低于25万美元。我可能是疯了，但我倾向于在我们真的进入YC的情况下拒绝这笔资金。",
  "description_zh-Hant": "我們已經為即將到來的這一批申請了YC，目前正在與天使/預投資人商談，以防我們無法進入。<p>我們目前有能力接受25萬美元的SAFE票據，沒有折扣/上限，但有一個最惠國條款。我們被告知，帶有最惠國條款的SAFE票據現在在一些天使/早期階段的資金來源中非常普遍。(對於那些不知道這意味著什麼的人來說，最惠國條款基本上是說，25萬美元將以與任何後續SAFE更好的條款相同的折扣/上限轉換。) <p>這是否意味著如果我們接受投資，然後進入YC，我們將放棄至少21%的公司？(因為25萬美元的票據與YC的12.5萬美元的7%的條件相同。)<p>這似乎是一個巨大的放棄量，因為我們可能會在種子輪期間失去另外25%的股權，這意味著我們在種子輪之後只剩下公司的約50%。<p>這是否意味著任何想通過YC的人都不應該籌集任何帶有最惠國條款的資金（這在今天似乎是非常普遍的）？<p>不幸的是，投資者不能在沒有最惠國條款的情況下投資（這是標準），不能等待兩個月讓我們知道YC的結果，而且不能投資低於25萬美元。我可能是瘋了，但我傾向於在我們真的進入YC的情況下拒絕這筆資金。"
}