{
  "@type": "NewsArticle",
  "identifier": "2022--03--07--en--askhn--HackerNews--NewsArticle--30592365",
  "url": "https://news.ycombinator.com/item?id=30592365",
  "headline": "Ask HN: U.S. worker receiving stock options from Canadian startup",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The four tax lawyers I've spoken to on an &quot;advice&quot; basis seem to think this is a complicated situation that calls for a specialist. Unfortunately, I haven't found a specialist who I can afford. And the ones I <i>can</i> afford have not been able to guarantee me that they can actually help me.<p>So, after a week of research, I'm asking HN in case anyone has been in a similar situation. Many thanks in advance.<p>The situation:<p>I'm a U.S.-based worker who has recently been hired on to a Canadian startup, and my hiring package includes stock options that vest over a four-year period. The exercise price on these options is set to the current fair market value. (That FMV is based, I imagine, on the valuation set by the pool of private investors -- this is not a publicly traded company).<p>My Questions:<p>(1) Do these options qualify for an 83(b) election? And if so, when do I file that? Some experts seem to say you don't file an 83(b) election on stock <i>options</i> until you exercise those options. Others seem to say that for options I should file for 83(b) election within 30 days of &quot;grant date&quot; (i.e. now).<p>(2) I'll assume the answer to the above is that I cannot file an 83(b) election until I exercise the options (e.g. at minimum one year from today). Does this mean that, at the time of vesting, if I think the value of the company will increase, I should exercise these options as soon as they vest (and file an 83(b))?<p>(3) Given that the FMV and strike price are equivalent at time of grant (now), do I need to do anything tax-wise this year? I imagine not, since there is not yet any inherent &quot;value&quot; to these options.<p>(4) Do I need to be aware of any double-taxation implication, since this is a Canadian-based company and I'm a U.S. worker?<p>(5) Is there anything else I'm overlooking here where I might curse myself down the road if I don't take action on?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway489322",
    "url": "https://news.ycombinator.com/user?id=throwaway489322"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30592365",
  "sameAs": "https://news.ycombinator.com/item?id=30592365",
  "dateCreated": "2022-03-07T21:36:30.319Z",
  "datePublished": "2022-03-07T19:38:20.000Z",
  "dateModified": "2022-03-07T21:36:30.319Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 美国工人从加拿大创业公司获得股票期权",
  "headline_zh-Hant": "Ask HN: 美國工人從加拿大創業公司獲得股票期權",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "The four tax lawyers I've spoken to on an &quot;advice&quot; basis seem to think this is a complicated situation that calls for a specialist. Unfortunately, I haven't found a specialist who I can afford. 所以，经过一周的研究，我向HN询问，希望有人能遇到类似的情况。<p>情况是这样的：<p>我是一名美国工人，最近被一家加拿大初创公司雇用，我的雇用计划包括股票期权，在四年内归属。这些期权的行使价格被设定为当前的公平市场价值。(<p>我的问题：<p>（1）这些期权是否符合83（b）选择的条件？And if so, when do I file that? Some experts seem to say you don't file an 83(b) election on stock <i>options</i> until you exercise those options. 其他人似乎说，对于期权，我应该在授予日期30天内（即现在）提出83(b)选择。<p>(2) 我假设上述答案是，在我行使期权之前（例如，从今天起至少一年），我不能提出83(b)选择。这是否意味着，在归属时，如果我认为公司的价值会增加，我应该在归属时立即行使这些期权（并提交83(b)）？<p>(3) 鉴于在授予时（现在）FMV和执行价格相等，我今年是否需要做任何税务方面的工作？我想不需要，因为这些期权还没有任何内在的价值。<p>(4) 我是否需要注意任何双重征税的影响，因为这是一家加拿大公司，而我是一名美国工人？<p>(5) 如果我不采取行动，还有什么我忽略了的地方吗？",
  "description_zh-Hant": "The four tax lawyers I've spoken to on an &quot;advice&quot; basis seem to think this is a complicated situation that calls for a specialist. Unfortunately, I haven't found a specialist who I can afford. 所以，經過一週的研究，我向HN詢問，希望有人能遇到類似的情況。<p>情況是這樣的：<p>我是一名美國工人，最近被一家加拿大初創公司僱用，我的僱用計劃包括股票期權，在四年內歸屬。這些期權的行使價格被設定為當前的公平市場價值。(<p>我的問題：<p>（1）這些期權是否符合83（b）選擇的條件？And if so, when do I file that? Some experts seem to say you don't file an 83(b) election on stock <i>options</i> until you exercise those options. 其他人似乎說，對於期權，我應該在授予日期30天內（即現在）提出83(b)選擇。<p>(2) 我假設上述答案是，在我行使期權之前（例如，從今天起至少一年），我不能提出83(b)選擇。這是否意味著，在歸屬時，如果我認為公司的價值會增加，我應該在歸屬時立即行使這些期權（並提交83(b)）？<p>(3) 鑑於在授予時（現在）FMV和執行價格相等，我今年是否需要做任何稅務方面的工作？我想不需要，因為這些期權還沒有任何內在的價值。<p>(4) 我是否需要注意任何雙重徵稅的影響，因為這是一家加拿大公司，而我是一名美國工人？<p>(5) 如果我不採取行動，還有什麼我忽略了的地方嗎？"
}