{
  "@type": "NewsArticle",
  "identifier": "2022--03--01--en--askhn--HackerNews--NewsArticle--30513030",
  "url": "https://news.ycombinator.com/item?id=30513030",
  "headline": "Ask HN: I realise Data Science is not for me and feel depressed",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a fourth year student in Eastern Europe, studying Math and Economics. This is the final year, and I have 3-4 months till graduation. At the same time, I've been working full time as a Data Scientist at a big telecom company for the last several months. And I think it's not for me<p>The project here is interesting, but I realize that I do not like any of the &quot;real&quot; DS tasks, e.g. anything that involves actually building a model from the statistical standpoint. Now, I write a lot of SQL: the company has hundreds of billions of calling records, so you have to really think about the queries you write, and even if they are quite optimized I still sit here for a long time waiting for the response. And even that is more exciting than any of the statistical tasks I face<p>Little background: I started coding when I was 16, back then I built an iOS app using Swift to help me learn English vocabulary. After that, I've been coding as a hobby on the side during my studies. I liked mathematics and statistics as a freshman, and during my second year found out about Data Science. Given my background, I thought it would be a perfect fit for me. I built a few pet-projects using ML during my third year, and started applying. They impressed one of the employers (big bank), so these projects basically landed me my first internship, which led me to the current job<p>The thing I like the most is actually building stuff with my hands, and I think SWE is a better fit here. I guess this is the reason I never liked Kaggle. Also, most of my internship I spent building a simple web interface for the existing model (mostly back, like connecting to DB, transforming data, deploying to Linux, etc), which was 100% SWE task and I liked it. So there were hints along the way...<p>How would you recommend me to switch to SWE the fastest way possible?<p>I'm quite depressed now because I've put enormous effort into switching to DS: I applied to 80 job postings before I got my first internship, and I feel this is for nothing now. Also, my university and faculty considered to be really difficult, so studying DS on the side was brutal.<p>Besides, I live in Russia and want to relocate (for obv reasons), and feel like it's easier with SWE skills (especially given that I know English and in the process of receiving EU passport). This puts an enormous time pressure on me given how the things are playing out now...<p>I would appreciate any opinion/advice!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "boa00",
    "url": "https://news.ycombinator.com/user?id=boa00"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30513030",
  "sameAs": "https://news.ycombinator.com/item?id=30513030",
  "dateCreated": "2022-03-01T12:14:56.399Z",
  "datePublished": "2022-03-01T11:53:29.000Z",
  "dateModified": "2022-03-01T12:14:56.399Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我意识到数据科学不适合我，感到很沮丧",
  "headline_zh-Hant": "Ask HN: 我意識到數據科學不適合我，感到很沮喪",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是东欧的一名四年级学生，学习数学和经济学。今年是最后一年，离毕业还有3-4个月。同时，在过去的几个月里，我一直在一家大型电信公司做全职的数据科学家。我认为这不适合我<p>这里的项目很有趣，但我意识到我不喜欢任何&quot;真正&quot;的DS任务，例如，任何涉及从统计角度实际建立模型的工作。现在，我写了很多SQL：公司有几千亿条调用记录，所以你必须真正考虑你所写的查询，即使它们已经相当优化，我仍然坐在这里等着回复。甚至这比我所面临的任何统计任务都更令人兴奋<p>小背景。我在16岁时开始编码，那时我用Swift建立了一个iOS应用程序，帮助我学习英语词汇。在那之后，我一直把编码作为学习期间的业余爱好来做。我在大一的时候喜欢数学和统计学，在大二的时候发现了数据科学。鉴于我的背景，我认为这对我来说是一个完美的选择。在第三年，我用ML建立了一些宠物项目，并开始申请。他们给其中一个雇主（大银行）留下了深刻的印象，所以这些项目基本上给我带来了第一个实习机会，这让我找到了现在的工作<p>我最喜欢的事情是真正用我的双手建造东西，我认为SWE在这里更适合。我想这就是我从不喜欢Kaggle的原因。另外，我实习的大部分时间是在为现有的模型建立一个简单的网络界面（主要是后面的，比如连接到DB，转换数据，部署到Linux等等），这100%是SWE的任务，我很喜欢。所以一路上都有提示......<p>你如何建议我以最快的方式转到SWE？<p>我现在相当郁闷，因为我为转到DS付出了巨大的努力：在得到第一个实习机会之前，我申请了80个招聘信息，现在我觉得这些都是白费的。此外，我的大学和学院被认为是非常困难的，所以在一边学习DS是很残酷的。<p>此外，我住在俄罗斯，想搬迁（因为明显的原因），并且觉得有了SWE技能会更容易（特别是考虑到我懂英语，并且正在获得欧盟护照）。鉴于现在的情况，这给我带来了巨大的时间压力......<p>我将感谢任何意见/建议",
  "description_zh-Hant": "我是東歐的一名四年級學生，學習數學和經濟學。今年是最後一年，離畢業還有3-4個月。同時，在過去的幾個月裡，我一直在一家大型電信公司做全職的數據科學家。我認為這不適合我<p>這裡的項目很有趣，但我意識到我不喜歡任何&quot;真正&quot;的DS任務，例如，任何涉及從統計角度實際建立模型的工作。現在，我寫了很多SQL：公司有幾千億條調用記錄，所以你必須真正考慮你所寫的查詢，即使它們已經相當優化，我仍然坐在這裡等著回覆。甚至這比我所面臨的任何統計任務都更令人興奮<p>小背景。我在16歲時開始編碼，那時我用Swift建立了一個iOS應用程序，幫助我學習英語詞彙。在那之後，我一直把編碼作為學習期間的業餘愛好來做。我在大一的時候喜歡數學和統計學，在大二的時候發現了數據科學。鑑於我的背景，我認為這對我來說是一個完美的選擇。在第三年，我用ML建立了一些寵物項目，並開始申請。他們給其中一個僱主（大銀行）留下了深刻的印象，所以這些項目基本上給我帶來了第一個實習機會，這讓我找到了現在的工作<p>我最喜歡的事情是真正用我的雙手建造東西，我認為SWE在這裡更適合。我想這就是我從不喜歡Kaggle的原因。另外，我實習的大部分時間是在為現有的模型建立一個簡單的網絡界面（主要是後面的，比如連接到DB，轉換數據，部署到Linux等等），這100%是SWE的任務，我很喜歡。所以一路上都有提示......<p>你如何建議我以最快的方式轉到SWE？<p>我現在相當鬱悶，因為我為轉到DS付出了巨大的努力：在得到第一個實習機會之前，我申請了80個招聘信息，現在我覺得這些都是白費的。此外，我的大學和學院被認為是非常困難的，所以在一邊學習DS是很殘酷的。<p>此外，我住在俄羅斯，想搬遷（因為明顯的原因），並且覺得有了SWE技能會更容易（特別是考慮到我懂英語，並且正在獲得歐盟護照）。鑑於現在的情況，這給我帶來了巨大的時間壓力......<p>我將感謝任何意見/建議"
}