{
  "@type": "NewsArticle",
  "identifier": "2022--03--13--en--askhn--HackerNews--NewsArticle--30665311",
  "url": "https://news.ycombinator.com/item?id=30665311",
  "headline": "Ask HN: How would you build a 1000 year Bandcamp?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I’ve been mulling this over again after seeing the online outrage over Bandcamp’s acquisition. I think people were really upset because they see Bandcamp as an indie platform that tries to do The Right Thing by artists by staying small and taking a relatively small cut of sales to run the service.<p>I feel pretty mixed about it. I’m happy for the founders and early employees getting rewarded for their hard work but recognize that it’s the end of an era for bandcamp since their profit motivation and sense of ownership won’t be there for much longer. As a tech-optimist I’m excited about futuristic new platforms that could flourish in it’s place.<p>That said, I don’t really want to philosophize about any of that here.<p>Instead, my question for all the builders on HN… how would you, both technically and organizationally, architect a version of Bandcamp that would last 1000 years instead of 15. And I mean, kudos on 15, that’s ages in tech but clearly a lot of people wanted more.<p>- What stack would you use and what infra would host it?<p>- Would it be an open source project?<p>- How would you organize and incentivize development?<p>A few thoughts to kick it off…<p>- We all know software’s gotta change over time as platforms and user expectations change. The computers we’re using in 20 years are going to crush what we’re on now and user expectations will update (though probably a lot slower than we usually think). So we need a mechanism to keep updating it.<p>- If it’s going to last, it should probably not be possible for a big co to take it over and cover it with ads or something.<p>Just some Sunday fun :).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "rgbrgb",
    "url": "https://news.ycombinator.com/user?id=rgbrgb"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30665311",
  "sameAs": "https://news.ycombinator.com/item?id=30665311",
  "dateCreated": "2022-03-13T20:30:25.557Z",
  "datePublished": "2022-03-13T20:19:11.000Z",
  "dateModified": "2022-03-13T20:30:25.557Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你将如何建立一个1000年的Bandcamp？",
  "headline_zh-Hant": "Ask HN: 你將如何建立一個1000年的Bandcamp？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在看到网上对Bandcamp收购案的愤怒之后，我又在琢磨这个问题了。我认为人们真的很不高兴，因为他们认为Bandcamp是一个独立的平台，试图通过保持小规模并从销售中抽取相对较少的份额来运营服务，从而为艺术家做正确的事情。我为创始人和早期员工的努力工作得到回报感到高兴，但也认识到这是 bandcamp 一个时代的结束，因为他们的盈利动机和所有权意识不会再存在了。作为一个技术乐观主义者，我对未来的新平台感到兴奋，这些平台可能会在它的位置上蓬勃发展。<p>尽管如此，我真的不想在这里对这些进行哲学思考。<p>相反，我对HN上的所有建设者提出了一个问题......你将如何在技术上和组织上构建一个可以持续1000年而不是15年的Bandcamp的版本。我的意思是，为15年点个赞，这在技术上是很久的事了，但显然很多人想要更多。<p>- 你会使用什么堆栈，用什么基础设施来承载它？<p>- 它会是一个开源项目吗？<p>- 你会如何组织和激励开发？<p>一些想法来启动它...<p>- 我们都知道软件会随着平台和用户期望的改变而改变。我们在20年后使用的计算机将粉碎我们现在使用的计算机，而且用户的期望也会更新（尽管可能比我们通常想象的要慢得多）。所以我们需要一种机制来不断地更新它。<p>- 如果它要持续下去，可能不应该让一个大公司接管它并用广告或其他东西来覆盖它。<p>只是一些星期天的乐趣：）。",
  "description_zh-Hant": "在看到網上對Bandcamp收購案的憤怒之後，我又在琢磨這個問題了。我認為人們真的很不高興，因為他們認為Bandcamp是一個獨立的平臺，試圖通過保持小規模並從銷售中抽取相對較少的份額來運營服務，從而為藝術家做正確的事情。我為創始人和早期員工的努力工作得到回報感到高興，但也認識到這是 bandcamp 一個時代的結束，因為他們的盈利動機和所有權意識不會再存在了。作為一個技術樂觀主義者，我對未來的新平臺感到興奮，這些平臺可能會在它的位置上蓬勃發展。<p>儘管如此，我真的不想在這裡對這些進行哲學思考。<p>相反，我對HN上的所有建設者提出了一個問題......你將如何在技術上和組織上構建一個可以持續1000年而不是15年的Bandcamp的版本。我的意思是，為15年點個贊，這在技術上是很久的事了，但顯然很多人想要更多。<p>- 你會使用什麼堆棧，用什麼基礎設施來承載它？<p>- 它會是一個開源項目嗎？<p>- 你會如何組織和激勵開發？<p>一些想法來啟動它...<p>- 我們都知道軟件會隨著平臺和用戶期望的改變而改變。我們在20年後使用的計算機將粉碎我們現在使用的計算機，而且用戶的期望也會更新（儘管可能比我們通常想象的要慢得多）。所以我們需要一種機制來不斷地更新它。<p>- 如果它要持續下去，可能不應該讓一個大公司接管它並用廣告或其他東西來覆蓋它。<p>只是一些星期天的樂趣：）。"
}