{
  "@type": "NewsArticle",
  "identifier": "2022--04--03--en--askhn--HackerNews--NewsArticle--30893043",
  "url": "https://news.ycombinator.com/item?id=30893043",
  "headline": "Ask HN: How to pull off a successful career switch?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I share personal details below if you want to help me in particular, but general advice is of course very welcome. I imagine many of us are looking to do something at least a little different.<p>--------------<p>My resume doesn't scream competency with any particular technologies. I've just been &quot;the web guy&quot; for marketing teams. I enjoy being a generalist but it seems to be backfiring on me now. I probably couldn't swing it in a front-end role or a back-end role. I've gotten by, by writing mostly HTML and CSS with some snippets of PHP and Bash. Roles tend to be looking for a React specialist or a Laravel expert. When years of experience with a technology come up, the best I can usually say is: &quot;I used that for a thing once.&quot;<p>I'm contemplating taking a break from tech altogether and doing--something with plants? Recently, it occurred to me that technical writing is a possibility. I might be able to stay proximate to my old roles but still do something different for a while. Honestly, getting into an &quot;actual&quot; developer role feels as daunting today as it did when I had no work experience. Is this just a confidence thing? I've enjoyed playing with computers since I was a child, but still the idea that I could even be a developer feels like a delusion. As a kid, I wanted cobble together a website, not become a PHP dev, so I learned enough to make my toy projects. Now, I'm 26 and after some professional experience, I feel semi-capable at a lot of things, but I don't think that's what most roles are looking for and I can't blame them.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "krasotkin",
    "url": "https://news.ycombinator.com/user?id=krasotkin"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30893043",
  "sameAs": "https://news.ycombinator.com/item?id=30893043",
  "dateCreated": "2022-04-03T00:39:41.010Z",
  "datePublished": "2022-04-03T00:37:25.000Z",
  "dateModified": "2022-04-03T00:39:41.010Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何成功完成职业转换？",
  "headline_zh-Hant": "Ask HN: 如何成功完成職業轉換？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "如果你想特别帮助我，我在下面分享个人的详细资料，但当然也非常欢迎一般的建议。我想我们中的许多人都想做一些至少有点不同的事情。<p>--------------<p>我的简历并没有喊出对任何特定技术的能力。我一直是营销团队的网络人员。我喜欢做一个通才，但现在看来，这对我来说是一种反击。我可能无法在前端角色或后端角色中摇摆不定。我主要是通过写HTML和CSS，再加上一些PHP和Bash的片段来应付。角色往往在寻找一个React专家或Laravel专家。当我提到某项技术的多年经验时，我通常只能说：&quot;我曾经用它来做过一件事。<p>我正在考虑从技术方面完全休息一下，做--与植物有关的事情？最近，我想到了技术写作是一种可能性。我也许可以保持与我以前的角色相近，但仍然可以暂时做一些不同的事情。说实话，今天进入一个真正的开发者角色和我没有工作经验的时候一样令人生畏。这只是一个信心问题吗？我从小就喜欢玩电脑，但我甚至可以成为一名开发者的想法仍然让人觉得是一种错觉。作为一个孩子，我想拼凑一个网站，而不是成为一个PHP开发人员，所以我学会了足够的东西来做我的玩具项目。现在，我26岁了，在有了一些专业经验之后，我觉得自己在很多事情上都有了一定的能力，但我认为这并不是大多数角色所需要的，我也不能责怪他们。",
  "description_zh-Hant": "如果你想特別幫助我，我在下面分享個人的詳細資料，但當然也非常歡迎一般的建議。我想我們中的許多人都想做一些至少有點不同的事情。<p>--------------<p>我的簡歷並沒有喊出對任何特定技術的能力。我一直是營銷團隊的網絡人員。我喜歡做一個通才，但現在看來，這對我來說是一種反擊。我可能無法在前端角色或後端角色中搖擺不定。我主要是通過寫HTML和CSS，再加上一些PHP和Bash的片段來應付。角色往往在尋找一個React專家或Laravel專家。當我提到某項技術的多年經驗時，我通常只能說：&quot;我曾經用它來做過一件事。<p>我正在考慮從技術方面完全休息一下，做--與植物有關的事情？最近，我想到了技術寫作是一種可能性。我也許可以保持與我以前的角色相近，但仍然可以暫時做一些不同的事情。說實話，今天進入一個真正的開發者角色和我沒有工作經驗的時候一樣令人生畏。這只是一個信心問題嗎？我從小就喜歡玩電腦，但我甚至可以成為一名開發者的想法仍然讓人覺得是一種錯覺。作為一個孩子，我想拼湊一個網站，而不是成為一個PHP開發人員，所以我學會了足夠的東西來做我的玩具項目。現在，我26歲了，在有了一些專業經驗之後，我覺得自己在很多事情上都有了一定的能力，但我認為這並不是大多數角色所需要的，我也不能責怪他們。"
}