{
  "@type": "NewsArticle",
  "identifier": "2022--03--14--en--askhn--HackerNews--NewsArticle--30678249",
  "url": "https://news.ycombinator.com/item?id=30678249",
  "headline": "Ask HN: Sick with Covid in Spain, Google Fi suddenly cuts off my phone service",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I was delayed in Spain because of Covid. I evacuated here sick with Covid from Ukraine, just before the war. Suddenly Google Fi cuts off my service, with no warning. I have not received their email warning. Can somebody help me on HN? I edited out my case ID from the chat, but I can add it.<p>Welcome to Google Support. My name is Lohitha. How are you today?\nLohitha · 1:32 PM\nhi\n1:32 PM\nL\nHi Alec!\nPlease make a note of this case ID: 5-XXXXXXX for future reference.\nLohitha · 1:32 PM\nI described the problem: I suddenly lost data connection today and cannot reconnet to data\n1:32 PM\nL\nI see that you are facing issues with the international data connection. I will help you to the best of my expertise.\nThanks for the details.\nLohitha · 1:33 PM\nIn the screenshot, all networks that now say Forbidden were available until today\n1:34 PM\nL\nOkay. Are you on active military duty or a government employee?\nLohitha · 1:35 PM\nno\n1:35 PM\nL\nThank you for the details.\nLohitha · 1:35 PM\nthis happened after I made a long call to a US phone number over WiFi\n1:36 PM\nL\nGot it.\nI have checked the details and see that your international data capability is suspended.\nLohitha · 1:39 PM\nWhy?\n1:39 PM\nL\nAs per our Terms of Service, Fi must be primarily used in the United States (territories not included) and isn’t intended for extended international use.\nIf you plan to stay abroad, we recommend you use a local carrier until you return to the US.\nLohitha · 1:39 PM\nI had covid and I was delayed here\nI have documents that show that I have had covid recently\n1:40 PM\nL\nAlec, I completely understand.\nI would have definitely helped you with this if there would have been any other alternative options.\nLohitha · 1:42 PM\nI am returning to the US in 2 weeks: I even had to ask for a visa extension because I am sick. I hope you won't cut off my service because I have Covid?\nI can upload my doctor's letter and a positive PCR test\n1:44 PM\nL\nUnfortunately, we don't have an option to provide exceptions for covid affected persons. I hope you understand.\nYour international data roaming capabilities are automatically reinstated once we determine that your services (data, talk and text) are primarily used in the United States (territories not included) as per our Terms of Service.\nLohitha · 1:45 PM\nI am sick and you cut off my phone without warning!\nThere was no warning whatsoever\n1:45 PM\nL\nAlec, you must have received an email before 30 days as a remainder.\nLohitha · 1:46 PM\nI have never received any email\nNothing\n1:46 PM\nL\nPlease check if you have blocked the system automated emails.\nLohitha · 1:46 PM\nI have not\n1:46 PM\nL\nGoogle Fi will send an email before 30 days.\nLohitha · 1:47 PM\nI have never seen the email\nAnd I cannot find it in my gmail account: I am looking no\nnow\n1:47 PM\nL\nI understand. Please check your gmail settings if you have any restrictions.\nLohitha · 1:48 PM\nI did not set any restrictions. Since this is about disconnecting my phone, you could have called me or at least sent a text!\ncan you please reinstate the service for 2 weeks? I am cut off from my banking, everything\nAnd I am sick\n1:49 PM\nL\nAlec, it is an automated email system. Unfortunately, we don't have an option to send you a text or call. I hope you understand.\nI would have certainly helped you if there is any alternative option.\nIt is my pleasure to assist you today! Have a good one!\nLohitha left the chat.\n1:50 PM\nThanks for contacting Google Fi chat support. Your chat session is now complete.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cft",
    "url": "https://news.ycombinator.com/user?id=cft"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30678249",
  "sameAs": "https://news.ycombinator.com/item?id=30678249",
  "dateCreated": "2022-03-14T21:10:08.309Z",
  "datePublished": "2022-03-14T21:01:20.000Z",
  "dateModified": "2022-03-14T21:10:08.309Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在西班牙的Covid生病了，Google Fi突然切断了我的电话服务",
  "headline_zh-Hant": "Ask HN: 在西班牙的Covid生病了，Google Fi突然切斷了我的電話服務",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在西班牙被耽搁了，因为科维德。我带着Covid从乌克兰疏散到这里，就在战争之前。突然间，Google Fi切断了我的服务，没有任何警告。我没有收到他们的电子邮件警告。有人能在HN上帮助我吗？我在聊天中编辑了我的案例ID，但我可以添加它。<p>欢迎来到谷歌支持。我的名字是Lohitha。你今天好吗？\nLohitha - 1:32 PM\n嗨\n1:32 PM\nL\n嗨，Alec!\n请记下这个案例的ID：5-XXXXXXX，供以后参考。\nLohitha - 1:32 PM\n我描述了这个问题：我今天突然失去了数据连接，无法重新连接到数据。\n1:32 PM\nL\n我看到你正面临着国际数据连接的问题。我将尽我所能帮助你。\n谢谢你的详细介绍。\nLohitha - 1:33 PM\n在截图中，所有现在显示禁止的网络在今天之前都是可用的\n1:34 PM\nL\n好的。你是现役军人还是政府雇员？\nLohitha - 1:35 PM\n不是\n1:35 PM\nL\n谢谢你的详细介绍。\nLohitha - 1:35 PM\n这发生在我通过WiFi给一个美国电话号码打长途电话之后\n1:36 PM\nL\n明白了。\n我已经检查了细节，发现你的国际数据功能被暂停了。\nLohitha - 1:39 PM\n为什么？\n1:39 PM\nL\n根据我们的服务条款，Fi必须主要在美国境内使用（不包括领土），不打算扩大国际使用。\n如果你计划留在国外，我们建议你使用当地的运营商，直到你返回美国。\nLohitha - 1:39 PM\n我有covid，我在这里被延误了\n我有文件显示我最近做过covid。\n下午1:40\nL\nAlec，我完全理解。\n如果有其他的选择，我肯定会帮你解决这个问题。\nLohitha - 1:42 PM\n我2周后就要回美国了。我甚至不得不要求签证延期，因为我生病了。我希望你们不会因为我有科维德而切断我的服务？\n我可以上传我的医生信和PCR测试的阳性报告\n下午1:44\nL\n不幸的是，我们没有选择为受Covid影响的人提供例外。我希望你能理解。\n一旦我们确定您的服务（数据、通话和文本）主要在美国（不包括的地区）使用，根据我们的服务条款，您的国际数据漫游能力将自动恢复。\nLohitha - 1:45 PM\n我生病了，你们没有警告就切断了我的电话!\n根本没有任何警告\n下午1:45\nL\nAlec，你一定是在30天之前收到了一封邮件，作为剩余。\nLohitha - 1:46 PM\n我从来没有收到过任何电子邮件\n没有什么\n1:46 PM\nL\n请检查你是否屏蔽了系统自动发送的邮件。\nLohitha - 1:46 PM\n我没有\n1:46 PM\nL\nGoogle Fi会在30天之前发送一封邮件。\nLohitha - 1:47 PM\n我从未见过这封邮件\n我在我的Gmail账户中也找不到它。我正在寻找\n现在\n1:47 PM\nL\n我明白了。如果你有任何限制，请检查你的Gmail设置。\nLohitha - 1:48 PM\n我没有设置任何限制。既然是关于断开我的电话，你可以给我打电话，或者至少发个短信！你能不能恢复2周的服务？\n你能不能恢复2周的服务？我被切断了银行业务，一切都被切断了\n而且我很难受\n下午1:49\nL\n艾力克，这是一个自动的电子邮件系统。不幸的是，我们没有选项可以给你发短信或打电话。我希望你能理解。\n如果有任何其他选择，我肯定会帮助你。\n今天能帮助你是我的荣幸! 祝您愉快!\nLohitha离开了聊天。\n下午1:50\n谢谢你联系Google Fi聊天支持。您的聊天会话现在已经完成。",
  "description_zh-Hant": "我在西班牙被耽擱了，因為科維德。我帶著Covid從烏克蘭疏散到這裡，就在戰爭之前。突然間，Google Fi切斷了我的服務，沒有任何警告。我沒有收到他們的電子郵件警告。有人能在HN上幫助我嗎？我在聊天中編輯了我的案例ID，但我可以添加它。<p>歡迎來到谷歌支持。我的名字是Lohitha。你今天好嗎？\nLohitha - 1:32 PM\n嗨\n1:32 PM\nL\n嗨，Alec!\n請記下這個案例的ID：5-XXXXXXX，供以後參考。\nLohitha - 1:32 PM\n我描述了這個問題：我今天突然失去了數據連接，無法重新連接到數據。\n1:32 PM\nL\n我看到你正面臨著國際數據連接的問題。我將盡我所能幫助你。\n謝謝你的詳細介紹。\nLohitha - 1:33 PM\n在截圖中，所有現在顯示禁止的網絡在今天之前都是可用的\n1:34 PM\nL\n好的。你是現役軍人還是政府僱員？\nLohitha - 1:35 PM\n不是\n1:35 PM\nL\n謝謝你的詳細介紹。\nLohitha - 1:35 PM\n這發生在我通過WiFi給一個美國電話號碼打長途電話之後\n1:36 PM\nL\n明白了。\n我已經檢查了細節，發現你的國際數據功能被暫停了。\nLohitha - 1:39 PM\n為什麼？\n1:39 PM\nL\n根據我們的服務條款，Fi必須主要在美國境內使用（不包括領土），不打算擴大國際使用。\n如果你計劃留在國外，我們建議你使用當地的運營商，直到你返回美國。\nLohitha - 1:39 PM\n我有covid，我在這裡被延誤了\n我有文件顯示我最近做過covid。\n下午1:40\nL\nAlec，我完全理解。\n如果有其他的選擇，我肯定會幫你解決這個問題。\nLohitha - 1:42 PM\n我2周後就要回美國了。我甚至不得不要求籤證延期，因為我生病了。我希望你們不會因為我有科維德而切斷我的服務？\n我可以上傳我的醫生信和PCR測試的陽性報告\n下午1:44\nL\n不幸的是，我們沒有選擇為受Covid影響的人提供例外。我希望你能理解。\n一旦我們確定您的服務（數據、通話和文本）主要在美國（不包括的地區）使用，根據我們的服務條款，您的國際數據漫遊能力將自動恢復。\nLohitha - 1:45 PM\n我生病了，你們沒有警告就切斷了我的電話!\n根本沒有任何警告\n下午1:45\nL\nAlec，你一定是在30天之前收到了一封郵件，作為剩餘。\nLohitha - 1:46 PM\n我從來沒有收到過任何電子郵件\n沒有什麼\n1:46 PM\nL\n請檢查你是否屏蔽了系統自動發送的郵件。\nLohitha - 1:46 PM\n我沒有\n1:46 PM\nL\nGoogle Fi會在30天之前發送一封郵件。\nLohitha - 1:47 PM\n我從未見過這封郵件\n我在我的Gmail賬戶中也找不到它。我正在尋找\n現在\n1:47 PM\nL\n我明白了。如果你有任何限制，請檢查你的Gmail設置。\nLohitha - 1:48 PM\n我沒有設置任何限制。既然是關於斷開我的電話，你可以給我打電話，或者至少發個短信！你能不能恢復2周的服務？\n你能不能恢復2周的服務？我被切斷了銀行業務，一切都被切斷了\n而且我很難受\n下午1:49\nL\n艾力克，這是一個自動的電子郵件系統。不幸的是，我們沒有選項可以給你發短信或打電話。我希望你能理解。\n如果有任何其他選擇，我肯定會幫助你。\n今天能幫助你是我的榮幸! 祝您愉快!\nLohitha離開了聊天。\n下午1:50\n謝謝你聯繫Google Fi聊天支持。您的聊天會話現在已經完成。"
}