{
  "@type": "NewsArticle",
  "identifier": "2022--03--05--en--askhn--HackerNews--NewsArticle--30568545",
  "url": "https://news.ycombinator.com/item?id=30568545",
  "headline": "Ask HN: Hide/remove the Flag / Hide links in the main list view",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The simplicity of the Hacker News UI is one of its charms, but viewing HN on a mobile, fairly often I end up accidentally hitting Flag or Hide when I'm simply trying to open an article link or go into the comments. Then there's that moment of &quot;did I hit the wrong thing?&quot; followed by the usual scrabble about to undo it (since I don't want to flag stuff inappropriately!)<p>What I wondered was whether it's really necessary to have the Flag / Hide links there in the main list view at all, especially when for most users they'll be used comparatively much less often than the other links (either to the article or to the comments). If they were hidden in the list then it would avoid the risk, and people who are genuinely flagging items can easily do it from the header of the comments page, which often will be where they've been anyway (eg if they check out what others have said before flagging)<p>What do people think? Needless change? Potentially helpful? Something to put behind an option? (so UI traditionalists keep it unchanged and optimisers can tweak it as desired)<p>I realise that on a full computer, one could use a grease monkey script / custom plugin for this kind of thing, but on mobile that's not really an option. Nor is zooming to increase the text size as it then loses content off the edge (on mobile Chrome at least)",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "nmstoker",
    "url": "https://news.ycombinator.com/user?id=nmstoker"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30568545",
  "sameAs": "https://news.ycombinator.com/item?id=30568545",
  "dateCreated": "2022-03-05T16:11:32.704Z",
  "datePublished": "2022-03-05T15:55:40.000Z",
  "dateModified": "2022-03-05T16:11:32.704Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 隐藏/删除旗帜/隐藏主列表视图中的链接",
  "headline_zh-Hant": "Ask HN: 隱藏/刪除旗幟/隱藏主列表視圖中的鏈接",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "黑客新闻用户界面的简单性是其魅力之一，但在手机上浏览黑客新闻时，当我只是想打开一个文章链接或进入评论时，经常会不小心点击Flag或隐藏。然后就会有那种 \"我是不是按错了？\"的感觉，接着就会拼命地去撤销它（因为我不想不适当地标记东西！）<p>我想知道的是，是否真的有必要在主要的列表视图中设置标记/隐藏链接，尤其是对大多数用户来说，它们比其他链接（无论是文章还是评论）的使用频率要低很多。如果它们被隐藏在列表中，那么就可以避免这种风险，而真正要标记项目的人可以很容易地从评论页面的标题中进行标记，这往往是他们一直在做的事情（例如，如果他们在标记之前查看其他人说了什么）<p>人们怎么看？有必要改变吗？有潜在的帮助吗？可以放在选项后面的东西？(这样一来，传统的UI设计者可以保持不变，而优化者则可以根据需要进行调整）<p>我意识到，在一台完整的电脑上，人们可以使用一个油猴脚本/自定义插件来做这种事情，但在移动设备上，这并不是一个真正的选择。缩放以增加文本大小也不是办法，因为这样会失去边缘的内容（至少在移动的Chrome上）。",
  "description_zh-Hant": "黑客新聞用戶界面的簡單性是其魅力之一，但在手機上瀏覽黑客新聞時，當我只是想打開一個文章鏈接或進入評論時，經常會不小心點擊Flag或隱藏。然後就會有那種 \"我是不是按錯了？\"的感覺，接著就會拼命地去撤銷它（因為我不想不適當地標記東西！）<p>我想知道的是，是否真的有必要在主要的列表視圖中設置標記/隱藏鏈接，尤其是對大多數用戶來說，它們比其他鏈接（無論是文章還是評論）的使用頻率要低很多。如果它們被隱藏在列表中，那麼就可以避免這種風險，而真正要標記項目的人可以很容易地從評論頁面的標題中進行標記，這往往是他們一直在做的事情（例如，如果他們在標記之前查看其他人說了什麼）<p>人們怎麼看？有必要改變嗎？有潛在的幫助嗎？可以放在選項後面的東西？(這樣一來，傳統的UI設計者可以保持不變，而優化者則可以根據需要進行調整）<p>我意識到，在一臺完整的電腦上，人們可以使用一個油猴腳本/自定義插件來做這種事情，但在移動設備上，這並不是一個真正的選擇。縮放以增加文本大小也不是辦法，因為這樣會失去邊緣的內容（至少在移動的Chrome上）。"
}