{
  "@type": "NewsArticle",
  "identifier": "2022--03--20--en--askhn--HackerNews--NewsArticle--30742539",
  "url": "https://news.ycombinator.com/item?id=30742539",
  "headline": "Ask HN: Upvotes have seemingly new, limited effect or delay",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I realized today that my upvotes on comments have either delayed or no effect, while my upvotes on submissions seem immediate, but with the odd inability to unvote without a long delay or no effect. To test this, I did the following:<p>1. COMMENTS: \nUpvoted several recent comments of different users through different threads. Refreshed their user profile in separate tab (multiple times) and observed no increase/decrease in karma. Same results when going back and forth refreshing same tab. Removing cache nor using a separate browser (not logged in) had any effect.<p>2. \nSUBMISSIONS:\nUsing the same method as above, I upvoted several submissions in new (but older) status. Strangely, the submission would rise by one point, but after unvoting, would remain unaffected, but possibly retract with a significant delay.<p>I can certainly imagine a purpose or reason for delays, but I'd never noticed previously. My effect (or ineffect) on comments does seem new.<p>Is this behavior induced moderation voodoo, or standard?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "eth0up",
    "url": "https://news.ycombinator.com/user?id=eth0up"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30742539",
  "sameAs": "https://news.ycombinator.com/item?id=30742539",
  "dateCreated": "2022-03-20T13:49:57.405Z",
  "datePublished": "2022-03-20T13:43:52.000Z",
  "dateModified": "2022-03-20T13:49:57.405Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 上引号似乎有新的、有限的效果或延迟",
  "headline_zh-Hant": "Ask HN: 上引號似乎有新的、有限的效果或延遲",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我今天意识到，我对评论的加注要么延迟，要么没有效果，而我对投稿的加注似乎是立即的，但奇怪的是无法取消加注，没有长时间的延迟或没有效果。为了测试这一点，我做了以下工作：<p>1. 评论。\n在不同的线程中为不同用户最近的几条评论加注。在单独的标签中重新刷新他们的用户资料（多次），观察到业力没有增加/减少。当来回刷新同一标签时，结果也一样。删除缓存或使用单独的浏览器（未登录）有任何影响。\n投稿。\n使用与上述相同的方法，我在新的（但较旧的）状态下给几个提交的作品投了高票。奇怪的是，投稿会上升一个点，但在取消投票后，仍然不受影响，但可能会以明显的延迟收回。<p>我当然可以想象延迟的目的或原因，但我以前从未注意过。我对评论的影响（或不影响）似乎确实是新的。<p>这种行为是诱发修改的巫术，还是标准？",
  "description_zh-Hant": "我今天意識到，我對評論的加註要麼延遲，要麼沒有效果，而我對投稿的加註似乎是立即的，但奇怪的是無法取消加註，沒有長時間的延遲或沒有效果。為了測試這一點，我做了以下工作：<p>1. 評論。\n在不同的線程中為不同用戶最近的幾條評論加註。在單獨的標籤中重新刷新他們的用戶資料（多次），觀察到業力沒有增加/減少。當來回刷新同一標籤時，結果也一樣。刪除緩存或使用單獨的瀏覽器（未登錄）有任何影響。\n投稿。\n使用與上述相同的方法，我在新的（但較舊的）狀態下給幾個提交的作品投了高票。奇怪的是，投稿會上升一個點，但在取消投票後，仍然不受影響，但可能會以明顯的延遲收回。<p>我當然可以想象延遲的目的或原因，但我以前從未注意過。我對評論的影響（或不影響）似乎確實是新的。<p>這種行為是誘發修改的巫術，還是標準？"
}