{
  "@type": "NewsArticle",
  "identifier": "2022--03--04--en--askhn--HackerNews--NewsArticle--30549400",
  "url": "https://news.ycombinator.com/item?id=30549400",
  "headline": "Ask HN: Co-Founder Equity Split",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey all,<p>Quick question on equity split for a technical co-founder. I was approached by an ex-coworker whom I had great rapport with for joining his startup.<p>They currently have:<p><pre><code>    - An idea (It seems like a pretty solid idea. The idea originates from someone with direct working experience with the problem trying to be solved. So this gives me confidence. )\n\n    - No revenue\n\n    - No outside funding (I believe some things have been self-funded in the amount of maybe a few thousand dollars)\n\n    - No MVP\n</code></pre>\nThe founder is focused on the business/product/marketing side and his current co-founder (brother) is perhaps a mid level backend engineer.<p>I am a sr. mobile engineer with full-stack capabilities and I have full confidence I could realize their MVP. I'd be coming on to the team with the most technical experience and perhaps the most important skillset for implementing the MVP.<p>Their first offer was 5%-10% equity without the title of a co-founder. After expressing my hesitancy toward that they have moved to 15% equity and co-founder title. I mentioned that I would be most comfortable with a split closer to equal, but I would pull the trigger on 25%. I would not be taking a paycheck.<p>Is this strange? They mentioned that their council told them that &quot;cash is king&quot; - in which the founder's existing and planned financial contributions outweigh my equity grant. Though I mentioned that I wouldn't be opposed to helping with financial contributions early on as well.<p>These seem like red-flags, but I honestly don't know. A big draw for me towards joining is just having some fun and getting the experience, but I want to look out for myself in the non-zero chance that the company becomes a financial success.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "drooby",
    "url": "https://news.ycombinator.com/user?id=drooby"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30549400",
  "sameAs": "https://news.ycombinator.com/item?id=30549400",
  "dateCreated": "2022-03-04T02:07:18.744Z",
  "datePublished": "2022-03-04T01:21:54.000Z",
  "dateModified": "2022-03-04T02:07:18.744Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 7
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "Ask HN: 联合创始人股权分割",
  "headline_zh-Hant": "Ask HN: 聯合創始人股權分割",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>关于技术性联合创始人的股权分配的简短问题。一位与我关系很好的前同事找到我，希望我加入他的创业公司。<p>他们目前有：<p><pre><code> - 一个想法（看起来是一个相当可靠的想法。这个想法源自于对试图解决的问题有直接工作经验的人。所以这给了我信心。)\n\n    - No revenue\n\n    - No outside funding (I believe some things have been self-funded in the amount of maybe a few thousand dollars)\n\n    - No MVP\n</code></pre>\n创始人专注于业务/产品/营销方面，他目前的联合创始人（哥哥）可能是一个中等水平的后台工程师。<p>我是一个具有全栈能力的高级移动工程师，我完全有信心可以实现他们的MVP。我将以最丰富的技术经验加入团队，也许是实现MVP最重要的技能组合。<p>他们的第一次报价是5%-10%的股权，没有联合创始人的头衔。在我表达了我的犹豫之后，他们转而提出15%的股权和联合创始人的头衔。我提到，我最喜欢的是接近平等的分成比例，但我愿意在25%时扣动扳机。我不会拿工资的。<p>这很奇怪吗？他们提到，他们的理事会告诉他们，\"现金为王\"--在这种情况下，创始人现有的和计划的财务贡献超过了我的股权授予。虽然我提到我也不反对在早期提供资金捐助。<p>这些似乎是红色信号，但我真的不知道。对我来说，加入公司的一个很大的吸引力就是找点乐子和获得经验，但我想在公司取得财务成功的非零可能性中为自己着想。",
  "description_zh-Hant": "大家好，<p>關於技術性聯合創始人的股權分配的簡短問題。一位與我關係很好的前同事找到我，希望我加入他的創業公司。<p>他們目前有：<p><pre><code> - 一個想法（看起來是一個相當可靠的想法。這個想法源自於對試圖解決的問題有直接工作經驗的人。所以這給了我信心。)\n\n    - No revenue\n\n    - No outside funding (I believe some things have been self-funded in the amount of maybe a few thousand dollars)\n\n    - No MVP\n</code></pre>\n創始人專注於業務/產品/營銷方面，他目前的聯合創始人（哥哥）可能是一箇中等水平的後臺工程師。<p>我是一個具有全棧能力的高級移動工程師，我完全有信心可以實現他們的MVP。我將以最豐富的技術經驗加入團隊，也許是實現MVP最重要的技能組合。<p>他們的第一次報價是5%-10%的股權，沒有聯合創始人的頭銜。在我表達了我的猶豫之後，他們轉而提出15%的股權和聯合創始人的頭銜。我提到，我最喜歡的是接近平等的分成比例，但我願意在25%時扣動扳機。我不會拿工資的。<p>這很奇怪嗎？他們提到，他們的理事會告訴他們，\"現金為王\"--在這種情況下，創始人現有的和計劃的財務貢獻超過了我的股權授予。雖然我提到我也不反對在早期提供資金捐助。<p>這些似乎是紅色信號，但我真的不知道。對我來說，加入公司的一個很大的吸引力就是找點樂子和獲得經驗，但我想在公司取得財務成功的非零可能性中為自己著想。"
}