{
  "@type": "NewsArticle",
  "identifier": "2022--03--13--en--askhn--HackerNews--NewsArticle--30664984",
  "url": "https://news.ycombinator.com/item?id=30664984",
  "headline": "Ask HN: How to help an engineering team come to a consensus on best practices?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "As my engineering team grows, there are naturally differences in opinion as to how things should be done<p>- e.g. &quot;Should a single X.js file contain both the React component and its styles OR should we create both an X.js (which contains only React and no css) and a linked-to X.css files?&quot; \n- e.g. 2 &quot;Should we use dash-case for CSS class or camelCase or snake_case?&quot;<p>I've scheduled a meeting next week where the goal is to reach some consensus. Seeing as I will be moderating this meeting, I wonder how I should approach things? Should we agree on some basic goods up-front (e.g. codebase consistency, standard community practice) and then proceed to rate each competing practice along these dimensions? How do I deal with nebulous goods - one such good often claimed is that &quot;this approach is cleaner&quot;. But many of these times I don't see a difference in cleanliness or any value in that aspect of cleanliness. And if consensus cannot be agreed informally, would it make sense to put it to vote anonymously and chose the most popular practice?<p>One of the factors that makes this challenging is that many best practice candidates started as innovations by one individual, and human nature being what it is, that individual will fight tooth and nail that their innovation is chosen.<p>I am open for any ideas whatsoever here. I'm a long-time programmer but started managing programmers so don't have any good framework for dealing with issues",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "semicolonandson",
    "url": "https://news.ycombinator.com/user?id=semicolonandson"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30664984",
  "sameAs": "https://news.ycombinator.com/item?id=30664984",
  "dateCreated": "2022-03-13T19:49:52.205Z",
  "datePublished": "2022-03-13T19:44:13.000Z",
  "dateModified": "2022-03-13T19:49:52.205Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何帮助工程团队就最佳实践达成共识？",
  "headline_zh-Hant": "Ask HN: 如何幫助工程團隊就最佳實踐達成共識？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "随着我的工程团队的成长，对于事情应该如何做，自然会有不同的意见<p>- 例如，&quot;一个X.js文件应该同时包含React组件和它的样式，或者我们应该同时创建一个X.js（只包含React，没有css）和一个链接到X.css文件？\n- e.g. 2 &quot;我们应该使用破折号大写的CSS类，还是CamelCase或snake_case?&quot;<p>我已经安排了下周的会议，目标是达成一些共识。鉴于我将主持这次会议，我想知道我应该如何处理事情？我们是否应该先就一些基本的东西达成一致（例如代码库的一致性、标准的社区实践），然后再根据这些维度对每个竞争性实践进行评分？我应该如何处理那些模糊不清的东西--其中一个经常被声称的东西就是 \"这种方法更干净\"（&quot;this approach is cleaner&quot;）。但很多时候，我并没有看到清洁度的区别，也没有看到清洁度这方面的任何价值。如果不能非正式地达成共识，那么匿名投票并选择最受欢迎的做法是否有意义呢？<p>使这一工作具有挑战性的因素之一是，许多最佳做法的候选者是由一个人的创新开始的，而人性就是这样，这个人将以牙还牙地争取使他们的创新被选中。我是一个长期的程序员，但开始管理程序员，所以没有任何处理问题的好框架。",
  "description_zh-Hant": "隨著我的工程團隊的成長，對於事情應該如何做，自然會有不同的意見<p>- 例如，&quot;一個X.js文件應該同時包含React組件和它的樣式，或者我們應該同時創建一個X.js（只包含React，沒有css）和一個鏈接到X.css文件？\n- e.g. 2 &quot;我們應該使用破折號大寫的CSS類，還是CamelCase或snake_case?&quot;<p>我已經安排了下週的會議，目標是達成一些共識。鑑於我將主持這次會議，我想知道我應該如何處理事情？我們是否應該先就一些基本的東西達成一致（例如代碼庫的一致性、標準的社區實踐），然後再根據這些維度對每個競爭性實踐進行評分？我應該如何處理那些模糊不清的東西--其中一個經常被聲稱的東西就是 \"這種方法更乾淨\"（&quot;this approach is cleaner&quot;）。但很多時候，我並沒有看到清潔度的區別，也沒有看到清潔度這方面的任何價值。如果不能非正式地達成共識，那麼匿名投票並選擇最受歡迎的做法是否有意義呢？<p>使這一工作具有挑戰性的因素之一是，許多最佳做法的候選者是由一個人的創新開始的，而人性就是這樣，這個人將以牙還牙地爭取使他們的創新被選中。我是一個長期的程序員，但開始管理程序員，所以沒有任何處理問題的好框架。"
}