{
  "@type": "NewsArticle",
  "identifier": "2022--03--12--en--askhn--HackerNews--NewsArticle--30654719",
  "url": "https://news.ycombinator.com/item?id=30654719",
  "headline": "Ask HN: Writing Software – Is it boring or am I bored?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey,<p>Some prose first, questions at the end.<p>After over two years I quit my student job. Besides the weekly meeting I was pretty much 100 percent of the time writing a frontend in flutter. In the beginning it was quite fun - lot's of new stuff to learn and quick progress. But it recently evolved into this boring feature implementation treadmill where things got ever more complex, brittle, and having this falls-apart-when-you-look-at-it-wrong attitude. I got bored from it.<p>It really reduced my interest in all the other computing stuff I’ve been playing around with. So since four or five months I haven’t cared much and did just the bare baseline amount of work - But it helped a lot! Started learning how people use tmux as a window manager, what makes vim addictive to learn, why some people can’t stop talking about clojure (reading about clojure and its ecosystem, I love it), what gnu is and software ideologies/licenses there are, people printing their own parametrized split ortho colemak keyboard. Fine stuff! Not advanced, but I'm eager understand all the parts.<p>I'm doing my masters degree in aerospace engineering, but I'm thinking more and more of putting that on pause and working in Software for some time. Having no formal software education, I want to learn new stuff. Is there enough demand for engineers that companies are willing to pay for one learning “it” on the go? If yes, what field is it? Trying to avoid cruft and mundane tasks: What kind of companies to look for and which ones to avoid? And on a more philosophical note: Can a hobby be a job without losing the fun part?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pirminj",
    "url": "https://news.ycombinator.com/user?id=pirminj"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30654719",
  "sameAs": "https://news.ycombinator.com/item?id=30654719",
  "dateCreated": "2022-03-12T20:49:54.646Z",
  "datePublished": "2022-03-12T20:43:56.000Z",
  "dateModified": "2022-03-12T20:49:54.646Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 写作软件--是无聊还是我无聊？",
  "headline_zh-Hant": "Ask HN: 寫作軟件--是無聊還是我無聊？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，<p>先写些散文，问题在最后。<p>两年多后，我辞去了学生工作。除了每周的会议，我几乎百分之百的时间都在用flutter写前端。刚开始的时候还挺有意思的--有很多新东西要学，而且进展很快。但最近，它演变成了一个无聊的功能实现的跑步机，事情变得越来越复杂，越来越脆，而且当你看到它的错误时，它的态度也越来越差。我对此感到厌烦。<p>这真的降低了我对所有其他我一直在玩的计算东西的兴趣。因此，从四五个月开始，我就不怎么关心了，只做了一些最基本的工作 - 但这对我帮助很大！我开始学习人们如何使用tmux。开始学习人们如何使用tmux作为窗口管理器，是什么让vim学习上瘾，为什么有些人不能停止谈论clojure（阅读关于clojure和它的生态系统，我喜欢它），什么是gnu和软件意识形态/许可证，人们打印他们自己的参数化分裂ortho colemak键盘。很好的东西! <p>我正在攻读航空航天工程的硕士学位，但我越来越想把它暂停下来，在软件领域工作一段时间。我没有受过正规的软件教育，我想学习新的东西。是否有足够的工程师需求，以至于公司愿意为一个在旅途中学习 \"它 \"的人付费？如果是，那是什么领域？试图避免繁琐和平凡的工作。应该寻找什么样的公司，哪些公司应该避免？还有一个更哲学的问题：爱好可以成为工作而不失去乐趣吗？",
  "description_zh-Hant": "嘿，<p>先寫些散文，問題在最後。<p>兩年多後，我辭去了學生工作。除了每週的會議，我幾乎百分之百的時間都在用flutter寫前端。剛開始的時候還挺有意思的--有很多新東西要學，而且進展很快。但最近，它演變成了一個無聊的功能實現的跑步機，事情變得越來越複雜，越來越脆，而且當你看到它的錯誤時，它的態度也越來越差。我對此感到厭煩。<p>這真的降低了我對所有其他我一直在玩的計算東西的興趣。因此，從四五個月開始，我就不怎麼關心了，只做了一些最基本的工作 - 但這對我幫助很大！我開始學習人們如何使用tmux。開始學習人們如何使用tmux作為窗口管理器，是什麼讓vim學習上癮，為什麼有些人不能停止談論clojure（閱讀關於clojure和它的生態系統，我喜歡它），什麼是gnu和軟件意識形態/許可證，人們打印他們自己的參數化分裂ortho colemak鍵盤。很好的東西! <p>我正在攻讀航空航天工程的碩士學位，但我越來越想把它暫停下來，在軟件領域工作一段時間。我沒有受過正規的軟件教育，我想學習新的東西。是否有足夠的工程師需求，以至於公司願意為一個在旅途中學習 \"它 \"的人付費？如果是，那是什麼領域？試圖避免繁瑣和平凡的工作。應該尋找什麼樣的公司，哪些公司應該避免？還有一個更哲學的問題：愛好可以成為工作而不失去樂趣嗎？"
}