{
  "@type": "NewsArticle",
  "identifier": "2022--04--08--en--askhn--HackerNews--NewsArticle--30952648",
  "url": "https://news.ycombinator.com/item?id=30952648",
  "headline": "Ask HN: What can I do about my messy/neurodivergent brain?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have to be honest that this is a repost[0], but I really would like more perspectives on this.<p>My mind is a mess and I'm wondering if HN has any tips, experiences, advice, etc. to share.<p>My mental health has improved significantly over the past 10 years, but as the depression lifted and as I gained more mental clarity, I'm finding myself still struggling with some persistent patterns of thought and behaviour (potentially neurodivergent ones) that are hindering my ability to progress further in life.<p>I'll give some examples, though it's quite complicated to describe as a lot of these patterns are very paradoxical.<p>- I'm reliant on routines and predictability to feel calm and settled, while at the same time desire personal freedom and autonomy, in that I really dislike following someone else's structure/rules and don't like being controlled, micromanaged, watched.<p>- I have a strong aversion to discipline, and can never get any productivity/organizational methods to work. The act of trying gives me anxiety, makes me feel very detached from myself, and zaps all creativity/authenticity/enthusiasm out of me.<p>- I work very slowly, both at home and at work. It takes me longer to do the same tasks compared to others at work, and at home I can only accomplish just a few mundane things that take up most of my day. I think it's because I'm paying a lot of attention and being careful with everything I'm doing, and/or I'm thinking about stuff. No matter how hard I try I can't do them any faster (plus rushing = stress and still just as slow).<p>- I think what bothers me most is how all these things lead to my inability to get enough quality self-care. I struggle immensely with 1) finding enough time to do things I enjoy, and 2) when I get some free time I get anxious about having to use this time wisely and productively and end up not doing anything. I just want to sit down and read my books and write my essays but I can't :'(<p>I'm sure there's more but these are the prominant ones that really get to me.<p>Anyway, I've watched this youtube video on ADHD [1] and can definitely identify with several of the descriptions, though I don't believe mine is that &quot;severe&quot;? (I've talked to doctors and they just dismiss me as usual.) Generally, I am much happier than I used to be and things are really not that bad, but I think many of these low-lying symptoms are starting to take a toll. I really don't want to take any kind of medication for fear of side-effects and because I, again, don't think my case is that bad to require medication. I would much rather try more holistic approaches etc. That said, all suggestions and advice etc are welcome! And feel free to ask me anything and I'll try my best to answer during the little bit of time that I have.<p>If you want more context: I've matured a lot mentally and am more self-aware than most people around me (though I have to admit my social skills are still well below average). I've gotten to know my own thought patterns and personality tendencies inside and out, and have developed them as well (eg I can often catch my own blindspots, at least in retrospect). I've grown significantly in many directions, both personally and in my relationships. I've dealt with at least some of my past traumas and am no longer tormented by them.<p>[0]: https://news.ycombinator.com/item?id=30951494\n[1]: https://www.youtube.com/watch?v=ouZrZa5pLXk",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30952648",
  "sameAs": "https://news.ycombinator.com/item?id=30952648",
  "dateCreated": "2022-04-08T02:25:20.142Z",
  "datePublished": "2022-04-08T02:22:05.000Z",
  "dateModified": "2022-04-08T02:25:20.142Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我可以对我混乱/神经质的大脑做些什么？",
  "headline_zh-Hant": "Ask HN: 我可以對我混亂/神經質的大腦做些什麼？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我必须诚实地说，这是一个转帖[0]，但我真的希望在这方面有更多的观点。<p>我的思想一团糟，我想知道HN是否有任何提示、经验、建议等可以分享。<p>在过去的10年里，我的心理健康有了很大的改善，但随着抑郁症的解除，随着我获得了更多的心理清晰度，我发现自己仍然在与一些持续的思想和行为模式（可能是神经分裂的模式）作斗争，这阻碍了我在生活中进一步进步。 <p>我举几个例子，尽管描述起来相当复杂，因为很多模式都是非常矛盾的。<p>- 我依赖常规和可预测性来感受平静和安定，同时又渴望个人自由和自主，因为我真的不喜欢遵循别人的结构/规则，不喜欢被控制、微观管理和监视。尝试的行为让我感到焦虑，让我觉得与自己非常疏远，并将所有的创造力/真实性/热情从我身上抹去。<p>- 我工作得非常慢，无论是在家里还是在工作中。与工作中的其他人相比，我做同样的任务需要更长的时间，在家里我只能完成一些平凡的事情，而这些事情占据了我一天的大部分时间。我想这是因为我对所做的一切都非常注意和小心，和/或我在想东西。无论我如何努力，我都无法加快做这些事情（加上匆忙=压力，还是一样慢）。<p>- 我认为最困扰我的是所有这些事情如何导致我无法获得足够的高质量自我护理。我在以下方面做了巨大的努力：1）找到足够的时间来做我喜欢的事情；2）当我得到一些空闲时间时，我为必须明智和有效地利用这些时间而感到焦虑，最终什么也没做。我只想坐下来读我的书，写我的文章，但我做不到：'(<p>我相信还有更多，但这些是真正影响我的主要问题。<p>不管怎样，我看了这个关于多动症的YouTube视频[1]，肯定能认同其中的一些描述，尽管我不相信我的情况有那么严重？(一般来说，我比以前快乐得多，事情也确实没有那么糟糕，但我认为许多低级别的症状已经开始造成损失了。我真的不想服用任何种类的药物，因为我担心会有副作用，而且我也不认为我的情况有多严重，需要药物治疗。我更愿意尝试更全面的方法等。也就是说，我们欢迎所有的建议和意见等。如果你想了解更多的情况，请随时问我，我会在我有的时间内尽力回答。我在精神上已经成熟了很多，而且比我周围的大多数人更有自我意识（虽然我不得不承认我的社交能力仍然远远低于平均水平）。我已经对自己的思维模式和个性倾向了如指掌，并且也得到了发展（例如，我经常能抓住自己的盲点，至少在回想起来）。我在很多方面都有很大的成长，无论是个人还是人际关系方面。我至少已经处理了我过去的一些创伤，不再被它们折磨。<p>[0]: https://news.ycombinator.com/item?id=30951494\n[1]: https://www.youtube.com/watch?v=ouZrZa5pLXk",
  "description_zh-Hant": "我必須誠實地說，這是一個轉帖[0]，但我真的希望在這方面有更多的觀點。<p>我的思想一團糟，我想知道HN是否有任何提示、經驗、建議等可以分享。<p>在過去的10年裡，我的心理健康有了很大的改善，但隨著抑鬱症的解除，隨著我獲得了更多的心理清晰度，我發現自己仍然在與一些持續的思想和行為模式（可能是神經分裂的模式）作鬥爭，這阻礙了我在生活中進一步進步。 <p>我舉幾個例子，儘管描述起來相當複雜，因為很多模式都是非常矛盾的。<p>- 我依賴常規和可預測性來感受平靜和安定，同時又渴望個人自由和自主，因為我真的不喜歡遵循別人的結構/規則，不喜歡被控制、微觀管理和監視。嘗試的行為讓我感到焦慮，讓我覺得與自己非常疏遠，並將所有的創造力/真實性/熱情從我身上抹去。<p>- 我工作得非常慢，無論是在家裡還是在工作中。與工作中的其他人相比，我做同樣的任務需要更長的時間，在家裡我只能完成一些平凡的事情，而這些事情佔據了我一天的大部分時間。我想這是因為我對所做的一切都非常注意和小心，和/或我在想東西。無論我如何努力，我都無法加快做這些事情（加上匆忙=壓力，還是一樣慢）。<p>- 我認為最困擾我的是所有這些事情如何導致我無法獲得足夠的高質量自我護理。我在以下方面做了巨大的努力：1）找到足夠的時間來做我喜歡的事情；2）當我得到一些空閒時間時，我為必須明智和有效地利用這些時間而感到焦慮，最終什麼也沒做。我只想坐下來讀我的書，寫我的文章，但我做不到：'(<p>我相信還有更多，但這些是真正影響我的主要問題。<p>不管怎樣，我看了這個關於多動症的YouTube視頻[1]，肯定能認同其中的一些描述，儘管我不相信我的情況有那麼嚴重？(一般來說，我比以前快樂得多，事情也確實沒有那麼糟糕，但我認為許多低級別的症狀已經開始造成損失了。我真的不想服用任何種類的藥物，因為我擔心會有副作用，而且我也不認為我的情況有多嚴重，需要藥物治療。我更願意嘗試更全面的方法等。也就是說，我們歡迎所有的建議和意見等。如果你想了解更多的情況，請隨時問我，我會在我有的時間內盡力回答。我在精神上已經成熟了很多，而且比我周圍的大多數人更有自我意識（雖然我不得不承認我的社交能力仍然遠遠低於平均水平）。我已經對自己的思維模式和個性傾向瞭如指掌，並且也得到了發展（例如，我經常能抓住自己的盲點，至少在回想起來）。我在很多方面都有很大的成長，無論是個人還是人際關係方面。我至少已經處理了我過去的一些創傷，不再被它們折磨。<p>[0]: https://news.ycombinator.com/item?id=30951494\n[1]: https://www.youtube.com/watch?v=ouZrZa5pLXk"
}