{
  "@type": "NewsArticle",
  "identifier": "2022--04--11--en--askhn--HackerNews--NewsArticle--30991768",
  "url": "https://news.ycombinator.com/item?id=30991768",
  "headline": "Ask HN: Do you find “writer” somewhat pejorative? or is it just me?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I don't remember where I picked up this association, but I think, at least in some circles, &quot;writer&quot; seems to imply someone who writes articles for online magazines or any kind of publication in a sort of &quot;lowest common denominator&quot; way (similar to the connotations that come with &quot;blogger&quot; sometimes).<p>Anyone know or heard of this usage? Or am I just making it up?<p>Maybe for this reason/bias, I've never felt comfortable calling myself a writer, for fear of being mixed in with this association, like someone who just &quot;writes anything&quot;. I take pride in writing essays and feel aversive about writing articles meant as &quot;content&quot; for general/mass consumption (damnit I sound like a douchebag).<p>I know many people who proudly call themselves writers, so I know it's not a universal thing. And I know PG calls himself a writer/programmer (don't remember the exact source, but probably a tweet), which never made sense to me because he strictly writes essays, so I would've thought &quot;essayist&quot; would fit him better.<p>I know I shouldn't care about labels or whatever, but I find it hard to shake. I don't know, maybe I'm just thinking too much (sorry this got a lot more personal than I had originally intended). What do you folks think??",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30991768",
  "sameAs": "https://news.ycombinator.com/item?id=30991768",
  "dateCreated": "2022-04-11T17:16:28.469Z",
  "datePublished": "2022-04-11T17:05:49.000Z",
  "dateModified": "2022-04-11T17:16:28.469Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 你觉得 \"作家 \"有些贬义吗？ 还是只有我觉得？",
  "headline_zh-Hant": "Ask HN: 你覺得 \"作家 \"有些貶義嗎？ 還是隻有我覺得？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我不记得我从哪里得到这个联想，但我认为，至少在某些圈子里，&quot;作家&quot;似乎意味着为在线杂志或任何类型的出版物写文章的人，以一种&quot;最低标准&quot;的方式（有时类似于&quot;博主&quot;的内涵）。<p>有人知道或听说这种用法吗？<p>也许是出于这个原因/偏见，我一直不愿意称自己为作家，因为我害怕被混入这种联想，就像一个人只是&quot;写任何东西&quot;。我以写文章为荣，而对写文章作为一般/大众消费的&quot;内容&quot;感到厌恶（该死的，我听起来像个恶棍）。<p>我知道很多人都自豪地称自己为作家，所以我知道这不是一个普遍现象。我知道PG称自己为作家/程序员（不记得确切的来源，但可能是一条推特），这对我来说从来没有意义，因为他严格地写文章，所以我认为&quot;散文家&quot;会更适合他。<p>我知道我不应该关心标签或什么，但我觉得很难摆脱。我不知道，也许我只是想得太多了（对不起，这比我原来想的要私人得多）。你们这些人怎么看？",
  "description_zh-Hant": "我不記得我從哪裡得到這個聯想，但我認為，至少在某些圈子裡，&quot;作家&quot;似乎意味著為在線雜誌或任何類型的出版物寫文章的人，以一種&quot;最低標準&quot;的方式（有時類似於&quot;博主&quot;的內涵）。<p>有人知道或聽說這種用法嗎？<p>也許是出於這個原因/偏見，我一直不願意稱自己為作家，因為我害怕被混入這種聯想，就像一個人只是&quot;寫任何東西&quot;。我以寫文章為榮，而對寫文章作為一般/大眾消費的&quot;內容&quot;感到厭惡（該死的，我聽起來像個惡棍）。<p>我知道很多人都自豪地稱自己為作家，所以我知道這不是一個普遍現象。我知道PG稱自己為作家/程序員（不記得確切的來源，但可能是一條推特），這對我來說從來沒有意義，因為他嚴格地寫文章，所以我認為&quot;散文家&quot;會更適合他。<p>我知道我不應該關心標籤或什麼，但我覺得很難擺脫。我不知道，也許我只是想得太多了（對不起，這比我原來想的要私人得多）。你們這些人怎麼看？"
}