{
  "@type": "NewsArticle",
  "identifier": "2022--03--21--en--askhn--HackerNews--NewsArticle--30754999",
  "url": "https://news.ycombinator.com/item?id=30754999",
  "headline": "Ask HN: Robustly displaying information in a video (~4kb/s)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've got a tentative side-project with a goal to allow individuals to guard against deep fakes of themselves (think the recent attempts against Volodymyr Zylenskiyy). The idea is to have their speech recorded, encoded with something like codec-2 in real-time and then displayed in the video feed, with periodic signing of the last second or whatever, with that signature forming part of the data feed. Anyone attempting to do a deep fake would not be able to implement the signed audio information so the fake would be apparent. The device would take the form of a box with a display that is placed or worn in the field of view of the camera.<p>I think the system could be implemented with less than 4kb/s, which seems eminently achievable - something like 10 frame changes per second with 400 bits/frame. Even with a bit of forward error correction, you don't need many pixels to convey that information.<p>It all seems very plausible, but I'm not sure of the best way to implement the video encoding display. The issue is that a naive data display sequence is not necessarily conducive to efficient compression. For example, a series of QR codes would be inefficient from the perspective of a DCT based compression algorithm, and there would be no scope at all for motion compensation. The question then is whether any research has been done looking at algorithms suitable for this application. Something like a dynamic QR code. There are also subtleties in robustly handling distortions in the video.<p>I'd ideally not have to roll my own, though I have considered something using a basis that better maps onto a perceptual-based compression algorithm, such as a DT-CWT.<p>It might be that I'm overthinking this and just having a 25x25 grid of LEDs displaying a rapidly changing QR code would work just wonderfully.<p>As an aside, this is an area where the search engines fail me. I just don't know the terms, and the dominant return links are to ways of creating a QR code linking to a video or encoding algorithms for video.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "hgomersall",
    "url": "https://news.ycombinator.com/user?id=hgomersall"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30754999",
  "sameAs": "https://news.ycombinator.com/item?id=30754999",
  "dateCreated": "2022-03-21T15:33:42.435Z",
  "datePublished": "2022-03-21T15:12:02.000Z",
  "dateModified": "2022-03-21T15:33:42.435Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 稳健地显示视频中的信息（~4kb/s）。",
  "headline_zh-Hant": "Ask HN: 穩健地顯示視頻中的信息（~4kb/s）。",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我有一个暂定的副业，目标是让个人能够防范对自己的深度伪造（想想最近对Volodymyr Zylenskiyy的企图）。这个想法是将他们的讲话记录下来，用类似编解码器-2的东西进行实时编码，然后显示在视频资料中，并定期签署最后一秒或其他内容，该签名构成数据资料的一部分。任何试图进行深度伪造的人都无法实现签名的音频信息，因此伪造是明显的。该设备将采取一个带有显示屏的盒子的形式，放置或佩戴在摄像机的视野中。<p>我认为该系统可以以低于4kb/s的速度实现，这似乎是可以实现的--大约每秒10帧变化，每帧400比特。即使有一点前向纠错，你也不需要很多像素来传达这些信息。<p>这一切似乎都很有道理，但我不确定实现视频编码显示的最佳方式。问题是，一个天真的数据显示序列不一定有利于高效压缩。例如，从基于DCT的压缩算法的角度来看，一系列的QR码将是低效的，而且根本没有运动补偿的范围。那么问题来了，是否有人研究过适合这种应用的算法。类似于动态二维码的东西。<p>最好不要让我自己来做，虽然我考虑过使用一个更好地映射到基于感知的压缩算法的基础，如DT-CWT。<p>这可能是我想多了，只要有一个25x25的LED网格显示一个快速变化的QR码，就可以很好地工作。我只是不知道这些术语，主要的返回链接是创建一个链接到视频或视频编码算法的QR码的方法。",
  "description_zh-Hant": "我有一個暫定的副業，目標是讓個人能夠防範對自己的深度偽造（想想最近對Volodymyr Zylenskiyy的企圖）。這個想法是將他們的講話記錄下來，用類似編解碼器-2的東西進行實時編碼，然後顯示在視頻資料中，並定期簽署最後一秒或其他內容，該簽名構成數據資料的一部分。任何試圖進行深度偽造的人都無法實現簽名的音頻信息，因此偽造是明顯的。該設備將採取一個帶有顯示屏的盒子的形式，放置或佩戴在攝像機的視野中。<p>我認為該系統可以以低於4kb/s的速度實現，這似乎是可以實現的--大約每秒10幀變化，每幀400比特。即使有一點前向糾錯，你也不需要很多像素來傳達這些信息。<p>這一切似乎都很有道理，但我不確定實現視頻編碼顯示的最佳方式。問題是，一個天真的數據顯示序列不一定有利於高效壓縮。例如，從基於DCT的壓縮算法的角度來看，一系列的QR碼將是低效的，而且根本沒有運動補償的範圍。那麼問題來了，是否有人研究過適合這種應用的算法。類似於動態二維碼的東西。<p>最好不要讓我自己來做，雖然我考慮過使用一個更好地映射到基於感知的壓縮算法的基礎，如DT-CWT。<p>這可能是我想多了，只要有一個25x25的LED網格顯示一個快速變化的QR碼，就可以很好地工作。我只是不知道這些術語，主要的返回鏈接是創建一個鏈接到視頻或視頻編碼算法的QR碼的方法。"
}