{
  "@type": "NewsArticle",
  "identifier": "2022--03--29--en--askhn--HackerNews--NewsArticle--30837836",
  "url": "https://news.ycombinator.com/item?id=30837836",
  "headline": "Ask HN: Is Apple low-balling me or am I an impostor greedy bastard?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "TL;DR — Apple offered me USD $228k average annual total compensation (base + RSU + bonus), which is below the 25th percentile of ICT4-Senior according to Levels FYI (https://www.levels.fyi/company/Apple/salaries/Software-Engineer/ICT4/Canada/). Are they low-balling me or am I being too greedy?<p>---<p>I am a Software Developer with over twelve (12) years of verifiable work experience as an individual contributor in Canada, US, and LATAM. University drop-out. I started in Web Development (full-stack), then Web Security (back-end and tooling) and, finally, Systems Programming in industries like InfoSec, Web Hosting, Gaming, Marketing, and Internet Services. I worked for two (2) Fortune Global 500 companies and have a passion for distributed systems.<p>---<p>Hello, HN.<p>I wonder if you can help me riddle this one out.<p>I have been doing interviews at dozens of medium and large companies for the last couple of years, mostly because 1) I want to keep my impostor syndrome at bay, 2) I want to practice my English as much as possible, 3) a manager taught me the best time to interview is when you don’t need a job, and 4) LeetCode and take-home exercises are equally fun to me.<p>Long story short, one of those interviews was at Apple (Canada). It was less technical than I expected, but still challenging, especially the one about Data Privacy and Security, which was the most entertaining interview I have had in years.<p>Unfortunately, the offer is several thousand dollars below what I expected (↓2x).<p>I feel like being a university drop-out and/or keeping a Senior Software Developer role for so long without jumping into management may have contributed to the low offer.<p>I am not white, and I don’t think race or gender had anything to do with it. However, the last time I tried to negotiate the salary, they invited me to a video call and I was the only one with the camera on, which I thought was a bit disrespectful and disingenuous.<p>Now, you may ask <i>—Why didn’t you ask the (internal) recruiter?—</i>.<p>Well, I did.<p>They said that the range for base salaries is limited by the 75th percentile they pay in the city my team is located, which is determined by market rates. Then, paraphrasing, <i>—If we pay you the amount you expect, you’ll have a much higher salary than any of your team mates, and it will make it much more difficult to give you a raise in subsequent years.—</i>.<p>The answer didn’t make sense to me at all, but I did not have a good come back in English at the moment.<p>Today, I think, why is it my fault that my team members are also underpaid? Is not that a sign that the company needs to re-evaluate their salaries too? And lastly, why would I worry about future raises if you can’t even pay what I expect today?<p>What do you think HN community?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway971608",
    "url": "https://news.ycombinator.com/user?id=throwaway971608"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30837836",
  "sameAs": "https://news.ycombinator.com/item?id=30837836",
  "dateCreated": "2022-03-29T02:23:50.564Z",
  "datePublished": "2022-03-29T01:52:28.000Z",
  "dateModified": "2022-03-29T02:23:50.564Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "Ask HN: 苹果公司是在低价收买我，还是我是个冒牌的贪婪的混蛋？",
  "headline_zh-Hant": "Ask HN: 蘋果公司是在低價收買我，還是我是個冒牌的貪婪的混蛋？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "TL;DR - 苹果公司为我提供了22.8万美元的平均年度总薪酬（基本工资+RSU+奖金），根据Levels FYI（https://www.levels.fyi/company/Apple/salaries/Software-Engineer/ICT4/Canada/），这低于ICT4-Senior的第25百分位。他们是在压低我还是我太贪婪了？<p>------<p>我是一名软件开发人员，在加拿大、美国和拉丁美洲有超过十二（12）年的可证实的个人贡献工作经验。大学辍学。我从网络开发（全栈）开始，然后是网络安全（后端和工具），最后是系统编程，行业包括信息安全、网络托管、游戏、营销和互联网服务。我曾在两（2）家财富全球500强公司工作过，对分布式系统充满热情。<p>------<p>你好，HN.<p>我想知道你是否能帮我解决这个问题。 <p>在过去的几年里，我一直在几十家大中型公司做面试，主要是因为：1）我想保持我的冒名顶替综合症，2）我想尽可能地练习我的英语，3）一位经理告诉我，面试的最佳时机是你不需要工作的时候，4）LeetCode和带回家的练习对我来说同样有趣。<p>长话短说，其中一个面试是在苹果（加拿大）。它的技术含量没有我想象的那么高，但仍然具有挑战性，尤其是关于数据隐私和安全的面试，这是我多年来最有趣的一次面试。<p>不幸的是，报价比我预期的要低几千美元（↓2倍）。<p>我觉得作为一个大学辍学生和/或保持一个高级软件开发人员的角色这么久而没有跳槽到管理层可能是导致低报价的原因。<p>我不是白人，我不认为种族或性别与此有任何关系。<p>现在，你可能会问<i>-你为什么不问（内部）招聘人员？</i>。<p>好吧，我问了。<p>他们说，基本工资的范围受限于他们在我的团队所在城市支付的第75个百分点，这是由市场价格决定的。然后，套用一句话：<i>-如果我们付给你期望的金额，你的工资会比你的任何一个队友都高得多，这将使你在随后的几年里更难加薪。</i>.<p>这个答案对我来说完全没有意义，但我此刻没有一个好的英语回来。<p>今天，我想，为什么我的团队成员也被低薪，这是我的错？这难道不是公司也需要重新评估他们的工资吗？最后，如果你甚至不能支付我今天的期望，我为什么要担心未来的加薪呢？<p>你认为HN社区怎么样？",
  "description_zh-Hant": "TL;DR - 蘋果公司為我提供了22.8萬美元的平均年度總薪酬（基本工資+RSU+獎金），根據Levels FYI（https://www.levels.fyi/company/Apple/salaries/Software-Engineer/ICT4/Canada/），這低於ICT4-Senior的第25百分位。他們是在壓低我還是我太貪婪了？<p>------<p>我是一名軟件開發人員，在加拿大、美國和拉丁美洲有超過十二（12）年的可證實的個人貢獻工作經驗。大學輟學。我從網絡開發（全棧）開始，然後是網絡安全（後端和工具），最後是系統編程，行業包括信息安全、網絡託管、遊戲、營銷和互聯網服務。我曾在兩（2）家財富全球500強公司工作過，對分佈式系統充滿熱情。<p>------<p>你好，HN.<p>我想知道你是否能幫我解決這個問題。 <p>在過去的幾年裡，我一直在幾十家大中型公司做面試，主要是因為：1）我想保持我的冒名頂替綜合症，2）我想盡可能地練習我的英語，3）一位經理告訴我，面試的最佳時機是你不需要工作的時候，4）LeetCode和帶回家的練習對我來說同樣有趣。<p>長話短說，其中一個面試是在蘋果（加拿大）。它的技術含量沒有我想象的那麼高，但仍然具有挑戰性，尤其是關於數據隱私和安全的面試，這是我多年來最有趣的一次面試。<p>不幸的是，報價比我預期的要低幾千美元（↓2倍）。<p>我覺得作為一個大學輟學生和/或保持一個高級軟件開發人員的角色這麼久而沒有跳槽到管理層可能是導致低報價的原因。<p>我不是白人，我不認為種族或性別與此有任何關係。<p>現在，你可能會問<i>-你為什麼不問（內部）招聘人員？</i>。<p>好吧，我問了。<p>他們說，基本工資的範圍受限於他們在我的團隊所在城市支付的第75個百分點，這是由市場價格決定的。然後，套用一句話：<i>-如果我們付給你期望的金額，你的工資會比你的任何一個隊友都高得多，這將使你在隨後的幾年裡更難加薪。</i>.<p>這個答案對我來說完全沒有意義，但我此刻沒有一個好的英語回來。<p>今天，我想，為什麼我的團隊成員也被低薪，這是我的錯？這難道不是公司也需要重新評估他們的工資嗎？最後，如果你甚至不能支付我今天的期望，我為什麼要擔心未來的加薪呢？<p>你認為HN社區怎麼樣？"
}