{
  "@type": "NewsArticle",
  "identifier": "2022--03--10--en--askhn--HackerNews--NewsArticle--30628375",
  "url": "https://news.ycombinator.com/item?id=30628375",
  "headline": "Ask HN: What Happened to Pinboard?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I know there have been threads like this in the past about sporadic difficulties, but from my own experience and complaints here and on twitter, I'm wondering if pinboard.in's paid archiving service is broken, and if there is any chance of a fix; and if not, what people have moved on to as an alternative.<p>For the last 4 months, my paid archiving account has almost completely stopped archiving bookmarks. I tried setting up another account as a trial, and that had the same problem. Worse, my wife made an account last summer, and the full text search of her bookmarks has never worked at all (it throws up an error message).<p>I've sent several emails to Maciej over the last few months without any replies (apart from one email cancelling the extra account I'd set up, so I know my emails are received).<p>This is a really frustrating experience! I've been really happy with Pinboard for many years, and paid up front for several years of archiving. There is also now a wonderful MacOS/iOS client (&quot;Pins for Pinboard&quot;).<p>I feel bad posting a thread here, but it seems to be impossible to contact support, and I hope that there are still other Pinboard users (and perhaps even Maciej) here who might have more of an idea what's going on (e.g. whether this is affecting all accounts).<p>I would really love to be able to carry on using Pinboard, but I have no idea whether to expect it to ever start working again.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tsg",
    "url": "https://news.ycombinator.com/user?id=tsg"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30628375",
  "sameAs": "https://news.ycombinator.com/item?id=30628375",
  "dateCreated": "2022-03-10T17:13:42.232Z",
  "datePublished": "2022-03-10T15:59:25.000Z",
  "dateModified": "2022-03-10T17:13:42.232Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 25
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 11
    }
  ],
  "headline_zh-Hans": "Ask HN: Pinboard发生了什么？",
  "headline_zh-Hant": "Ask HN: Pinboard發生了什麼？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我知道过去也有这样的主题，说的是零星的困难，但根据我自己的经验以及在这里和twitter上的抱怨，我想知道pinboard.in的付费存档服务是否有问题，以及是否有机会修复；如果没有，人们已经转而使用什么作为替代。<p>过去4个月，我的付费存档账户几乎完全停止存档书签。我试着设置另一个账户作为试用，也有同样的问题。更糟糕的是，我的妻子去年夏天开了一个账户，而她的书签的全文搜索根本没有工作（它抛出了一个错误信息）。<p>在过去的几个月里，我给Maciej发了几封电子邮件，但没有任何回复（除了一封取消我设置的额外账户的电子邮件，所以我知道我的电子邮件被收到）。多年来，我对Pinboard非常满意，并为数年的归档工作预付了费用。现在还有一个很棒的MacOS/iOS客户端（&quot;Pins for Pinboard&quot;）。<p>我觉得在这里发帖很不好，但似乎无法联系到技术支持，我希望这里还有其他Pinboard用户（甚至可能是Maciej），他们可能更清楚发生了什么（例如，这是否影响了所有账户）。",
  "description_zh-Hant": "我知道過去也有這樣的主題，說的是零星的困難，但根據我自己的經驗以及在這裡和twitter上的抱怨，我想知道pinboard.in的付費存檔服務是否有問題，以及是否有機會修復；如果沒有，人們已經轉而使用什麼作為替代。<p>過去4個月，我的付費存檔賬戶幾乎完全停止存檔書籤。我試著設置另一個賬戶作為試用，也有同樣的問題。更糟糕的是，我的妻子去年夏天開了一個賬戶，而她的書籤的全文搜索根本沒有工作（它拋出了一個錯誤信息）。<p>在過去的幾個月裡，我給Maciej發了幾封電子郵件，但沒有任何回覆（除了一封取消我設置的額外賬戶的電子郵件，所以我知道我的電子郵件被收到）。多年來，我對Pinboard非常滿意，併為數年的歸檔工作預付了費用。現在還有一個很棒的MacOS/iOS客戶端（&quot;Pins for Pinboard&quot;）。<p>我覺得在這裡發帖很不好，但似乎無法聯繫到技術支持，我希望這裡還有其他Pinboard用戶（甚至可能是Maciej），他們可能更清楚發生了什麼（例如，這是否影響了所有賬戶）。"
}