{
  "@type": "NewsArticle",
  "identifier": "2022--04--07--en--askhn--HackerNews--NewsArticle--30947850",
  "url": "https://news.ycombinator.com/item?id=30947850",
  "headline": "Ask HN: Enough YoE to be senior, but no CS background, how to find work?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I started writing software over 10 years ago. I've worked in several companies, from corporations to startups.<p>I have no CS background. I studied something completely unrelated and taught myself. I live in Europe.<p>While I'm generally ok at writing code and know better than to put a loop within a loop, I can't hope to do well in algorithms or CS theory.<p>I'm looking for a new job at the moment but the &quot;code challenges&quot; are killing me. Even more so than usual this time around because I think with my 10+ years I get evaluated for Senior roles. It is incredibly demoralizing to be reminded of all the ways you can fail with every interview.<p>I love programming but I'm getting more and more tired of the interviews. How much do you really need to know to add a button to yet another CRUD app?<p>I've considered several options:<p>- Refuse to do code challenges altogether. I should note that I have several open source projects on my GitHub that I'd volunteer for examination or even pair-programming on<p>- Aim for the jobs that require 3-5 YoE, so that I don't get evaluated against senior contributor criteria<p>- Switch out of programming and to something related (but what? endless meetings or politics isn't really my thing)<p>Have you ever been in that situation? How did you get out of it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pakop",
    "url": "https://news.ycombinator.com/user?id=pakop"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30947850",
  "sameAs": "https://news.ycombinator.com/item?id=30947850",
  "dateCreated": "2022-04-07T17:44:06.068Z",
  "datePublished": "2022-04-07T17:41:28.000Z",
  "dateModified": "2022-04-07T17:44:06.068Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 足够的YoE是高级的，但没有CS背景，如何找到工作？",
  "headline_zh-Hant": "Ask HN: 足夠的YoE是高級的，但沒有CS背景，如何找到工作？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在10多年前开始编写软件。我曾在几家公司工作过，从公司到初创公司。<p>我没有CS背景。我学的是完全不相关的东西，是自学的。我住在欧洲。<p>虽然我在写代码方面总体上还可以，也知道最好不要在一个循环中放一个循环，但我不能指望在算法或CS理论方面做得很好。<p>我目前正在寻找一份新的工作，但&quot;代码挑战&quot;让我感到很痛苦。这一次甚至比以往更甚，因为我认为以我10多年的工作经验，我被评估为高级职位。我喜欢编程，但我对面试越来越厌烦。你到底需要知道多少，才能在另一个CRUD应用中添加一个按钮？<p>我考虑过几个选择：<p>--完全拒绝做代码挑战。我应该注意到，我的GitHub上有几个开源项目，我愿意自愿参加考试，甚至结对编程<p>- 争取那些需要3-5个YoE的工作，这样我就不会按照高级贡献者的标准进行评估<p>- 从编程转到相关的工作（但是什么？ 无休止的会议或政治并不是我真正喜欢的）<p> 你曾经遇到过这种情况吗？你是如何摆脱它的？",
  "description_zh-Hant": "我在10多年前開始編寫軟件。我曾在幾家公司工作過，從公司到初創公司。<p>我沒有CS背景。我學的是完全不相關的東西，是自學的。我住在歐洲。<p>雖然我在寫代碼方面總體上還可以，也知道最好不要在一個循環中放一個循環，但我不能指望在算法或CS理論方面做得很好。<p>我目前正在尋找一份新的工作，但&quot;代碼挑戰&quot;讓我感到很痛苦。這一次甚至比以往更甚，因為我認為以我10多年的工作經驗，我被評估為高級職位。我喜歡編程，但我對面試越來越厭煩。你到底需要知道多少，才能在另一個CRUD應用中添加一個按鈕？<p>我考慮過幾個選擇：<p>--完全拒絕做代碼挑戰。我應該注意到，我的GitHub上有幾個開源項目，我願意自願參加考試，甚至結對編程<p>- 爭取那些需要3-5個YoE的工作，這樣我就不會按照高級貢獻者的標準進行評估<p>- 從編程轉到相關的工作（但是什麼？ 無休止的會議或政治並不是我真正喜歡的）<p> 你曾經遇到過這種情況嗎？你是如何擺脫它的？"
}