{
  "@type": "NewsArticle",
  "identifier": "2022--04--10--en--askhn--HackerNews--NewsArticle--30973771",
  "url": "https://news.ycombinator.com/item?id=30973771",
  "headline": "Ask HN: Should we survey all the oceans?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Our future on Earth is rather gloomy. We are causing a massive climate dereliction and an even larger loss of biodiversity - and we do very little about it.<p>The space programs to send humans in space are at the same time granted hundreds of billions. Many point that maybe this money should be invested in ... discovering our oceans rather than setting up a base on the Moon.<p>I was until recently convinced that it would be much more relevant. Now I wonder: Could it be better to keep the oceans away from our knowledge?<p>I know how absurd it sounds. My opinion varies accordingly to my mood, I reckon. One day, I have faith that knowledge and Science is The Way. The other day, I can't help thinking that the current unchecked capitalism will ruthlessly exploit whatever Science discovers at whatever cost for the climate and biodiversity.<p>Could it be more ethical to keep our oceans and seas out of reach of capitalism?<p>Of course, it's easy to argue that a better knowledge will empower the protectors of the oceans, since unchecked capitalism is already depleting the seas.<p>Scientific arguments would be therefore the only way to convince the governments to preserve the oceans.<p>But would they really? In the last 30 years, the IPCC reports have proved reliable. Its climate model has been being tuned continuously and their last report is now very reliable.<p>And yet we do nothing at the scale of the issue.<p>So what is the point, really, to know more about our oceans except opening new ways to make profits while destroying Life?<p>Hoping for the best as a principle is nice. And easy. But doing again and again the same error is stupid, isn't it?<p>If we believed in Science and Technology as much as we pretend, why aren't the 300 billions needed for a base on the Moon directed to find a technical solution to grab CO2 and methane from the atmosphere - at a scale large enough to stop global warming?<p>It seems that we trust Science and Technology in very different ways. A colony on Mars? Yeah, genius! Stop global warming? Rather than founding EarthX, Elon Musk himself prefers to grant 100 million to whoever finds the way to massively recapture CO2.<p>So, what do you think? Is Science the Way or are we helplessly the baddies, since we can't help going to the Dark Side when money is to be made?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "FrenchAmerican",
    "url": "https://news.ycombinator.com/user?id=FrenchAmerican"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30973771",
  "sameAs": "https://news.ycombinator.com/item?id=30973771",
  "dateCreated": "2022-04-10T02:21:24.645Z",
  "datePublished": "2022-04-10T01:44:07.000Z",
  "dateModified": "2022-04-10T02:21:24.645Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们是否应该调查所有的海洋？",
  "headline_zh-Hant": "Ask HN: 我們是否應該調查所有的海洋？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们在地球上的未来是相当黯淡的。我们正在造成大规模的气候破坏和更大的生物多样性损失--而我们对此却无动于衷。<p>将人类送入太空的太空计划同时也获得了数千亿的资金。许多人指出，也许这些钱应该投资于......发现我们的海洋，而不是在月球上建立一个基地。<p>我直到最近才相信，这将是更有意义的。现在我想知道。让海洋远离我们的知识会不会更好？<p>我知道这听起来很荒唐。我的观点随着我的心情而变化，我估计。有一天，我相信知识和科学就是道路。另一天，我忍不住想，目前不受约束的资本主义将无情地利用科学所发现的任何东西，而不惜牺牲气候和生物多样性。<p>让我们的海洋远离资本主义，是否更符合道德？ <p>当然，我们很容易争辩说，更好的知识将增强海洋保护者的能力，因为不受约束的资本主义已经在耗尽海洋。<p>因此，科学论证将是说服政府保护海洋的唯一途径。<p>但他们真的会吗？在过去的30年里，IPCC的报告被证明是可靠的。它的气候模型一直在不断调整，他们的最后一份报告现在非常可靠。<p>然而，在这个问题的规模上，我们什么也没做。<p>因此，除了在破坏生命的同时开辟新的盈利方式之外，了解我们的海洋有什么意义呢？而且很容易。但一而再、再而三地犯同样的错误是愚蠢的，不是吗？<p>如果我们像我们假装的那样相信科学和技术，为什么不把在月球上建立基地所需的3000亿资金用于寻找技术解决方案，以从大气中攫取二氧化碳和甲烷--其规模足以阻止全球变暖？在火星上建立殖民地？是的，天才! 阻止全球变暖？埃隆-马斯克本人并没有创立EarthX，而是倾向于为找到大规模回收二氧化碳的方法的人提供1亿美金。是科学的方式，还是我们无奈地成为了坏人，因为只要有钱赚，我们就会不由自主地走到黑暗面？",
  "description_zh-Hant": "我們在地球上的未來是相當黯淡的。我們正在造成大規模的氣候破壞和更大的生物多樣性損失--而我們對此卻無動於衷。<p>將人類送入太空的太空計劃同時也獲得了數千億的資金。許多人指出，也許這些錢應該投資於......發現我們的海洋，而不是在月球上建立一個基地。<p>我直到最近才相信，這將是更有意義的。現在我想知道。讓海洋遠離我們的知識會不會更好？<p>我知道這聽起來很荒唐。我的觀點隨著我的心情而變化，我估計。有一天，我相信知識和科學就是道路。另一天，我忍不住想，目前不受約束的資本主義將無情地利用科學所發現的任何東西，而不惜犧牲氣候和生物多樣性。<p>讓我們的海洋遠離資本主義，是否更符合道德？ <p>當然，我們很容易爭辯說，更好的知識將增強海洋保護者的能力，因為不受約束的資本主義已經在耗盡海洋。<p>因此，科學論證將是說服政府保護海洋的唯一途徑。<p>但他們真的會嗎？在過去的30年裡，IPCC的報告被證明是可靠的。它的氣候模型一直在不斷調整，他們的最後一份報告現在非常可靠。<p>然而，在這個問題的規模上，我們什麼也沒做。<p>因此，除了在破壞生命的同時開闢新的盈利方式之外，瞭解我們的海洋有什麼意義呢？而且很容易。但一而再、再而三地犯同樣的錯誤是愚蠢的，不是嗎？<p>如果我們像我們假裝的那樣相信科學和技術，為什麼不把在月球上建立基地所需的3000億資金用於尋找技術解決方案，以從大氣中攫取二氧化碳和甲烷--其規模足以阻止全球變暖？在火星上建立殖民地？是的，天才! 阻止全球變暖？埃隆-馬斯克本人並沒有創立EarthX，而是傾向於為找到大規模回收二氧化碳的方法的人提供1億美金。是科學的方式，還是我們無奈地成為了壞人，因為只要有錢賺，我們就會不由自主地走到黑暗面？"
}