{
  "@type": "NewsArticle",
  "identifier": "2022--03--19--en--askhn--HackerNews--NewsArticle--30733828",
  "url": "https://news.ycombinator.com/item?id=30733828",
  "headline": "Ask HN: Mid-career researcher wanting to move to Internet scale company",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm a mid career research scientist (15 years post-PhD) with expertise in cloud computing and AI (mostly vision). I currently work at an industry research lab (almost a decade at my current employer) The work I have done has resulted in papers at top IEEE and ACM conferences, and I am in a quasi management position at my current employer (lead a team of 6; mix of scientists and engineers).<p>While being a success in an industry lab setting, I am interested in moving to an Internet scale company. I have a very hard time selling myself. The work I have done has not made it into products .. just papers and patents. I could probably move to a professor job as I have reputation in my subfield with a strong publication record, on the program committees of key conferences, etc.<p>I am extremely passionate about technology. I am also pretty decent as a manager (be it as a coach or where I am representing my part of the lab to other parts of the business). I also feel a bit of faker syndrome. I have a high salary (350K USD), which is problematic .. it makes going to small companies hard to stomach (I see engineering managers get paid 150K in some small companies) and the larger companies (FANG-Amazon) pay a lot more but seem impossible for me to get into. I did try getting into such companies when I was fresh out of school but flunked the interviews.<p>One other issue .. I feel at home coding but my currently role leave me nearly no time to code. I do management stuff and lead research projects.<p>Any advice would be most appreciated.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "brutus1213",
    "url": "https://news.ycombinator.com/user?id=brutus1213"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30733828",
  "sameAs": "https://news.ycombinator.com/item?id=30733828",
  "dateCreated": "2022-03-19T14:29:45.223Z",
  "datePublished": "2022-03-19T14:11:25.000Z",
  "dateModified": "2022-03-19T14:29:45.223Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 希望转到互联网规模公司的中层研究人员",
  "headline_zh-Hant": "Ask HN: 希望轉到互聯網規模公司的中層研究人員",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一名中级职业研究科学家（博士后15年），擅长云计算和人工智能（主要是视觉）。我目前在一个行业研究实验室工作（在我目前的雇主那里工作了近十年），我所做的工作已经在顶级的IEEE和ACM会议上发表了论文，而且我在我目前的雇主那里处于一个准管理职位（领导一个6人团队；科学家和工程师的混合）。我很难推销自己。我所做的工作没有变成产品......只有论文和专利。我可能会转到一个教授的职位，因为我在我的子领域有很好的声誉，有很强的出版记录，在关键会议的程序委员会中，等等。我也是一个相当不错的管理者（无论是作为教练还是代表我所在的实验室向企业的其他部门汇报）。我也感觉到了一点伪造者综合症。我的工资很高（35万美元），这很成问题......这让我很难去小公司（我看到工程经理在一些小公司的工资是15万），而大公司（FANG-Amazon）的工资要高得多，但我似乎不可能进入。<p>还有一个问题......我觉得在家里编码，但我目前的角色让我几乎没有时间去编码。我做的是管理方面的工作，并领导研究项目。<p>如果有任何建议，我将非常感激。",
  "description_zh-Hant": "我是一名中級職業研究科學家（博士後15年），擅長雲計算和人工智能（主要是視覺）。我目前在一個行業研究實驗室工作（在我目前的僱主那裡工作了近十年），我所做的工作已經在頂級的IEEE和ACM會議上發表了論文，而且我在我目前的僱主那裡處於一個準管理職位（領導一個6人團隊；科學家和工程師的混合）。我很難推銷自己。我所做的工作沒有變成產品......只有論文和專利。我可能會轉到一個教授的職位，因為我在我的子領域有很好的聲譽，有很強的出版記錄，在關鍵會議的程序委員會中，等等。我也是一個相當不錯的管理者（無論是作為教練還是代表我所在的實驗室向企業的其他部門彙報）。我也感覺到了一點偽造者綜合症。我的工資很高（35萬美元），這很成問題......這讓我很難去小公司（我看到工程經理在一些小公司的工資是15萬），而大公司（FANG-Amazon）的工資要高得多，但我似乎不可能進入。<p>還有一個問題......我覺得在家裡編碼，但我目前的角色讓我幾乎沒有時間去編碼。我做的是管理方面的工作，並領導研究項目。<p>如果有任何建議，我將非常感激。"
}