{
  "@type": "NewsArticle",
  "identifier": "2022--03--15--en--askhn--HackerNews--NewsArticle--30683594",
  "url": "https://news.ycombinator.com/item?id=30683594",
  "headline": "Ask HN: Understanding spirituality for an introverted skeptic scientist",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Throwaway because I'm not brave enough to ask this on my main account. Also this may be more appropriate for /r/relationshipadvice but you're my people, so here we are!<p>I (M/40) have fallen for someone (F/32) who's very into spirituality, Law of Attraction, and related stuff. I'm a technical person, I'm very much aligned with evidence-based beliefs, atheist, and this is all very new to me. We are best friends, we will likely be no more than that (i.e. no relationship on the horizon), and I am 100% happy with that to be the case.<p>I would like to better understand some of her interests without being drawn into what I currently view as pseudoscience. I realise this might make me a bad person, but she makes me feel like nobody else I've ever met, and she's so well-read on it all that I can't quite make the jump to have her explain some of it to me as a skeptic…I have a feeling I'll be going in unprepared if I don't have at least a cursory understanding first.<p>Is there reading material you'd recommend for this? Is there any advice you'd give to someone who's somewhat open-minded but doesn't want to screw up a friendship by blundering in with the wrong thing?<p>Thanks for reading, and thanks for any advice.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway-kr",
    "url": "https://news.ycombinator.com/user?id=throwaway-kr"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30683594",
  "sameAs": "https://news.ycombinator.com/item?id=30683594",
  "dateCreated": "2022-03-15T10:33:52.354Z",
  "datePublished": "2022-03-15T10:21:29.000Z",
  "dateModified": "2022-03-15T10:33:52.354Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 一个内向的怀疑论者科学家对灵性的理解",
  "headline_zh-Hant": "Ask HN: 一個內向的懷疑論者科學家對靈性的理解",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "抛砖引玉，因为我没有勇气在我的主账户上问这个问题。另外，这可能更适合于/r/relationshipadvice，但你们是我的人，所以我们在这里！<p>我（男/40）已经爱上了一个人（女/32），他非常喜欢灵性、吸引力法则和相关的东西。我是一个技术人员，我非常认同以证据为基础的信仰，是无神论者，这些对我来说都很新鲜。我们是最好的朋友，我们很可能不会再有其他关系（也就是说，不会有任何关系），我对这种情况感到100%的满意。我意识到这可能会使我成为一个坏人，但她给我的感觉是我从未见过的人，她对这一切都有很深的研究，以至于我无法跳出来让她向我这个怀疑论者解释一些东西......我有一种感觉，如果我不先有至少粗略的了解，我就会毫无准备地进去。<p>对此你有什么阅读材料推荐吗？你有没有什么建议给一个思想开放，但又不想因为误入歧途而破坏友谊的人？<p>谢谢你的阅读，也谢谢你的建议。",
  "description_zh-Hant": "拋磚引玉，因為我沒有勇氣在我的主賬戶上問這個問題。另外，這可能更適合於/r/relationshipadvice，但你們是我的人，所以我們在這裡！<p>我（男/40）已經愛上了一個人（女/32），他非常喜歡靈性、吸引力法則和相關的東西。我是一個技術人員，我非常認同以證據為基礎的信仰，是無神論者，這些對我來說都很新鮮。我們是最好的朋友，我們很可能不會再有其他關係（也就是說，不會有任何關係），我對這種情況感到100%的滿意。我意識到這可能會使我成為一個壞人，但她給我的感覺是我從未見過的人，她對這一切都有很深的研究，以至於我無法跳出來讓她向我這個懷疑論者解釋一些東西......我有一種感覺，如果我不先有至少粗略的瞭解，我就會毫無準備地進去。<p>對此你有什麼閱讀材料推薦嗎？你有沒有什麼建議給一個思想開放，但又不想因為誤入歧途而破壞友誼的人？<p>謝謝你的閱讀，也謝謝你的建議。"
}