{
  "@type": "NewsArticle",
  "identifier": "2022--03--28--en--askhn--HackerNews--NewsArticle--30826063",
  "url": "https://news.ycombinator.com/item?id=30826063",
  "headline": "Ask HN: Are visual website builders just selling theme customization?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "It becomes a must to have pre-built templates for these apps. Their demos only show &quot;almost-done&quot; kind of example. Imagine comparing each of these with criteria of starting from blank page, it would show more awkward moment trying to arrange details of layout on deep level elements.<p>There is new kind of builder that's trying to free users from limitation previous generation used to have. That is to render layout from code and generate code (two-way). But it becomes YesCode (Low Code is not enough for 100% customizable and extensible), and also ties to particular paradigm of how their code do styling because the UI needs to understand and be able to render it as well as to generate the code in some style (can it generate styled-component, tailwind, etc?). Therefore, they end up doing a lot of pre-built components, let users drag and drop and customize, so YesCode is now closed to just selling widgets library since composing part is already easy at this point, probably easier than using the gui one.<p>Apparently, these site builders serve well, so there is huge market. If I asked &quot;is the market saturated&quot; 5 years ago, the answer was probably yes, and proven wrong today. But I wonder if this time the market really is saturated, how could them be better than this, they seem to already reach both end of &lt;-convenience--------flexibility-&gt; spectrum.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Existenceblinks",
    "url": "https://news.ycombinator.com/user?id=Existenceblinks"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30826063",
  "sameAs": "https://news.ycombinator.com/item?id=30826063",
  "dateCreated": "2022-03-28T02:22:25.188Z",
  "datePublished": "2022-03-28T01:30:20.000Z",
  "dateModified": "2022-03-28T02:22:25.188Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 可视化网站建设者只是在销售主题定制吗？",
  "headline_zh-Hant": "Ask HN: 可視化網站建設者只是在銷售主題定製嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "为这些应用程序提供预建模板成为一种必须。他们的演示只展示了 \"几乎完成 \"的例子。想象一下，把这些东西与从空白页开始的标准进行比较，会发现在试图安排深层元素的布局细节时，会有更多的尴尬。<p>有一种新的构建器，试图把用户从上一代人的限制中解放出来。那就是通过代码渲染布局和生成代码（双向）。但它变成了YesCode（低代码不足以实现100%的可定制和可扩展），而且还与他们的代码如何做造型的特定范式联系在一起，因为UI需要理解并能够渲染它，以及以某种风格生成代码（它能否生成有风格的组件、tailwind，等等）。因此，他们最终做了很多预建的组件，让用户拖放和定制，所以YesCode现在已经关闭了，只卖小部件库，因为合成部分在这一点上已经很容易，可能比使用gui的更容易。<p>显然，这些网站建设者服务很好，所以有巨大的市场。如果我在5年前问&quot;市场是否饱和&quot;，答案可能是肯定的，而且今天证明是错误的。但我想知道这次市场是否真的饱和了，他们怎么可能比这更好呢，他们似乎已经达到了&lt;-便利性_COPYflexibility-&gt;的两端。",
  "description_zh-Hant": "為這些應用程序提供預建模板成為一種必須。他們的演示只展示了 \"幾乎完成 \"的例子。想象一下，把這些東西與從空白頁開始的標準進行比較，會發現在試圖安排深層元素的佈局細節時，會有更多的尷尬。<p>有一種新的構建器，試圖把用戶從上一代人的限制中解放出來。那就是通過代碼渲染布局和生成代碼（雙向）。但它變成了YesCode（低代碼不足以實現100%的可定製和可擴展），而且還與他們的代碼如何做造型的特定範式聯繫在一起，因為UI需要理解並能夠渲染它，以及以某種風格生成代碼（它能否生成有風格的組件、tailwind，等等）。因此，他們最終做了很多預建的組件，讓用戶拖放和定製，所以YesCode現在已經關閉了，只賣小部件庫，因為合成部分在這一點上已經很容易，可能比使用gui的更容易。<p>顯然，這些網站建設者服務很好，所以有巨大的市場。如果我在5年前問&quot;市場是否飽和&quot;，答案可能是肯定的，而且今天證明是錯誤的。但我想知道這次市場是否真的飽和了，他們怎麼可能比這更好呢，他們似乎已經達到了&lt;-便利性_COPYflexibility-&gt;的兩端。"
}