{
  "@type": "NewsArticle",
  "identifier": "2022--03--11--en--askhn--HackerNews--NewsArticle--30646015",
  "url": "https://news.ycombinator.com/item?id=30646015",
  "headline": "Ask HN: Will accepting a systems engineer job make it harder to get a SWE one?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm a new grad (this spring) from a state school majoring in CS. I love software development, and although I only started in college, it's what I want to do in my career. However before then I wanted to be a 'sysadmin' and did a lot of Linux/DB/cloud stuff (starting with game servers and forums) so I have a good amount of experience in I guess what would be called &quot;systems engineering.&quot; Hence why I was given a good offer at a proprietary trading firm doing just that. But I'm worried that I won't feel fulfilled or I'll have my professional growth stunted by accepting the position, and that recruiters/peers will see me as 'just' a systems engineer; even when I have a CS degree and will likely be writing code (just more along the lines of automation/scripts/some APIs) every day. On the other hand this is the best offer I've had yet (including over SWE roles) and I don't want to let it go.<p>Am I just overthinking this first professional role or are my fears that I'll be pigeonholed later justified?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "propsyseng",
    "url": "https://news.ycombinator.com/user?id=propsyseng"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30646015",
  "sameAs": "https://news.ycombinator.com/item?id=30646015",
  "dateCreated": "2022-03-11T21:09:44.672Z",
  "datePublished": "2022-03-11T21:06:10.000Z",
  "dateModified": "2022-03-11T21:09:44.672Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 接受系统工程师的工作是否会让你更难得到SWE的工作？",
  "headline_zh-Hant": "Ask HN: 接受系統工程師的工作是否會讓你更難得到SWE的工作？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一名刚毕业的学生（今年春天），来自一所州立学校，主修CS。我喜欢软件开发，虽然我在大学才开始，但这是我想做的职业。然而，在此之前，我想成为一名 \"系统管理员\"，并做了很多Linux/DB/云的工作（从游戏服务器和论坛开始），所以我在我想被称为 \"系统工程 \"方面有很好的经验，这就是为什么我在一家自营交易公司获得了一份很好的工作。但我担心接受这个职位后，我不会有成就感，或者我的职业发展会受到阻碍，而且招聘人员/同行会把我看作 \"仅仅是 \"一个系统工程师；即使我有CS学位，而且可能每天都在写代码（只是更多的是沿着自动化/脚本/一些API的思路）。另一方面，这是我目前得到的最好的机会（包括超过SWE的角色），我不想让它离开。<p>我是否只是过度考虑了这第一个职业角色，或者我担心我以后会被放鸽子是有道理的？",
  "description_zh-Hant": "我是一名剛畢業的學生（今年春天），來自一所州立學校，主修CS。我喜歡軟件開發，雖然我在大學才開始，但這是我想做的職業。然而，在此之前，我想成為一名 \"系統管理員\"，並做了很多Linux/DB/雲的工作（從遊戲服務器和論壇開始），所以我在我想被稱為 \"系統工程 \"方面有很好的經驗，這就是為什麼我在一家自營交易公司獲得了一份很好的工作。但我擔心接受這個職位後，我不會有成就感，或者我的職業發展會受到阻礙，而且招聘人員/同行會把我看作 \"僅僅是 \"一個系統工程師；即使我有CS學位，而且可能每天都在寫代碼（只是更多的是沿著自動化/腳本/一些API的思路）。另一方面，這是我目前得到的最好的機會（包括超過SWE的角色），我不想讓它離開。<p>我是否只是過度考慮了這第一個職業角色，或者我擔心我以後會被放鴿子是有道理的？"
}