{
  "@type": "NewsArticle",
  "identifier": "2022--03--16--en--askhn--HackerNews--NewsArticle--30698269",
  "url": "https://news.ycombinator.com/item?id=30698269",
  "headline": "Ask HN: Is it normal to be ghosted for senior position job interviews?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm casually browsing for some engineer manager / principal engineering roles. I scheduled an interview with 3 different companies, and in all 3 cases nobody showed up for the interview.<p>In the first 2 cases, I emailed the recruiter about 5~10 minutes after the interview was supposed to start, to check if I had the right meeting link (I know I did, but wanted to frame it politely). After the meeting was supposed to end, I sent another email saying that unfortunately I was not able to reach them, but that I'm still interested and would like to reschedule. Again... crickets.<p>In the 3rd scenario I confirmed the proposed interview date/time, but never received the meeting invite. Only after the interview was supposed to take place, the recruiter proposed a new time.<p>The companies mentioned are Grafana (no reply at all, not even from the head of people who I reached out to after being ignored by the recruiter 3 times), Miro (the recruiter replied several days later with a very vague non-apologetic message, but never reacted to my proposal of rescheduling) and Microsoft.<p>Is this a normal experience or is something weird going on?<p>(and yes, I know shaming companies with their name is not nice, but ghosting candidates also isn't nice imho)",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Avalaxy",
    "url": "https://news.ycombinator.com/user?id=Avalaxy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30698269",
  "sameAs": "https://news.ycombinator.com/item?id=30698269",
  "dateCreated": "2022-03-16T13:17:31.138Z",
  "datePublished": "2022-03-16T13:06:23.000Z",
  "dateModified": "2022-03-16T13:17:31.138Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 10
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 6
    }
  ],
  "headline_zh-Hans": "Ask HN: 高级职位的工作面试被幽灵化是正常的吗？",
  "headline_zh-Hant": "Ask HN: 高級職位的工作面試被幽靈化是正常的嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我正在随意浏览一些工程师经理/主要工程的职位。<p>在前两个案例中，我在面试开始后约5~10分钟给招聘人员发了电子邮件，以检查我是否有正确的会议链接（我知道我有，但想礼貌地提出来）。在会议结束后，我又发了一封邮件，说很遗憾我没能联系上他们，但我仍然感兴趣，希望重新安排时间。<p>在第三种情况下，我确认了拟议的面试日期/时间，但从未收到会议邀请。<p>提到的公司有：Grafana（完全没有回复，甚至连我在被招聘人员无视后联系的负责人也没有回复）、Miro（招聘人员几天后回复了一个非常模糊的非歉意信息，但从未对我的改期建议做出反应）和微软。 <p>这是一个正常的经历，还是发生了什么奇怪的事情？<p>（是的，我知道用公司的名字来羞辱他们是不好的，但幽灵般的候选人也是不好的。）",
  "description_zh-Hant": "我正在隨意瀏覽一些工程師經理/主要工程的職位。<p>在前兩個案例中，我在面試開始後約5~10分鐘給招聘人員發了電子郵件，以檢查我是否有正確的會議鏈接（我知道我有，但想禮貌地提出來）。在會議結束後，我又發了一封郵件，說很遺憾我沒能聯繫上他們，但我仍然感興趣，希望重新安排時間。<p>在第三種情況下，我確認了擬議的面試日期/時間，但從未收到會議邀請。<p>提到的公司有：Grafana（完全沒有回覆，甚至連我在被招聘人員無視後聯繫的負責人也沒有回覆）、Miro（招聘人員幾天後回覆了一個非常模糊的非歉意信息，但從未對我的改期建議做出反應）和微軟。 <p>這是一個正常的經歷，還是發生了什麼奇怪的事情？<p>（是的，我知道用公司的名字來羞辱他們是不好的，但幽靈般的候選人也是不好的。）"
}