{
  "@type": "NewsArticle",
  "identifier": "2022--03--08--en--askhn--HackerNews--NewsArticle--30597498",
  "url": "https://news.ycombinator.com/item?id=30597498",
  "headline": "Ask HN: Did any one or any thing predict the Russian invasion of Ukraine?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I know there were myriad people over the past 20 years who were calling all the NATO expansion decisions disastrous and very likely to lead to war and even world war, but I'm more interested in real and recent actual predictions of whether Russia was going to attack and/or invade (a more serious commitment to your strategic goals).<p>Were there any analysts, historians, stock traders, redditors, HNers, conventional or AI systems, tarot card readers, shamans, etc. who correctly predicted that Russia would attack -- invade -- Ukraine 'in the next three' months or similar?<p>There are plenty of sports analysts on ESPN, for example, who will say things like:<p>&gt; If Lebron plays like an MVP, they will likely win the chip. But if Lebron plays like less than an MVP, then they might not win it all. But maybe not either or both.<p>Highly qualified 'nothing' statements like this are not interesting.<p>I'm talking about someone who publicly staked their reputation on their prediction -- someone who was so convinced of their correctness and the soundness of the facts of the case and the competing interests and dynamics -- that they were willing to actually say it out loud and/or in print.<p>To me, now, looking back on it, it seems completely predictable -- and I feel like it only took me fifteen minutes to learn the relevant background and come to this conclusion -- which suggests to me that most serious analysts would have had to have been pretty confident (&gt;90%) that this invasion would happen. In other words, any serious analyst should have predicted this.<p>On a side note, I do think it's funny how I, upon knowing about the Russian buildup on the Ukrainian border, and paid some attention to it, would not have immediately declared publicly and loudly, &quot;They're going to invade you/we **** idiots! We have to do something!&quot;<p>I think back to WWII and similar scenarios when you read about troop/border buildups and think, &quot;Gosh -- how asleep/gullible did the whole world have to be to _not_ understand what was happening? IDIOTS.&quot;<p>Well, now I'm one of those who was too asleep / gullible / IDIOTIC.<p>And I think if we're being honest, that's probably 99% of the world or more.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "readonthegoapp",
    "url": "https://news.ycombinator.com/user?id=readonthegoapp"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30597498",
  "sameAs": "https://news.ycombinator.com/item?id=30597498",
  "dateCreated": "2022-03-08T07:50:01.226Z",
  "datePublished": "2022-03-08T07:47:41.000Z",
  "dateModified": "2022-03-08T07:50:01.226Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 是否有任何人或事物预测到俄罗斯对乌克兰的入侵？",
  "headline_zh-Hant": "Ask HN: 是否有任何人或事物預測到俄羅斯對烏克蘭的入侵？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我知道在过去的20年里，有无数人称所有的北约扩张决定都是灾难性的，非常有可能导致战争甚至世界大战，但我更感兴趣的是对俄罗斯是否会进攻和/或入侵的真实和最近的实际预测（对你的战略目标更严肃的承诺）。 <p>有没有任何分析师、历史学家、股票交易员、红客、HNers、传统或AI系统、塔罗牌阅读者、巫师等正确预测俄罗斯将在'未来三个月'或类似情况下进攻--入侵--乌克兰？<p>例如，ESPN上有很多体育分析师，他们会说这样的话：<p>&gt; 如果勒布朗打得像个MVP，他们将可能赢得芯片。但如果勒布朗打得不像一个MVP，那么他们可能不会赢得一切。<p>像这样高度合格的 \"无 \"的声明并不有趣。<p>我说的是有人将他们的声誉公开押在他们的预测上--有人如此相信他们的正确性和案件事实的合理性以及竞争的利益和动态--以至于他们愿意真正大声说出来和/或打印出来。 <p>对我来说，现在回过头来看，这似乎是完全可以预测的--而且我觉得我只花了15分钟来了解相关的背景并得出这个结论--这对我来说表明，大多数严肃的分析家都必须对这次入侵的发生有相当的信心（&gt;90%）。换句话说，任何严肃的分析家都应该预测到这一点。<p>从侧面看，我确实认为很有趣，当我知道俄罗斯在乌克兰边境的集结，并对其给予一些关注时，我不会立即公开和大声宣布：&quot;他们要入侵你/我们**** 白痴! 我们必须做点什么！&quot;<p>我回想起二战和类似的情况，当你读到部队/边境集结时，你会想，&quot;天哪--整个世界必须是多么沉睡/轻信的人，才会不明白发生了什么？傻瓜。<p>好吧，现在我是那些太过沉睡/轻信/白痴的人之一。<p>而且我认为如果我们是诚实的，这可能是世界上99%或更多的人。",
  "description_zh-Hant": "我知道在過去的20年裡，有無數人稱所有的北約擴張決定都是災難性的，非常有可能導致戰爭甚至世界大戰，但我更感興趣的是對俄羅斯是否會進攻和/或入侵的真實和最近的實際預測（對你的戰略目標更嚴肅的承諾）。 <p>有沒有任何分析師、歷史學家、股票交易員、紅客、HNers、傳統或AI系統、塔羅牌閱讀者、巫師等正確預測俄羅斯將在'未來三個月'或類似情況下進攻--入侵--烏克蘭？<p>例如，ESPN上有很多體育分析師，他們會說這樣的話：<p>&gt; 如果勒布朗打得像個MVP，他們將可能贏得芯片。但如果勒布朗打得不像一個MVP，那麼他們可能不會贏得一切。<p>像這樣高度合格的 \"無 \"的聲明並不有趣。<p>我說的是有人將他們的聲譽公開押在他們的預測上--有人如此相信他們的正確性和案件事實的合理性以及競爭的利益和動態--以至於他們願意真正大聲說出來和/或打印出來。 <p>對我來說，現在回過頭來看，這似乎是完全可以預測的--而且我覺得我只花了15分鐘來了解相關的背景並得出這個結論--這對我來說表明，大多數嚴肅的分析家都必須對這次入侵的發生有相當的信心（&gt;90%）。換句話說，任何嚴肅的分析家都應該預測到這一點。<p>從側面看，我確實認為很有趣，當我知道俄羅斯在烏克蘭邊境的集結，並對其給予一些關注時，我不會立即公開和大聲宣佈：&quot;他們要入侵你/我們**** 白痴! 我們必須做點什麼！&quot;<p>我回想起二戰和類似的情況，當你讀到部隊/邊境集結時，你會想，&quot;天哪--整個世界必須是多麼沉睡/輕信的人，才會不明白髮生了什麼？傻瓜。<p>好吧，現在我是那些太過沉睡/輕信/白痴的人之一。<p>而且我認為如果我們是誠實的，這可能是世界上99%或更多的人。"
}