{
  "@type": "NewsArticle",
  "identifier": "2022--02--23--en--askhn--HackerNews--NewsArticle--30438204",
  "url": "https://news.ycombinator.com/item?id=30438204",
  "headline": "Ask HN: Cheaper Alternatives for Landing Page?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am looking to setup a landing page for a book I'm writing. The goal of the page is mainly pitch the book, collect emails and direct people to purchase the e-book, the print book when it's available, and to link to my profile on other social media.<p>I am a backend engineer with very limited frontend skills so I'd prefer to just pay for something that is simple set up and ideally can handle collecting the emails and managing the list (or at least make it easy to integrate with something like MailChimp).<p>Looking at pricing for starter plans for products that offer this service, I'm surprised to see how expensive they are. Unbounce is $90, SmartPages is $60, etc.<p>Are there cheaper alternatives? Is my best to do what I can to roll my own, perhaps using a preexisting landing page then and integrating the email capture myself?<p>I don't want to get too bogged down on setting this up myself as I prefer to focus on writing the book and I'm weary of spending a bunch of time trying to create this myself, only to have it end up not looking very good on account of my weak design and frontend skills.<p>Any suggestions on the best route to take? Thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "xwowsersx",
    "url": "https://news.ycombinator.com/user?id=xwowsersx"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30438204",
  "sameAs": "https://news.ycombinator.com/item?id=30438204",
  "dateCreated": "2022-02-23T06:12:09.603Z",
  "datePublished": "2022-02-23T06:09:10.000Z",
  "dateModified": "2022-02-23T06:12:09.603Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 更便宜的登陆页替代品？",
  "headline_zh-Hant": "Ask HN: 更便宜的登陸頁替代品？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我想为我正在写的一本书建立一个登陆页面。这个页面的目标主要是推销这本书，收集电子邮件，引导人们购买电子书，在印刷书上市时购买，并链接到我在其他社会媒体上的个人资料。 <p>我是一个后端工程师，前端技术非常有限，所以我更愿意只支付一些简单的设置，最好能处理收集电子邮件和管理列表（或至少使其容易与类似MailChimp的东西集成）。<p>看看提供这种服务的产品的启动计划的定价，我很惊讶地看到它们有多么昂贵。Unbounce是90美元，SmartPages是60美元，等等。<p>是否有更便宜的替代品？我最好的办法是自己动手，也许使用一个预先存在的着陆页，然后自己整合电子邮件捕获功能？<p>我不想在自己设置这个问题上陷入困境，因为我更愿意专注于写书，我很担心花了很多时间试图自己创建这个，但由于我的设计和前端技能薄弱，它最终看起来不是很好。谢谢。",
  "description_zh-Hant": "我想為我正在寫的一本書建立一個登陸頁面。這個頁面的目標主要是推銷這本書，收集電子郵件，引導人們購買電子書，在印刷書上市時購買，並鏈接到我在其他社會媒體上的個人資料。 <p>我是一個後端工程師，前端技術非常有限，所以我更願意只支付一些簡單的設置，最好能處理收集電子郵件和管理列表（或至少使其容易與類似MailChimp的東西集成）。<p>看看提供這種服務的產品的啟動計劃的定價，我很驚訝地看到它們有多麼昂貴。Unbounce是90美元，SmartPages是60美元，等等。<p>是否有更便宜的替代品？我最好的辦法是自己動手，也許使用一個預先存在的著陸頁，然後自己整合電子郵件捕獲功能？<p>我不想在自己設置這個問題上陷入困境，因為我更願意專注於寫書，我很擔心花了很多時間試圖自己創建這個，但由於我的設計和前端技能薄弱，它最終看起來不是很好。謝謝。"
}