{
  "@type": "NewsArticle",
  "identifier": "2022--04--13--en--askhn--HackerNews--NewsArticle--31010892",
  "url": "https://news.ycombinator.com/item?id=31010892",
  "headline": "Ask HN: How do hackers hack MongoDB instances?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This week I got my mongodb instances hacked two times. Since it is a test database there is no damage. But my question is how it possible?\nI've setup a unique password for my db? If the hacker can figure out my password, is it not possible they can hack every other accounts on the internet too?\nI've hosted my db on AWS. And my port is open to connect from anywhere. I know it shouldn't be kept like that. I am only doing it since it is a test db. My biggest question is how easy is to a hacker to break passwords?\nThis is the document hacker left on my db:\n&quot;All your data is a backed up. You must pay 0.021 BTC to 1Di1cM1QgTxZuwsxp9nRBc6UXUAhbMN7YX 48 hours for recover it. After 48 hours expiration we will leaked and exposed all your data. In case of refusal to pay, we will contact the General Data Protection Regulation, GDPR and notify them that you store user data in an open form and is not safe. Under the rules of the law, you face a heavy fine or arrest and your base dump will be dropped from our server! You can buy bitcoin here, does not take much time to buy https://localbitcoins.com or https://buy.moonpay.io/ After paying write to me in the mail with your DB IP: recmydb+1j117@onionmail.org and you will receive a link to download your database dump.&quot;<p>Any  tips on protecting aws EC2 instances also welcome. Thank you.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "NithurM",
    "url": "https://news.ycombinator.com/user?id=NithurM"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31010892",
  "sameAs": "https://news.ycombinator.com/item?id=31010892",
  "dateCreated": "2022-04-13T03:52:47.698Z",
  "datePublished": "2022-04-13T03:25:59.000Z",
  "dateModified": "2022-04-13T03:52:47.698Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 黑客是如何入侵MongoDB实例的？",
  "headline_zh-Hant": "Ask HN: 黑客是如何入侵MongoDB實例的？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这周我的mongodb实例被黑了两次。因为这是一个测试数据库，所以没有什么损失。但我的问题是，这怎么可能？\n我已经为我的数据库设置了一个独特的密码？如果黑客能知道我的密码，他们是不是也可以入侵互联网上的所有其他账户？\n我在AWS上托管了我的数据库。而且我的端口是开放的，可以从任何地方连接。我知道它不应该保持这样的状态。我这样做只是因为它是一个测试数据库。我最大的问题是，黑客要破解密码有多容易？\n这就是黑客在我的数据库上留下的文件。\n&quot;你的所有数据都被备份了。你必须支付0.021 BTC给1Di1cM1QgTxZuwsxp9nRBc6UXUAhbMN7YX 48小时内恢复它。48小时到期后，我们将泄露和暴露您的所有数据。在拒绝支付的情况下，我们将联系通用数据保护条例，GDPR，并通知他们，你以开放的形式存储用户数据，是不安全的。根据法律的规定，你将面临重罚或逮捕，你的基础转储将从我们的服务器上删除 你可以在这里购买比特币，不需要太多的时间，购买https://localbitcoins.com 或 https://buy.moonpay.io/ 付款后，在邮件中写上你的DB IP：recmydb+1j117@onionmail.org，你会收到一个下载你的数据库转储的链接。&quot;<p>也欢迎任何关于保护aws EC2实例的提示。谢谢你。",
  "description_zh-Hant": "這周我的mongodb實例被黑了兩次。因為這是一個測試數據庫，所以沒有什麼損失。但我的問題是，這怎麼可能？\n我已經為我的數據庫設置了一個獨特的密碼？如果黑客能知道我的密碼，他們是不是也可以入侵互聯網上的所有其他賬戶？\n我在AWS上託管了我的數據庫。而且我的端口是開放的，可以從任何地方連接。我知道它不應該保持這樣的狀態。我這樣做只是因為它是一個測試數據庫。我最大的問題是，黑客要破解密碼有多容易？\n這就是黑客在我的數據庫上留下的文件。\n&quot;你的所有數據都被備份了。你必須支付0.021 BTC給1Di1cM1QgTxZuwsxp9nRBc6UXUAhbMN7YX 48小時內恢復它。48小時到期後，我們將洩露和暴露您的所有數據。在拒絕支付的情況下，我們將聯繫通用數據保護條例，GDPR，並通知他們，你以開放的形式存儲用戶數據，是不安全的。根據法律的規定，你將面臨重罰或逮捕，你的基礎轉儲將從我們的服務器上刪除 你可以在這裡購買比特幣，不需要太多的時間，購買https://localbitcoins.com 或 https://buy.moonpay.io/ 付款後，在郵件中寫上你的DB IP：recmydb+1j117@onionmail.org，你會收到一個下載你的數據庫轉儲的鏈接。&quot;<p>也歡迎任何關於保護aws EC2實例的提示。謝謝你。"
}