{
  "@type": "NewsArticle",
  "identifier": "2022--02--28--en--askhn--HackerNews--NewsArticle--30501840",
  "url": "https://news.ycombinator.com/item?id=30501840",
  "headline": "Ask HN: Who would be interested in a platform for text based job interviews",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm currently looking for a new job, and I have a problem: I absolutely hate job interviews. I have an irrational fear of them. I get so anxious I can't sleep days before the interview. During the interview, I'm the worst possible version of myself, and my brain just shuts down. I can't answer the basic questions and I make the impression that I don't know what I'm talking about.<p>I have 10 years of professional experience, I have a good CV and I think I'm actually good at my job. But I don't think I will get a job like this. (And I'm not really looking anymore, because I don't want to put myself in that situation again)<p>So I thought: if this is happening to me, it must happen to others!<p>There must be thousands of great developers out there, who don't switch jobs, who don't apply to a position which they would be a perfect fit for, simply because they loathe job interviews, are shy, introverted or have social anxiety...<p>And companies are missing out on great developers. They are basically filtering out anyone who isn't good at interviewing. I get that for some companies or some positions, talking on the phone or per video chat is part of the job. But not for (every) software developer jobs?<p>I know that at least one company, Automattic, is conducting their job interviews via text. So it must work, even on the scale of a company with ~1000 of employees.<p>Maybe there are more?<p>I'm starting a wait list, and if you are in the same position as me: you want a new job, but you would like to do job interviews via text, please sign up. If there are enough people on the wait list, I will start a new platform, and try to convince other companies use this completely untapped source for new tech talent.<p>Wait list for developers: https://docs.google.com/forms/d/e/1FAIpQLScxkdroJ4NrOZFi_HTwEtR7szPKg4uQE_1WUEH9vuEznOEvZw/viewform<p>If you are hiring and are interested in this, sign up here: https://docs.google.com/forms/d/e/1FAIpQLSePfriC4xwSEUbw8u05UGfLUVpyGBGS79wFInEYrqQnYxPxJA/viewform",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "wnm",
    "url": "https://news.ycombinator.com/user?id=wnm"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30501840",
  "sameAs": "https://news.ycombinator.com/item?id=30501840",
  "dateCreated": "2022-02-28T16:45:59.445Z",
  "datePublished": "2022-02-28T16:39:33.000Z",
  "dateModified": "2022-02-28T16:45:59.445Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 谁会对基于文本的工作面试平台感兴趣？",
  "headline_zh-Hant": "Ask HN: 誰會對基於文本的工作面試平臺感興趣？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我目前正在寻找一份新工作，我有一个问题：我绝对讨厌工作面试。我对它们有一种非理性的恐惧。我非常焦虑，在面试前几天无法入睡。在面试期间，我是最糟糕的自己，我的大脑只是关闭了。我无法回答基本问题，给人的印象是我不知道自己在说什么。<p>我有10年的专业经验，我有一份好的简历，我认为我实际上很擅长我的工作。但我不认为我会得到这样的工作。(而且我已经不怎么找了，因为我不想再让自己陷入这种境地)<p>所以我想：如果这种情况发生在我身上，那就一定会发生在其他人身上！<p>肯定有成千上万的优秀开发人员没有换工作，没有申请到他们最适合的职位，只是因为他们厌恶求职面试，害羞、内向或有社交焦虑......<p>而公司正在错过优秀的开发人员。他们基本上是在过滤那些不擅长面试的人。我明白，对于某些公司或某些职位来说，通过电话或视频聊天是工作的一部分。但对于（每一个）软件开发人员的工作来说就不是这样了吗？<p>我知道至少有一家公司，Automattic，正在通过文本进行他们的工作面试。<p>也许还有更多？<p>我正在启动一个等待名单，如果你和我有同样的情况：你想要一份新工作，但你想通过短信进行工作面试，请注册。如果等待名单上有足够多的人，我将启动一个新的平台，并试图说服其他公司使用这个完全未开发的新技术人才来源。<p>开发人员的等待名单：https://docs.google.com/forms/d/e/1FAIpQLScxkdroJ4NrOZFi_HTwEtR7szPKg4uQE_1WUEH9vuEznOEvZw/viewform<p>如果你正在招聘并对此感兴趣，请在这里注册：https://docs.google.com/forms/d/e/1FAIpQLSePfriC4xwSEUbw8u05UGfLUVpyGBGS79wFInEYrqQnYxPxJA/viewform",
  "description_zh-Hant": "我目前正在尋找一份新工作，我有一個問題：我絕對討厭工作面試。我對它們有一種非理性的恐懼。我非常焦慮，在面試前幾天無法入睡。在面試期間，我是最糟糕的自己，我的大腦只是關閉了。我無法回答基本問題，給人的印象是我不知道自己在說什麼。<p>我有10年的專業經驗，我有一份好的簡歷，我認為我實際上很擅長我的工作。但我不認為我會得到這樣的工作。(而且我已經不怎麼找了，因為我不想再讓自己陷入這種境地)<p>所以我想：如果這種情況發生在我身上，那就一定會發生在其他人身上！<p>肯定有成千上萬的優秀開發人員沒有換工作，沒有申請到他們最適合的職位，只是因為他們厭惡求職面試，害羞、內向或有社交焦慮......<p>而公司正在錯過優秀的開發人員。他們基本上是在過濾那些不擅長面試的人。我明白，對於某些公司或某些職位來說，通過電話或視頻聊天是工作的一部分。但對於（每一個）軟件開發人員的工作來說就不是這樣了嗎？<p>我知道至少有一家公司，Automattic，正在通過文本進行他們的工作面試。<p>也許還有更多？<p>我正在啟動一個等待名單，如果你和我有同樣的情況：你想要一份新工作，但你想通過短信進行工作面試，請註冊。如果等待名單上有足夠多的人，我將啟動一個新的平臺，並試圖說服其他公司使用這個完全未開發的新技術人才來源。<p>開發人員的等待名單：https://docs.google.com/forms/d/e/1FAIpQLScxkdroJ4NrOZFi_HTwEtR7szPKg4uQE_1WUEH9vuEznOEvZw/viewform<p>如果你正在招聘並對此感興趣，請在這裡註冊：https://docs.google.com/forms/d/e/1FAIpQLSePfriC4xwSEUbw8u05UGfLUVpyGBGS79wFInEYrqQnYxPxJA/viewform"
}