{
  "@type": "NewsArticle",
  "identifier": "2022--04--08--en--askhn--HackerNews--NewsArticle--30960211",
  "url": "https://news.ycombinator.com/item?id=30960211",
  "headline": "Ask HN: Finding a new role in a new industry",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN. I am in my late 30s working and have been working for the same company for around 10 years. My role has ranged from consulting to product management to now sales and business development. Responding to RFPs is definitely not my dream and I have been considering a career change but I am not stuck on what to pursue. Being a pure product manager is one possibility but I do like customer engagement and really understanding the issues and concerns clients have.<p>The other part of this is that I am in an industry that isn't really changing all that much. There's a lot of consolidation and we're not seeing tremendous growth in sales, in fact the writing is on the wall that our competitors are making more strides than us.<p>Any tips on positioning myself, my resume, etc. for the correct role? Do I cast a wide net and just hope to get bites? My worry is being able to even get a foot in the door because I have no relevant industry experience outside of the one I am in.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pdx_flyer",
    "url": "https://news.ycombinator.com/user?id=pdx_flyer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30960211",
  "sameAs": "https://news.ycombinator.com/item?id=30960211",
  "dateCreated": "2022-04-08T17:51:18.525Z",
  "datePublished": "2022-04-08T17:43:43.000Z",
  "dateModified": "2022-04-08T17:51:18.525Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在新的行业中寻找新的角色",
  "headline_zh-Hant": "Ask HN: 在新的行業中尋找新的角色",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN。我已经30多岁了，一直在为同一家公司工作了10年左右。我的角色从咨询到产品管理再到现在的销售和业务发展。回复征求意见稿绝对不是我的梦想，我一直在考虑改变职业，但我不知道要追求什么。成为一名纯粹的产品经理是一种可能，但我确实喜欢与客户接触，并真正了解客户的问题和关切。<p>另一部分原因是，我所处的行业其实并没有什么变化。有很多整合，我们没有看到巨大的销售增长，事实上，我们的竞争对手比我们取得了更大的进步。<p>在为自己和我的简历等定位方面有什么提示？我是否要广撒网，并希望能有机会上钩？我担心的是，由于我在我所处的行业之外没有任何相关的行业经验，我甚至无法踏入这扇门一步。",
  "description_zh-Hant": "你好，HN。我已經30多歲了，一直在為同一家公司工作了10年左右。我的角色從諮詢到產品管理再到現在的銷售和業務發展。回覆徵求意見稿絕對不是我的夢想，我一直在考慮改變職業，但我不知道要追求什麼。成為一名純粹的產品經理是一種可能，但我確實喜歡與客戶接觸，並真正瞭解客戶的問題和關切。<p>另一部分原因是，我所處的行業其實並沒有什麼變化。有很多整合，我們沒有看到巨大的銷售增長，事實上，我們的競爭對手比我們取得了更大的進步。<p>在為自己和我的簡歷等定位方面有什麼提示？我是否要廣撒網，並希望能有機會上鉤？我擔心的是，由於我在我所處的行業之外沒有任何相關的行業經驗，我甚至無法踏入這扇門一步。"
}