{
  "@type": "NewsArticle",
  "identifier": "2022--04--07--en--askhn--HackerNews--NewsArticle--30946641",
  "url": "https://news.ycombinator.com/item?id=30946641",
  "headline": "Ask HN: How do you avoid video game addiction?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm a mid 30s male, software developer, married without children.<p>I started playing a video game at the end of 2019, and played every time I could when my wife was not home. Then came 2020, covid lockdowns, also I started getting better at the game (the ladder systems are so addictive) and played more. In 2021 I just didn't care anymore whether my wife was home or not or even if I was supposed to be working and started playing all the time. I'd wake up early to play and would go to bed late to catch up with work I had not done during the day.<p>According to Steam I played over 2.000 hours during 2020 and 2021.<p>Finally I decided I was seriously addicted and uninstalled the game, unsubscribed from everyone related to the game in youtube, quit all discord communities, and it worked.<p>I have been now &quot;clean&quot; for 4 months. But sometimes I crave to go back and play. I watched a youtube video in incognito recently of some famous player and had so much urge to play again. But I'm afraid just by installing the game I will be going back to the addiction.<p>Is it possible to have a &quot;healthy&quot; amount of playing? Let's say just a couple of hours in the weekends? The only reason I think I have been able to not play for 4 months is because it's time consuming for me to download/install the game again, set my keyboard shortcuts, etc. It will take at least 1 hour for me to set up everything and that's what is preventing me to go back. But if I had the game available and ready to launch in a click I am not sure I would be able to play only some hours on the weekends.<p>What I love about this particular game is how I can totally focus mind and body for each 30-40 minutes match where I won't take a look at my cellphone or anything can distract me really because I'm totally focused basically in a real &quot;flow&quot; state. Of course it's a flow state for something irrelevant to my life or society, so it's basically a waste of time I guess... But I also don't have the change to get to this flow state in my day job or in other activity really, adult life can be so boring sometimes...<p>Really curious if someone else has experienced something similar",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Volrath89",
    "url": "https://news.ycombinator.com/user?id=Volrath89"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30946641",
  "sameAs": "https://news.ycombinator.com/item?id=30946641",
  "dateCreated": "2022-04-07T16:45:39.814Z",
  "datePublished": "2022-04-07T16:23:37.000Z",
  "dateModified": "2022-04-07T16:45:39.814Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 21
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 19
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何避免电子游戏成瘾？",
  "headline_zh-Hant": "Ask HN: 如何避免電子遊戲成癮？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一名30多岁的男性，软件开发人员，已婚无子女。<p>我在2019年底开始玩一款电子游戏，每当我妻子不在家的时候就玩。然后到了2020年，covid锁定，同时我开始在游戏中变得更好（天梯系统让人上瘾），玩得更多。2021年，我不再关心我妻子是否在家，甚至我是否应该工作，开始一直在玩。<p>根据Steam的数据，我在2020年和2021年期间玩了超过2000个小时。<p>最后我决定我已经严重上瘾了，于是卸载了游戏，退订了youtube上所有与游戏有关的人，退出了所有的discord社区，这才有了效果。但有时我很想回去玩。最近我在隐身状态下看了一个Youtube视频，里面有一些著名的玩家，我有很大的冲动想再玩一次。但我担心只要安装了这个游戏，我就会重新上瘾。<p>有没有可能有一个&quot;健康&quot;的游戏量？比方说，在周末的时候只玩几个小时？我认为我能够4个月不玩的唯一原因是，对我来说，重新下载/安装游戏、设置键盘快捷键等都很耗时。我至少要花1个小时来设置一切，这就是阻碍我回去的原因。<p>我喜欢这个特别的游戏的原因是，在每场30-40分钟的比赛中，我可以完全集中精神和身体，我不会看一眼我的手机或任何东西可以分散我的注意力，因为我基本上完全集中在一个真正的 \"流 \"的状态。当然，这是一个与我的生活或社会无关的流动状态，所以它基本上是在浪费时间，我想...... 但我在日常工作或其他活动中也没有变化，无法达到这种流动状态，成人的生活有时会很无聊......<p>真的很好奇是否有人有类似的经历",
  "description_zh-Hant": "我是一名30多歲的男性，軟件開發人員，已婚無子女。<p>我在2019年底開始玩一款電子遊戲，每當我妻子不在家的時候就玩。然後到了2020年，covid鎖定，同時我開始在遊戲中變得更好（天梯系統讓人上癮），玩得更多。2021年，我不再關心我妻子是否在家，甚至我是否應該工作，開始一直在玩。<p>根據Steam的數據，我在2020年和2021年期間玩了超過2000個小時。<p>最後我決定我已經嚴重上癮了，於是卸載了遊戲，退訂了youtube上所有與遊戲有關的人，退出了所有的discord社區，這才有了效果。但有時我很想回去玩。最近我在隱身狀態下看了一個Youtube視頻，裡面有一些著名的玩家，我有很大的衝動想再玩一次。但我擔心只要安裝了這個遊戲，我就會重新上癮。<p>有沒有可能有一個&quot;健康&quot;的遊戲量？比方說，在週末的時候只玩幾個小時？我認為我能夠4個月不玩的唯一原因是，對我來說，重新下載/安裝遊戲、設置鍵盤快捷鍵等都很耗時。我至少要花1個小時來設置一切，這就是阻礙我回去的原因。<p>我喜歡這個特別的遊戲的原因是，在每場30-40分鐘的比賽中，我可以完全集中精神和身體，我不會看一眼我的手機或任何東西可以分散我的注意力，因為我基本上完全集中在一個真正的 \"流 \"的狀態。當然，這是一個與我的生活或社會無關的流動狀態，所以它基本上是在浪費時間，我想...... 但我在日常工作或其他活動中也沒有變化，無法達到這種流動狀態，成人的生活有時會很無聊......<p>真的很好奇是否有人有類似的經歷"
}