{
  "@type": "NewsArticle",
  "identifier": "2022--02--21--en--askhn--HackerNews--NewsArticle--30415724",
  "url": "https://news.ycombinator.com/item?id=30415724",
  "headline": "Ask HN: How do you manage legal documents",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi guys,<p>I have started to digitalise my legal documents - contracts, warranties, bills etc. I am scanning them to PDFs. Currently, I have hundred documents scanned already.<p>In the beginning, I tried to create directory structure and save files in appropriate directories. But the more documents I scan, the more cumbersome it becomes. Sometimes I want one file to be in multiple directories etc.<p>How do you manage your digital version of legal documents? Or even, is it worth it to digitalise them (for you)? At least where I come from (Czech Republic) we are required to keep the paper originals for about 10 years. But I see this digitalisation as organization and accessibility improvement.<p>If I could build my dream software, it should have the following features:\n- Tagging support - so one file could be assigned to multiple &quot;types&quot; like bill, family, leasing, ...\n- Reminders and alarms - So I could set alarm for expiration dates, recurring payments, ...\n- Phone and PC support - Sometimes, I don`t have scanner at hand. Taking picture from my phone which would be uploaded and processed on the server would help a lot. The same way, files should be available from my phone. \n- OCR - So the full text of the document is searchable.<p>Preferably, it would be some online platform, which allows to share documents with other people - I work in small firm and some documents may be shared between multiple people.<p>Thank you in advance.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "maljacz",
    "url": "https://news.ycombinator.com/user?id=maljacz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30415724",
  "sameAs": "https://news.ycombinator.com/item?id=30415724",
  "dateCreated": "2022-02-21T13:39:37.634Z",
  "datePublished": "2022-02-21T13:38:55.000Z",
  "dateModified": "2022-02-21T13:39:37.634Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何管理法律文件",
  "headline_zh-Hant": "Ask HN: 你如何管理法律文件",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>我已经开始将我的法律文件数字化--合同、保证书、账单等等。我正在把它们扫描成PDF文件。目前，我已经扫描了上百份文件。<p>一开始，我试图创建目录结构并将文件保存在适当的目录下。但我扫描的文件越多，就变得越麻烦。有时我想把一个文件放在多个目录里，等等。<p>你是如何管理你的数字版法律文件的？甚至，将它们数字化（对你来说）是否值得？至少在我的家乡（捷克共和国），我们被要求保留纸质原件大约10年。但我认为这种数字化是对组织和可访问性的改进。<p>如果我可以建立我的梦想软件，它应该有以下功能。\n- 支持标签 - 所以一个文件可以被分配到多个&quot;类型&quot;，如账单，家庭，租赁，...\n- 提醒和警报 - 所以我可以为到期日、定期付款设置警报，...\n- 电话和电脑支持 - 有时，我手头没有扫描仪。用我的手机拍照，然后上传到服务器上处理，会有很大的帮助。同样地，我的手机也应该可以提供文件。\n- OCR--这样就可以搜索到文件的全文。<p>最好是一些在线平台，允许与其他人共享文件--我在小公司工作，有些文件可能会在多人之间共享。",
  "description_zh-Hant": "大家好，<p>我已經開始將我的法律文件數字化--合同、保證書、賬單等等。我正在把它們掃描成PDF文件。目前，我已經掃描了上百份文件。<p>一開始，我試圖創建目錄結構並將文件保存在適當的目錄下。但我掃描的文件越多，就變得越麻煩。有時我想把一個文件放在多個目錄裡，等等。<p>你是如何管理你的數字版法律文件的？甚至，將它們數字化（對你來說）是否值得？至少在我的家鄉（捷克共和國），我們被要求保留紙質原件大約10年。但我認為這種數字化是對組織和可訪問性的改進。<p>如果我可以建立我的夢想軟件，它應該有以下功能。\n- 支持標籤 - 所以一個文件可以被分配到多個&quot;類型&quot;，如賬單，家庭，租賃，...\n- 提醒和警報 - 所以我可以為到期日、定期付款設置警報，...\n- 電話和電腦支持 - 有時，我手頭沒有掃描儀。用我的手機拍照，然後上傳到服務器上處理，會有很大的幫助。同樣地，我的手機也應該可以提供文件。\n- OCR--這樣就可以搜索到文件的全文。<p>最好是一些在線平臺，允許與其他人共享文件--我在小公司工作，有些文件可能會在多人之間共享。"
}