{
  "@type": "NewsArticle",
  "identifier": "2022--04--12--en--askhn--HackerNews--NewsArticle--30998586",
  "url": "https://news.ycombinator.com/item?id=30998586",
  "headline": "Ask HN: Do you feel bad for having a good job?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "When I interact with people who have demanding jobs that give them little pay or respect, I feel bad because I'm younger than they are, but I make much more money doing much more comfortable work.<p>You might say I &quot;deserve&quot; my current place in life. Nothing has been handed to me, and I'm unusually smart and hard working. But I believe that I was born smart, and I've always had a compulsion to work hard.<p>I feel uncomfortable interacting with people of lower social classes. I don't care what they think about me. I just feel bad that they might lack respect or comfort in their work, or that their general life position may be unpleasant.<p>I give rather large tips, but it doesn't make me feel better. I usually tell myself that they probably greatly appreciate the jobs that they have and are using it as a stepping stone to achieve their dreams - that makes me feel better. I've also decided to stop avoiding discomfort/pain in my life, which makes me feel better.<p>Do you experience this? How do you deal with it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "paulwooden",
    "url": "https://news.ycombinator.com/user?id=paulwooden"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30998586",
  "sameAs": "https://news.ycombinator.com/item?id=30998586",
  "dateCreated": "2022-04-12T04:42:24.873Z",
  "datePublished": "2022-04-12T04:20:19.000Z",
  "dateModified": "2022-04-12T04:42:24.873Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你会因为有一份好工作而感到难过吗？",
  "headline_zh-Hant": "Ask HN: 你會因為有一份好工作而感到難過嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "当我与那些从事苛刻工作的人交流时，我感到很难过，因为我比他们年轻，但我赚的钱要多得多，做的工作也更舒服。没有什么是别人给我的，而且我异常的聪明和努力工作。但我相信我生来就很聪明，而且我一直有一种努力工作的强迫症。<p>我觉得与社会地位较低的人交往很不舒服。我不在乎他们对我有什么看法。我只是觉得他们在工作中可能缺乏尊重或舒适感，或者他们的一般生活地位可能不令人愉快。<p>我给的小费相当多，但这并没有让我感觉更好。我通常会告诉自己，他们可能非常感谢他们所拥有的工作，并将其作为实现梦想的垫脚石--这让我感觉好些。我还决定不再回避生活中的不适/痛苦，这让我感觉更好。<p>你有这种经历吗？你是如何处理的？",
  "description_zh-Hant": "當我與那些從事苛刻工作的人交流時，我感到很難過，因為我比他們年輕，但我賺的錢要多得多，做的工作也更舒服。沒有什麼是別人給我的，而且我異常的聰明和努力工作。但我相信我生來就很聰明，而且我一直有一種努力工作的強迫症。<p>我覺得與社會地位較低的人交往很不舒服。我不在乎他們對我有什麼看法。我只是覺得他們在工作中可能缺乏尊重或舒適感，或者他們的一般生活地位可能不令人愉快。<p>我給的小費相當多，但這並沒有讓我感覺更好。我通常會告訴自己，他們可能非常感謝他們所擁有的工作，並將其作為實現夢想的墊腳石--這讓我感覺好些。我還決定不再回避生活中的不適/痛苦，這讓我感覺更好。<p>你有這種經歷嗎？你是如何處理的？"
}