{
  "@type": "NewsArticle",
  "identifier": "2022--04--10--en--askhn--HackerNews--NewsArticle--30982655",
  "url": "https://news.ycombinator.com/item?id=30982655",
  "headline": "Ask HN: Do you think cookie prompts on websites are a bad thing?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "It's very common for people to complain about how many things clutter the screen in 'the modern web', and this has definitely come up on HN. People seem to strongly dislike cookie prompts, and I wonder why?<p>For one, it's a tiny point of friction - if the site is optimized it shows up quickly and you can click OK in a second. Are we so sensitive to minor inconvenience? I thought about this just now while opening a site and having to accept cookies, and it being really quick if slightly annoying.<p>Second, is this not a good inconvenience to have? Another common complaint about the modern web is the lack of privacy and sites being heavy with reliance on JS and just not being optimized. Having these toggles means the site presumably has to work without cookies, which seems good?<p>Lastly, the laws that require this represent protection of our data. While cookies may not be a huge deal, I do think acceptance of such legislation could enable further requirements about what data is collected and can be deleted. Is this too optimistic?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "andreyk",
    "url": "https://news.ycombinator.com/user?id=andreyk"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30982655",
  "sameAs": "https://news.ycombinator.com/item?id=30982655",
  "dateCreated": "2022-04-10T23:10:20.635Z",
  "datePublished": "2022-04-10T23:05:53.000Z",
  "dateModified": "2022-04-10T23:10:20.635Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 你认为网站上的cookie提示是一件坏事吗？",
  "headline_zh-Hant": "Ask HN: 你認為網站上的cookie提示是一件壞事嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "人们抱怨 \"现代网络 \"中有多少东西使屏幕杂乱无章是很常见的，这一点在HN上肯定也出现过。人们似乎非常不喜欢cookie提示，我想知道为什么？<p>其一，这是一个微小的摩擦点--如果网站经过优化，它很快就会显示出来，你可以在一秒钟内点击确定。我们对微小的不便如此敏感吗？我刚才在打开一个网站时想到了这一点，而且必须接受cookie，这真的很快，尽管稍微有点烦人。<p>其次，这不是一个好的不便吗？关于现代网络的另一个常见的抱怨是缺乏隐私，而且网站严重依赖JS，只是没有被优化。有了这些切换意味着网站可能必须在没有cookie的情况下工作，这似乎很好？<p>最后，要求这样做的法律代表了对我们数据的保护。虽然cookie可能不是什么大问题，但我确实认为接受这样的法律可以使我们对哪些数据被收集和可以被删除有进一步的要求。这是不是太乐观了？",
  "description_zh-Hant": "人們抱怨 \"現代網絡 \"中有多少東西使屏幕雜亂無章是很常見的，這一點在HN上肯定也出現過。人們似乎非常不喜歡cookie提示，我想知道為什麼？<p>其一，這是一個微小的摩擦點--如果網站經過優化，它很快就會顯示出來，你可以在一秒鐘內點擊確定。我們對微小的不便如此敏感嗎？我剛才在打開一個網站時想到了這一點，而且必須接受cookie，這真的很快，儘管稍微有點煩人。<p>其次，這不是一個好的不便嗎？關於現代網絡的另一個常見的抱怨是缺乏隱私，而且網站嚴重依賴JS，只是沒有被優化。有了這些切換意味著網站可能必須在沒有cookie的情況下工作，這似乎很好？<p>最後，要求這樣做的法律代表了對我們數據的保護。雖然cookie可能不是什麼大問題，但我確實認為接受這樣的法律可以使我們對哪些數據被收集和可以被刪除有進一步的要求。這是不是太樂觀了？"
}