{
  "@type": "NewsArticle",
  "identifier": "2022--03--23--en--askhn--HackerNews--NewsArticle--30777224",
  "url": "https://news.ycombinator.com/item?id=30777224",
  "headline": "Ask HN: Why is contributing to existing open source projects so hard?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm trying to get into open source development, and I've made a few attempts in the last year or so. It was always small bug fixes or enhancements to existing project, and the experience was consistently terrible. It made me wonder how developers get into seriously contributing to these projects - and whether it's even possible.<p>The main hurdle I encountered is simply lack of response from the project maintainers. This happened to me several times already: I would encounter a bug or limitation, investigate the cause, fix it, and open a pull request with as many details as I could about the issue and how I fixed it. This requires several hours of work - understanding the project structure, testing the fix, adding unit tests, and so on. You could say I did my homework. Then I waited, and waited, and waited…<p>The last time this happened was the most representative. I don't want to call out any specific projects - that would seem unfair - it's a well-known open source project that originates from a FAANG-level company, popular enough to appear on CVs. It's one of those libraries that is used everywhere. I encountered a bug in that library, and opened the most detailed issue I could, even pointed to specific lines of code and what needs to be changed there. Due to my previous experience, I didn't open a PR yet. I wanted to get confirmation on my observation first, and I mentioned in the issue that after getting confirmation that my direction is correct I would open a PR. The result? Complete silence. This was 2 weeks ago - should I expect to wait more for a response?<p>I understand that these are open source projects, and that the maintainers don't owe me anything, and so on. I'm just wondering if I'm doing something wrong. Do others here have similar experiences? How would someone get seriously involved in such a project, if just making the first steps is met with such roadblocks? This reminds me of xkcd #2347, where all modern digital infrastructure depends on &quot;a project some random person in Nebraska has been thanklessly maintaining since 2003&quot;. It's like I want to help that person, but they aren't answering my calls.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tomerv",
    "url": "https://news.ycombinator.com/user?id=tomerv"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30777224",
  "sameAs": "https://news.ycombinator.com/item?id=30777224",
  "dateCreated": "2022-03-23T11:24:50.271Z",
  "datePublished": "2022-03-23T11:11:39.000Z",
  "dateModified": "2022-03-23T11:24:50.271Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么为现有的开源项目做贡献这么难？",
  "headline_zh-Hant": "Ask HN: 為什麼為現有的開源項目做貢獻這麼難？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我正在尝试进入开源开发，在过去一年左右的时间里，我做了一些尝试。这总是一些小的错误修复或对现有项目的改进，而且经验一直很糟糕。这让我想知道开发者是如何认真地为这些项目做贡献的--以及这是否可能。<p>我遇到的主要障碍是缺乏来自项目维护者的回应。这种情况已经发生在我身上好几次了。我遇到了一个错误或限制，调查了原因，修复了它，然后打开一个拉动请求，并尽可能多地提供关于这个问题和我如何修复它的细节。这需要几个小时的工作--了解项目结构，测试修复，添加单元测试，等等。你可以说我做了功课。然后我等待，等待，再等待......<p>最后一次发生这种情况是最具代表性的。我不想叫出任何具体的项目--那似乎不公平--这是一个知名的开源项目，源于一家FAANG级别的公司，受欢迎到足以出现在简历上。它是那些到处都在使用的库之一。我在那个库中遇到了一个错误，并打开了我能打开的最详细的问题，甚至指出了具体的代码行以及那里需要修改的内容。由于我以前的经验，我还没有打开一个PR。我想先对我的观察进行确认，我在问题中提到，在得到确认我的方向是正确的之后，我会开一个PR。结果呢？完全沉默了。这是两周前的事了--我是否应该期待更多的回应？<p>我知道这些是开源项目，维护者不欠我什么，等等。我只是想知道我是否做错了什么。这里的其他人有类似的经历吗？如果仅仅是迈出第一步就遇到了这样的障碍，有人会如何认真参与这样的项目？这让我想起了xkcd #2347，所有的现代数字基础设施都依赖于&quot;一个在内布拉斯加的某个随机的人从2003年以来一直不遗余力地维护的项目&quot;。这就像我想帮助那个人，但他们不接我的电话。",
  "description_zh-Hant": "我正在嘗試進入開源開發，在過去一年左右的時間裡，我做了一些嘗試。這總是一些小的錯誤修復或對現有項目的改進，而且經驗一直很糟糕。這讓我想知道開發者是如何認真地為這些項目做貢獻的--以及這是否可能。<p>我遇到的主要障礙是缺乏來自項目維護者的迴應。這種情況已經發生在我身上好幾次了。我遇到了一個錯誤或限制，調查了原因，修復了它，然後打開一個拉動請求，並儘可能多地提供關於這個問題和我如何修復它的細節。這需要幾個小時的工作--瞭解項目結構，測試修復，添加單元測試，等等。你可以說我做了功課。然後我等待，等待，再等待......<p>最後一次發生這種情況是最具代表性的。我不想叫出任何具體的項目--那似乎不公平--這是一個知名的開源項目，源於一家FAANG級別的公司，受歡迎到足以出現在簡歷上。它是那些到處都在使用的庫之一。我在那個庫中遇到了一個錯誤，並打開了我能打開的最詳細的問題，甚至指出了具體的代碼行以及那裡需要修改的內容。由於我以前的經驗，我還沒有打開一個PR。我想先對我的觀察進行確認，我在問題中提到，在得到確認我的方向是正確的之後，我會開一個PR。結果呢？完全沉默了。這是兩週前的事了--我是否應該期待更多的迴應？<p>我知道這些是開源項目，維護者不欠我什麼，等等。我只是想知道我是否做錯了什麼。這裡的其他人有類似的經歷嗎？如果僅僅是邁出第一步就遇到了這樣的障礙，有人會如何認真參與這樣的項目？這讓我想起了xkcd #2347，所有的現代數字基礎設施都依賴於&quot;一個在內布拉斯加的某個隨機的人從2003年以來一直不遺餘力地維護的項目&quot;。這就像我想幫助那個人，但他們不接我的電話。"
}