{
  "@type": "NewsArticle",
  "identifier": "2022--03--21--en--askhn--HackerNews--NewsArticle--30753186",
  "url": "https://news.ycombinator.com/item?id=30753186",
  "headline": "Ask HN: Whose business operates without email?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Is anyone successfully operating a business without email? Please describe pros, cons, how you got there, etc.<p>Rant:<p>I'm sick of email. It's become the &quot;universal inbox&quot;. We never predicted just how awful that would be. Let me count the ways...<p>Chat. Email has become live chat, despite more suitable platforms existing. I first saw this with Blackberry, but this is now prevalent in white-collar industries. People expect rapid responses. This is hugely detrimetal to morale and work-life balance.<p>Fire-and-forget. Optional bonus: workload shuffling. We all send emails like &quot;Here's X, let me know if/when Y&quot; and tick-off a todo item. But this is emblematic of a terrible workflow: get it off my desk ASAP and off-load responsibility to someone else. Inevitably this multiplies someone else's workload and encourages short-termism. The individual looks productive to management, since their throughput is high, but they're contributing to a pervasive syrup which clogs the business and lowers morale.<p>Work multiplier. You get am email from a superior: &quot;I can't find X, please send&quot;. You know X is in their mail archive/shared drive because you sent it to them/put it there, but their inability to find it means extra work for you. (Yes, this problem exists outside email, but email is a major force-magnifier here.) When you receive the email &quot;Here's X, let me know if/when Y&quot;, how do you handle it? Pin it, flag it, put a note in the calendar for the date, identify what Y involves, and... fire off a few emails?<p>Workflow management. Sure, &quot;inbox zero&quot;, &quot;GTD&quot;, etc, but there are an <i>infinite</i> number of ways individuals <i>actually</i> manage their work via email. Large orgs train staff how to &quot;effectively use email&quot;, inevitably involving poorly thought out workflows which favour certain types of individual and leaves no room for others. Email gets mangled to fit ad-hoc solutions, and the solutions are perennially updated to deal with shortcomings. It's a vicious circle.<p>Knowledge base. Enabled by ubiquitous search, knowledge is dumped into email. This seems reasonable, but I've experienced real issues with this. Email is managed differently from knowledge bases. I had to move depts within an org once, entailing a change in email address, and hence account. The IT dept could not guarantee that I would retain access to my email archive. Yikes!<p>Audit trail. Like the knowledge base, but more personal. Who did what, when. Weaponised during one-to-ones and meetings with HR.<p>Magic. Email functionality is tightly entwined with calendaring and more. If I delete the email, will the calendar item be cancelled? If I cancel a meeting, will everyone get an email? Why can some people see the Teams button but some can't? Why do some emails in Gmail offer to track a delivery, add to calendar, etc? I want colleagues to <i>understand</i> what's going on, but nobody is confident how these things operate. It's all magic.<p>Silos. Self-hosting email has become non-trivial, see HN conversations passim [0]. The incumbents (Gmail, Outlook, Mailgun, Sendgrid, etc etc) effectively determine what constiutes spam, making it risky to use anyone other than the major operators. The silos don't always interoperate well; hence &quot;magic&quot;. Silo providers are also keen to exploit data, with obvious concerns for privacy.<p>Privacy. Plenty on this elsewhere. Silo providers read your emails, calendars, documents, etc etc. Yuck.<p>Identity. Email is synonymous with online identity, despite being unencrypted, non-private, and riddled with other design features which make it orthogonal to identity provision.<p>To pre-empt, a lot of these problems would exist without email. I'm still interested in how you'd cope with these issues if email ceased to exist. Perhaps email is simply &quot;surfacing&quot; the real, underlying issues.<p>Edit: perhaps <i>external</i> comms will always require email e.g. with Governments and service providers. If so, is it possible to get rid of email for internal comms?<p>Thanks all :)<p>[0] https://hn.algolia.com/?query=self-hosted%20email",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "austinjp",
    "url": "https://news.ycombinator.com/user?id=austinjp"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30753186",
  "sameAs": "https://news.ycombinator.com/item?id=30753186",
  "dateCreated": "2022-03-21T12:51:37.075Z",
  "datePublished": "2022-03-21T12:18:00.000Z",
  "dateModified": "2022-03-21T12:51:37.075Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 谁的业务运作没有电子邮件？",
  "headline_zh-Hant": "Ask HN: 誰的業務運作沒有電子郵件？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "是否有人在没有电子邮件的情况下成功经营企业？请描述优点、缺点、你是如何做到的，等等。<p>咆哮：<p>我厌恶电子邮件。它已经成为 \"通用收件箱\"。我们从未预料到这将是多么可怕的事情。让我数一数......<p>聊天。尽管存在更多合适的平台，但电子邮件已经成为实时聊天。我第一次看到这种情况是在黑莓手机上，但现在这种情况在白领行业很普遍。人们希望得到快速回应。这对士气和工作与生活的平衡是非常不利的。<p>火烧眉毛。可选的奖励：工作量的调整。我们都会发送类似 \"这里是X，如果/何时有Y，请告诉我 \"的电子邮件，并勾选一个待办项目。但这是一个糟糕的工作流程的象征：尽快把它从我的桌子上拿下来，把责任推给别人。这不可避免地增加了别人的工作量，鼓励了短期行为。在管理层看来，这个人的工作效率很高，因为他们的产量很高，但他们却在为一种普遍存在的糖浆做贡献，这种糖浆堵塞了业务，降低了士气。你收到一封来自上司的电子邮件：&quot;我找不到X，请发送&quot;。你知道X在他们的邮件档案/共享驱动器中，因为你把它发送给他们/放在那里，但他们无法找到它意味着你的额外工作。(是的，这个问题在电子邮件之外也存在，但电子邮件在这里是一个主要的力量放大器。) 当你收到电子邮件&quot;这是X，如果/当Y&quot;时请告诉我，你如何处理它？Pin it, flag it, put a note in the calendar for the date, identify what Y involves, and... fire off a few emails?<p>Workflow management. Sure, &quot;inbox zero&quot;, &quot;GTD&quot;, etc, but there are an <i>infinite</i> number of ways individuals <i>actually</i> manage their work via email. 大型企业培训员工如何有效地使用电子邮件，不可避免地涉及考虑不周的工作流程，这有利于某些类型的人，而没有给其他人留下空间。电子邮件被扭曲以适应临时的解决方案，而这些解决方案又被不断地更新以处理缺点。这是一个恶性循环。<p>知识库。在无处不在的搜索的推动下，知识被倾倒在电子邮件中。这似乎是合理的，但我经历过这方面的实际问题。电子邮件的管理方式与知识库不同。有一次，我不得不在一个组织内转移部门，这就需要改变电子邮件地址，从而改变账户。IT部门不能保证我可以保留对我的电子邮件档案的访问。呀！<p>审计线索。就像知识库一样，但更个人化。谁做了什么，什么时候做的。在一对一和与人力资源部门的会议上，它是一种武器。<p>神奇。电子邮件功能与日历和其他功能紧密相连。如果我删除电子邮件，日历项目会被取消吗？如果我取消一个会议，每个人都会收到电子邮件吗？Why can some people see the Teams button but some can't? Why do some emails in Gmail offer to track a delivery, add to calendar, etc? I want colleagues to <i>understand</i> what's going on, but nobody is confident how these things operate. It's all magic.<p>Silos. 自我托管的电子邮件已经变得非同小可，见HN的对话段落[0]。在位者（Gmail、Outlook、Mailgun、Sendgrid等）有效地决定了什么是垃圾邮件，使得使用主要运营商以外的人有风险。筒仓并不总是能很好地互通有无；因此有 \"魔法 \"之称。筒仓供应商也热衷于利用数据，对隐私有明显的担忧。这方面的问题在其他地方有很多。筒仓提供商会读取你的电子邮件、日历、文件等等。讨厌。<p>身份。Email is synonymous with online identity, despite being unencrypted, non-private, and riddled with other design features which make it orthogonal to identity provision.<p>To pre-empt, a lot of these problems would exist without email. I'm still interested in how you'd cope with these issues if email ceased to exist. <p>编辑：也许<i>外部</i>通信将始终需要电子邮件，例如与政府和服务提供商的通信。如果是这样，是否有可能在内部通信中摆脱电子邮件？<p>谢谢大家 :)<p>[0] https://hn.algolia.com/?query=self-hosted%20email",
  "description_zh-Hant": "是否有人在沒有電子郵件的情況下成功經營企業？請描述優點、缺點、你是如何做到的，等等。<p>咆哮：<p>我厭惡電子郵件。它已經成為 \"通用收件箱\"。我們從未預料到這將是多麼可怕的事情。讓我數一數......<p>聊天。儘管存在更多合適的平臺，但電子郵件已經成為實時聊天。我第一次看到這種情況是在黑莓手機上，但現在這種情況在白領行業很普遍。人們希望得到快速回應。這對士氣和工作與生活的平衡是非常不利的。<p>火燒眉毛。可選的獎勵：工作量的調整。我們都會發送類似 \"這裡是X，如果/何時有Y，請告訴我 \"的電子郵件，並勾選一個待辦項目。但這是一個糟糕的工作流程的象徵：儘快把它從我的桌子上拿下來，把責任推給別人。這不可避免地增加了別人的工作量，鼓勵了短期行為。在管理層看來，這個人的工作效率很高，因為他們的產量很高，但他們卻在為一種普遍存在的糖漿做貢獻，這種糖漿堵塞了業務，降低了士氣。你收到一封來自上司的電子郵件：&quot;我找不到X，請發送&quot;。你知道X在他們的郵件檔案/共享驅動器中，因為你把它發送給他們/放在那裡，但他們無法找到它意味著你的額外工作。(是的，這個問題在電子郵件之外也存在，但電子郵件在這裡是一個主要的力量放大器。) 當你收到電子郵件&quot;這是X，如果/當Y&quot;時請告訴我，你如何處理它？Pin it, flag it, put a note in the calendar for the date, identify what Y involves, and... fire off a few emails?<p>Workflow management. Sure, &quot;inbox zero&quot;, &quot;GTD&quot;, etc, but there are an <i>infinite</i> number of ways individuals <i>actually</i> manage their work via email. 大型企業培訓員工如何有效地使用電子郵件，不可避免地涉及考慮不周的工作流程，這有利於某些類型的人，而沒有給其他人留下空間。電子郵件被扭曲以適應臨時的解決方案，而這些解決方案又被不斷地更新以處理缺點。這是一個惡性循環。<p>知識庫。在無處不在的搜索的推動下，知識被傾倒在電子郵件中。這似乎是合理的，但我經歷過這方面的實際問題。電子郵件的管理方式與知識庫不同。有一次，我不得不在一個組織內轉移部門，這就需要改變電子郵件地址，從而改變賬戶。IT部門不能保證我可以保留對我的電子郵件檔案的訪問。呀！<p>審計線索。就像知識庫一樣，但更個人化。誰做了什麼，什麼時候做的。在一對一和與人力資源部門的會議上，它是一種武器。<p>神奇。電子郵件功能與日曆和其他功能緊密相連。如果我刪除電子郵件，日曆項目會被取消嗎？如果我取消一個會議，每個人都會收到電子郵件嗎？Why can some people see the Teams button but some can't? Why do some emails in Gmail offer to track a delivery, add to calendar, etc? I want colleagues to <i>understand</i> what's going on, but nobody is confident how these things operate. It's all magic.<p>Silos. 自我託管的電子郵件已經變得非同小可，見HN的對話段落[0]。在位者（Gmail、Outlook、Mailgun、Sendgrid等）有效地決定了什麼是垃圾郵件，使得使用主要運營商以外的人有風險。筒倉並不總是能很好地互通有無；因此有 \"魔法 \"之稱。筒倉供應商也熱衷於利用數據，對隱私有明顯的擔憂。這方面的問題在其他地方有很多。筒倉提供商會讀取你的電子郵件、日曆、文件等等。討厭。<p>身份。Email is synonymous with online identity, despite being unencrypted, non-private, and riddled with other design features which make it orthogonal to identity provision.<p>To pre-empt, a lot of these problems would exist without email. I'm still interested in how you'd cope with these issues if email ceased to exist. <p>編輯：也許<i>外部</i>通信將始終需要電子郵件，例如與政府和服務提供商的通信。如果是這樣，是否有可能在內部通信中擺脫電子郵件？<p>謝謝大家 :)<p>[0] https://hn.algolia.com/?query=self-hosted%20email"
}