{
  "@type": "NewsArticle",
  "identifier": "2022--03--22--en--askhn--HackerNews--NewsArticle--30771963",
  "url": "https://news.ycombinator.com/item?id=30771963",
  "headline": "Ask HN: What makes you want to keep on reading README?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "When you visit some new or not so new open-source project's page, whether it's on Github or maybe it has some sort of website, what makes you want to keep on reading after you glanced over the title and the first paragraph of text?<p>I would like to specify that I only mean content here - not presentation. So imagine there's just plaintext and browsers are not capable of displaying anything else but it.<p>Of course we all know that a well written documentation in general is such a rarity in this world and there are, in truth, very few examples (FreeBSD comes to mind) of documentations that stand out simply because you can sense every single sentence was written by a human passionate about it and a human caring for his reader. But how to achieve that - is quite a different question too. Let's suppose this wonderfully written documentation is there.<p>How does one punch through the wall of indifference with just the title, a subtitle/tagline and one paragraph? What makes you care all of a sudden, even though a minute ago you couldn't even imagine you'd want to try this piece of software or at least read more about it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "smoochy",
    "url": "https://news.ycombinator.com/user?id=smoochy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30771963",
  "sameAs": "https://news.ycombinator.com/item?id=30771963",
  "dateCreated": "2022-03-22T21:50:00.698Z",
  "datePublished": "2022-03-22T21:43:17.000Z",
  "dateModified": "2022-03-22T21:50:00.698Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 是什么让你想继续阅读README？",
  "headline_zh-Hant": "Ask HN: 是什麼讓你想繼續閱讀README？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "当你访问一些新的或不太新的开源项目的页面时，不管它是在Github上还是有一些网站，是什么让你在扫过标题和第一段文字后还想继续阅读？<p>我想说明的是，我在这里只指内容--而不是表述。<p>当然，我们都知道，一般来说，写得好的文档在这个世界上是非常罕见的，事实上，有很少的例子（我想到了FreeBSD），这些文档之所以能脱颖而出，是因为你能感觉到每一句话都是由一个对它充满热情的人和一个关心读者的人写的。但如何实现这一点--也是一个相当不同的问题。<p>如何通过标题、副标题/标签行和一个段落来冲破冷漠的墙？是什么让你突然关心起来，尽管一分钟前你甚至无法想象你会想要尝试这款软件，或者至少要阅读更多关于它的信息？",
  "description_zh-Hant": "當你訪問一些新的或不太新的開源項目的頁面時，不管它是在Github上還是有一些網站，是什麼讓你在掃過標題和第一段文字後還想繼續閱讀？<p>我想說明的是，我在這裡只指內容--而不是表述。<p>當然，我們都知道，一般來說，寫得好的文檔在這個世界上是非常罕見的，事實上，有很少的例子（我想到了FreeBSD），這些文檔之所以能脫穎而出，是因為你能感覺到每一句話都是由一個對它充滿熱情的人和一個關心讀者的人寫的。但如何實現這一點--也是一個相當不同的問題。<p>如何通過標題、副標題/標籤行和一個段落來衝破冷漠的牆？是什麼讓你突然關心起來，儘管一分鐘前你甚至無法想象你會想要嘗試這款軟件，或者至少要閱讀更多關於它的信息？"
}