{
  "@type": "NewsArticle",
  "identifier": "2022--03--01--en--askhn--HackerNews--NewsArticle--30507359",
  "url": "https://news.ycombinator.com/item?id=30507359",
  "headline": "Ask HN: How can you be pro freedom and anti crypto?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Here's a list of things that I imagine the average HN user supports.<p>Freedom of the press<p>Freedom of speech<p>Encryption<p>Privacy<p>The Internet<p>Net neutrality<p>Open source<p>The above items are generally regarded as a net good to society. These technologies can be dangerous in the wrong hands, but what powerful technology isn't. So what I simply cannot understand, is how someone can be ideologically aligned with the above list, yet vehemently opposed to cryptocurrency.<p>Cryptocurrency encapsulates all of these ideas around freedom into a monetary system. It's certainly not perfect, there's issues with energy use, price volatility, scalability, scams, consumer protections, and a number of other things. But, it's the most freedom preserving financial system the world has ever seen.<p>I can see being against certain negative aspects of this, like the energy use or scams, but to be outright against it just seems crazy at this point. It feels like the equivalent of rallying against the printing press, the internet, or encryption. And no doubt, powerful people who stood to loose control from technological shifts have done just that throughout history. But why are a bunch of tech nerds who only stand to gain from freedom empowering technology rallying against it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "yourabstraction",
    "url": "https://news.ycombinator.com/user?id=yourabstraction"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30507359",
  "sameAs": "https://news.ycombinator.com/item?id=30507359",
  "dateCreated": "2022-03-01T00:34:36.496Z",
  "datePublished": "2022-03-01T00:30:54.000Z",
  "dateModified": "2022-03-01T00:34:36.496Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你怎么能既支持自由又反对加密货币呢？",
  "headline_zh-Hant": "Ask HN: 你怎麼能既支持自由又反對加密貨幣呢？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "以下是我想象中普通HN用户支持的事情的清单。<p>新闻自由<p>言论自由<p>加密<p>隐私<p>互联网<p>网络中立<p>开放源代码<p>上述项目通常被认为是社会的净利益。这些技术在错误的人手中可能是危险的，但什么强大的技术不是这样。因此，我根本无法理解的是，为什么有人可以在意识形态上与上述清单保持一致，但却强烈反对加密货币。<p>加密货币将所有这些围绕自由的想法囊括在一个货币系统中。它当然不是完美的，存在着能源使用、价格波动、可扩展性、诈骗、消费者保护和其他一些问题。<p>我可以看到反对它的某些消极方面，如能源使用或诈骗，但在这一点上，彻底反对它似乎是疯狂的。这感觉就像反对印刷术、互联网或加密的集会一样。毫无疑问，在整个历史上，那些站在技术转变中失去控制的有权势的人就是这样做的。但是，为什么一群只想从赋予自由的技术中获益的科技书呆子却要集会反对它呢？",
  "description_zh-Hant": "以下是我想象中普通HN用戶支持的事情的清單。<p>新聞自由<p>言論自由<p>加密<p>隱私<p>互聯網<p>網絡中立<p>開放源代碼<p>上述項目通常被認為是社會的淨利益。這些技術在錯誤的人手中可能是危險的，但什麼強大的技術不是這樣。因此，我根本無法理解的是，為什麼有人可以在意識形態上與上述清單保持一致，但卻強烈反對加密貨幣。<p>加密貨幣將所有這些圍繞自由的想法囊括在一個貨幣系統中。它當然不是完美的，存在著能源使用、價格波動、可擴展性、詐騙、消費者保護和其他一些問題。<p>我可以看到反對它的某些消極方面，如能源使用或詐騙，但在這一點上，徹底反對它似乎是瘋狂的。這感覺就像反對印刷術、互聯網或加密的集會一樣。毫無疑問，在整個歷史上，那些站在技術轉變中失去控制的有權勢的人就是這樣做的。但是，為什麼一群只想從賦予自由的技術中獲益的科技書呆子卻要集會反對它呢？"
}