{
  "@type": "NewsArticle",
  "identifier": "2022--03--15--en--askhn--HackerNews--NewsArticle--30680767",
  "url": "https://news.ycombinator.com/item?id=30680767",
  "headline": "Ask HN: Why Does Taiwan Have So Few Covid Cases?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I lived here for a couple of years and I thought the pandemic would hit pretty hard here eventually. But so far it hasn't. I'm really surprised because it's very densely populated, people don't social distance (e.g queues will have less than 1m gap, and  rubbish day everyone basically moshes, and social distancing is not enforced) and life hasn't changed much here. Everyone wears masks and uses the checkin apps and a whole lot of other measures like that. But there's a large old population who live in some sort of retirement homes and there's a lot of public transport. And vaccination rate is exceeded by places like Singapore and Hong Kong, but no large outbreaks, or death spikes, like in other places. And also we're right across the water from mainland China so things are not really not different in terms of geography, urban planning culture (if anything is far less space here and everything's more crowded than in an average mainland City), and so on... The one big difference is the lockdown measures have been far less severe here, if there can be said to have been a lockdown at all. And while we closed the borders at some point there's been international flights and people coming and going as long as you have the proper paperwork basically throughout the entire duration. I'm so curious what the reasons might be and maybe it's something that other places can replicate.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "graderjs",
    "url": "https://news.ycombinator.com/user?id=graderjs"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30680767",
  "sameAs": "https://news.ycombinator.com/item?id=30680767",
  "dateCreated": "2022-03-15T02:05:35.861Z",
  "datePublished": "2022-03-15T01:28:50.000Z",
  "dateModified": "2022-03-15T02:05:35.861Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么台湾的Covid案例这么少？",
  "headline_zh-Hant": "Ask HN: 為什麼臺灣的Covid案例這麼少？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在这里住了几年，我认为大流行病最终会对这里造成相当大的冲击。但是到目前为止，它还没有。我真的很惊讶，因为这里人口非常密集，人们没有社交距离（例如，排队时会有不到1米的间隙，而垃圾日大家基本上都在一起，社交距离没有强制执行），这里的生活没有什么变化。每个人都戴着口罩，使用签到应用程序和一大堆其他类似的措施。但这里有大量的老年人口，他们住在一些退休之家，有很多公共交通工具。而且疫苗接种率超过了新加坡和香港等地，但没有像其他地方那样出现大规模爆发，或死亡高峰。此外，我们与中国大陆隔水相望，所以在地理、城市规划文化方面并没有什么不同（如果有的话，这里的空间要小得多，一切都比一般的大陆城市更拥挤），等等...... 最大的区别是这里的封锁措施远没有那么严重，如果可以说是有封锁的话。虽然我们在某些时候关闭了边界，但只要你有适当的文书工作，在整个期间都有国际航班和人们来来往往。我很好奇原因是什么，也许这是其他地方可以复制的东西。",
  "description_zh-Hant": "我在這裡住了幾年，我認為大流行病最終會對這裡造成相當大的衝擊。但是到目前為止，它還沒有。我真的很驚訝，因為這裡人口非常密集，人們沒有社交距離（例如，排隊時會有不到1米的間隙，而垃圾日大家基本上都在一起，社交距離沒有強制執行），這裡的生活沒有什麼變化。每個人都戴著口罩，使用簽到應用程序和一大堆其他類似的措施。但這裡有大量的老年人口，他們住在一些退休之家，有很多公共交通工具。而且疫苗接種率超過了新加坡和香港等地，但沒有像其他地方那樣出現大規模爆發，或死亡高峰。此外，我們與中國大陸隔水相望，所以在地理、城市規劃文化方面並沒有什麼不同（如果有的話，這裡的空間要小得多，一切都比一般的大陸城市更擁擠），等等...... 最大的區別是這裡的封鎖措施遠沒有那麼嚴重，如果可以說是有封鎖的話。雖然我們在某些時候關閉了邊界，但只要你有適當的文書工作，在整個期間都有國際航班和人們來來往往。我很好奇原因是什麼，也許這是其他地方可以複製的東西。"
}