{
  "@type": "NewsArticle",
  "identifier": "2022--03--06--en--askhn--HackerNews--NewsArticle--30581056",
  "url": "https://news.ycombinator.com/item?id=30581056",
  "headline": "Ask HN: How do a prepare mentally for war?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've seen some posts here about preparing for a nuclear attack, but I don't think I'm prepared mentally for war of any kind.<p>I grew up in the UK during the 90s so I've obviously had a very sheltered life. The two most difficult things I've ever gone through is losing a job and having my heart broken. If nuclear war happened, assuming I survived I'm not sure I'd be able to cope with the real suffering that would follow. I'm also not sure how I'd cope if I was drafted into a more conventional war. The idea of being cold, dump, tried and hungry for weeks on end seems unbearable to me. I also have no idea how I'd cope without seeing my partner for what could be months not knowing if she's safe, or even still alive.<p>I'm terrified that the world I was raised for will not be my future. I am scared and I've not been able to focus on anything else since this conflict started. I don't know how to mentally prepare myself for what might come and I'm not the kind of person who can just switch off and distract themselves at times like this.<p>Is there anything I can do to better prepare myself mentally for what might come?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kypro",
    "url": "https://news.ycombinator.com/user?id=kypro"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30581056",
  "sameAs": "https://news.ycombinator.com/item?id=30581056",
  "dateCreated": "2022-03-06T20:49:55.439Z",
  "datePublished": "2022-03-06T20:40:42.000Z",
  "dateModified": "2022-03-06T20:49:55.439Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 一个人如何为战争做好心理准备？",
  "headline_zh-Hant": "Ask HN: 一個人如何為戰爭做好心理準備？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在这里看到一些关于为核攻击做准备的帖子，但我不认为我对任何形式的战争都有心理准备。<p>我在90年代的英国长大，所以我显然有一个非常受保护的生活。我经历过的最困难的两件事是失去工作和心碎。如果核战争发生了，假设我活了下来，我不确定我是否能够应对随之而来的真正痛苦。我也不确定如果我被征召参加一场更常规的战争，我将如何应对。想到连续几周的寒冷、倾倒、考验和饥饿，我似乎无法忍受。我也不知道在可能是几个月的时间里看不到我的伴侣，不知道她是否安全，甚至不知道她是否还活着，我会如何应对。我很害怕，自从这场冲突开始以来，我一直无法专注于其他事情。我不知道如何为可能发生的事情做好心理准备，我不是那种在这种时候可以随便关掉和转移注意力的人。<p>有什么办法可以让我为可能发生的事情做好心理准备？",
  "description_zh-Hant": "我在這裡看到一些關於為核攻擊做準備的帖子，但我不認為我對任何形式的戰爭都有心理準備。<p>我在90年代的英國長大，所以我顯然有一個非常受保護的生活。我經歷過的最困難的兩件事是失去工作和心碎。如果核戰爭發生了，假設我活了下來，我不確定我是否能夠應對隨之而來的真正痛苦。我也不確定如果我被徵召參加一場更常規的戰爭，我將如何應對。想到連續幾周的寒冷、傾倒、考驗和飢餓，我似乎無法忍受。我也不知道在可能是幾個月的時間裡看不到我的伴侶，不知道她是否安全，甚至不知道她是否還活著，我會如何應對。我很害怕，自從這場衝突開始以來，我一直無法專注於其他事情。我不知道如何為可能發生的事情做好心理準備，我不是那種在這種時候可以隨便關掉和轉移注意力的人。<p>有什麼辦法可以讓我為可能發生的事情做好心理準備？"
}