{
  "@type": "NewsArticle",
  "identifier": "2022--04--06--en--askhn--HackerNews--NewsArticle--30932661",
  "url": "https://news.ycombinator.com/item?id=30932661",
  "headline": "Ask HN: Is open source ruining your job satisfaction too?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been working as a programmer for about 7 years now.<p>Increasingly it feels like my job has just become gluing together opensource components, which doesn't feel creative at all -- there's little problem-solving going on.<p>All the areas where I could feel like I'm contributing something aren't valued. For instance, shareholders don't care less if the software is reliable, performant, or secure because they only want something that &quot;works.&quot; If it &quot;works,&quot; everything else is irrelevant.<p>It wasn't like this when I first started. Back then it felt like open-source was mostly limited to template engines, URL routers, and so on -- stuff you wouldn't want to write yourself and probably couldn't do better. I'm working on a (non-JavaScript) project with almost 200 dependencies. I've had entire weeks at work where all I do is edit YAML files (I don't work in DevOps, it's not k8s) and write glue for code that I'm not allowed to write myself.<p>Any code I do write myself eventually gets replaced with another open-source package. Even if the package is worse! When I've tried to talk to my manager, he's told me we have to think about how maintainable the project is. It seems the company is trying to optimize for having as much code as possible be maintained by &quot;the community&quot; so they can minimize risk.<p>It's all left me feeling extremely depressed and I don't know what to do. I'd just leave and work somewhere else, but it seems like this is becoming more and more common. After all, most problems are solved by now. Why not just pull yet another package off GitHub?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "sad-throwaway",
    "url": "https://news.ycombinator.com/user?id=sad-throwaway"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30932661",
  "sameAs": "https://news.ycombinator.com/item?id=30932661",
  "dateCreated": "2022-04-06T15:11:00.907Z",
  "datePublished": "2022-04-06T14:54:02.000Z",
  "dateModified": "2022-04-06T15:11:00.907Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 开源也毁了你的工作满意度吗？",
  "headline_zh-Hant": "Ask HN: 開源也毀了你的工作滿意度嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我作为一名程序员已经工作了大约7年。<p>我越来越觉得我的工作只是把开放源码的组件粘在一起，这完全没有创造性，几乎没有解决问题的能力。例如，股东们并不关心软件是否可靠、性能或安全，因为他们只想要能用的东西。<p>如果它能用，其他一切都不重要。在那时，人们觉得开源大多局限于模板引擎、URL 路由器等 -- 这些东西你不会想自己写，也可能做不到更好。我正在做一个有近200个依赖项的（非JavaScript）项目。我在工作中曾有过整整几周的时间，我所做的就是编辑YAML文件（我不在DevOps工作，这不是k8s），为那些我不允许自己写的代码写胶水。<p>任何我自己写的代码最终都会被另一个开源包取代。即使这个软件包更糟糕! 当我试图与我的经理沟通时，他告诉我我们必须考虑项目的可维护性。似乎公司正在努力优化，让尽可能多的代码由&quot;社区&quot;维护，这样他们就可以把风险降到最低。<p>这一切让我感到非常沮丧，我不知道该怎么办。我只想离开并在其他地方工作，但这似乎变得越来越普遍了。毕竟，大多数问题现在已经解决了。为什么不直接从GitHub上再拉一个包呢？",
  "description_zh-Hant": "我作為一名程序員已經工作了大約7年。<p>我越來越覺得我的工作只是把開放源碼的組件粘在一起，這完全沒有創造性，幾乎沒有解決問題的能力。例如，股東們並不關心軟件是否可靠、性能或安全，因為他們只想要能用的東西。<p>如果它能用，其他一切都不重要。在那時，人們覺得開源大多侷限於模板引擎、URL 路由器等 -- 這些東西你不會想自己寫，也可能做不到更好。我正在做一個有近200個依賴項的（非JavaScript）項目。我在工作中曾有過整整幾周的時間，我所做的就是編輯YAML文件（我不在DevOps工作，這不是k8s），為那些我不允許自己寫的代碼寫膠水。<p>任何我自己寫的代碼最終都會被另一個開源包取代。即使這個軟件包更糟糕! 當我試圖與我的經理溝通時，他告訴我我們必須考慮項目的可維護性。似乎公司正在努力優化，讓儘可能多的代碼由&quot;社區&quot;維護，這樣他們就可以把風險降到最低。<p>這一切讓我感到非常沮喪，我不知道該怎麼辦。我只想離開並在其他地方工作，但這似乎變得越來越普遍了。畢竟，大多數問題現在已經解決了。為什麼不直接從GitHub上再拉一個包呢？"
}