{
  "@type": "NewsArticle",
  "identifier": "2022--04--05--en--askhn--HackerNews--NewsArticle--30916302",
  "url": "https://news.ycombinator.com/item?id=30916302",
  "headline": "Ask HN: What is the “digital size” of your life, and what goes in?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "After a professional career of 25+ yrs in IT (and some more in other engineering fields, prior to that), I decided to move onto a sabbatical / maybe  RE stage (part of the FIRE). I am looking now at approx 9-10TB of data I gathered (cleaned irrelevant stuff in time, and probably will clean more, while other parts have been compressed, where such offered an evident benefit of space saving) - duplicated onto 2 x 12TB encrypted disks - for what I could consider my &quot;digital&quot; life. Major categories:<p>- personal (including family) info<p>- career info<p>- pictures (a third copy in the cloud, but planning to remove it, eventually)<p>- personal and professional notes I created in my time, for all of the above<p>- some software I wrote in time (just the code, in large part)<p>- professional documentation of all sorts (mainly fundamentals associated to CS and derivatives, math, physics, misc engineering, as well as specific technologies)<p>- ebooks + movies + series of critical significance to me<p>- documented trips around the world<p>- misc not fitting in any of the categories above<p>Based on the new direction my life will take, the emphasis in digital imprint growth, from this point on, for the reminder of life, could be safely extrapolated from the existing data on pictures, ebooks and trips, and will probably amount to no more than 2TB. All this being said, I assume I could say that my &quot;digital life&quot; will be eventually represented by aprox. 12TB of stored info.<p>What is the estimate of the &quot;digital size&quot; of your life, and what goes in yours?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "netfortius",
    "url": "https://news.ycombinator.com/user?id=netfortius"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30916302",
  "sameAs": "https://news.ycombinator.com/item?id=30916302",
  "dateCreated": "2022-04-05T07:49:59.179Z",
  "datePublished": "2022-04-05T07:40:27.000Z",
  "dateModified": "2022-04-05T07:49:59.179Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你的生活的 \"数字尺寸 \"是多少，有什么东西会进入？",
  "headline_zh-Hant": "Ask HN: 你的生活的 \"數字尺寸 \"是多少，有什麼東西會進入？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在经历了25年多的IT职业生涯后（在此之前还在其他工程领域工作了一段时间），我决定进入休假/也许是RE阶段（FIRE的一部分）。我现在看到我收集的大约9-10TB的数据（及时清理了不相关的东西，可能还会清理更多，而其他部分已经被压缩了，因为这样做可以明显地节省空间）--复制到2个12TB的加密磁盘上--我可以考虑我的&quot;数字&quot;生活。主要类别。 <p>- 个人（包括家庭）信息<p>- 职业信息<p>- 照片（第三份拷贝在云端，但计划最终将其删除）<p>- 个人和专业笔记，我在我的时间内为上述所有内容创建的<p>- 我在时间内编写的一些软件（只是代码，大部分）<p>- 各种专业文件（主要是与CS和衍生品、数学、物理、杂项工程相关的基础知识。<p>- 电子书+电影+对我有重要意义的系列<p>- 有记录的世界各地的旅行<p>- 不属于上述任何类别的杂项<p>基于我的生活将采取的新方向，从现在开始，为了提醒生活，数字印记增长的重点可以从现有的图片、电子书和旅行的数据中安全地推断出来，并且可能会达到不超过2TB。所有这些，我想我可以说我的&quot;数字生活&quot;最终将由大约12TB的存储信息来代表。<p>对你生活的&quot;数字大小&quot;的估计是什么？",
  "description_zh-Hant": "在經歷了25年多的IT職業生涯後（在此之前還在其他工程領域工作了一段時間），我決定進入休假/也許是RE階段（FIRE的一部分）。我現在看到我收集的大約9-10TB的數據（及時清理了不相關的東西，可能還會清理更多，而其他部分已經被壓縮了，因為這樣做可以明顯地節省空間）--複製到2個12TB的加密磁盤上--我可以考慮我的&quot;數字&quot;生活。主要類別。 <p>- 個人（包括家庭）信息<p>- 職業信息<p>- 照片（第三份拷貝在雲端，但計劃最終將其刪除）<p>- 個人和專業筆記，我在我的時間內為上述所有內容創建的<p>- 我在時間內編寫的一些軟件（只是代碼，大部分）<p>- 各種專業文件（主要是與CS和衍生品、數學、物理、雜項工程相關的基礎知識。<p>- 電子書+電影+對我有重要意義的系列<p>- 有記錄的世界各地的旅行<p>- 不屬於上述任何類別的雜項<p>基於我的生活將採取的新方向，從現在開始，為了提醒生活，數字印記增長的重點可以從現有的圖片、電子書和旅行的數據中安全地推斷出來，並且可能會達到不超過2TB。所有這些，我想我可以說我的&quot;數字生活&quot;最終將由大約12TB的存儲信息來代表。<p>對你生活的&quot;數字大小&quot;的估計是什麼？"
}