{
  "@type": "NewsArticle",
  "identifier": "2022--03--04--en--askhn--HackerNews--NewsArticle--30558248",
  "url": "https://news.ycombinator.com/item?id=30558248",
  "headline": "Ask HN: Can we talk about this now?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Alternative title: Intelligence-funded public services behind veils of startup mystique<p>The understanding came to me while pondering Imgur's business model. The only ethical problem I have is the abstraction placed over the public's expectations of neutrality in national projects. With how money is managed in times when people expect to fight for survival it becomes too easy to overlook what we are fighting for.<p>But, something more distressing is going on as a result of the necessary misdirection and resource constrain. Those who voiced their opinion by applying their gifts in civilian social networking enterprises instead of military intelligence are suffering from diffusion of effort as their projects are being dual-used for the intelligence effort. Work meant to bring people together was re-fashioned into something that drives them apart until strife brings them to the edge of disaster. It is an old story. Once the engineers realize that their plowshares were swords, they will be disillusioned. The population is facing deinstitutionalization, which is the fever cramps that the Soviet block fell into when they realized they no longer had a system. This is a bad time for the system builders to be incapacitated by existential doubt.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ganzuul",
    "url": "https://news.ycombinator.com/user?id=ganzuul"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30558248",
  "sameAs": "https://news.ycombinator.com/item?id=30558248",
  "dateCreated": "2022-03-04T18:35:05.019Z",
  "datePublished": "2022-03-04T18:11:52.000Z",
  "dateModified": "2022-03-04T18:35:05.019Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们现在能谈谈这个吗？",
  "headline_zh-Hant": "Ask HN: 我們現在能談談這個嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "替代标题。情报资助的公共服务在创业公司神秘面纱的背后<p>在思考Imgur的商业模式时，我想到了这个理解。我唯一的道德问题是，在公众对国家项目的中立性的期望上放置了抽象的东西。在人们期望为生存而战的时候，随着金钱的管理方式，变得太容易忽视我们为之奋斗的东西。<p>但是，由于必要的误导和资源的限制，一些更令人不安的事情正在发生。那些将自己的天赋应用于民用社交网络企业而不是军事情报的人正在遭受努力的分散，因为他们的项目被双重使用于情报工作。本应将人们聚集在一起的工作被重新塑造成使他们分离的东西，直到纷争将他们带到灾难的边缘。这是一个古老的故事。一旦工程师们意识到他们的犁铧是剑，他们就会感到幻灭。民众正面临着去制度化，这就是苏联街区在意识到他们不再有制度时陷入的热痉挛。对于制度建设者来说，现在是一个糟糕的时刻，他们会因为存在的怀疑而失去能力。",
  "description_zh-Hant": "替代標題。情報資助的公共服務在創業公司神秘面紗的背後<p>在思考Imgur的商業模式時，我想到了這個理解。我唯一的道德問題是，在公眾對國家項目的中立性的期望上放置了抽象的東西。在人們期望為生存而戰的時候，隨著金錢的管理方式，變得太容易忽視我們為之奮鬥的東西。<p>但是，由於必要的誤導和資源的限制，一些更令人不安的事情正在發生。那些將自己的天賦應用於民用社交網絡企業而不是軍事情報的人正在遭受努力的分散，因為他們的項目被雙重使用於情報工作。本應將人們聚集在一起的工作被重新塑造成使他們分離的東西，直到紛爭將他們帶到災難的邊緣。這是一個古老的故事。一旦工程師們意識到他們的犁鏵是劍，他們就會感到幻滅。民眾正面臨著去制度化，這就是蘇聯街區在意識到他們不再有制度時陷入的熱痙攣。對於制度建設者來說，現在是一個糟糕的時刻，他們會因為存在的懷疑而失去能力。"
}