{
  "@type": "NewsArticle",
  "identifier": "2022--04--11--en--askhn--HackerNews--NewsArticle--30996097",
  "url": "https://news.ycombinator.com/item?id=30996097",
  "headline": "Ask HN: I want to start a company, but I am currently overemployed",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Context: I have been working multiple SWE jobs, remotely, since early in the pandemic. None of the companies know I am doing this. It's been very time demanding, but also financially and intellectually rewarding. Some of the companies are FAANG.<p>I want to start a company, but I'm worried about the potential legal/ethical fallout from what I have done. I've kept a low profile so far, but obviously if I start a company I will need do a lot of networking, and people will need to know my background. If my work history is publicly known, there is some risk of litigation from the massive-cap companies that I have worked for.<p>I don't feel I've done anything ethically wrong. I work 80hrs most weeks, and received feedback and promotions from each of the companies. I have never breached any NDA or employment agreement, except for the obligatory clause in most salaried contracts: &quot;don't engage in any other employment, not even as a cashier at Taco Bell&quot;. That said, it is a legal grey-area, and a well-funded lawsuit could drag on for a long time.<p>The company I want to start would be creating a software product which plugs into, or perhaps replaces one of the products I currently work on (it's a very old piece of software). I don't believe this would breach any contracts, since other competitors were born out of similar circumstances (minus the overemployment)<p>I wanted to get some other perspectives on my situation. Is it salvageable? Or did I ruin my chances by having a non-conventional work history?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "hashxyz",
    "url": "https://news.ycombinator.com/user?id=hashxyz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30996097",
  "sameAs": "https://news.ycombinator.com/item?id=30996097",
  "dateCreated": "2022-04-11T22:49:51.931Z",
  "datePublished": "2022-04-11T22:45:53.000Z",
  "dateModified": "2022-04-11T22:49:51.931Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我想开一家公司，但我目前就业过剩",
  "headline_zh-Hant": "Ask HN: 我想開一家公司，但我目前就業過剩",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "背景。从大流行初期开始，我就一直在做多个SWE的工作，远程工作。这些公司都不知道我在做这个工作。这对时间要求很高，但在经济上和智力上也有收获。<p>我想开一家公司，但我担心我所做的事情可能带来的法律/道德后果。到目前为止，我一直保持低调，但显然，如果我开一家公司，我将需要做大量的网络，人们将需要了解我的背景。如果我的工作经历被公开，就会有一些来自我曾经工作过的大规模公司的诉讼风险。<p>我不觉得我在道德上做错了什么。我大多数星期工作80小时，并从每家公司获得反馈和晋升。我从未违反过任何NDA或就业协议，除了大多数受薪合同中的强制性条款：&quot;不要从事任何其他工作，甚至不要在Taco Bell做收银员&quot;。<p>我想成立的公司将创建一个软件产品，它可以插入或取代我目前工作的一个产品（它是一个非常古老的软件）。我认为这不会违反任何合同，因为其他竞争者也是在类似的情况下诞生的（除去过度就业）<p>我想就我的情况获得一些其他的观点。它是可以挽救的吗？还是我因为有非常规的工作经历而毁了我的机会？",
  "description_zh-Hant": "背景。從大流行初期開始，我就一直在做多個SWE的工作，遠程工作。這些公司都不知道我在做這個工作。這對時間要求很高，但在經濟上和智力上也有收穫。<p>我想開一家公司，但我擔心我所做的事情可能帶來的法律/道德後果。到目前為止，我一直保持低調，但顯然，如果我開一家公司，我將需要做大量的網絡，人們將需要了解我的背景。如果我的工作經歷被公開，就會有一些來自我曾經工作過的大規模公司的訴訟風險。<p>我不覺得我在道德上做錯了什麼。我大多數星期工作80小時，並從每家公司獲得反饋和晉升。我從未違反過任何NDA或就業協議，除了大多數受薪合同中的強制性條款：&quot;不要從事任何其他工作，甚至不要在Taco Bell做收銀員&quot;。<p>我想成立的公司將創建一個軟件產品，它可以插入或取代我目前工作的一個產品（它是一個非常古老的軟件）。我認為這不會違反任何合同，因為其他競爭者也是在類似的情況下誕生的（除去過度就業）<p>我想就我的情況獲得一些其他的觀點。它是可以挽救的嗎？還是我因為有非常規的工作經歷而毀了我的機會？"
}