{
  "@type": "NewsArticle",
  "identifier": "2022--03--10--en--askhn--HackerNews--NewsArticle--30623161",
  "url": "https://news.ycombinator.com/item?id=30623161",
  "headline": "Ask HN: How much of a SaaS needs to be built before fundraising?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm an aspiring founder and developer. I've worked on a few toy projects over the years, but have recently started on something that I believe has real potential.<p>I know next to nothing about the business side of things. I've been researching and learning, but its left me with questions. One such, at what stage in development should I begin fundraising?<p>Part of me feels like I should continue working on it during weekends and evenings until complete, and then start worrying about the &quot;business&quot; stuff. All the conventional wisdom however seems to argue against that and encourages swift market entry. How do I enter the market appropriately without funds? And how do I obtain funds without a fleshed out product or prior founding experience?<p>I have virtually 0 presence on professional social media outlets. No twitter, no IG, inactive linkedin, etc. My only viable options for marketing really is going to be paid ads. I'd also, ideally, like to be in a position to focus on this fulltime rather than worrying about it after my day job.<p>Now, it'd certainly be possible for me to just launch it one weekend and spend a few hour in the evenings managing things, but it'd seriously hamper growth and adoption.<p>Suggestion? Advice? Wisdom? I'm open to it all. Thanks in advance.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "MathCodeLove",
    "url": "https://news.ycombinator.com/user?id=MathCodeLove"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30623161",
  "sameAs": "https://news.ycombinator.com/item?id=30623161",
  "dateCreated": "2022-03-10T09:08:10.163Z",
  "datePublished": "2022-03-10T04:16:19.000Z",
  "dateModified": "2022-03-10T09:08:10.163Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 怎样才能",
  "headline_zh-Hant": "Ask HN: 怎樣才能",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个有抱负的创始人和开发者。这些年来，我做过一些玩具项目，但最近开始做一些我认为真正有潜力的事情。<p>我对商业方面的事情几乎一无所知。我一直在研究和学习，但它给我留下了一些问题。其中一个问题是，我应该在发展的哪个阶段开始筹款？<p>我的一部分觉得我应该在周末和晚上继续工作，直到完成，然后开始担心&quot;商业&quot;的问题。然而，所有的传统智慧似乎都反对这样做，并鼓励迅速进入市场。没有资金，我如何适当地进入市场？如果没有成熟的产品或先前的创建经验，我又如何获得资金呢？没有微博，没有IG，没有活跃的Linkedin，等等。我唯一可行的营销选择是付费广告。<p>现在，我当然有可能在一个周末推出它，并在晚上花几个小时来管理它，但这将严重阻碍增长和采用。建议？智慧？我在做 [...] ",
  "description_zh-Hant": "我是一個有抱負的創始人和開發者。這些年來，我做過一些玩具項目，但最近開始做一些我認為真正有潛力的事情。<p>我對商業方面的事情幾乎一無所知。我一直在研究和學習，但它給我留下了一些問題。其中一個問題是，我應該在發展的哪個階段開始籌款？<p>我的一部分覺得我應該在週末和晚上繼續工作，直到完成，然後開始擔心&quot;商業&quot;的問題。然而，所有的傳統智慧似乎都反對這樣做，並鼓勵迅速進入市場。沒有資金，我如何適當地進入市場？如果沒有成熟的產品或先前的創建經驗，我又如何獲得資金呢？沒有微博，沒有IG，沒有活躍的Linkedin，等等。我唯一可行的營銷選擇是付費廣告。<p>現在，我當然有可能在一個週末推出它，並在晚上花幾個小時來管理它，但這將嚴重阻礙增長和採用。建議？智慧？我在做 [...] "
}