{
  "@type": "NewsArticle",
  "identifier": "2022--02--20--en--askhn--HackerNews--NewsArticle--30405851",
  "url": "https://news.ycombinator.com/item?id=30405851",
  "headline": "Ask HN: How to gain a meaningful experience at work?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "It's my second job and our team work on some HR software.\nMostly I wanted to see microservices in the wild and how several teams cooperate and coordinate themselves (quite poorly).\nAlso the product domain touches on a lot of legal stuff which is good to know anyway, even if I won't ever work in this domain anymore.<p>But reality is harsh. Scrum ceremonies eat up more time than I feel like they should, and they don't even work well enough IMO.\nOur team unsurprisingly works on one specific service, which is 90% black box to me because nobody has the time to introduce me to the domain. The rest of a system is even more opaque.\nDedicated devops team handles all infra/CI/CD, and I have no idea how and where the app is deployed, I only know we use k8s and docker for that.<p>It feels like an eternity before my team would consider me knowledgeable enough to discuss anything significant with them, e.g. data modeling, service interaction etc.\nAnd even when that would happen, I'll find myself in the same position where I left previous job - a big ball of mud you only can throw away and start from scratch.<p>Overall I don't care because the pay is way over than a junior dev would normally get.\nI'm more worried &quot;n years of experience&quot; line on my resume would mean nothing. How do I prevent that?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kartoshechka",
    "url": "https://news.ycombinator.com/user?id=kartoshechka"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30405851",
  "sameAs": "https://news.ycombinator.com/item?id=30405851",
  "dateCreated": "2022-02-20T14:26:18.654Z",
  "datePublished": "2022-02-20T14:15:47.000Z",
  "dateModified": "2022-02-20T14:26:18.654Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何在工作中获得有意义的经验？",
  "headline_zh-Hant": "Ask HN: 如何在工作中獲得有意義的經驗？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这是我的第二份工作，我们团队从事一些人力资源软件的工作。\n我主要是想看看野外的微服务，以及几个团队如何合作和协调（相当糟糕）。\n另外，产品领域涉及到很多法律方面的东西，无论如何，知道这些是很好的，即使我再也不会在这个领域工作了。Scrum仪式占用的时间比我觉得应该占用的时间要多，而且它们甚至没有足够的效果，IMO。\n我们的团队不出所料地在一个特定的服务上工作，这对我来说90%是黑箱，因为没有人有时间向我介绍这个领域。一个系统的其余部分就更不透明了。\n专门的开发团队处理所有的信息/CI/CD，我不知道应用程序是如何部署的，也不知道在哪里部署，我只知道我们使用k8s和docker。<p>在我的团队认为我有足够的知识与他们讨论任何重要的事情，例如数据建模、服务互动等，感觉就像是永恒的。\n<p>总的来说，我并不在意，因为工资比初级开发人员通常得到的要多得多。\n我更担心我简历上的 \"N年经验 \"一栏将毫无意义。我怎样才能避免这种情况呢？",
  "description_zh-Hant": "這是我的第二份工作，我們團隊從事一些人力資源軟件的工作。\n我主要是想看看野外的微服務，以及幾個團隊如何合作和協調（相當糟糕）。\n另外，產品領域涉及到很多法律方面的東西，無論如何，知道這些是很好的，即使我再也不會在這個領域工作了。Scrum儀式佔用的時間比我覺得應該佔用的時間要多，而且它們甚至沒有足夠的效果，IMO。\n我們的團隊不出所料地在一個特定的服務上工作，這對我來說90%是黑箱，因為沒有人有時間向我介紹這個領域。一個系統的其餘部分就更不透明瞭。\n專門的開發團隊處理所有的信息/CI/CD，我不知道應用程序是如何部署的，也不知道在哪裡部署，我只知道我們使用k8s和docker。<p>在我的團隊認為我有足夠的知識與他們討論任何重要的事情，例如數據建模、服務互動等，感覺就像是永恆的。\n<p>總的來說，我並不在意，因為工資比初級開發人員通常得到的要多得多。\n我更擔心我簡歷上的 \"N年經驗 \"一欄將毫無意義。我怎樣才能避免這種情況呢？"
}