{
  "@type": "NewsArticle",
  "identifier": "2022--03--17--en--askhn--HackerNews--NewsArticle--30715850",
  "url": "https://news.ycombinator.com/item?id=30715850",
  "headline": "Ask HN: Putting macOS to sleep with multiple monitors",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I sent a message to a friend of mine (a 30+ year veteran designer (he's seen/done it all) and Apple user) earlier today about Apple's new Universal Control feature after reading https://www.theverge.com/2022/3/16/22980566/universal-control-ios-macos-mac-ipad-hands-on. His response intrigued me and I'd love to hear from the HN community regarding any idea/suggestions abou what he's experiencing - with all the collaboration that Apple has done with the design/animation/studio community who typically have these monster setups I'm really surprised that he's having these issues. Here was his note:<p>&quot;I’ll have to try it out…but my expectations are pretty low at this point. Most of these (black) magic features from Apple seem geared towards laptop and iMac users that have an iPad sitting next to them. Everything falls apart when you have towers with 2-3 displays attached.<p>Whatever the little deamon or code devil or whatever that’s in charge of managing all the screens + power + window arrangement is just woefully not up to the task. For the past four OS versions I’ve not been able to ever put my machines to sleep. And for the past two or three versions even letting the displays “sleep” causes all sorts of havoc.<p>If I let my Mac Pros sleep then it’s a slim chance that tapping the space bar will bring all displays back up or at the 4K res they were when they went down. OS X will then shuffle windows or app UI around haphazardly. A restart will usually fix it but the more ram you have the longer that boot time is. With 400GB it can be “go get a cup of tea” time.<p>I’ve trained myself to try and close most production apps if I plan to be away from my computer for more than hour – the time at which my screens go to sleep. If I fail to do that then when I return all the app windows will have moved to the center screen. Dragging the Mail app back to the left screen isn’t so bad but if you have Photoshop on one workspace and Maya on another, etc. then you have to spend an uneasy moment or two dragging panels back to where they were when you left.<p>If the resolution has shifted then some Adobe panels might be off screen and you can’t get to the top bars to move them.<p>I’ve tried DisplayPort, HDMI and last year I switched all my monitors to a single flavor of LGs with Thunderbolt but nothing seems to help. These LGs say they pull full power down the cable so the 2nd TB port should run another monitor in a chain or at least charge an iPad. But they seem to be right at their limits and if they happen to power cycle for some reason like a brown out that exceeds your UPS’s battery lifetime then there’s a 50/50 chance the screen won’t boot up and they just turn themselves off citing “No Input Signal Detected”. At that point you have to plug one screen in at a time and reboot the mac a few times (and clear the PMU sometimes) to get things unstuck.&quot;",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jonathanzufi",
    "url": "https://news.ycombinator.com/user?id=jonathanzufi"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30715850",
  "sameAs": "https://news.ycombinator.com/item?id=30715850",
  "dateCreated": "2022-03-17T21:09:39.930Z",
  "datePublished": "2022-03-17T21:03:00.000Z",
  "dateModified": "2022-03-17T21:09:39.930Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 用多个显示器使macOS进入睡眠状态",
  "headline_zh-Hant": "Ask HN: 用多個顯示器使macOS進入睡眠狀態",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "今天早些时候，我给我的一个朋友（一个有30多年经验的设计师（他见过/做过所有的事情）和苹果用户）发了一条信息，关于苹果的新通用控制功能，在阅读了https://www.theverge.com/2022/3/16/22980566/universal-control-ios-macos-mac-ipad-hands-on。他的回答让我很感兴趣，我很想听听HN社区对他所遇到的问题的任何想法/建议--苹果与设计/动画/工作室社区所做的所有合作，他们通常有这些怪物的设置，我真的很惊讶他有这些问题。以下是他的说明：<p>&quot;我必须试一试......但我的期望值在这一点上相当低。苹果公司的这些（黑色）神奇的功能似乎都是针对笔记本电脑和iMac用户的，他们旁边有一台iPad。<p>负责管理所有屏幕+电源+窗口安排的小恶魔或代码魔鬼或其他什么东西，实在是太不称职了。在过去的四个操作系统版本中，我从来没有能够让我的机器进入睡眠状态。<p>如果我让我的 Mac Pros 睡觉，那么点击空格键就会有很小的机会让所有显示器恢复正常，或者达到它们关闭时的4K分辨率。然后，OS X会将窗口或应用程序的用户界面胡乱地洗一遍。重新启动通常会解决这个问题，但你的内存越多，启动时间就越长。<p>我已经训练自己，如果我打算离开我的电脑超过一小时--也就是我的屏幕进入睡眠状态的时间--就会尝试关闭大多数生产应用程序。如果我没能做到这一点，那么当我回来时，所有的应用程序窗口都会移到屏幕中央。把邮件应用拖回左边的屏幕还不算太糟，但如果你在一个工作区使用Photoshop，在另一个工作区使用Maya，等等，那么你就必须花一两个小时的时间把面板拖回你离开时的位置，这让人感到不安。<p>如果分辨率发生了变化，那么一些Adobe面板可能会离开屏幕，你无法进入顶部栏来移动它们。<p>我已经尝试过DisplayPort、HDMI，去年我把所有显示器换成带有Thunderbolt的LGs的单一型号，但似乎没有什么帮助。这些LG显示器说，它们通过电缆拉满电源，所以第二个TB端口应该可以在一个链条上运行另一台显示器，或者至少可以为iPad充电。但它们似乎正处于极限状态，如果它们碰巧因为某种原因发生了电源循环，比如超过了UPS的电池寿命，那么有50/50的机会屏幕不会启动，它们只是以 \"没有检测到输入信号 \"为由自行关闭。在这一点上，你必须一次插入一个屏幕，并重新启动Mac几次（有时还要清除PMU），以使事情恢复原状。",
  "description_zh-Hant": "今天早些時候，我給我的一個朋友（一個有30多年經驗的設計師（他見過/做過所有的事情）和蘋果用戶）發了一條信息，關於蘋果的新通用控制功能，在閱讀了https://www.theverge.com/2022/3/16/22980566/universal-control-ios-macos-mac-ipad-hands-on。他的回答讓我很感興趣，我很想聽聽HN社區對他所遇到的問題的任何想法/建議--蘋果與設計/動畫/工作室社區所做的所有合作，他們通常有這些怪物的設置，我真的很驚訝他有這些問題。以下是他的說明：<p>&quot;我必須試一試......但我的期望值在這一點上相當低。蘋果公司的這些（黑色）神奇的功能似乎都是針對筆記本電腦和iMac用戶的，他們旁邊有一臺iPad。<p>負責管理所有屏幕+電源+窗口安排的小惡魔或代碼魔鬼或其他什麼東西，實在是太不稱職了。在過去的四個操作系統版本中，我從來沒有能夠讓我的機器進入睡眠狀態。<p>如果我讓我的 Mac Pros 睡覺，那麼點擊空格鍵就會有很小的機會讓所有顯示器恢復正常，或者達到它們關閉時的4K分辨率。然後，OS X會將窗口或應用程序的用戶界面胡亂地洗一遍。重新啟動通常會解決這個問題，但你的內存越多，啟動時間就越長。<p>我已經訓練自己，如果我打算離開我的電腦超過一小時--也就是我的屏幕進入睡眠狀態的時間--就會嘗試關閉大多數生產應用程序。如果我沒能做到這一點，那麼當我回來時，所有的應用程序窗口都會移到屏幕中央。把郵件應用拖回左邊的屏幕還不算太糟，但如果你在一個工作區使用Photoshop，在另一個工作區使用Maya，等等，那麼你就必須花一兩個小時的時間把面板拖回你離開時的位置，這讓人感到不安。<p>如果分辨率發生了變化，那麼一些Adobe面板可能會離開屏幕，你無法進入頂部欄來移動它們。<p>我已經嘗試過DisplayPort、HDMI，去年我把所有顯示器換成帶有Thunderbolt的LGs的單一型號，但似乎沒有什麼幫助。這些LG顯示器說，它們通過電纜拉滿電源，所以第二個TB端口應該可以在一個鏈條上運行另一臺顯示器，或者至少可以為iPad充電。但它們似乎正處於極限狀態，如果它們碰巧因為某種原因發生了電源循環，比如超過了UPS的電池壽命，那麼有50/50的機會屏幕不會啟動，它們只是以 \"沒有檢測到輸入信號 \"為由自行關閉。在這一點上，你必須一次插入一個屏幕，並重新啟動Mac幾次（有時還要清除PMU），以使事情恢復原狀。"
}