{
  "@type": "NewsArticle",
  "identifier": "2022--03--05--en--askhn--HackerNews--NewsArticle--30567116",
  "url": "https://news.ycombinator.com/item?id=30567116",
  "headline": "Ask HN: Turning a Sysadmin/Support Team into a DevOps/Project Team?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've noticed that some DevOps teams struggle with project-oriented concepts, and my theory is that these teams are made up of people whose experience has been in support and systems administration rather than software engineering.<p>I don't mean to dismiss or insult the support/sysadmin career path or experience, especially since I started out on that track! I've been lucky in that most of my career I've worked closely with developers, R&amp;D, and academia. That has given me exposure to project work concepts such as requirements, acceptance criteria, sprints, etc.<p>My progression from sysadmin to DevOps took place over more than a decade; how do I help people who haven't had that gradual change embrace the more software development style mindset? One team I am working with is very focused on support tickets and interrupts, and I'd like to help that team switch to a more project-based mindset.<p>How do I help people whose background is in interrupt-driven work change to working in sprints with requirements, features, etc?<p>Or do you disagree with my fundamental assumption that people whose experience has been in support have a harder time moving to a project-based workflow?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "bloopernova",
    "url": "https://news.ycombinator.com/user?id=bloopernova"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30567116",
  "sameAs": "https://news.ycombinator.com/item?id=30567116",
  "dateCreated": "2022-03-05T13:04:00.882Z",
  "datePublished": "2022-03-05T12:53:28.000Z",
  "dateModified": "2022-03-05T13:04:00.882Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 把一个系统管理员/支持团队变成一个DevOps/项目团队？",
  "headline_zh-Hant": "Ask HN: 把一個系統管理員/支持團隊變成一個DevOps/項目團隊？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我注意到，一些DevOps团队对面向项目的概念感到挣扎，而我的理论是，这些团队是由那些有支持和系统管理经验而不是软件工程经验的人组成的。<p>我无意否定或侮辱支持/系统管理员的职业道路或经验，尤其是我一开始就在这个轨道上！我很幸运，因为我的大多数CIO都是在支持和系统管理方面的。我很幸运，在我职业生涯的大部分时间里，我都与开发人员、研发部门和学术界密切合作。<p>我从系统管理员到DevOps的进展经历了十多年；我如何帮助那些没有经历过这种逐步变化的人接受更多的软件开发风格的思维方式？<p>我如何帮助那些有中断工作背景的人转变为以需求、功能等为基础的冲刺工作？<p>或者你不同意我的基本假设，即那些有支持经验的人很难转变为基于项目的工作流程？",
  "description_zh-Hant": "我注意到，一些DevOps團隊對面向項目的概念感到掙扎，而我的理論是，這些團隊是由那些有支持和系統管理經驗而不是軟件工程經驗的人組成的。<p>我無意否定或侮辱支持/系統管理員的職業道路或經驗，尤其是我一開始就在這個軌道上！我很幸運，因為我的大多數CIO都是在支持和系統管理方面的。我很幸運，在我職業生涯的大部分時間裡，我都與開發人員、研發部門和學術界密切合作。<p>我從系統管理員到DevOps的進展經歷了十多年；我如何幫助那些沒有經歷過這種逐步變化的人接受更多的軟件開發風格的思維方式？<p>我如何幫助那些有中斷工作背景的人轉變為以需求、功能等為基礎的衝刺工作？<p>或者你不同意我的基本假設，即那些有支持經驗的人很難轉變為基於項目的工作流程？"
}