{
  "@type": "NewsArticle",
  "identifier": "2022--03--24--en--askhn--HackerNews--NewsArticle--30786279",
  "url": "https://news.ycombinator.com/item?id=30786279",
  "headline": "Ask HN: Isn't any discussion on taxes pointless if budget is never balanced?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I admit I don't have full idea how can govt continue working with ever deepening debt, not an economist. But the govt increases debt limit each time, what's the point of having a debt limit then?... whether govt spends money through budget or create money and distribute it through cheap loans, it's the same, isn't it?... more money supply in the system. i.e. instead of passing a budget that gives small business owners 10k in aid vs allowing small biz to borrow 10k at 1% rate for 30 year payback.. more or less the same thing, in first case budget was already in negative, just became more negative..but so what?<p>there has been ongoing discussion on taxing income vs wealth, taxing billionares, UBI, etc....<p>taxing wealth over income only makes sense if income taxes go down.. but even if they go down what's the point.. at this point why does govt even bother collecting taxes obviously doesn't care about how much debt it runs<p>somehow if govt decided to tax everyone 80%, and balance the budget, in few cycles even that budget will be not enough.<p>I am really confused about what are implications for govt to perpetually keep going in deeper debt, what would happen if govt just stopped taxing everything and just kept going in debt even faster?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lifeplusplus",
    "url": "https://news.ycombinator.com/user?id=lifeplusplus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30786279",
  "sameAs": "https://news.ycombinator.com/item?id=30786279",
  "dateCreated": "2022-03-24T04:12:52.412Z",
  "datePublished": "2022-03-24T04:04:43.000Z",
  "dateModified": "2022-03-24T04:12:52.412Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如果预算永远不平衡，任何关于税收的讨论不是毫无意义吗？",
  "headline_zh-Hant": "Ask HN: 如果預算永遠不平衡，任何關於稅收的討論不是毫無意義嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我承认我并不完全了解政府如何能够在债务不断加深的情况下继续工作，我不是经济学家。但政府每次都增加债务限额，那还有什么意义呢......无论政府是通过预算花钱，还是创造货币并通过廉价贷款发放，都是一样的，不是吗......系统中更多的货币供应。在第一种情况下，预算已经是负值，只是变得更加负值。但那又怎样呢？ <p>对财富征税而不是收入征税，只有在所得税下降的情况下才有意义，但即使它们下降了，又有什么意义呢？在这一点上，政府为什么还要费力地收税呢？ <p>我真的很困惑，如果政府不再征收一切税款，而是以更快的速度增加债务，会有什么影响呢？",
  "description_zh-Hant": "我承認我並不完全瞭解政府如何能夠在債務不斷加深的情況下繼續工作，我不是經濟學家。但政府每次都增加債務限額，那還有什麼意義呢......無論政府是通過預算花錢，還是創造貨幣並通過廉價貸款發放，都是一樣的，不是嗎......系統中更多的貨幣供應。在第一種情況下，預算已經是負值，只是變得更加負值。但那又怎樣呢？ <p>對財富徵稅而不是收入徵稅，只有在所得稅下降的情況下才有意義，但即使它們下降了，又有什麼意義呢？在這一點上，政府為什麼還要費力地收稅呢？ <p>我真的很困惑，如果政府不再徵收一切稅款，而是以更快的速度增加債務，會有什麼影響呢？"
}