{
  "@type": "NewsArticle",
  "identifier": "2022--03--29--en--askhn--HackerNews--NewsArticle--30846114",
  "url": "https://news.ycombinator.com/item?id=30846114",
  "headline": "Ask HN: How do you want to buy technology?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Wondering how folks want to buy? Who's doing a great job fitting that modern buying process and why?  Who's unbearable to deal with (but you are somewhat forced to deal with them) and why?<p>It strikes me that legacy technology sales is pretty dead for the most part.  Some big purchase decisions like big ERP are still RFI/RFP driven but most SaaS/IaaS/PaaS seems more easily consumable (less risk).  Public pricing and good online documentation are much more common today which makes a big part of the process self serviceable.  How much do you want the vendor to feed this info to you vs you doing your own research?  How do you get good engagement from the sales team when you want to dig beyond the publicly available info?  How do you keep them from bugging you?<p>At some point you may want a big discount, how comfortable with actual hands on use do you need to be before you want to subject yourself to a big painful sales cycle?  How much discount would you give up to avoid a painful sales cycle?<p>Finally, any general advice you can provide as a technology buyer?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "greenail",
    "url": "https://news.ycombinator.com/user?id=greenail"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30846114",
  "sameAs": "https://news.ycombinator.com/item?id=30846114",
  "dateCreated": "2022-03-29T18:12:03.680Z",
  "datePublished": "2022-03-29T17:56:49.000Z",
  "dateModified": "2022-03-29T18:12:03.680Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你想如何购买技术？",
  "headline_zh-Hant": "Ask HN: 你想如何購買技術？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "想知道人们想如何购买？谁在做适合现代购买过程的工作，为什么？ 谁是难以忍受的人（但你在某种程度上被迫与他们打交道），为什么？<p>在我看来，传统的技术销售在大多数情况下是相当死的。 一些大的购买决定，如大型ERP仍然是由RFI/RFP驱动的，但大多数SaaS/IaaS/PaaS似乎更容易消费（风险更小）。 今天，公开定价和良好的在线文档更为普遍，这使得很大一部分过程可以自我服务。 你希望供应商在多大程度上向你提供这些信息，而不是你自己做研究？ 当你想挖掘公开信息之外的东西时，你如何从销售团队获得良好的参与？ <p>在某些时候，你可能想要一个大的折扣，在你想把自己置于一个大的痛苦的销售周期之前，你需要对实际的使用感到多么舒适？ 你会放弃多少折扣来避免痛苦的销售周期？<p>最后，作为一个技术买家，你能提供什么一般性建议吗？",
  "description_zh-Hant": "想知道人們想如何購買？誰在做適合現代購買過程的工作，為什麼？ 誰是難以忍受的人（但你在某種程度上被迫與他們打交道），為什麼？<p>在我看來，傳統的技術銷售在大多數情況下是相當死的。 一些大的購買決定，如大型ERP仍然是由RFI/RFP驅動的，但大多數SaaS/IaaS/PaaS似乎更容易消費（風險更小）。 今天，公開定價和良好的在線文檔更為普遍，這使得很大一部分過程可以自我服務。 你希望供應商在多大程度上向你提供這些信息，而不是你自己做研究？ 當你想挖掘公開信息之外的東西時，你如何從銷售團隊獲得良好的參與？ <p>在某些時候，你可能想要一個大的折扣，在你想把自己置於一個大的痛苦的銷售週期之前，你需要對實際的使用感到多麼舒適？ 你會放棄多少折扣來避免痛苦的銷售週期？<p>最後，作為一個技術買家，你能提供什麼一般性建議嗎？"
}