{
  "@type": "NewsArticle",
  "identifier": "2022--03--13--en--askhn--HackerNews--NewsArticle--30663611",
  "url": "https://news.ycombinator.com/item?id=30663611",
  "headline": "Ask HN: Should having just political borders and no social borders help?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "If the world follows a system of just political borders and remove social borders, will that reduce the fallout of wars?<p>In ideal situation I would have said that removing all borders will reduce major conflicts. But we don't live in an ideal world. The &quot;ruling class&quot; will not want to let go of the borders for political reasons. But removing social borders(i.e. allowing people to move across the world unhindered<i>) will help disconnect the masses from the classes. Most of the major wars are started by the classes and millions from the masses die due to that. If the social borders are removed, it will be very difficult for the classes to drag the masses into conflicts due to political reasons/borders. In that case the wars are then relegated to a very small section of the society and hence will be limited and of smaller duration.<p></i> with political borders comes jurisdiction, so even if social borders are removed there won't be problem of criminals going unpunished. We do have present structures such as local justice system, international courts etc in place to tackle those issues.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "m33k44",
    "url": "https://news.ycombinator.com/user?id=m33k44"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30663611",
  "sameAs": "https://news.ycombinator.com/item?id=30663611",
  "dateCreated": "2022-03-13T17:39:51.951Z",
  "datePublished": "2022-03-13T17:31:37.000Z",
  "dateModified": "2022-03-13T17:39:51.951Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 只有政治边界而没有社会边界是否应该有帮助？",
  "headline_zh-Hant": "Ask HN: 只有政治邊界而沒有社會邊界是否應該有幫助？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "如果世界遵循一个只有政治边界的制度，并取消社会边界，这是否会减少战争的后果？<p>在理想的情况下，我会说取消所有边界会减少重大冲突。但我们并没有生活在一个理想的世界里。The &quot;ruling class&quot; will not want to let go of the borders for political reasons. But removing social borders(i.e. allowing people to move across the world unhindered<i>) will help disconnect the masses from the classes. 大多数重大的战争都是由阶级发动的，数百万群众因此而死亡。如果社会边界被取消，阶级就很难因为政治原因/边界而将大众拖入冲突。在这种情况下，战争就会降到社会的很小一部分，因此会受到限制，持续时间也会变短。<p></i>有了政治边界就有了管辖权，所以即使社会边界被取消，也不会出现罪犯不受惩罚的问题。我们确实有现有的结构，如地方司法系统、国际法庭等来解决这些问题。",
  "description_zh-Hant": "如果世界遵循一個只有政治邊界的制度，並取消社會邊界，這是否會減少戰爭的後果？<p>在理想的情況下，我會說取消所有邊界會減少重大沖突。但我們並沒有生活在一個理想的世界裡。The &quot;ruling class&quot; will not want to let go of the borders for political reasons. But removing social borders(i.e. allowing people to move across the world unhindered<i>) will help disconnect the masses from the classes. 大多數重大的戰爭都是由階級發動的，數百萬群眾因此而死亡。如果社會邊界被取消，階級就很難因為政治原因/邊界而將大眾拖入衝突。在這種情況下，戰爭就會降到社會的很小一部分，因此會受到限制，持續時間也會變短。<p></i>有了政治邊界就有了管轄權，所以即使社會邊界被取消，也不會出現罪犯不受懲罰的問題。我們確實有現有的結構，如地方司法系統、國際法庭等來解決這些問題。"
}