{
  "@type": "NewsArticle",
  "identifier": "2022--04--14--en--askhn--HackerNews--NewsArticle--31029536",
  "url": "https://news.ycombinator.com/item?id=31029536",
  "headline": "Ask HN: Fortune 500 company with a whole new team of executives, time to leave?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Long story short, I've had a pretty lucrative ($XXX,XXX) contracting gig for a few years, I built a great relationship and basically did work nobody else in the entire company could do. There's now new directors, SVPs, etc. who basically know nothing about this business but are implementing generic BS like Agile and OKRs that are nothing more than busy work.<p>One of the two people who hired me recently left, and the other basically ignored my message when I asked who I should submit my timesheets to. I've been coasting (I've always stood out as an above average engineer because of my creativity and past business experience) for a while with great pay, but I think the gravy train is ending.<p>I'm not happy with my role and while I'm still being paid and nobody bothers me, I feel like I have no purpose in the overall new direction things are going and I find the new people incompetent as well. They're generic engineers who want to build cool technology instead of solving the actual business problems I've seen working 1-1 with so many people across the org top to bottom.<p>I don't plan to leave until they fire me, because I barely do any work and get paid but at the same time I feel slighted by the person who I've worked for for not responding, and I suffered an injury because of this work too (I burned days nonstop trying to build something at one point and injured myself, may need surgery).<p>I don't really feel like getting a new job because I'd have to work for more than 10 hours a week, but I also don't like hopping onto Slack and only having 2 - 3 people message me over a week or two, and I don't really have ownership over anything besides a small project with lots of delays and back and forth with nothing to do in between.<p>Feel kind of lost and like there's no future. So I ask HN, if anyone else has been here before, what should I do?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "JobReplacing",
    "url": "https://news.ycombinator.com/user?id=JobReplacing"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31029536",
  "sameAs": "https://news.ycombinator.com/item?id=31029536",
  "dateCreated": "2022-04-14T17:16:52.404Z",
  "datePublished": "2022-04-14T16:48:42.000Z",
  "dateModified": "2022-04-14T17:16:52.404Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 财富500强公司有一个全新的高管团队，是时候离开了？",
  "headline_zh-Hant": "Ask HN: 財富500強公司有一個全新的高管團隊，是時候離開了？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "长话短说，我有一个相当有利可图的（XXX美元）承包工作，几年来，我建立了一个很好的关系，基本上做了整个公司里没有人能够做的工作。现在有了新的董事、高级副总裁等，他们基本上对这一行业一无所知，但却在实施像敏捷和OKR这样的通用BS，而这些只不过是忙碌的工作。<p>雇用我的两个人中有一个最近离开了，另一个在我问我应该向谁提交时间表时基本上无视我的信息。<p>我对自己的角色并不满意，虽然我仍然有工资，也没有人打扰我，但我觉得我在整个新的发展方向上没有任何意义，而且我发现新来的人也很无能。<p>我不打算离开，直到他们解雇我，因为我几乎没有做任何工作，也没有得到报酬，但同时我觉得被我工作的人轻视了，因为他没有回应，而且我也因为这项工作受了伤（我曾经为了建造一些东西而不停地烧了好几天，弄伤了自己，可能需要手术）。 <p>我真的不想找一份新的工作，因为我必须每周工作超过10个小时，但我也不喜欢跳到Slack上，在一两个星期内只有2-3个人给我留言，而且除了一个小项目，我对任何东西都没有所有权，中间有很多拖延和来回，没有任何事情可做。<p>感觉有点失落，好像没有未来。所以我问HN，如果有人以前来过这里，我应该怎么做？",
  "description_zh-Hant": "長話短說，我有一個相當有利可圖的（XXX美元）承包工作，幾年來，我建立了一個很好的關係，基本上做了整個公司裡沒有人能夠做的工作。現在有了新的董事、高級副總裁等，他們基本上對這一行業一無所知，但卻在實施像敏捷和OKR這樣的通用BS，而這些只不過是忙碌的工作。<p>僱用我的兩個人中有一個最近離開了，另一個在我問我應該向誰提交時間表時基本上無視我的信息。<p>我對自己的角色並不滿意，雖然我仍然有工資，也沒有人打擾我，但我覺得我在整個新的發展方向上沒有任何意義，而且我發現新來的人也很無能。<p>我不打算離開，直到他們解僱我，因為我幾乎沒有做任何工作，也沒有得到報酬，但同時我覺得被我工作的人輕視了，因為他沒有迴應，而且我也因為這項工作受了傷（我曾經為了建造一些東西而不停地燒了好幾天，弄傷了自己，可能需要手術）。 <p>我真的不想找一份新的工作，因為我必須每週工作超過10個小時，但我也不喜歡跳到Slack上，在一兩個星期內只有2-3個人給我留言，而且除了一個小項目，我對任何東西都沒有所有權，中間有很多拖延和來回，沒有任何事情可做。<p>感覺有點失落，好像沒有未來。所以我問HN，如果有人以前來過這裡，我應該怎麼做？"
}