{
  "@type": "NewsArticle",
  "identifier": "2022--03--13--en--askhn--HackerNews--NewsArticle--30659588",
  "url": "https://news.ycombinator.com/item?id=30659588",
  "headline": "Ask HN: Are there scientific underpinnings for hypnosis?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I know what I'm asking. To the extent I've researched it myself (10 years ago), all I've seen is pseudoscience. But when I see stage performances like this [1], I can't help but think &quot;well, clearly this works on a small subset of people!&quot; One might argue, that that's the trick, to get highly suggestible people on there and that that's why it works. I don't think it's that simple, but more importantly that could be researched [2, 3].<p>When I look at videos like [1], I clearly see problems with the explanation of hypnosis. It is apparently the same as REM sleep, yet no studies were cited. I mean, it sounds plausible, but a lot of things sound plausible (true and untrue things). In other words, hypnotists aren't scientists. When it comes to the human mind, the best scientific role we have are psychologists.<p>Did anyone on HN do some research on this? I'm asking you, because I'm dreading that Google would show me 10 websites with nonsense for every 1 website that has a small scientific result.<p>[1] https://www.youtube.com/watch?v=1RA2Zy_IZfQ<p>[2] IMO such a thing should've been researched, wouldn't it? Get a control group and a normal person (claiming to be a hypnotist) performing a hypnosis routine without any hypnosis tricks, then get an experimental group with a hypnotist. Let them perform certain tasks and see if there are any strong differences in the suggestibility of people. If there are, then it's easy to isolate that hypnosis isn't just filtering out highly suggestible people. It simply suggests that it's one of the tricks they apply, but what are the other tricks?<p>[3] I've experienced a thing or two with meditation that seem to be related. Whenever I meditated getting into a trance or whatever they call it was never ever the point. Yet, I've been in emotional states that were very unusual and interesting. I experienced the same thing with exercise. So it seems plausible that more could be going on (but IMO that's not enough evidence, scientific research is needed).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mettamage",
    "url": "https://news.ycombinator.com/user?id=mettamage"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30659588",
  "sameAs": "https://news.ycombinator.com/item?id=30659588",
  "dateCreated": "2022-03-13T09:37:40.285Z",
  "datePublished": "2022-03-13T09:32:45.000Z",
  "dateModified": "2022-03-13T09:37:40.285Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 催眠术有科学依据吗？",
  "headline_zh-Hant": "Ask HN: 催眠術有科學依據嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我知道我在问什么。在我自己研究的范围内（10年前），我所看到的都是伪科学。但当我看到像这样的舞台表演[1]时，我不禁想：\"好吧，显然这对一小部分人是有效的！\"有人可能会说，这就是诀窍，让高度受暗示的人在那里，这就是为什么它有效。我不认为有这么简单，但更重要的是这可以被研究出来[2，3]。<p>当我看像[1]这样的视频时，我清楚地看到催眠的解释有问题。它显然与快速眼动睡眠相同，但却没有引用任何研究。我的意思是，这听起来很有道理，但很多事情听起来都很有道理（真实和不真实的事情）。换句话说，催眠师并不是科学家。当涉及到人类的思想时，我们最好的科学角色是心理学家。<p>HN上有人对此做了一些研究吗？我问你，因为我害怕谷歌会给我显示10个网站的废话，而每1个网站有一个小的科学成果。<p>[1] https://www.youtube.com/watch?v=1RA2Zy_IZfQ<p>[2] IMO这样的事情应该已经研究过了，不是吗？找一个对照组和一个正常人（自称是催眠师）执行催眠程序，没有任何催眠的技巧，然后找一个有催眠师的实验组。让他们执行某些任务，看看人们的受暗示性是否有强烈的差异。如果有，那么就很容易分离出，催眠并不只是过滤掉高度受暗示的人。这只是表明这是他们应用的技巧之一，但其他的技巧是什么呢？<p>[3]我经历过一两件与冥想似乎有关的事情。每当我冥想时，进入恍惚状态或他们所说的任何东西，从来都不是重点。然而，我曾处于非常不寻常和有趣的情绪状态。我在锻炼时也经历过同样的事情。因此，似乎有可能有更多的事情发生（但这并不是足够的证据，需要进行科学研究）。",
  "description_zh-Hant": "我知道我在問什麼。在我自己研究的範圍內（10年前），我所看到的都是偽科學。但當我看到像這樣的舞臺表演[1]時，我不禁想：\"好吧，顯然這對一小部分人是有效的！\"有人可能會說，這就是訣竅，讓高度受暗示的人在那裡，這就是為什麼它有效。我不認為有這麼簡單，但更重要的是這可以被研究出來[2，3]。<p>當我看像[1]這樣的視頻時，我清楚地看到催眠的解釋有問題。它顯然與快速眼動睡眠相同，但卻沒有引用任何研究。我的意思是，這聽起來很有道理，但很多事情聽起來都很有道理（真實和不真實的事情）。換句話說，催眠師並不是科學家。當涉及到人類的思想時，我們最好的科學角色是心理學家。<p>HN上有人對此做了一些研究嗎？我問你，因為我害怕谷歌會給我顯示10個網站的廢話，而每1個網站有一個小的科學成果。<p>[1] https://www.youtube.com/watch?v=1RA2Zy_IZfQ<p>[2] IMO這樣的事情應該已經研究過了，不是嗎？找一個對照組和一個正常人（自稱是催眠師）執行催眠程序，沒有任何催眠的技巧，然後找一個有催眠師的實驗組。讓他們執行某些任務，看看人們的受暗示性是否有強烈的差異。如果有，那麼就很容易分離出，催眠並不只是過濾掉高度受暗示的人。這只是表明這是他們應用的技巧之一，但其他的技巧是什麼呢？<p>[3]我經歷過一兩件與冥想似乎有關的事情。每當我冥想時，進入恍惚狀態或他們所說的任何東西，從來都不是重點。然而，我曾處於非常不尋常和有趣的情緒狀態。我在鍛鍊時也經歷過同樣的事情。因此，似乎有可能有更多的事情發生（但這並不是足夠的證據，需要進行科學研究）。"
}