{
  "@type": "NewsArticle",
  "identifier": "2022--03--20--en--askhn--HackerNews--NewsArticle--30745411",
  "url": "https://news.ycombinator.com/item?id=30745411",
  "headline": "Ask HN: How to find companies that build sustainably?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This is going to be a very cynical post. If you just want to sneer at me, please just save us both some time and skip it.<p>My current position has left me questioning much of what I thought about my career, tech industry, and business.<p>The philosophy here boils down to:<p>&quot;We need to move extremely fast.<p>Why? Because there's no moat, and competitors will eat us alive, eventually.<p>Therefore, we have to build the crappiest thing we can as fast as possible and make enumerable business promises that we don't have the human capacity to keep.<p>Therefore, the only people who will survive at this company will be those who don't really care that what they're building is setting up the next person for a world of pain.<p>Everyone who wants to do a truly good job will burn out and/or be pushed out.<p>But we'll keep attracting starry-eyed talent by puffing ourselves up as this incredible, smart organization (that, for now, is making money).&quot;<p>The thing is, I chose this situation based on what I thought a successful company looks like. Now, I want to work somewhere:<p>1) That has slack built in.\n2) That gives a damn about system quality.\n3) That can grow without overreaching (see point 1).<p>Does this type of company even exist? I feel like even if it does, I'm blind to it because my head has been in this &quot;uber-lean startup&quot; space and I almost can't believe anything else exists.<p>It seems like, if something isn't trying to grow at breakneck speed, it is stagnating or dying.<p>I want to believe this isn't the case.<p>Have you found a place in this world that grows sustainably? If so, how, and do you think I can replicate the search strategy?<p>Thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "bckr",
    "url": "https://news.ycombinator.com/user?id=bckr"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30745411",
  "sameAs": "https://news.ycombinator.com/item?id=30745411",
  "dateCreated": "2022-03-20T18:52:15.487Z",
  "datePublished": "2022-03-20T18:50:24.000Z",
  "dateModified": "2022-03-20T18:52:15.487Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何找到可持续建设的公司？",
  "headline_zh-Hant": "Ask HN: 如何找到可持續建設的公司？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这将是一个非常愤世嫉俗的帖子。如果你只是想嘲笑我，请省去我们两个人的时间，跳过它。<p>我目前的职位让我对我的职业、技术行业和商业的许多想法产生了怀疑。<p>这里的哲学归结为：<p>&quot;我们需要极快地发展。<p>为什么？因为没有护城河，竞争对手最终会把我们生吞活剥。<p>因此，我们必须尽可能快地建立最糟糕的东西，并作出无数的商业承诺，但我们没有能力履行这些承诺。<p>因此，唯一能在这家公司生存的人将是那些并不真正关心他们所建立的东西正在为下一个人带来痛苦的人。 <p>每一个想真正做好工作的人都会被淘汰和/或被挤走。<p>但我们会继续吸引那些满怀希望的人才，把自己吹嘘成一个不可思议的、聪明的组织（目前，它正在赚钱）。现在，我想在这样的地方工作：<p>1）有松弛的内涵。\n2）对系统质量非常重视。\n<p>这种类型的公司存在吗？我觉得即使存在，我也对它视而不见，因为我的头脑一直在这个 \"超瘦的创业公司 \"的空间里，我几乎不相信还有别的东西存在。<p>似乎，如果某样东西不试图以极快的速度增长，它就会停滞不前或死亡。如果是这样，是如何做到的，你认为我可以复制这种搜索策略吗？<p>谢谢。",
  "description_zh-Hant": "這將是一個非常憤世嫉俗的帖子。如果你只是想嘲笑我，請省去我們兩個人的時間，跳過它。<p>我目前的職位讓我對我的職業、技術行業和商業的許多想法產生了懷疑。<p>這裡的哲學歸結為：<p>&quot;我們需要極快地發展。<p>為什麼？因為沒有護城河，競爭對手最終會把我們生吞活剝。<p>因此，我們必須儘可能快地建立最糟糕的東西，並作出無數的商業承諾，但我們沒有能力履行這些承諾。<p>因此，唯一能在這家公司生存的人將是那些並不真正關心他們所建立的東西正在為下一個人帶來痛苦的人。 <p>每一個想真正做好工作的人都會被淘汰和/或被擠走。<p>但我們會繼續吸引那些滿懷希望的人才，把自己吹噓成一個不可思議的、聰明的組織（目前，它正在賺錢）。現在，我想在這樣的地方工作：<p>1）有鬆弛的內涵。\n2）對系統質量非常重視。\n<p>這種類型的公司存在嗎？我覺得即使存在，我也對它視而不見，因為我的頭腦一直在這個 \"超瘦的創業公司 \"的空間裡，我幾乎不相信還有別的東西存在。<p>似乎，如果某樣東西不試圖以極快的速度增長，它就會停滯不前或死亡。如果是這樣，是如何做到的，你認為我可以複製這種搜索策略嗎？<p>謝謝。"
}