{
  "@type": "NewsArticle",
  "identifier": "2022--04--12--en--askhn--HackerNews--NewsArticle--31005777",
  "url": "https://news.ycombinator.com/item?id=31005777",
  "headline": "Ask HN: How to get bilingual in a country where the language is not used?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm a Spanish native speaker. I started working as a Junior SWE for a consultant company. We work with American-based companies so English is a key to treat with clients and teammates. Improving my English has been one of my main goals over the last 6 months.<p>I have improved my English a lot in the last few months. I go to classes twice a week and use it every day. However, I feel stuck right now. I am fully capable to have conversations about almost anything, but I don’t feel fluent at all. I know that learning a language is practice, and it’s a slow process, but I feel that I will seldom get a fluent level without living in a foreign country. It’s something that I want to do, but it’s not a real thing to do right now since I don’t have the necessary experience to make a company pay me a visa to emigrate (even in Europa where I can work locally).<p>I know that almost every non-English speaker here has been in the same situation that I’m right now, so I would like you to provide me with methods or things to do to learn English in a non-English country.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "corderop",
    "url": "https://news.ycombinator.com/user?id=corderop"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31005777",
  "sameAs": "https://news.ycombinator.com/item?id=31005777",
  "dateCreated": "2022-04-12T17:36:54.936Z",
  "datePublished": "2022-04-12T17:33:14.000Z",
  "dateModified": "2022-04-12T17:36:54.936Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何在一个不使用该语言的国家获得双语？",
  "headline_zh-Hant": "Ask HN: 如何在一個不使用該語言的國家獲得雙語？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个以西班牙语为母语的人。我开始在一家咨询公司担任初级SWE的工作。我们与总部设在美国的公司合作，所以英语是与客户和队友交往的关键。在过去的6个月里，提高我的英语水平是我的主要目标之一。<p>在过去的几个月里，我的英语有了很大的提高。我每周去上两次课，每天都在使用它。然而，我现在感觉被卡住了。我完全有能力就几乎任何事情进行对话，但我感觉一点也不流利。我知道学习语言是一种练习，而且是一个缓慢的过程，但我觉得如果不在外国生活，我很少能达到流利的水平。这是我想做的事情，但现在不是一个真正的事情，因为我没有必要的经验让公司付给我移民的签证（即使是在欧洲，我可以在当地工作）。<p>我知道这里几乎每个非英语国家的人都有过和我现在一样的情况，所以我希望你能给我提供在非英语国家学习英语的方法或事情。",
  "description_zh-Hant": "我是一個以西班牙語為母語的人。我開始在一家諮詢公司擔任初級SWE的工作。我們與總部設在美國的公司合作，所以英語是與客戶和隊友交往的關鍵。在過去的6個月裡，提高我的英語水平是我的主要目標之一。<p>在過去的幾個月裡，我的英語有了很大的提高。我每週去上兩次課，每天都在使用它。然而，我現在感覺被卡住了。我完全有能力就幾乎任何事情進行對話，但我感覺一點也不流利。我知道學習語言是一種練習，而且是一個緩慢的過程，但我覺得如果不在外國生活，我很少能達到流利的水平。這是我想做的事情，但現在不是一個真正的事情，因為我沒有必要的經驗讓公司付給我移民的簽證（即使是在歐洲，我可以在當地工作）。<p>我知道這裡幾乎每個非英語國家的人都有過和我現在一樣的情況，所以我希望你能給我提供在非英語國家學習英語的方法或事情。"
}