{
  "@type": "NewsArticle",
  "identifier": "2022--03--26--en--askhn--HackerNews--NewsArticle--30808821",
  "url": "https://news.ycombinator.com/item?id=30808821",
  "headline": "Ask HN: Migrating from Confluence to Sharepoint, Help",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "My company is rolling out M365 and is going to sunset Confluence.<p>My team has made confluence an integral part of our daily work. We use it for two purposes:<p>1) knowledge repository. all major process instructions, tools, on-boarding information, workflow diagrams, etc. get written documentation in confluence.<p>2) meeting notes &amp; follow ups. before each meeting the host creates an agenda template in confluence, all attendees edit concurrently with their updates / topics in written form. we read ahead of time and minimize meeting time by discussing the written updates only. follow ups from the meeting are tracked using checkboxes and @ mentions in confluence that get aggregated up to the space level.<p>Most of us watch the entire space so get email  updates of new content / edits, etc.  People feel comfortable skipping meetings when they have nothing to add because they know that there will be thorough notes of the topics and they won't miss out on information.<p>This is all going away and I need to figure out the best way to replicate it in the microsoft stack. It seems like there are a myriad of ways to accomplish any particular task in teams/sharepoint.<p>Does HN have any suggestions for how to best do what I described above?<p>Also, some general observations about sharepoint I'm wondering if anyone could tell me if they're true:<p>Search seems woefully inadequate, and there seems to be a lack of transparency in that users don't see anything unless they've been explicitly granted access, and even then the top level sharepoint has no functionality to browse sites you have access to, you have to know about it, or access it through teams. Contrast with confluence there's a news feed and most spaces across our company are public so if you like you can see activity other teams are up to there or find things in other team spaces that might be relevant to your group via search.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "argella",
    "url": "https://news.ycombinator.com/user?id=argella"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30808821",
  "sameAs": "https://news.ycombinator.com/item?id=30808821",
  "dateCreated": "2022-03-26T02:57:31.316Z",
  "datePublished": "2022-03-26T02:43:34.000Z",
  "dateModified": "2022-03-26T02:57:31.316Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 从Confluence迁移到Sharepoint, 帮助",
  "headline_zh-Hant": "Ask HN: 從Confluence遷移到Sharepoint, 幫助",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的公司正在推出M365，并将关闭Confluence。<p>我的团队已经将Confluence作为我们日常工作的一个组成部分。我们使用它有两个目的：<p>1）知识库。所有主要的流程说明、工具、入职信息、工作流程图等都在confluence中得到书面记录。<p>2）会议记录和；跟进。每次会议前，主持人在confluence中创建一个议程模板，所有与会者同时以书面形式编辑其更新/主题。我们提前阅读，并通过讨论书面更新来尽量减少会议时间。会议的后续行动是通过confluence中的复选框和@ mentions来追踪的，这些复选框和@ mentions会被汇总到空间层面。<p>我们中的大多数人都在关注整个空间，所以会收到新内容/编辑等的电子邮件更新。 当人们没有什么要补充的时候，他们会觉得跳过会议很舒服，因为他们知道会有详尽的主题笔记，他们不会错过任何信息。<p>这一切都会消失，我需要找出在微软堆栈中复制它的最佳方法。<p>在团队/共享点中，似乎有无数种方法可以完成任何特定的任务。<p>对于如何最好地完成我上面描述的事情，HN有什么建议吗？ <p>另外，关于sharepoint的一些普遍看法，我想知道是否有人能告诉我这些看法是否属实：<p>搜索似乎很不充分，而且似乎缺乏透明度，除非用户被明确授予访问权，否则他们不会看到任何东西，即使如此，顶级sharepoint也没有浏览你所访问的网站的功能，你必须知道它，或通过团队访问它。与confluence相比，它有一个新闻源，而且我们公司的大多数空间都是公开的，所以如果你喜欢，你可以看到其他团队在那里的活动，或者通过搜索找到其他团队空间中可能与你的小组有关的东西。",
  "description_zh-Hant": "我的公司正在推出M365，並將關閉Confluence。<p>我的團隊已經將Confluence作為我們日常工作的一個組成部分。我們使用它有兩個目的：<p>1）知識庫。所有主要的流程說明、工具、入職信息、工作流程圖等都在confluence中得到書面記錄。<p>2）會議記錄和；跟進。每次會議前，主持人在confluence中創建一個議程模板，所有與會者同時以書面形式編輯其更新/主題。我們提前閱讀，並通過討論書面更新來儘量減少會議時間。會議的後續行動是通過confluence中的複選框和@ mentions來追蹤的，這些複選框和@ mentions會被彙總到空間層面。<p>我們中的大多數人都在關注整個空間，所以會收到新內容/編輯等的電子郵件更新。 當人們沒有什麼要補充的時候，他們會覺得跳過會議很舒服，因為他們知道會有詳盡的主題筆記，他們不會錯過任何信息。<p>這一切都會消失，我需要找出在微軟堆棧中複製它的最佳方法。<p>在團隊/共享點中，似乎有無數種方法可以完成任何特定的任務。<p>對於如何最好地完成我上面描述的事情，HN有什麼建議嗎？ <p>另外，關於sharepoint的一些普遍看法，我想知道是否有人能告訴我這些看法是否屬實：<p>搜索似乎很不充分，而且似乎缺乏透明度，除非用戶被明確授予訪問權，否則他們不會看到任何東西，即使如此，頂級sharepoint也沒有瀏覽你所訪問的網站的功能，你必須知道它，或通過團隊訪問它。與confluence相比，它有一個新聞源，而且我們公司的大多數空間都是公開的，所以如果你喜歡，你可以看到其他團隊在那裡的活動，或者通過搜索找到其他團隊空間中可能與你的小組有關的東西。"
}