{
  "@type": "NewsArticle",
  "identifier": "2022--04--10--en--askhn--HackerNews--NewsArticle--30975586",
  "url": "https://news.ycombinator.com/item?id=30975586",
  "headline": "Ask HN: What Happened to Evernote?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have depended on Evernote for a long time without even realizing how much of a daily utility it is. It has been so seamless that I had forgotten I was rolling with the free version, until recently. I noticed a few UI changes which seemed a little unintuitive and some of my notes didn't seem to sync as reliably between my phone and laptop. No biggie, I have gotten used to updates.<p>Then this week I was working through a new project on a customer's site taking notes in Evernote as I normally do. I spent a good chunk of time going through the project onsite and making a comprehensive list of everything that would need to be done. I noticed the header on my note was grey but assumed it was a UI change. I had 4G reception on my phone and figured, even if something's not quite right I can sync it up back at the office like I normally do as the note would be on my phone. So I proceeded like normal.<p>The whole note is gone as if it never existed.<p>Is this some sort of effort to onboard me to the paid version?\nHave I inadvertently clicked a &quot;yes I accept that the free version is going to become unreliable&quot; button?<p>I appreciate I am not a great customer - I have been using a free version for years without even thinking about it. But thats kind of the point, Evernote worked so well I never gave it a second thought.<p>Now I am not 100% sure on the safety of my notes...<p>What is other people's experience? Have I just been caught napping because I mindlessly clicked an updated terms of use without reading it (as I do)?<p>If I go paid am I getting something as good as what the old Evernote was like?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cconcepts",
    "url": "https://news.ycombinator.com/user?id=cconcepts"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30975586",
  "sameAs": "https://news.ycombinator.com/item?id=30975586",
  "dateCreated": "2022-04-10T09:30:16.689Z",
  "datePublished": "2022-04-10T09:27:03.000Z",
  "dateModified": "2022-04-10T09:30:16.689Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: Evernote发生了什么？",
  "headline_zh-Hant": "Ask HN: Evernote發生了什麼？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我已经依赖Evernote很长时间了，甚至没有意识到它是多么的日常实用。它是如此完美，以至于我都忘记了我在使用免费版本，直到最近。我注意到一些用户界面的变化，这似乎有点不直观，而且我的一些笔记似乎不能在我的手机和笔记本电脑之间可靠地同步。没什么大不了的，我已经习惯了更新。<p>这周，我在一个客户的网站上做了一个新项目，像往常一样在Evernote中做笔记。我花了很多时间在现场查看该项目，并列出了一份需要完成的所有工作的综合清单。我注意到我的笔记的标题是灰色的，但我认为这是一个用户界面的变化。我的手机有4G信号，我想，即使有什么不对劲的地方，我也可以像平时一样在办公室里同步，因为笔记就在我的手机上。<p>整个笔记不见了，就像它从未存在过一样。<p>这是不是为了让我加入付费版本的某种努力？\n我是否无意中点击了一个&quot;是的，我接受免费版本将变得不可靠&quot;的按钮？<p>我知道我不是一个伟大的客户--我已经使用了多年的免费版本，甚至没有想过它。但这也是问题的关键，Evernote工作得很好，我从未考虑过它。<p>现在我对我的笔记的安全性没有100%的把握......<p>其他人的经验是什么？我是否只是因为没有阅读更新的使用条款而被抓了个正着？<p>如果我付费的话，我得到的东西是否和以前的Evernote一样好？",
  "description_zh-Hant": "我已經依賴Evernote很長時間了，甚至沒有意識到它是多麼的日常實用。它是如此完美，以至於我都忘記了我在使用免費版本，直到最近。我注意到一些用戶界面的變化，這似乎有點不直觀，而且我的一些筆記似乎不能在我的手機和筆記本電腦之間可靠地同步。沒什麼大不了的，我已經習慣了更新。<p>這周，我在一個客戶的網站上做了一個新項目，像往常一樣在Evernote中做筆記。我花了很多時間在現場查看該項目，並列出了一份需要完成的所有工作的綜合清單。我注意到我的筆記的標題是灰色的，但我認為這是一個用戶界面的變化。我的手機有4G信號，我想，即使有什麼不對勁的地方，我也可以像平時一樣在辦公室裡同步，因為筆記就在我的手機上。<p>整個筆記不見了，就像它從未存在過一樣。<p>這是不是為了讓我加入付費版本的某種努力？\n我是否無意中點擊了一個&quot;是的，我接受免費版本將變得不可靠&quot;的按鈕？<p>我知道我不是一個偉大的客戶--我已經使用了多年的免費版本，甚至沒有想過它。但這也是問題的關鍵，Evernote工作得很好，我從未考慮過它。<p>現在我對我的筆記的安全性沒有100%的把握......<p>其他人的經驗是什麼？我是否只是因為沒有閱讀更新的使用條款而被抓了個正著？<p>如果我付費的話，我得到的東西是否和以前的Evernote一樣好？"
}