{
  "@type": "NewsArticle",
  "identifier": "2022--03--22--en--askhn--HackerNews--NewsArticle--30768701",
  "url": "https://news.ycombinator.com/item?id=30768701",
  "headline": "Ask HN: Diagnosed with genetic heart disease at 25 – how do I make an impact?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have been diagnosed with pre-clinical hypertrophic cardiomyopathy (HCM), a form of genetic heart disease where the heart becomes abnormally thick. It affects 1 in 500 people (most asymptomatically) and is the leading cause of sudden death amongst otherwise healthy young athletes.<p>My father is currently suffering symptoms, and my uncle died before the age of 50 from sudden cardiac death caused by HCM. While modern technology such as implantable defibrillators greatly reduce the chances of sudden cardiac death, the degenerative consequences of the disease that probably await me are daunting and scary for a fit and sporty 25 year old.<p>HCM has only recently begun to emerge from a dark age of being viewed as a benign tumor that can be cut and hacked away at; in reality it is an interesting condition for which drugs and treatments can be specifically developed. Some of the first generation of HCM drugs, myosin inhibitors, are undergoing clinical trials and one, mavacamten, is awaiting FDA approval. These drugs help reduce obstructive symptoms and benefit the structure of the heart, but the root cause, the faulty genes, are left unchanged and the heart continues to thicken. As the genes that cause HCM are known and can be identified by sequencing ones DNA my instinct is that HCM is particularly suited to gene therapy.<p>I am a recent graduate in computer science, with a bachelors and masters degree. It is hubris (and dangerous) to think that I could save or cure myself, but I have been toying with the idea of doing a PhD in Genetics or a related field and then further research on gene therapy applicable to the heart.<p>I don't want to start suffering symptoms later in life and regret that I played it safe and did not try to contribute to fighting HCM. It helps that I have not yet found happiness in the working world and was most fulfilled when independently learning and solving problems at university.<p>---<p>My questions to you HNers:<p>How can I make the most impact against HCM? A genetics/gene therapy PhD? Apply to AI-aided drug discovery start-ups? Would comp sci give me an edge or just leave me playing catch-up with the biologists?<p>Is it sensible or healthy to even try? The slow pace of medical advancement &amp; regulation (in comparison to software) and the very personal consequences of failure would be mentally difficult.<p>Would I be better off staying in software, earning as much money as possible to get the best healthcare and ensure any future children don't carry the genes? Or should I try to maximise happiness while I am still healthy (which is easier said than done)?<p>Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "hcmthrowaway",
    "url": "https://news.ycombinator.com/user?id=hcmthrowaway"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30768701",
  "sameAs": "https://news.ycombinator.com/item?id=30768701",
  "dateCreated": "2022-03-22T17:54:08.251Z",
  "datePublished": "2022-03-22T17:08:22.000Z",
  "dateModified": "2022-03-22T17:54:08.251Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 25岁时被诊断出患有遗传性心脏病--我怎样才能产生影响？",
  "headline_zh-Hant": "Ask HN: 25歲時被診斷出患有遺傳性心臟病--我怎樣才能產生影響？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我被诊断出患有临床前肥厚型心肌病（HCM），这是一种遗传性心脏病，心脏会变得异常肥厚。它影响到每500人中的1人（大多数是无症状的），是其他健康的年轻运动员中猝死的主要原因。<p>我的父亲目前正在遭受症状，我的叔叔在50岁之前死于HCM引起的心脏猝死。虽然植入式除颤器等现代技术大大降低了心脏猝死的几率，但对于一个身体健康、喜欢运动的25岁年轻人来说，这种疾病可能带来的退行性后果令人生畏和恐惧。<p>HCM最近才开始摆脱被视为可以切割和砍掉的良性肿瘤的黑暗时代；实际上，它是一种有趣的疾病，可以专门开发药物和疗法。一些第一代HCM药物，即肌球蛋白抑制剂，正在进行临床试验，其中一个药物，即mavacamten，正在等待FDA批准。这些药物有助于减少阻塞性症状，并有利于心脏结构，但根本原因，即错误的基因，却没有改变，心脏继续变厚。由于导致HCM的基因是已知的，并且可以通过DNA测序来确定，我的直觉是HCM特别适合基因治疗。<p>我是计算机科学的应届毕业生，拥有学士和硕士学位。如果认为我可以拯救或治愈自己，那是一种狂妄（也很危险），但我一直在考虑攻读遗传学或相关领域的博士学位，然后进一步研究适用于心脏的基因疗法。<p>我不想在以后的生活中开始遭受症状，并为自己的安全而没有尝试为对抗HCM做出贡献而后悔。我还没有在工作中找到幸福感，在大学里独立学习和解决问题时，我感到最充实。<p>----<p>我向各位HNers提出的问题：<p>我怎样才能对HCM产生最大的影响？遗传学/基因治疗博士？申请人工智能辅助药物发现的初创公司？汇编科学会不会给我带来优势，或者只是让我追赶生物学家的脚步？<p>尝试一下是否明智或健康？医学进步的步伐缓慢；监管（与软件相比）和失败的个人后果将使我在精神上感到困难。<p>我是否应该留在软件行业，尽可能多地赚钱以获得最好的医疗保健并确保任何未来的孩子不携带基因？或者我应该在我仍然健康的时候努力使幸福最大化（这说起来容易做起来难）？",
  "description_zh-Hant": "我被診斷出患有臨床前肥厚型心肌病（HCM），這是一種遺傳性心臟病，心臟會變得異常肥厚。它影響到每500人中的1人（大多數是無症狀的），是其他健康的年輕運動員中猝死的主要原因。<p>我的父親目前正在遭受症狀，我的叔叔在50歲之前死於HCM引起的心臟猝死。雖然植入式除顫器等現代技術大大降低了心臟猝死的幾率，但對於一個身體健康、喜歡運動的25歲年輕人來說，這種疾病可能帶來的退行性後果令人生畏和恐懼。<p>HCM最近才開始擺脫被視為可以切割和砍掉的良性腫瘤的黑暗時代；實際上，它是一種有趣的疾病，可以專門開發藥物和療法。一些第一代HCM藥物，即肌球蛋白抑制劑，正在進行臨床試驗，其中一個藥物，即mavacamten，正在等待FDA批准。這些藥物有助於減少阻塞性症狀，並有利於心臟結構，但根本原因，即錯誤的基因，卻沒有改變，心臟繼續變厚。由於導致HCM的基因是已知的，並且可以通過DNA測序來確定，我的直覺是HCM特別適合基因治療。<p>我是計算機科學的應屆畢業生，擁有學士和碩士學位。如果認為我可以拯救或治癒自己，那是一種狂妄（也很危險），但我一直在考慮攻讀遺傳學或相關領域的博士學位，然後進一步研究適用於心臟的基因療法。<p>我不想在以後的生活中開始遭受症狀，併為自己的安全而沒有嘗試為對抗HCM做出貢獻而後悔。我還沒有在工作中找到幸福感，在大學裡獨立學習和解決問題時，我感到最充實。<p>----<p>我向各位HNers提出的問題：<p>我怎樣才能對HCM產生最大的影響？遺傳學/基因治療博士？申請人工智能輔助藥物發現的初創公司？彙編科學會不會給我帶來優勢，或者只是讓我追趕生物學家的腳步？<p>嘗試一下是否明智或健康？醫學進步的步伐緩慢；監管（與軟件相比）和失敗的個人後果將使我在精神上感到困難。<p>我是否應該留在軟件行業，儘可能多地賺錢以獲得最好的醫療保健並確保任何未來的孩子不攜帶基因？或者我應該在我仍然健康的時候努力使幸福最大化（這說起來容易做起來難）？"
}