{
  "@type": "NewsArticle",
  "identifier": "2022--03--26--en--askhn--HackerNews--NewsArticle--30808265",
  "url": "https://news.ycombinator.com/item?id=30808265",
  "headline": "Ask HN: Sequester Carbon with Wave Power?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Picture a fabric structure floating, anchored, in the ocean, roughly tube-shaped. At the surface, the edge is supported a few feet above average water level, positioned so waves wash over the edge into it. Once in, the only way out is down to the bottom end of the tube, say a thousand meters deep.<p>In the tube, where it narrows, is a flow meter and a pH meter. Water at the surface has atmospheric CO2 dissolved in it, which in water becomes carbonic acid, so the metrics report the exact quantity of atmospheric CO2 being driven to the deeps. Certified, transmitted by satellite, I think this should be able to be sold as carbon credits.<p>High waves are a shallow-water phenomenon, so the tube would need to be slanted to exhaust out in deep water, probably situated near an underwater cliff. The amount of wave water that can be collected depends on the perimeter, so the overall shape needs to be like a funnel, very wide at the top, but narrower below so the total amount of fabric needed is not extreme.<p>(Some may question whether this would acidify the deep ocean. A bit of calculation shows not, provided we cut carbon emissions in coming decades.)<p>I imagine thousands, maybe ultimately millions of these installed worldwide to draw down atmospheric CO2 using the whole ocean surface to collect it.<p>Is there anything I am misunderstanding about how carbon credits are awarded? How does one get metrics certified?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ncmncm",
    "url": "https://news.ycombinator.com/user?id=ncmncm"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30808265",
  "sameAs": "https://news.ycombinator.com/item?id=30808265",
  "dateCreated": "2022-03-26T00:36:20.336Z",
  "datePublished": "2022-03-26T00:32:48.000Z",
  "dateModified": "2022-03-26T00:36:20.336Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 用波浪发电封存碳？",
  "headline_zh-Hant": "Ask HN: 用波浪發電封存碳？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "想象一下，一个漂浮在海洋中的织物结构，被锚定，大致呈管状。在海面上，边缘被支撑在平均水位以上几英尺的地方，其位置使海浪从边缘冲入。一旦进入，唯一的出路是下到管子的底端，例如一千米深。<p>在管子里，在它变窄的地方，有一个流量计和一个pH计。地表的水溶解了大气中的二氧化碳，在水中变成了碳酸，因此这些指标报告了大气中的二氧化碳被驱赶到深海的确切数量。经过认证，由卫星传输，我想这应该可以作为碳信用额度出售。<p>高浪是一种浅水现象，所以管子需要倾斜，在深水中排气，可能位于水下悬崖附近。可以收集到的波浪水的数量取决于周长，所以整体形状需要像一个漏斗，顶部非常宽，但下面比较窄，这样所需的织物总量就不会太多。<p>（有些人可能会质疑这是否会使深海酸化。<p>我设想在全球范围内安装数千个，甚至数百万个这样的装置，利用整个海洋表面来收集大气中的二氧化碳。<p>对于如何授予碳信用，我是否有什么误解？一个人如何获得指标认证？",
  "description_zh-Hant": "想象一下，一個漂浮在海洋中的織物結構，被錨定，大致呈管狀。在海面上，邊緣被支撐在平均水位以上幾英尺的地方，其位置使海浪從邊緣衝入。一旦進入，唯一的出路是下到管子的底端，例如一千米深。<p>在管子裡，在它變窄的地方，有一個流量計和一個pH計。地表的水溶解了大氣中的二氧化碳，在水中變成了碳酸，因此這些指標報告了大氣中的二氧化碳被驅趕到深海的確切數量。經過認證，由衛星傳輸，我想這應該可以作為碳信用額度出售。<p>高浪是一種淺水現象，所以管子需要傾斜，在深水中排氣，可能位於水下懸崖附近。可以收集到的波浪水的數量取決於周長，所以整體形狀需要像一個漏斗，頂部非常寬，但下面比較窄，這樣所需的織物總量就不會太多。<p>（有些人可能會質疑這是否會使深海酸化。<p>我設想在全球範圍內安裝數千個，甚至數百萬個這樣的裝置，利用整個海洋表面來收集大氣中的二氧化碳。<p>對於如何授予碳信用，我是否有什麼誤解？一個人如何獲得指標認證？"
}