{
  "@type": "NewsArticle",
  "identifier": "2022--02--23--en--askhn--HackerNews--NewsArticle--30436147",
  "url": "https://news.ycombinator.com/item?id=30436147",
  "headline": "Ask HN: Is Amazon distributing malware infested laptops?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I recently bought an upgraded HP laptop from Amazon. The memory and storage were upgraded by Oydisen Electronics. \nAfter 2 weeks of use, the laptop shut off. In restarting, an HP screen let me know that no OS was detected. I worked through some HP troubleshooting steps and the laptop could not detect an SSD. I tried taking the back panel off to see if the SSD had somehow come loose, but it is glued to something in the middle, and forcing it off would mean breaking the back panel and maybe the motherboard if that is what it is glued to. \nI asked the seller about this and they just told me to return it, but I had already saved so many personal files to the drive when it disappeared, and I do not feel comfortable returning it like this.\nI have tried Linux/Windows USB installations, but neither could detect any drives (after USB).\nIt seems that I will be taking the $1000 hit on this. Amazon refuses to refund me without a return, and returning it would mean submitting my financials, health records, passwords, etc., to the mercy of Oydisen Electronics. \nCould this be a self-destructing laptop by design of Oydisen Electronics? It certainly looks that way to me.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mattymf",
    "url": "https://news.ycombinator.com/user?id=mattymf"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30436147",
  "sameAs": "https://news.ycombinator.com/item?id=30436147",
  "dateCreated": "2022-02-23T01:57:04.319Z",
  "datePublished": "2022-02-23T00:56:10.000Z",
  "dateModified": "2022-02-23T01:57:04.319Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 亚马逊是否在分发被恶意软件侵袭的笔记本电脑？",
  "headline_zh-Hant": "Ask HN: 亞馬遜是否在分發被惡意軟件侵襲的筆記本電腦？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我最近从亚马逊买了一台升级版的惠普笔记本电脑。内存和存储是由Oydisen电子公司升级的。\n使用了2周后，笔记本关机了。在重新启动时，一个惠普屏幕让我知道没有检测到操作系统。我通过惠普的一些故障排除步骤，笔记本电脑无法检测到SSD。我试着把后面板拆下来，看看固态硬盘是否以某种方式松动了，但它是粘在中间的东西上的，强行把它拆下来就意味着打破后面板，如果它是粘在主板上的，可能就会打破主板。\n我问了卖家这个问题，他们只是告诉我把它退掉，但是当它消失的时候，我已经把很多个人文件保存在硬盘上了，我觉得这样退掉它不太合适。\n我试过Linux/Windows的USB安装，但都无法检测到任何驱动器（USB后）。\n看来，我将为此承担1000美元的损失。亚马逊拒绝在没有退货的情况下给我退款，而退货则意味着将我的财务状况、健康记录、密码等提交给奥迪森电子公司的怜悯。\n这可能是一个由Oydisen Electronics设计的自毁的笔记本电脑吗？对我来说，它肯定是这样的。",
  "description_zh-Hant": "我最近從亞馬遜買了一臺升級版的惠普筆記本電腦。內存和存儲是由Oydisen電子公司升級的。\n使用了2周後，筆記本關機了。在重新啟動時，一個惠普屏幕讓我知道沒有檢測到操作系統。我通過惠普的一些故障排除步驟，筆記本電腦無法檢測到SSD。我試著把後面板拆下來，看看固態硬盤是否以某種方式鬆動了，但它是粘在中間的東西上的，強行把它拆下來就意味著打破後面板，如果它是粘在主板上的，可能就會打破主板。\n我問了賣家這個問題，他們只是告訴我把它退掉，但是當它消失的時候，我已經把很多個人文件保存在硬盤上了，我覺得這樣退掉它不太合適。\n我試過Linux/Windows的USB安裝，但都無法檢測到任何驅動器（USB後）。\n看來，我將為此承擔1000美元的損失。亞馬遜拒絕在沒有退貨的情況下給我退款，而退貨則意味著將我的財務狀況、健康記錄、密碼等提交給奧迪森電子公司的憐憫。\n這可能是一個由Oydisen Electronics設計的自毀的筆記本電腦嗎？對我來說，它肯定是這樣的。"
}