{
  "@type": "NewsArticle",
  "identifier": "2022--04--13--en--askhn--HackerNews--NewsArticle--31018941",
  "url": "https://news.ycombinator.com/item?id=31018941",
  "headline": "Ask HN: Can I call myself a senior?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey guys,<p>I would like to know which state i’m currently in. I got my bachelors degree last year. I resigned at the end of June. Due to the setup of the study, i’ve got 2 years of part time and almost 4 years of full-time experience in software development.<p>In my current job, I do ERP-Desktop-Software development with Delphi and MSSQL-Database. Additionally, I do project management, analyze problems and develop solutions together with the customers, support, etc. (It’s a very small company, so the list goes on.) It’s important to note that my employer is extremely happy with the work I’ve done.<p>In the new job, I would like to do full-stack development on a modern stack. For example JAM, with a proper backend and something like ReactJS on the frontend. In preparation, I learned my last missing basic (CSS). I’m doing so by building a personal forum with nextjs and postgresql.<p>My question remains whether I can call myself a senior. Of course, I'm missing a lot of experience in the web-dev field. But on the contrary, i learned a lot of the current technologies and how to design and develop software in general already. Like debugging your code, finding errors, etc.<p>How do I compare to someone who’s done web development for 4-5 years?\nHow important is the actual language when it comes to applying for a job in another field?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "azoth128",
    "url": "https://news.ycombinator.com/user?id=azoth128"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31018941",
  "sameAs": "https://news.ycombinator.com/item?id=31018941",
  "dateCreated": "2022-04-13T19:35:13.172Z",
  "datePublished": "2022-04-13T19:15:01.000Z",
  "dateModified": "2022-04-13T19:35:13.172Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我可以称自己为长者吗？",
  "headline_zh-Hant": "Ask HN: 我可以稱自己為長者嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，伙计们，<p>我想知道我目前在哪个州。我去年拿到了我的本科学位。我在六月底辞职了。由于学习的设置，我有2年的兼职和近4年的全职软件开发经验。<p>在我目前的工作中，我用Delphi和MSSQL-数据库做ERP-桌面-软件开发。此外，我还做项目管理，分析问题并与客户一起开发解决方案，提供支持等。(这是一个非常小的公司，所以这个名单还在继续。)重要的是，我的雇主对我所做的工作非常满意。<p>在新的工作中，我想在现代堆栈上做全栈开发。例如，JAM，有一个适当的后台，在前端有类似ReactJS的东西。在准备过程中，我学习了我最后缺失的基础（CSS）。我是通过用nextjs和postgresql建立一个个人论坛来做到这一点的。<p>我的问题是，我是否可以称自己为一个资深人士。当然，我在Web开发领域缺少很多经验。但恰恰相反，我已经学到了很多当前的技术以及如何设计和开发一般的软件。比如说调试你的代码，寻找错误等等。<p>我和一个做了4-5年网络开发的人相比，我是如何做到的？\n在申请其他领域的工作时，实际的语言有多重要？",
  "description_zh-Hant": "嘿，夥計們，<p>我想知道我目前在哪個州。我去年拿到了我的本科學位。我在六月底辭職了。由於學習的設置，我有2年的兼職和近4年的全職軟件開發經驗。<p>在我目前的工作中，我用Delphi和MSSQL-數據庫做ERP-桌面-軟件開發。此外，我還做項目管理，分析問題並與客戶一起開發解決方案，提供支持等。(這是一個非常小的公司，所以這個名單還在繼續。)重要的是，我的僱主對我所做的工作非常滿意。<p>在新的工作中，我想在現代堆棧上做全棧開發。例如，JAM，有一個適當的後臺，在前端有類似ReactJS的東西。在準備過程中，我學習了我最後缺失的基礎（CSS）。我是通過用nextjs和postgresql建立一個個人論壇來做到這一點的。<p>我的問題是，我是否可以稱自己為一個資深人士。當然，我在Web開發領域缺少很多經驗。但恰恰相反，我已經學到了很多當前的技術以及如何設計和開發一般的軟件。比如說調試你的代碼，尋找錯誤等等。<p>我和一個做了4-5年網絡開發的人相比，我是如何做到的？\n在申請其他領域的工作時，實際的語言有多重要？"
}