{
  "@type": "NewsArticle",
  "identifier": "2022--04--04--en--askhn--HackerNews--NewsArticle--30912794",
  "url": "https://news.ycombinator.com/item?id=30912794",
  "headline": "Ask HN: How much job hopping is too much?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I think the conventional wisdom is to stay at a company for at least 2 years, but I'm not sure if that is still agreed upon in this market.<p>My job history is as follows:<p>7 months - quit because they needed me to relocate a long distance<p>13 months - quit because we were acquired by another company and the new leadership was toxic in my opinion<p>5 months - contract, decided to not renew<p>7 months - current<p>I am considering leaving my current job, and I'm wondering if hiring managers would see it as a red flag. I don't want to dox myself but the reasons are:<p>1. Low pay. I was actually happy with the pay when I started but rent and everything has increased tremendously since COVID started. My company's health insurance plan was also changed at the beginning of this year and my cost went from 0% to 10% of my after-tax take home pay. I've talked to my boss about both these things and she said it sucked. So I didn't formally ask for a raise and I don't think I'd be eligible for one anyway, my other coworkers have not yet received one I don't think.<p>2. I'm not happy about the culture. The only people who get any recognition for their work is the sales team &quot;because they pay the bills.&quot; Even my boss (CTO) agrees. My attempts to fix tech debt is shot down because engineering is seen as a cost center to begin with. My team is fantastic to work with but I don't like leadership's position.<p>3. Related to my second reason, as someone who is junior I want to sink my teeth into a tough and long term project, but management won't allow it and they only want us working on short (and buggy) MVPs and shipped to customers. Our time to ship averages less than a day. I don't think I'm learning many &quot;proper&quot; engineering skills doing this.<p>4. Similar to my last reason, I want to work in a team with other people in my discipline (QA) to learn from them. Right now my company has 5 engineers but I'm the only one who works in QA. When I ask for feedback on my code the other engineers say they don't know how it works so they can't help. But the frontend and backend engineers get plenty of feedback from the other engineers because they're more knowledgeable. They're trying their best but I feel I'd learn more working in a team of others rather than by myself.<p>Other than _maybe_ the first reason, I don't think I have many strong reasons for leaving and that's why I think another employer would see this as a red flag. But I also know there are a lot of job openings these days so I'm wondering if I should give it a shot.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ishiz",
    "url": "https://news.ycombinator.com/user?id=ishiz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30912794",
  "sameAs": "https://news.ycombinator.com/item?id=30912794",
  "dateCreated": "2022-04-04T22:31:37.065Z",
  "datePublished": "2022-04-04T22:26:36.000Z",
  "dateModified": "2022-04-04T22:31:37.065Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 多少次跳槽才算多？",
  "headline_zh-Hant": "Ask HN: 多少次跳槽才算多？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我认为传统的智慧是在一家公司至少呆两年，但我不确定在这个市场上是否还能达成共识。 <p>我的工作经历如下：<p>7个月--辞职，因为他们需要我搬迁到很远的地方<p>13个月--辞职，因为我们被另一家公司收购了，在我看来，新的领导层是有毒的<p>5个月--合同，决定不再续约<p>7个月--目前<p>我正在考虑离开我目前的工作，我想知道招聘经理是否会把它看作一个红旗。我不想泄露自己的身份，但原因是：<p>1. 工资低。我开始工作时其实对工资很满意，但自从COVID开始后，房租和一切都有了巨大的增长。我公司的健康保险计划也在今年年初发生了变化，我的费用从税后工资的0%增加到10%。我已经和我的老板谈过这两件事，她说这很糟糕。所以我没有正式要求加薪，而且我不认为我有资格获得加薪，我的其他同事还没有获得加薪，我不认为。<p>2.我对公司的文化不满意。只有销售团队的工作得到了认可&quot;因为他们付账。&quot;甚至我的老板（CTO）也同意。我试图解决技术债务问题的努力被否决了，因为工程部被视为一个成本中心。我的团队合作得非常好，但我不喜欢领导的立场。<p>3.与我的第二个原因有关，作为一个初级的人，我想沉下心来做一个艰难而长期的项目，但管理层不允许，他们只想让我们做短期（和错误）的MVP并运送给客户。我们发货的时间平均不到一天。我不认为我这样做能学到很多正确的工程技能。<p>4.与我的最后一个原因类似，我想与我所在学科（QA）的其他人在一个团队里工作，向他们学习。现在我的公司有5个工程师，但我是唯一一个从事QA的人。当我要求对我的代码进行反馈时，其他工程师说他们不知道它是如何工作的，所以他们不能提供帮助。但前端和后端工程师从其他工程师那里得到了大量的反馈，因为他们的知识更丰富。他们已经尽力了，但我觉得我在一个由其他人组成的团队中工作会比自己一个人工作学到更多。<p>除了_也许是第一个原因，我不认为我有很多强烈的理由离开，这就是为什么我认为另一个雇主会把这视为一个红旗。但我也知道最近有很多职位空缺，所以我想知道我是否应该试一试。",
  "description_zh-Hant": "我認為傳統的智慧是在一家公司至少呆兩年，但我不確定在這個市場上是否還能達成共識。 <p>我的工作經歷如下：<p>7個月--辭職，因為他們需要我搬遷到很遠的地方<p>13個月--辭職，因為我們被另一家公司收購了，在我看來，新的領導層是有毒的<p>5個月--合同，決定不再續約<p>7個月--目前<p>我正在考慮離開我目前的工作，我想知道招聘經理是否會把它看作一個紅旗。我不想洩露自己的身份，但原因是：<p>1. 工資低。我開始工作時其實對工資很滿意，但自從COVID開始後，房租和一切都有了巨大的增長。我公司的健康保險計劃也在今年年初發生了變化，我的費用從稅後工資的0%增加到10%。我已經和我的老闆談過這兩件事，她說這很糟糕。所以我沒有正式要求加薪，而且我不認為我有資格獲得加薪，我的其他同事還沒有獲得加薪，我不認為。<p>2.我對公司的文化不滿意。只有銷售團隊的工作得到了認可&quot;因為他們付賬。&quot;甚至我的老闆（CTO）也同意。我試圖解決技術債務問題的努力被否決了，因為工程部被視為一個成本中心。我的團隊合作得非常好，但我不喜歡領導的立場。<p>3.與我的第二個原因有關，作為一個初級的人，我想沉下心來做一個艱難而長期的項目，但管理層不允許，他們只想讓我們做短期（和錯誤）的MVP並運送給客戶。我們發貨的時間平均不到一天。我不認為我這樣做能學到很多正確的工程技能。<p>4.與我的最後一個原因類似，我想與我所在學科（QA）的其他人在一個團隊裡工作，向他們學習。現在我的公司有5個工程師，但我是唯一一個從事QA的人。當我要求對我的代碼進行反饋時，其他工程師說他們不知道它是如何工作的，所以他們不能提供幫助。但前端和後端工程師從其他工程師那裡得到了大量的反饋，因為他們的知識更豐富。他們已經盡力了，但我覺得我在一個由其他人組成的團隊中工作會比自己一個人工作學到更多。<p>除了_也許是第一個原因，我不認為我有很多強烈的理由離開，這就是為什麼我認為另一個僱主會把這視為一個紅旗。但我也知道最近有很多職位空缺，所以我想知道我是否應該試一試。"
}