{
  "@type": "NewsArticle",
  "identifier": "2022--03--17--en--askhn--HackerNews--NewsArticle--30713537",
  "url": "https://news.ycombinator.com/item?id=30713537",
  "headline": "Ask HN: Why isn't there an Amazon for skilled 1099 contractors?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "By 'Amazon', I mean- an online platform where hiring companies and contractors list themselves, and can find each other. (Maybe I should've said Ebay). But- why hasn't such a thing been invented yet? I understand that several hiring marketplaces have been attempted for fulltime jobs (Hired.com, etc.) But that relies on getting the developer to actively sign up for the website, and they may not necessarily be thinking about a new job. Whereas, a 1099 contractor always needs to think about their next contract, after their current one is over.<p>So- why isn't there one? Platforms like Upwork and Freelancer.com (ugh) were invented in the late 90s, yet they don't seem to have really cornered the enterprise market. Why are 1099 contracts still being handled by 3rd party recruiting agencies? I'm not really interested in a typical HN-complaint fest about recruiters, I'm interested in understanding why a platform hasn't been a good business model (to date). Yes recruiters probably do a lot of non-scaleable/non codeable work in screening candidates, but that could be offloaded to an HR person at the hiring company. Yes enterprise sales is tough &amp; annoying, but it's a huge moat once you're on the vendor list of every Fortune 500 company- hiring and compensating salesguys to sign up enterprise clients is what VC money is for. Yes, companies offload liability and whatnot with W2 contractors from a staffing agency- but that's not really the case for 1099ers, right? It's just a contract between the hiring company and the freelancer's LLC.<p>So- why do companies and 1099 contractors continue to use recruiting agencies to find each other? Isn't this exactly the kind of problem that tech can solve- that platforms exist for, where network effects leads to a winner-take-all market? There has to be a solid business reason why a 1099 Amazon or Ebay hasn't been invented yet, just curious what it is",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "hash872",
    "url": "https://news.ycombinator.com/user?id=hash872"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30713537",
  "sameAs": "https://news.ycombinator.com/item?id=30713537",
  "dateCreated": "2022-03-17T17:20:57.485Z",
  "datePublished": "2022-03-17T17:17:28.000Z",
  "dateModified": "2022-03-17T17:20:57.485Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么没有为熟练的1099承包商设立亚马逊？",
  "headline_zh-Hant": "Ask HN: 為什麼沒有為熟練的1099承包商設立亞馬遜？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我所说的 \"亚马逊 \"是指--一个在线平台，雇用公司和承包商在这里列出自己，并可以找到对方。(也许我应该说是Ebay）。但是，为什么这样的东西还没有被发明出来？我知道有几个招聘市场已经尝试过全职工作（Hired.com等），但这有赖于让开发人员主动注册网站，而他们不一定会考虑新工作。而1099承包商总是需要考虑他们的下一份合同，在他们目前的合同结束后。<p>那么，为什么没有一个？像Upwork和Freelancer.com（唉）这样的平台是在90年代末发明的，但它们似乎并没有真正占领企业市场。为什么1099合同仍然由第三方招聘机构处理？我对典型的HN-抱怨招聘人员不感兴趣，我感兴趣的是了解为什么一个平台没有成为一个好的商业模式（到目前为止）。是的，招聘人员可能在筛选候选人方面做了很多不可扩展/不可编码的工作，但这可以卸载给招聘公司的人力资源人员。是的，企业销售是艰难的；令人讨厌，但一旦你进入了每个财富500强公司的供应商名单，它就是一条巨大的护城河--雇用和补偿销售人员来签署企业客户是风险投资资金的用途。是的，公司通过人事代理公司的W2承包商来减轻责任，但对于1099人员来说，情况并非如此，对吗？这只是雇佣公司和自由职业者的有限责任公司之间的合同。<p>那么，为什么公司和1099承包商继续使用招聘机构来寻找对方？这不正是技术可以解决的问题吗--平台的存在，网络效应导致了赢家通吃的市场。1099亚马逊或Ebay还没有被发明出来，一定有一个坚实的商业原因，只是好奇它是什么。",
  "description_zh-Hant": "我所說的 \"亞馬遜 \"是指--一個在線平臺，僱用公司和承包商在這裡列出自己，並可以找到對方。(也許我應該說是Ebay）。但是，為什麼這樣的東西還沒有被髮明出來？我知道有幾個招聘市場已經嘗試過全職工作（Hired.com等），但這有賴於讓開發人員主動註冊網站，而他們不一定會考慮新工作。而1099承包商總是需要考慮他們的下一份合同，在他們目前的合同結束後。<p>那麼，為什麼沒有一個？像Upwork和Freelancer.com（唉）這樣的平臺是在90年代末發明的，但它們似乎並沒有真正佔領企業市場。為什麼1099合同仍然由第三方招聘機構處理？我對典型的HN-抱怨招聘人員不感興趣，我感興趣的是瞭解為什麼一個平臺沒有成為一個好的商業模式（到目前為止）。是的，招聘人員可能在篩選候選人方面做了很多不可擴展/不可編碼的工作，但這可以卸載給招聘公司的人力資源人員。是的，企業銷售是艱難的；令人討厭，但一旦你進入了每個財富500強公司的供應商名單，它就是一條巨大的護城河--僱用和補償銷售人員來簽署企業客戶是風險投資資金的用途。是的，公司通過人事代理公司的W2承包商來減輕責任，但對於1099人員來說，情況並非如此，對嗎？這只是僱傭公司和自由職業者的有限責任公司之間的合同。<p>那麼，為什麼公司和1099承包商繼續使用招聘機構來尋找對方？這不正是技術可以解決的問題嗎--平臺的存在，網絡效應導致了贏家通吃的市場。1099亞馬遜或Ebay還沒有被髮明出來，一定有一個堅實的商業原因，只是好奇它是什麼。"
}