{
  "@type": "NewsArticle",
  "identifier": "2022--03--24--en--askhn--HackerNews--NewsArticle--30795829",
  "url": "https://news.ycombinator.com/item?id=30795829",
  "headline": "Ask HN: Someone's using my email to sign up to newsletters. What should I do?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I woke up this morning to a mountain of newsletters in my primary inbox that I did not sign up for. A lot of them were for &quot;earn money by surveys&quot;-websites, but some were job listing pages and I even got some from regular, reputable, companies like Huggies (an american diaper company). The only common denominator I've found between all these companies is that they're US based, or the US version of the brand.<p>I'm not quite sure what's going on and why someone would do this, but it's not a good feeling. I started contacting companies about removing my account and associated data as per GDPR law, but truth be told I'm not quite sure if that applies. It's also way too time consuming.<p>This is my personal main email with gmail. I'd rather not swap, but it's hard to wade through all the unrelated crap.<p>Has anyone been through this before? How did you solve it? What steps should I take to protect myself?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cupofjoakim",
    "url": "https://news.ycombinator.com/user?id=cupofjoakim"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30795829",
  "sameAs": "https://news.ycombinator.com/item?id=30795829",
  "dateCreated": "2022-03-24T22:11:13.951Z",
  "datePublished": "2022-03-24T21:56:49.000Z",
  "dateModified": "2022-03-24T22:11:13.951Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 有人用我的电子邮件来注册新闻简报。我应该怎么做？",
  "headline_zh-Hant": "Ask HN: 有人用我的電子郵件來註冊新聞簡報。我應該怎麼做？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "今天早上我醒来时，我的主要收件箱里有堆积如山的通讯，而我并没有报名参加。其中很多是通过调查赚钱的网站，但也有一些是工作列表网页，我甚至还收到了一些正规的、有信誉的公司，如Huggies（一家美国尿布公司）。我发现所有这些公司之间的唯一共同点是，它们都是以美国为基地的，或者是该品牌的美国版本。<p>我不太清楚发生了什么，为什么有人会这样做，但这种感觉不好。我开始联系公司，希望按照GDPR法律删除我的账户和相关数据，但说实话，我不太确定这是否适用。这也太耗费时间了。<p>这是我在gmail的个人主邮箱。我宁愿不交换，但也很难在所有不相关的垃圾中穿行。<p>有人曾经经历过这种情况吗？你是如何解决的？我应该采取什么措施来保护自己？",
  "description_zh-Hant": "今天早上我醒來時，我的主要收件箱裡有堆積如山的通訊，而我並沒有報名參加。其中很多是通過調查賺錢的網站，但也有一些是工作列表網頁，我甚至還收到了一些正規的、有信譽的公司，如Huggies（一家美國尿布公司）。我發現所有這些公司之間的唯一共同點是，它們都是以美國為基地的，或者是該品牌的美國版本。<p>我不太清楚發生了什麼，為什麼有人會這樣做，但這種感覺不好。我開始聯繫公司，希望按照GDPR法律刪除我的賬戶和相關數據，但說實話，我不太確定這是否適用。這也太耗費時間了。<p>這是我在gmail的個人主郵箱。我寧願不交換，但也很難在所有不相關的垃圾中穿行。<p>有人曾經經歷過這種情況嗎？你是如何解決的？我應該採取什麼措施來保護自己？"
}