{
  "@type": "NewsArticle",
  "identifier": "2022--03--08--en--askhn--HackerNews--NewsArticle--30607556",
  "url": "https://news.ycombinator.com/item?id=30607556",
  "headline": "Ask HN: Navigating activist tech organizations during a job hunt",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN,<p>I've got a job now that's been pretty good to me so far, but a recent change in circumstances has put a bad taste in my mouth. As such, I'm considering other options. I do site reliability engineering work, though I could transition into full software if I wanted. I've got about 15 years of experience so it would be for a senior role.<p>One concern I have is accidentally stumbling into a company with a twisted, woke culture that will see me ostracized if I don't self-flagellate (being a white man) and engage in performative social justice. I could probably bring the odds of that down to about 0 if I avoid anything in say, urban California and NYC but that really cuts down on the available job opportunities in tech.<p>A few questions for you all:<p>1. How pervasive is this sort of work culture, actually? I get the impression that it's common in some areas, like Silicon Valley, but that could easily be a misconception.<p>2. Do you have any tips for detecting this kind of culture before signing on at a new company?<p>3. Any specific companies you can recommend looking into? I have roots where I am and not willing to move, so remote work flexibility is a must.<p>Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "dolni",
    "url": "https://news.ycombinator.com/user?id=dolni"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30607556",
  "sameAs": "https://news.ycombinator.com/item?id=30607556",
  "dateCreated": "2022-03-08T21:50:03.077Z",
  "datePublished": "2022-03-08T21:46:16.000Z",
  "dateModified": "2022-03-08T21:50:03.077Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在求职过程中为活跃的科技组织导航",
  "headline_zh-Hant": "Ask HN: 在求職過程中為活躍的科技組織導航",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hi HN,<p>我现在有一份工作，到目前为止对我还算不错，但最近的一个变化让我感到很不舒服。因此，我正在考虑其他选择。我做的是现场可靠性工程工作，尽管如果我愿意，我可以过渡到完全的软件工作。我有大约15年的工作经验，所以会是一个高级职位。<p>我有一个顾虑，那就是不小心闯入一个有着扭曲的、清醒的文化的公司，如果我不自我鞭策（作为一个白人），不参与表演性的社会正义，我就会被排斥。如果我避开加州和纽约市的任何地方，我可能会把这种几率降到0，但这确实减少了技术领域的工作机会。<p>有几个问题要问大家：<p>1.这种工作文化究竟有多普遍？我的印象是，它在某些地区很普遍，比如硅谷，但这很容易是一种误解。 <p>2.在签约新公司之前，你有什么提示来检测这种文化吗？ <p>3.你有什么具体的公司可以推荐给大家看看吗？我在当地有根，不愿意搬家，所以远程工作的灵活性是必须的。<p>谢谢!",
  "description_zh-Hant": "Hi HN,<p>我現在有一份工作，到目前為止對我還算不錯，但最近的一個變化讓我感到很不舒服。因此，我正在考慮其他選擇。我做的是現場可靠性工程工作，儘管如果我願意，我可以過渡到完全的軟件工作。我有大約15年的工作經驗，所以會是一個高級職位。<p>我有一個顧慮，那就是不小心闖入一個有著扭曲的、清醒的文化的公司，如果我不自我鞭策（作為一個白人），不參與表演性的社會正義，我就會被排斥。如果我避開加州和紐約市的任何地方，我可能會把這種幾率降到0，但這確實減少了技術領域的工作機會。<p>有幾個問題要問大家：<p>1.這種工作文化究竟有多普遍？我的印象是，它在某些地區很普遍，比如硅谷，但這很容易是一種誤解。 <p>2.在簽約新公司之前，你有什麼提示來檢測這種文化嗎？ <p>3.你有什麼具體的公司可以推薦給大家看看嗎？我在當地有根，不願意搬家，所以遠程工作的靈活性是必須的。<p>謝謝!"
}