{
  "@type": "NewsArticle",
  "identifier": "2022--03--07--en--askhn--HackerNews--NewsArticle--30594674",
  "url": "https://news.ycombinator.com/item?id=30594674",
  "headline": "Ask HN: Apple terminated my developer account for association",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Apple terminated my developer account for the association with a previously terminated account.<p>First I should say: I &amp; my developer account are not associated with anyone else in any way since May 2018.<p>From this, I feel I’m fully innocent.<p>My Apple developer account is my only job and I’ve put blood and sweat there, I appreciate any advice. Thank you.<p>More details:<p>Apple fully terminated my developer account of 5 years because they determined it’s associated with some terminated account. However, immediately they gave me another chance to re-instate it. They gave me a chance to write a letter and explain why Apple should give me my developer membership back.<p>Here I’m asking for your advice. I already sent them an email and explained everything, but I think I can add more information. Is there a way I can call them? My account is not accessible at all.<p>This is the latest letter I’ve sent to them: https://imgur.com/a/MMWq87X<p>My association with a terminated account lasted until May 12, 2018, the day I removed my Apple ID there. Also one of my bank accounts has been there until July 2017. I uploaded one app there 7 years ago and on May 12, 2018, I removed it, that’s all!\nI believe this account is terminated about a year ago, so almost 3 years after I’ve had any association with it.<p>Of course, they gave me an appeal chance before as well, but my appeal wasn’t successful! I told them the same things that I said here( but with details), except I have had forgotten about the Apple ID thing. But in my last letter, I also told them that my Apple ID has been there until May 2018. Since my previous appeal and my last letter are not much different, I see a low chance for my case.<p>I think they shouldn't even flag my account since my association has been very weak and it has been from the distant past.<p>I believe my account terminated using robots with no human interactions, I believe no human even read my previous appeal.<p>Thanks for reading.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Hadi_Asiaie",
    "url": "https://news.ycombinator.com/user?id=Hadi_Asiaie"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30594674",
  "sameAs": "https://news.ycombinator.com/item?id=30594674",
  "dateCreated": "2022-03-07T23:29:21.480Z",
  "datePublished": "2022-03-07T23:23:37.000Z",
  "dateModified": "2022-03-07T23:29:21.480Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 苹果终止了我的开发者账户的关联",
  "headline_zh-Hant": "Ask HN: 蘋果終止了我的開發者賬戶的關聯",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "苹果公司终止了我的开发者账户，因为它与之前被终止的账户有关联。<p>首先我应该说。自2018年5月以来，我的开发者账户没有以任何方式与其他人关联。<p>从这一点来看，我觉得我是完全无辜的。<p>我的苹果开发者账户是我唯一的工作，我在那里付出了血和汗，我很感激任何建议。谢谢。<p>更多细节：<p>苹果完全终止了我5年的开发者账户，因为他们确定它与一些终止的账户有关。然而，他们马上又给了我一个重新注册的机会。他们给了我一个机会，让我写一封信，解释为什么苹果应该把我的开发者会员资格还给我。<p>在这里，我想征求你的意见。我已经给他们发了一封邮件，并解释了一切，但我想我可以补充更多信息。有什么办法可以让我给他们打电话吗？我的账户根本无法访问。<p>这是我发给他们的最新信件：https://imgur.com/a/MMWq87X<p>我与一个被终止的账户的联系一直持续到2018年5月12日，我在那里删除了我的苹果ID。另外我的一个银行账户也一直在那里，直到2017年7月。7年前，我在那里上传了一个应用程序，2018年5月12日，我删除了它，仅此而已！我相信这个账户被终止的原因是什么？\n我相信这个账户是在一年前被终止的，所以在我与它有任何联系之后几乎3年了。<p>当然，他们之前也给了我一个上诉的机会，但我的上诉并不成功！我告诉他们同样的事情。我告诉他们我在这里说的同样的事情（但有细节），除了我已经忘记了苹果ID的事情。但在我的最后一封信中，我也告诉他们，我的苹果ID一直存在到2018年5月。由于我之前的上诉和我的最后一封信没有什么不同，我认为我的案件机会很低。<p>我认为他们甚至不应该标记我的账户，因为我的关联一直很弱，而且是在遥远的过去。<p>我相信我的账户是用机器人终止的，没有人类的互动，我相信甚至没有人类阅读我之前的上诉。",
  "description_zh-Hant": "蘋果公司終止了我的開發者賬戶，因為它與之前被終止的賬戶有關聯。<p>首先我應該說。自2018年5月以來，我的開發者賬戶沒有以任何方式與其他人關聯。<p>從這一點來看，我覺得我是完全無辜的。<p>我的蘋果開發者賬戶是我唯一的工作，我在那裡付出了血和汗，我很感激任何建議。謝謝。<p>更多細節：<p>蘋果完全終止了我5年的開發者賬戶，因為他們確定它與一些終止的賬戶有關。然而，他們馬上又給了我一個重新註冊的機會。他們給了我一個機會，讓我寫一封信，解釋為什麼蘋果應該把我的開發者會員資格還給我。<p>在這裡，我想徵求你的意見。我已經給他們發了一封郵件，並解釋了一切，但我想我可以補充更多信息。有什麼辦法可以讓我給他們打電話嗎？我的賬戶根本無法訪問。<p>這是我發給他們的最新信件：https://imgur.com/a/MMWq87X<p>我與一個被終止的賬戶的聯繫一直持續到2018年5月12日，我在那裡刪除了我的蘋果ID。另外我的一個銀行賬戶也一直在那裡，直到2017年7月。7年前，我在那裡上傳了一個應用程序，2018年5月12日，我刪除了它，僅此而已！我相信這個賬戶被終止的原因是什麼？\n我相信這個賬戶是在一年前被終止的，所以在我與它有任何聯繫之後幾乎3年了。<p>當然，他們之前也給了我一個上訴的機會，但我的上訴並不成功！我告訴他們同樣的事情。我告訴他們我在這裡說的同樣的事情（但有細節），除了我已經忘記了蘋果ID的事情。但在我的最後一封信中，我也告訴他們，我的蘋果ID一直存在到2018年5月。由於我之前的上訴和我的最後一封信沒有什麼不同，我認為我的案件機會很低。<p>我認為他們甚至不應該標記我的賬戶，因為我的關聯一直很弱，而且是在遙遠的過去。<p>我相信我的賬戶是用機器人終止的，沒有人類的互動，我相信甚至沒有人類閱讀我之前的上訴。"
}