{
  "@type": "NewsArticle",
  "identifier": "2022--02--24--en--askhn--HackerNews--NewsArticle--30459958",
  "url": "https://news.ycombinator.com/item?id=30459958",
  "headline": "Ask HN: As a long-time unofficial developer, how do I level set for SWE jobs?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "While my job title is “Actuary”, software development and management have been my bread and butter for a number of years now. I had a hand in creating most of the systems and tools that my team uses today, but lately there have been some obstacles to building cool new things or making quality of life improvements in our existing tools. I also see some career limitations if I keep going down this hybrid path.<p>I’m considering a career change to focus on being a developer or an engineering manager. I think I can find positives to focus on and be happy in either role. I’m not sure which level of jobs I should be applying for though. Telling people that I have 5+ years of professional development experience feels iffy with a resume that isn’t very clean cut. I also assume that I might have some knowledge gaps, but I don’t think I’m a junior either.<p>In 2022, how would you level set for someone with experience but without the title to back it up? Would hobby projects or something like TripleByte help? It’s a much easier change for me to make if I don’t have to start at square one. Most of the advice out there seems tailored to new grads, so I really appreciate any thoughts you can share.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwawaytuary",
    "url": "https://news.ycombinator.com/user?id=throwawaytuary"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30459958",
  "sameAs": "https://news.ycombinator.com/item?id=30459958",
  "dateCreated": "2022-02-24T20:39:25.407Z",
  "datePublished": "2022-02-24T20:38:11.000Z",
  "dateModified": "2022-02-24T20:39:25.407Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 作为一个长期的非官方开发者，我如何为SWE工作进行水平设置？",
  "headline_zh-Hant": "Ask HN: 作為一個長期的非官方開發者，我如何為SWE工作進行水平設置？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "虽然我的工作头衔是 \"精算师\"，但多年来，软件开发和管理一直是我的面包和黄油。我曾参与创建了我的团队今天所使用的大部分系统和工具，但最近在建立很酷的新东西或在我们现有的工具中进行生活质量改进方面遇到了一些障碍。如果我继续走这条混合道路，我也看到了一些职业限制。<p>我正在考虑改变职业，专注于成为一名开发人员或工程经理。我认为我可以在这两个角色中找到可以关注的积极因素并获得快乐。但我不确定我应该申请哪个级别的工作。告诉别人我有5年以上的专业开发经验，这让我觉得很不放心，因为我的简历并不是很干净。<p>在2022年，你将如何为一个有经验但没有头衔支持的人设定等级？兴趣项目或像TripleByte这样的东西会有帮助吗？如果我不用从头开始的话，对我来说，这种改变要容易得多。外面的大多数建议似乎都是为新毕业的学生量身定做的，所以我真的很感谢你能分享任何想法。",
  "description_zh-Hant": "雖然我的工作頭銜是 \"精算師\"，但多年來，軟件開發和管理一直是我的麵包和黃油。我曾參與創建了我的團隊今天所使用的大部分系統和工具，但最近在建立很酷的新東西或在我們現有的工具中進行生活質量改進方面遇到了一些障礙。如果我繼續走這條混合道路，我也看到了一些職業限制。<p>我正在考慮改變職業，專注於成為一名開發人員或工程經理。我認為我可以在這兩個角色中找到可以關注的積極因素並獲得快樂。但我不確定我應該申請哪個級別的工作。告訴別人我有5年以上的專業開發經驗，這讓我覺得很不放心，因為我的簡歷並不是很乾淨。<p>在2022年，你將如何為一個有經驗但沒有頭銜支持的人設定等級？興趣項目或像TripleByte這樣的東西會有幫助嗎？如果我不用從頭開始的話，對我來說，這種改變要容易得多。外面的大多數建議似乎都是為新畢業的學生量身定做的，所以我真的很感謝你能分享任何想法。"
}