{
  "@type": "NewsArticle",
  "identifier": "2022--02--25--en--askhn--HackerNews--NewsArticle--30465096",
  "url": "https://news.ycombinator.com/item?id=30465096",
  "headline": "Ask HN: Trending Content on TikTok, Twitter etc. looks completely off to me",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "** First off, I'm aware this topic has a strong political side to it and being aware at that risk it is NOT my intention to turn this into a turf war. I acknowledge propaganda isn't one sided. This post is about US companies, not about the geopolitical situation. Please stay civil in the comments. **<p>I opened Twitter today and I was just shocked.<p>In my western EU democracy, I woke up to the trends in all of social media looking like the discourse is completely dominated by an actor that represents the absolute opposite of any respected media source or any of my peers.<p>Investigating those posts and accounts, all of which try to sow doubt in the media and general disinformation, just all of it is fishy. The people aren't real. The network is shallow and unconnected. There are strange typos. The accounts posted meaningless fluff before and &quot;woke up&quot; to spew out carefully crafted psychological warfare.<p>It just seems so completely obvious to me that this is a carefully orchestrated attack on public discourse and I feel weird that just nobody seems to speak up about this.<p>And it is Facebook, Twitter, TikTok and others fueling this with the social proof of their brands by letting this happen.<p>I'm all for free speech by real people, but after all we've learned over the past years, how come that in 2022 social networks silently stay behind this with their brand? Where are the employees speaking up? Where are the executives hiding?<p>I am just so shocked and I didn't know where else to bring my frustration.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "endymi0n",
    "url": "https://news.ycombinator.com/user?id=endymi0n"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30465096",
  "sameAs": "https://news.ycombinator.com/item?id=30465096",
  "dateCreated": "2022-02-25T09:10:47.018Z",
  "datePublished": "2022-02-25T08:54:49.000Z",
  "dateModified": "2022-02-25T09:10:47.018Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在我看来，TikTok、Twitter等的趋势性内容完全不对头。",
  "headline_zh-Hant": "Ask HN: 在我看來，TikTok、Twitter等的趨勢性內容完全不對頭。",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "** 首先，我知道这个话题有很强的政治性，并且意识到这种风险，我无意将其变成一场地盘战。我承认宣传不是一边倒的。这篇文章是关于美国公司，而不是关于地缘政治局势。请在评论中保持文明。**<p>我今天打开了推特，我只是感到震惊。<p>在我的西方欧盟民主国家，我醒来时发现所有社交媒体的趋势看起来是完全由一个代表任何受尊敬的媒体来源或任何同行的绝对相反的行为者主导。<p>调查那些帖子和账户，所有这些都试图在媒体和一般虚假信息中播撒怀疑，只是所有这些都是腥臭的。这些人并不真实。网络是浅薄的，没有联系的。有奇怪的错别字。<p>在我看来，这是一个精心策划的对公众话语的攻击，这一点非常明显，而且我感到奇怪的是，似乎没有人对此发表意见。 <p>而Facebook、Twitter、TikTok和其他公司则通过其品牌的社会证明来助长这种情况的发生。<p>我完全支持真正的人的言论自由，但在我们过去几年所学到的一切之后，为什么2022年的社交网络会默默地用其品牌来支持这种情况？员工们在哪里发声？高管们都躲到哪里去了？<p>我实在是太震惊了，我不知道还有什么地方可以让我感到沮丧。",
  "description_zh-Hant": "** 首先，我知道這個話題有很強的政治性，並且意識到這種風險，我無意將其變成一場地盤戰。我承認宣傳不是一邊倒的。這篇文章是關於美國公司，而不是關於地緣政治局勢。請在評論中保持文明。**<p>我今天打開了推特，我只是感到震驚。<p>在我的西方歐盟民主國家，我醒來時發現所有社交媒體的趨勢看起來是完全由一個代表任何受尊敬的媒體來源或任何同行的絕對相反的行為者主導。<p>調查那些帖子和賬戶，所有這些都試圖在媒體和一般虛假信息中播撒懷疑，只是所有這些都是腥臭的。這些人並不真實。網絡是淺薄的，沒有聯繫的。有奇怪的錯別字。<p>在我看來，這是一個精心策劃的對公眾話語的攻擊，這一點非常明顯，而且我感到奇怪的是，似乎沒有人對此發表意見。 <p>而Facebook、Twitter、TikTok和其他公司則通過其品牌的社會證明來助長這種情況的發生。<p>我完全支持真正的人的言論自由，但在我們過去幾年所學到的一切之後，為什麼2022年的社交網絡會默默地用其品牌來支持這種情況？員工們在哪裡發聲？高管們都躲到哪裡去了？<p>我實在是太震驚了，我不知道還有什麼地方可以讓我感到沮喪。"
}