{
  "@type": "NewsArticle",
  "identifier": "2022--03--03--en--askhn--HackerNews--NewsArticle--30535181",
  "url": "https://news.ycombinator.com/item?id=30535181",
  "headline": "Ask HN: Headaches from Charging Batteries?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi, I've been struggling with an unusual technology/medical issue for some months, and I'm wondering if anyone here has gone through anything like it and possibly found success dealing with it.<p>I assume most people here are heavy users of technology, which these days means many devices with rechargeable batteries. I've noticed that I get terrible headaches when I'm in the same room with a device while it's charging. It could be a phone, tablet, laptop, or even a battery for power tools. I would describe the feeling as a kind of clenching in my brain. I've gone so far as to request a desktop rather than a laptop for work in order to cope with this.<p>I've talked to my doctor, but he was baffled. We did a standard screening for epilepsy but found nothing.<p>Needless to say, this is very distressing. I realize no one here will be able to offer medical advice, but I guess I'm hoping someone out there might be experiencing the same thing. I'm also interested to know if anyone knows of any relevant research into the health effects of charging batteries.<p>Thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "NoCharging",
    "url": "https://news.ycombinator.com/user?id=NoCharging"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30535181",
  "sameAs": "https://news.ycombinator.com/item?id=30535181",
  "dateCreated": "2022-03-03T00:35:28.563Z",
  "datePublished": "2022-03-02T23:51:03.000Z",
  "dateModified": "2022-03-03T00:35:28.563Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 给电池充电引起的头痛？",
  "headline_zh-Hant": "Ask HN: 給電池充電引起的頭痛？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，几个月来，我一直在与一个不寻常的技术/医疗问题作斗争，我想知道这里是否有人经历过类似的事情，并可能找到成功的处理方法。<p>我想这里的大多数人都是技术的重度使用者，这些天意味着许多设备都有可充电电池。我注意到，当我与正在充电的设备同处一室时，我会感到非常头痛。它可能是一部手机、平板电脑、笔记本电脑，甚至是电动工具的电池。我将这种感觉描述为我的大脑中的一种紧缩。为了应对这种情况，我甚至要求用台式机而不是笔记本电脑来工作。<p>我已经和医生谈过，但他感到很困惑。我们做了一个标准的癫痫筛查，但什么也没发现。<p>不用说，这让人非常苦恼。我意识到这里没有人能够提供医疗建议，但我想我希望外面有人可能正在经历同样的事情。我还想知道是否有人知道任何关于电池充电对健康影响的相关研究。",
  "description_zh-Hant": "嗨，幾個月來，我一直在與一個不尋常的技術/醫療問題作鬥爭，我想知道這裡是否有人經歷過類似的事情，並可能找到成功的處理方法。<p>我想這裡的大多數人都是技術的重度使用者，這些天意味著許多設備都有可充電電池。我注意到，當我與正在充電的設備同處一室時，我會感到非常頭痛。它可能是一部手機、平板電腦、筆記本電腦，甚至是電動工具的電池。我將這種感覺描述為我的大腦中的一種緊縮。為了應對這種情況，我甚至要求用臺式機而不是筆記本電腦來工作。<p>我已經和醫生談過，但他感到很困惑。我們做了一個標準的癲癇篩查，但什麼也沒發現。<p>不用說，這讓人非常苦惱。我意識到這裡沒有人能夠提供醫療建議，但我想我希望外面有人可能正在經歷同樣的事情。我還想知道是否有人知道任何關於電池充電對健康影響的相關研究。"
}