{
  "@type": "NewsArticle",
  "identifier": "2022--02--28--en--askhn--HackerNews--NewsArticle--30504303",
  "url": "https://news.ycombinator.com/item?id=30504303",
  "headline": "Ask HN: Where is the border between allowed and disallowed in Apple appstore?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I was thinking about building an app for adult p2p video calls with random people similar to chatroulette but with its own unique (as I hope) features.<p>I was absolutely sure the app I'd have built could never be approved in App Store because they don't allow adult-content oriented apps to be published.<p>So, that's fine, I knew it from the start so I started building a webapp optimized for mobile devices as the primary goal. But, when I had a look at the potential competitors, I found out some of them have their apps in App Store looking absolutely fine, searchable and installed by hundreds of users. Though, the apps have these words or similar in the descriptions: &quot;Dating app&quot;, &quot;Meet new people&quot;, &quot;Video chat with girls&quot; and so on. They don't have any clear signs they expose any adult content, but in practice obviously it's their purpose.<p>Well, that's fine as well, I am not here to blame anyone doing their business their way. But my concern is also practical - seeing these apps to be sound and safe in the AppStore, what if I consider to build an iOS version of my webapp and publish it?<p>What would be the symptoms I am getting into the yellow or red zone for the AppStore reviewers? I know I can pretend the video app I am building is just for nice innocent flirt and smiles.<p>But how the AppStore reviewers see it? I am sure they saw millions of shady apps they precisely know the purpose of.<p>Are there any guidelines for such apps to not fall into the blacklist?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cosmorocket",
    "url": "https://news.ycombinator.com/user?id=cosmorocket"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30504303",
  "sameAs": "https://news.ycombinator.com/item?id=30504303",
  "dateCreated": "2022-02-28T20:11:23.862Z",
  "datePublished": "2022-02-28T19:54:36.000Z",
  "dateModified": "2022-02-28T20:11:23.862Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在苹果应用商店中，允许和不允许的边界在哪里？",
  "headline_zh-Hant": "Ask HN: 在蘋果應用商店中，允許和不允許的邊界在哪裡？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我正在考虑建立一个成人p2p视频通话的应用程序，与chatroulette类似，但有自己独特的（我希望）功能。<p>我绝对相信我建立的应用程序不可能被App Store批准，因为他们不允许发布成人内容的应用程序。<p>所以，这很好，我一开始就知道，所以我开始建立一个为移动设备优化的Web应用程序作为主要目标。但是，当我看了一下潜在的竞争对手时，我发现他们中的一些人的应用程序在App Store中看起来绝对不错，可以被搜索到，并且有数百名用户安装。虽然，这些应用程序的描述中有这些词或类似的词：&quot;约会应用程序&quot;，&quot;认识新朋友&quot;，&quot;与女孩视频聊天&quot;等等。他们没有任何明确的迹象表明他们暴露了任何成人内容，但在实践中，这显然是他们的目的。<p>好吧，这也很好，我不是在这里指责任何人以他们的方式做生意。但我担心的也是实际问题--看到这些应用程序在AppStore中是健全和安全的，如果我考虑为我的网络应用程序建立一个iOS版本并发布它呢？<p>对于AppStore的审查人员来说，我进入黄色或红色区域的症状会是什么？我知道我可以假装我正在建立的视频应用程序只是为了漂亮的纯洁的调情和微笑。<p>但是AppStore审查员是如何看待它的呢？我确信他们看到了数以百万计的阴暗的应用程序，他们确切地知道其目的。<p>是否有任何指导方针，使这些应用程序不落入黑名单？",
  "description_zh-Hant": "我正在考慮建立一個成人p2p視頻通話的應用程序，與chatroulette類似，但有自己獨特的（我希望）功能。<p>我絕對相信我建立的應用程序不可能被App Store批准，因為他們不允許發佈成人內容的應用程序。<p>所以，這很好，我一開始就知道，所以我開始建立一個為移動設備優化的Web應用程序作為主要目標。但是，當我看了一下潛在的競爭對手時，我發現他們中的一些人的應用程序在App Store中看起來絕對不錯，可以被搜索到，並且有數百名用戶安裝。雖然，這些應用程序的描述中有這些詞或類似的詞：&quot;約會應用程序&quot;，&quot;認識新朋友&quot;，&quot;與女孩視頻聊天&quot;等等。他們沒有任何明確的跡象表明他們暴露了任何成人內容，但在實踐中，這顯然是他們的目的。<p>好吧，這也很好，我不是在這裡指責任何人以他們的方式做生意。但我擔心的也是實際問題--看到這些應用程序在AppStore中是健全和安全的，如果我考慮為我的網絡應用程序建立一個iOS版本併發布它呢？<p>對於AppStore的審查人員來說，我進入黃色或紅色區域的症狀會是什麼？我知道我可以假裝我正在建立的視頻應用程序只是為了漂亮的純潔的調情和微笑。<p>但是AppStore審查員是如何看待它的呢？我確信他們看到了數以百萬計的陰暗的應用程序，他們確切地知道其目的。<p>是否有任何指導方針，使這些應用程序不落入黑名單？"
}