{
  "@type": "NewsArticle",
  "identifier": "2022--02--19--en--askhn--HackerNews--NewsArticle--30401526",
  "url": "https://news.ycombinator.com/item?id=30401526",
  "headline": "Ask HN: Why are Google's search products bad if Google has decades of Know-how?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I use Google's search products(Google Search, YouTube search etc.) on a daily basis and I see so many reasonable solutions that would significantly improve UX within Google Products but I don't understand that designers and managers at Google are not seeing the same or similar solutions. Googles has decades of know-how and unbounded human, financial and computational resources but still they can not figure out things like:<p>My backlog: Google Search: 1. Crawl, index and rank audio content and add it next to Images and Videos in Google Search e.g. &quot;All Images Videos Audio Maps Books More&quot; so I can find and discover audio on the web.<p>2. Add tags in Google Search just like you added tags when searching in Google Images so I can find websites in specific category or in similar category or that I can find similar type of web content.<p>3. Just like GitHub has percentage of languages of source code within source code's project page e.g. 90% C++ 10% C add percentage next to each web page result in search results e.g. Text 70%  Images 20% Videos 10% Audio 0%<p>YouTube: 1. Standardize both web version and mobile version; in web version on channel's page I can search channel for videos on mobile I can not.<p>2. Add search option/bar in comment section of videos so I can search for information that is relevant and useful to me.<p>3. Add search option/bar to playlists so I can search for videos within my playlists.<p>4. Add Google Lens type search solution to YouTube so I can search &quot;within&quot; YouTube videos; frame by frame e.g. let's say I watch wild animals documentary and I want to skip to lions part, machine learning(AI) can analyse frame by frame and point me to that part of the video(Google has similar solution but only for creators called &quot;Chapters&quot;). And use speech recognition so I have transcript and timestamps for YouTube videos or in anther words try to transcribe and timestamp audio of YouTube videos. Frame by frame and transcription solution are complementary.<p>I have other ideas for YouTube and Google Search in particular but this is my short list. For Google Search my focus is linguistic analysis of websites and I think greater focus should be put on analyzing websites(text, images, videos, audio, links etc.) not trying to guess what users want. Users will find good search results if your analysis and presentation of websites and their specifics/qualities is good in Search Results page.<p>Also Google Chrome has some web search and web navigation problems that I would like to add but that I can explain another time.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mrkramer",
    "url": "https://news.ycombinator.com/user?id=mrkramer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30401526",
  "sameAs": "https://news.ycombinator.com/item?id=30401526",
  "dateCreated": "2022-02-19T23:29:07.406Z",
  "datePublished": "2022-02-19T23:23:40.000Z",
  "dateModified": "2022-02-19T23:29:07.406Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如果谷歌拥有数十年的专业知识，为什么谷歌的搜索产品会很糟糕？",
  "headline_zh-Hant": "Ask HN: 如果谷歌擁有數十年的專業知識，為什麼谷歌的搜索產品會很糟糕？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我每天都在使用谷歌的搜索产品（谷歌搜索、YouTube搜索等），我看到了许多合理的解决方案，这些解决方案将大大改善谷歌产品的用户体验，但我不明白，谷歌的设计师和经理们却没有看到相同或类似的解决方案。Googles拥有数十年的专业知识和无限制的人力、财力和计算资源，但他们仍然无法解决以下问题：<p>我的积压。谷歌搜索。1. <p>2.在谷歌搜索中添加标签，就像你在谷歌图片中搜索时添加标签一样，这样我就可以找到特定类别或类似类别的网站，或者可以找到类似类型的网络内容。 <p>3.就像GitHub在源代码的项目页面内有源代码的语言百分比，例如90%的C++ 10%的C，在搜索结果中的每个网页结果旁边添加百分比，例如文本70%的图片20%的视频10%的音频0%<p>YouTube。1. <p>2.在视频的评论部分添加搜索选项/条，这样我就可以搜索到与我相关且有用的信息。<p>3.在播放列表中添加搜索选项/条，这样我就可以在播放列表中搜索到视频。在YouTube上添加Google Lens类型的搜索解决方案，这样我就可以在YouTube视频中逐帧搜索，例如，假设我看野生动物纪录片，我想跳到狮子部分，机器学习（AI）可以逐帧分析并将我指向视频的那一部分（Google有类似的解决方案，但只针对创作者，称为 \"章节\"）。并使用语音识别，这样我就有了YouTube视频的转录和时间戳，或者换句话说，尝试转录YouTube视频的音频和时间戳。<p>我对YouTube和谷歌搜索还有其他想法，但这是我的简短清单。对于谷歌搜索，我的重点是网站的语言学分析，我认为应该把更多的重点放在分析网站（文本、图像、视频、音频、链接等）上，而不是试图猜测用户想要什么。如果你在搜索结果页中对网站及其特性/质量的分析和展示很好，用户就会找到好的搜索结果。<p>另外，谷歌浏览器有一些网络搜索和网络导航问题，我想补充一下，但我可以下次再解释。",
  "description_zh-Hant": "我每天都在使用谷歌的搜索產品（谷歌搜索、YouTube搜索等），我看到了許多合理的解決方案，這些解決方案將大大改善谷歌產品的用戶體驗，但我不明白，谷歌的設計師和經理們卻沒有看到相同或類似的解決方案。Googles擁有數十年的專業知識和無限制的人力、財力和計算資源，但他們仍然無法解決以下問題：<p>我的積壓。谷歌搜索。1. <p>2.在谷歌搜索中添加標籤，就像你在谷歌圖片中搜索時添加標籤一樣，這樣我就可以找到特定類別或類似類別的網站，或者可以找到類似類型的網絡內容。 <p>3.就像GitHub在源代碼的項目頁面內有源代碼的語言百分比，例如90%的C++ 10%的C，在搜索結果中的每個網頁結果旁邊添加百分比，例如文本70%的圖片20%的視頻10%的音頻0%<p>YouTube。1. <p>2.在視頻的評論部分添加搜索選項/條，這樣我就可以搜索到與我相關且有用的信息。<p>3.在播放列表中添加搜索選項/條，這樣我就可以在播放列表中搜索到視頻。在YouTube上添加Google Lens類型的搜索解決方案，這樣我就可以在YouTube視頻中逐幀搜索，例如，假設我看野生動物紀錄片，我想跳到獅子部分，機器學習（AI）可以逐幀分析並將我指向視頻的那一部分（Google有類似的解決方案，但只針對創作者，稱為 \"章節\"）。並使用語音識別，這樣我就有了YouTube視頻的轉錄和時間戳，或者換句話說，嘗試轉錄YouTube視頻的音頻和時間戳。<p>我對YouTube和谷歌搜索還有其他想法，但這是我的簡短清單。對於谷歌搜索，我的重點是網站的語言學分析，我認為應該把更多的重點放在分析網站（文本、圖像、視頻、音頻、鏈接等）上，而不是試圖猜測用戶想要什麼。如果你在搜索結果頁中對網站及其特性/質量的分析和展示很好，用戶就會找到好的搜索結果。<p>另外，谷歌瀏覽器有一些網絡搜索和網絡導航問題，我想補充一下，但我可以下次再解釋。"
}