{
  "@type": "NewsArticle",
  "identifier": "2022--03--15--en--askhn--HackerNews--NewsArticle--30688803",
  "url": "https://news.ycombinator.com/item?id=30688803",
  "headline": "Ask HN: What's so great about the metaverse?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm one of the many skeptics about the metaverse. I think that the reason this idea is suddenly so popular is because it is baked by a large company (Meta, former Facebook), and due to the pandemic: while having a metaverse to explore could be a great opportunity during a lockdown, who would prefer a meeting in the metaverse vs an in-person meeting when the real world is freely accessible? (Except if you're meeting people form the other side of the world, but the use cases that are being pushed for the metaverse don't seem to discriminate between somebody physically close to you or somebody very far away). But I know that other people have a different opinion. So if you're a metaverse supporter, why do you like the idea? Why isn't everybody on Second Life and what Second life got wrong that the metaverse will get right? Is VR a key part of the metaverse or can you also have one without VR? If VR is a key component, why isn't that just a VR videogame? Which characteristics should something have to be considered a metaverse? It is possible to have a metaverse on Minecraft like this article claims [1]? Of course you don't have to answer all these questions, you can just skip them an go straight to the point it your point has nothing to do with them. [1] https://debugger.medium.com/the-metaverse-is-already-here-its-minecraft-99c89ed8ba2",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "GTP",
    "url": "https://news.ycombinator.com/user?id=GTP"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30688803",
  "sameAs": "https://news.ycombinator.com/item?id=30688803",
  "dateCreated": "2022-03-15T18:12:29.320Z",
  "datePublished": "2022-03-15T18:10:53.000Z",
  "dateModified": "2022-03-15T18:12:29.320Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 元空间有什么好的？",
  "headline_zh-Hant": "Ask HN: 元空間有什麼好的？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是众多对元空间持怀疑态度的人之一。我认为，这个想法之所以突然如此流行，是因为它是由一家大公司（Meta，前Facebook）烘托出来的，而且是由于大流行病：虽然在封锁期间有一个可以探索的元空间可能是一个很好的机会，但在现实世界可以自由进入的情况下，谁会喜欢在元空间中的会议与面对面的会议？(除非你是在世界的另一端与人见面，但正在推动的元空间的用例似乎并不区分是离你很近的人还是很远的人）。但我知道，其他人有不同的看法。那么，如果你是一个元空间的支持者，你为什么喜欢这个想法？为什么不是每个人都在关注 \"第二人生\"，以及 \"第二人生 \"有哪些地方做错了，而 \"元空间 \"会做对？VR是metaverse的一个关键部分，还是没有VR也可以有metaverse？如果VR是一个关键部分，为什么不只是一个VR电子游戏？某个东西应该具备哪些特征才能被认为是一个元宇宙？是否有可能像这篇文章所说的那样，在Minecraft上有一个metaverse[1]？当然，你不必回答所有这些问题，你可以直接跳过它们，直接进入主题，因为你的观点与它们无关。[1] https://debugger.medium.com/the-metaverse-is-already-here-its-minecraft-99c89ed8ba2",
  "description_zh-Hant": "我是眾多對元空間持懷疑態度的人之一。我認為，這個想法之所以突然如此流行，是因為它是由一家大公司（Meta，前Facebook）烘托出來的，而且是由於大流行病：雖然在封鎖期間有一個可以探索的元空間可能是一個很好的機會，但在現實世界可以自由進入的情況下，誰會喜歡在元空間中的會議與面對面的會議？(除非你是在世界的另一端與人見面，但正在推動的元空間的用例似乎並不區分是離你很近的人還是很遠的人）。但我知道，其他人有不同的看法。那麼，如果你是一個元空間的支持者，你為什麼喜歡這個想法？為什麼不是每個人都在關注 \"第二人生\"，以及 \"第二人生 \"有哪些地方做錯了，而 \"元空間 \"會做對？VR是metaverse的一個關鍵部分，還是沒有VR也可以有metaverse？如果VR是一個關鍵部分，為什麼不只是一個VR電子遊戲？某個東西應該具備哪些特徵才能被認為是一個元宇宙？是否有可能像這篇文章所說的那樣，在Minecraft上有一個metaverse[1]？當然，你不必回答所有這些問題，你可以直接跳過它們，直接進入主題，因為你的觀點與它們無關。[1] https://debugger.medium.com/the-metaverse-is-already-here-its-minecraft-99c89ed8ba2"
}