{
  "@type": "NewsArticle",
  "identifier": "2022--03--16--en--askhn--HackerNews--NewsArticle--30698194",
  "url": "https://news.ycombinator.com/item?id=30698194",
  "headline": "Ask HN: Advocates of socialized production, why and how?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The other day I had a very brief discussion with another individual who believed that all private production should be socialized. That, e.g., farmers should give away their food for free and in turn have their needs be met for free. Ad infinitum. I've heard others with the same or a very similar economic ideology that they insisted would be the best thing for humanity.<p>Personally I'm quite the fan of capitalism and think that, while not perfect, it's most definitely the best economic system that we have and that I, at least, can conceive of. That said, I've never been able to rationalize for myself, nor have heard others rationalize, what a society with socialized production would actually look like and how we'd maintain the same quality of life as we have today. Hence, this post. I'm really hoping that someone on the &quot;other side&quot; (though that sounds a bit too adversarial for my taste) can eloquently explain their thought process. Not trying to spark hostility, just want a thoughtful discussion.<p>Some of the big questions I have are:<p>1. Who does the hard/dirty jobs in this society? Farming being one. But also construction, sewage, trash, ad inifitum. There are a lot of undesirable jobs and while maybe some people would be willing, I doubt our needs could be met when the same individuals could just work an easier job for the same reward.<p>2. How are &quot;needs&quot; defined? Food, shelter, clothing. Then what? Electricity? Internet? Smartphones? Gaming consoles/PC's? Games to play on those? Music? Memory foam mattresses? Etc. If all of these aren't needs, then how would individuals with varying interests actually choose what they want to own?<p>3. What are the incentives to advance amd become highly skilled? Take doctors. Some are really passionate about what they do. Most may be a little passionate, but are mainly just intelligent people drawn by the money and prestige. Assuming medical school and university still exists, for what purpose would someone go through that pipeline when they could do something far easier?<p>The only answers I've received to these thus far are something along the lines of &quot;Well humans would just have to fundamentally change their nature and  learn to live like <i>x</i>.&quot; Which isn't an answer at all.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "MathCodeLove",
    "url": "https://news.ycombinator.com/user?id=MathCodeLove"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30698194",
  "sameAs": "https://news.ycombinator.com/item?id=30698194",
  "dateCreated": "2022-03-16T13:17:31.124Z",
  "datePublished": "2022-03-16T12:59:02.000Z",
  "dateModified": "2022-03-16T13:17:31.124Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 社会化生产的倡导者，为什么和如何？",
  "headline_zh-Hant": "Ask HN: 社會化生產的倡導者，為什麼和如何？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "有一天，我和另一个人进行了非常简短的讨论，他认为所有私人生产都应该社会化。例如，农民应该免费送出他们的食物，反过来，他们的需求也应该免费得到满足。无穷无尽。我还听说过其他具有相同或非常类似的经济意识形态的人，他们坚持认为这对人类来说是最好的事情。<p>就个人而言，我是资本主义的粉丝，认为它虽然不完美，但绝对是我们拥有的最好的经济体系，至少是我能够想象到的。也就是说，我从来没有为自己理顺过，也没有听别人理顺过，一个社会化生产的社会究竟会是什么样子，我们如何保持和今天一样的生活质量。因此，这篇文章。我真的希望站在 \"另一方 \"的人（尽管这听起来对我来说有点过于敌对）能够雄辩地解释他们的思想过程。我不是想引发敌意，只是想进行一次有思想的讨论。<p>我的一些大问题是：<p>1. 在这个社会中，谁在做艰苦/肮脏的工作？耕作是其中之一。但也有建筑业、污水处理、垃圾处理等工作，不一而足。有很多不受欢迎的工作，虽然也许有些人愿意做，但我怀疑我们的需求能否得到满足，因为同样的人可以为同样的报酬做更容易的工作。 <p>2.如何定义需求？食物、住所、衣服。然后呢？电？互联网？智能手机？游戏机/电脑？在那些上面玩的游戏？音乐？记忆海绵床垫？等等。如果所有这些都不是需求，那么具有不同兴趣的个人将如何真正选择他们想要拥有的东西？ <p>3.有什么激励措施来提高和成为高技能？以医生为例。有些人对他们的工作真的很有热情。大多数人可能有一点激情，但主要是被金钱和声望吸引的聪明人。假设医学院和大学仍然存在，当一个人可以做一些更容易的事情时，他为什么要通过那个管道呢？<p>到目前为止，我收到的唯一答案是：\"嗯，人类将不得不从根本上改变他们的本性，学会像<i>x</i>一样生活。",
  "description_zh-Hant": "有一天，我和另一個人進行了非常簡短的討論，他認為所有私人生產都應該社會化。例如，農民應該免費送出他們的食物，反過來，他們的需求也應該免費得到滿足。無窮無盡。我還聽說過其他具有相同或非常類似的經濟意識形態的人，他們堅持認為這對人類來說是最好的事情。<p>就個人而言，我是資本主義的粉絲，認為它雖然不完美，但絕對是我們擁有的最好的經濟體系，至少是我能夠想象到的。也就是說，我從來沒有為自己理順過，也沒有聽別人理順過，一個社會化生產的社會究竟會是什麼樣子，我們如何保持和今天一樣的生活質量。因此，這篇文章。我真的希望站在 \"另一方 \"的人（儘管這聽起來對我來說有點過於敵對）能夠雄辯地解釋他們的思想過程。我不是想引發敵意，只是想進行一次有思想的討論。<p>我的一些大問題是：<p>1. 在這個社會中，誰在做艱苦/骯髒的工作？耕作是其中之一。但也有建築業、汙水處理、垃圾處理等工作，不一而足。有很多不受歡迎的工作，雖然也許有些人願意做，但我懷疑我們的需求能否得到滿足，因為同樣的人可以為同樣的報酬做更容易的工作。 <p>2.如何定義需求？食物、住所、衣服。然後呢？電？互聯網？智能手機？遊戲機/電腦？在那些上面玩的遊戲？音樂？記憶海綿床墊？等等。如果所有這些都不是需求，那麼具有不同興趣的個人將如何真正選擇他們想要擁有的東西？ <p>3.有什麼激勵措施來提高和成為高技能？以醫生為例。有些人對他們的工作真的很有熱情。大多數人可能有一點激情，但主要是被金錢和聲望吸引的聰明人。假設醫學院和大學仍然存在，當一個人可以做一些更容易的事情時，他為什麼要通過那個管道呢？<p>到目前為止，我收到的唯一答案是：\"嗯，人類將不得不從根本上改變他們的本性，學會像<i>x</i>一樣生活。"
}