{
  "@type": "NewsArticle",
  "identifier": "2022--04--08--en--askhn--HackerNews--NewsArticle--30960530",
  "url": "https://news.ycombinator.com/item?id=30960530",
  "headline": "Ask HN: What skills should I (try to) pass on to this year's intern?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Nearly every summer for the last 10 years, there has been an intern or two where I work (small software group inside of a manufacturing company). We usually get them on the younger/earlier side. We've tended to throw a project or two of side interest their way, help them with the tools, and see what they come up with. Lots of extra bandwidth hasn't usually be something we have in excess during the summer months. Our own development model looks a lot like open source (e.g. initiative, trust, collaborative process, play outsized roles compared to more &quot;managed&quot; organizations).<p>I'm trying to be a little more intentional about it this year. They'll have access to both our group and the small group that does web facing front end stuff. So the web UI guys will have to do what they want with them. I do all of the other stuff (from Elixir APIs to embedded C on microcontrollers to native apps to embedded Linux). More than coding C, Elixir, Python, Kotlin, Swift though, my first inclination is to expose them to as much Linux as I can. We run multiple servers and develop a product that runs embedded Debian on a small SBC. Knowing Unix decently has been one of the most transcendental skills for me over the years.<p>What types of experiences would you try to create for a relatively inexperienced intern in such an environment?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "travisgriggs",
    "url": "https://news.ycombinator.com/user?id=travisgriggs"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30960530",
  "sameAs": "https://news.ycombinator.com/item?id=30960530",
  "dateCreated": "2022-04-08T18:12:35.823Z",
  "datePublished": "2022-04-08T18:07:50.000Z",
  "dateModified": "2022-04-08T18:12:35.823Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该（努力）把什么技能传给今年的实习生？",
  "headline_zh-Hant": "Ask HN: 我應該（努力）把什麼技能傳給今年的實習生？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在过去的10年中，几乎每个夏天，我工作的地方都有一两个实习生（一家制造公司内部的小型软件小组）。我们收到的实习生通常都是比较年轻/早熟的。我们倾向于把一两个他们感兴趣的项目扔给他们，帮助他们使用工具，看看他们能想出什么办法。很多额外的带宽通常不是我们在夏季有多余的东西。我们自己的开发模式看起来很像开放源码（例如，主动性、信任、合作过程，与更多的 \"管理型 \"组织相比，发挥更大的作用）。他们将有机会接触到我们的小组和从事面向网络的前端工作的小型小组。因此，Web UI人员将不得不对他们做他们想做的事。我做所有其他的事情（从Elixir APIs到微控制器上的嵌入式C语言到本地应用程序到嵌入式Linux）。比起编写C、Elixir、Python、Kotlin、Swift，我更倾向于让他们尽可能多地接触Linux。我们运行多个服务器，并开发一个在小型SBC上运行嵌入式Debian的产品。多年来，对Unix的了解是我最有成就感的技能之一。<p>在这样的环境中，你会尝试为一个相对没有经验的实习生创造什么样的经验？",
  "description_zh-Hant": "在過去的10年中，幾乎每個夏天，我工作的地方都有一兩個實習生（一家制造公司內部的小型軟件小組）。我們收到的實習生通常都是比較年輕/早熟的。我們傾向於把一兩個他們感興趣的項目扔給他們，幫助他們使用工具，看看他們能想出什麼辦法。很多額外的帶寬通常不是我們在夏季有多餘的東西。我們自己的開發模式看起來很像開放源碼（例如，主動性、信任、合作過程，與更多的 \"管理型 \"組織相比，發揮更大的作用）。他們將有機會接觸到我們的小組和從事面向網絡的前端工作的小型小組。因此，Web UI人員將不得不對他們做他們想做的事。我做所有其他的事情（從Elixir APIs到微控制器上的嵌入式C語言到本地應用程序到嵌入式Linux）。比起編寫C、Elixir、Python、Kotlin、Swift，我更傾向於讓他們儘可能多地接觸Linux。我們運行多個服務器，並開發一個在小型SBC上運行嵌入式Debian的產品。多年來，對Unix的瞭解是我最有成就感的技能之一。<p>在這樣的環境中，你會嘗試為一個相對沒有經驗的實習生創造什麼樣的經驗？"
}