{
  "@type": "NewsArticle",
  "identifier": "2022--03--28--en--askhn--HackerNews--NewsArticle--30827696",
  "url": "https://news.ycombinator.com/item?id=30827696",
  "headline": "Ask HN: How to stop being so anxious about job interviews?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Before I started: yes, I have generalized anxiety disorder, properly diagnosed, properly treated. It has not bothered in me in years, and for someone who couldn't get a haircut without feeling the heart racing to 150bpm, it's been really great. All that therapy and (some, intermittent) medication worked, except for one use case: job interviews.<p>It's not even a career-related anxiety: I manage large teams and am able to deal with all sorts of people at levels junior to EVP, no problem, very little is capable of throwing me off-balance.<p>Yet here I am. I have a Meta interview later tonight, and I feel lightheaded, sick, and weak-kneeled. I measured my temperature and I've got a minor fever. Couldn't sleep at night. All psychological - I am not sick. Thinking about it, here are some of the things that cause all those reactions:<p>1) Fear of embarrassing myself in front of very senior/accomplished people. \n2) Getting stuck/blocked or coming up with a laughable solution that won't make sense.\n3) Rejection fear and worse: fear of a downward spiral of failure that can end my career (typical catastrophic thinking).<p>Oddly enough, I don't feel anything like that in behavioral interviews. It's only in those where I need to be &quot;creative&quot;, like system design or coding. I am having a miserable weekend because of this. Frequently I think about cancelling interviews (and many times I do - this is the 3rd time I'm talking to Meta, the last 2 I cancelled the loops) because of this combination of anxiety and misery at peak level for so many hours and days.<p>People who have similar symptoms, how do/did you deal with it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "danrocks",
    "url": "https://news.ycombinator.com/user?id=danrocks"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30827696",
  "sameAs": "https://news.ycombinator.com/item?id=30827696",
  "dateCreated": "2022-03-28T06:37:22.828Z",
  "datePublished": "2022-03-28T06:29:43.000Z",
  "dateModified": "2022-03-28T06:37:22.828Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何不再对工作面试如此焦虑？",
  "headline_zh-Hant": "Ask HN: 如何不再對工作面試如此焦慮？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在我开始之前：是的，我有广泛性焦虑症，经过适当的诊断和治疗。多年来，它没有打扰过我，对于一个理发都不会感到心跳加速到150bpm的人来说，这真的很棒。所有这些治疗和（一些，间歇性的）药物治疗都起了作用，除了一个用例：工作面试。<p>这甚至不是一个与职业有关的焦虑。我管理着大型团队，能够与初级到EVP级别的各种人打交道，没有问题，很少有人能够让我失去平衡。<p>然而我在这里。今晚我有一个Meta面试，我感到头晕目眩，身体不适，腿脚发软。我测量了体温，我有轻微的发烧。晚上睡不着觉。所有的心理--我没有病。想了想，以下是导致所有这些反应的一些事情：<p>1）害怕在非常资深/有成就的人面前出丑。\n2）被卡住/阻碍或想出一个可笑的解决方案，不会有意义。\n3）害怕被拒绝，更糟糕的是：害怕失败的螺旋式下降，这可能会结束我的职业生涯（典型的灾难性思维）。只有在那些我需要有&quot;创造性&quot;的地方，如系统设计或编码。因为这个原因，我的周末过得很痛苦。我经常想到取消面试（而且很多次我都这样做了--这是我第三次和Meta谈话，前两次我都取消了循环），因为这种焦虑和痛苦的组合在这么多小时和这么多天里都处于峰值水平。<p>有类似症状的人，你们是如何/如何处理的？",
  "description_zh-Hant": "在我開始之前：是的，我有廣泛性焦慮症，經過適當的診斷和治療。多年來，它沒有打擾過我，對於一個理髮都不會感到心跳加速到150bpm的人來說，這真的很棒。所有這些治療和（一些，間歇性的）藥物治療都起了作用，除了一個用例：工作面試。<p>這甚至不是一個與職業有關的焦慮。我管理著大型團隊，能夠與初級到EVP級別的各種人打交道，沒有問題，很少有人能夠讓我失去平衡。<p>然而我在這裡。今晚我有一個Meta面試，我感到頭暈目眩，身體不適，腿腳發軟。我測量了體溫，我有輕微的發燒。晚上睡不著覺。所有的心理--我沒有病。想了想，以下是導致所有這些反應的一些事情：<p>1）害怕在非常資深/有成就的人面前出醜。\n2）被卡住/阻礙或想出一個可笑的解決方案，不會有意義。\n3）害怕被拒絕，更糟糕的是：害怕失敗的螺旋式下降，這可能會結束我的職業生涯（典型的災難性思維）。只有在那些我需要有&quot;創造性&quot;的地方，如系統設計或編碼。因為這個原因，我的週末過得很痛苦。我經常想到取消面試（而且很多次我都這樣做了--這是我第三次和Meta談話，前兩次我都取消了循環），因為這種焦慮和痛苦的組合在這麼多小時和這麼多天裡都處於峰值水平。<p>有類似症狀的人，你們是如何/如何處理的？"
}