{
  "@type": "NewsArticle",
  "identifier": "2022--03--16--en--askhn--HackerNews--NewsArticle--30702753",
  "url": "https://news.ycombinator.com/item?id=30702753",
  "headline": "Ask HN: What do you use as your go-to source of world news?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I used to &quot;trust&quot; Google News to give me a reasonable picture of the state of the world, perhaps even with some bias towards things I'm interested in, but now I find it very difficult to navigate. Choosing a region biases the news loads, and I can't choose Europe as a region. I would like something which is as broad as possible, and reports on the important stuff. Nowadays I tend to use the Guardian because I'm fairly progressive-leaning and it seems good enough in terms of quality, and it's also free (I really don't want to have to pay for another subscription, but I understand that beggars can't be choosers). Is there anything else I should check out? With the recent invasion of Ukraine, I have relied more and more on Twitter, but I really struggle to get the signal out of the noise, it's just not proper journalism. What I noticed, however, is that major news outlets tend to just rebroadcast whatever is on Twitter, just with many hours of delay and (hopefully, but not always, given the fast-paced rate at which new stuff happens) with some fact-checking. I am really looking for advice.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tunnuz",
    "url": "https://news.ycombinator.com/user?id=tunnuz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30702753",
  "sameAs": "https://news.ycombinator.com/item?id=30702753",
  "dateCreated": "2022-03-16T19:24:31.431Z",
  "datePublished": "2022-03-16T19:12:46.000Z",
  "dateModified": "2022-03-16T19:24:31.431Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 你用什么作为你的世界新闻的首选来源？",
  "headline_zh-Hant": "Ask HN: 你用什麼作為你的世界新聞的首選來源？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我曾经相信谷歌新闻能给我一个合理的世界现状，也许甚至对我感兴趣的事情有一些偏见，但现在我发现它很难浏览。选择一个地区会使新闻加载出现偏差，而且我不能选择欧洲作为一个地区。我希望有一个尽可能广泛的东西，并报道重要的东西。现在我倾向于使用《卫报》，因为我是相当进步的人，而且它的质量似乎足够好，而且它也是免费的（我真的不想再花钱订阅，但我知道乞丐是不能选择的）。还有什么是我应该查看的吗？随着最近对乌克兰的入侵，我越来越依赖推特，但我真的很难从噪音中获取信号，这不是正确的新闻报道。然而，我注意到的是，主要的新闻机构往往只是转播推特上的任何内容，只是有许多小时的延迟和（希望，但并不总是，鉴于新事物发生的快节奏）一些事实核查。我真的在寻求建议。",
  "description_zh-Hant": "我曾經相信谷歌新聞能給我一個合理的世界現狀，也許甚至對我感興趣的事情有一些偏見，但現在我發現它很難瀏覽。選擇一個地區會使新聞加載出現偏差，而且我不能選擇歐洲作為一個地區。我希望有一個儘可能廣泛的東西，並報道重要的東西。現在我傾向於使用《衛報》，因為我是相當進步的人，而且它的質量似乎足夠好，而且它也是免費的（我真的不想再花錢訂閱，但我知道乞丐是不能選擇的）。還有什麼是我應該查看的嗎？隨著最近對烏克蘭的入侵，我越來越依賴推特，但我真的很難從噪音中獲取信號，這不是正確的新聞報道。然而，我注意到的是，主要的新聞機構往往只是轉播推特上的任何內容，只是有許多小時的延遲和（希望，但並不總是，鑑於新事物發生的快節奏）一些事實核查。我真的在尋求建議。"
}