{
  "@type": "NewsArticle",
  "identifier": "2022--04--01--en--askhn--HackerNews--NewsArticle--30873861",
  "url": "https://news.ycombinator.com/item?id=30873861",
  "headline": "Ask HN: When do you give up on Silicon Valley?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been working at a FAANG company (call it FaceAppleMicroNetoogle) for several years. I make &gt; $800,000 a year. I live in the bay area and spend a lot of what I make (after taxes and 401k) on housing and other basic needs for my wife and two kids.<p>I have a certain amount of ennui lately. My team at FaceAppleMicroNetoogle is maybe growing in a different direction than I am. With respect to software engineering practices in my particular vertical. I'm working on something that I don't think will matter. But it has to be done anyway to meet some goals. I can and will do that thing.<p>I feel a certain amount of job security at FaceAppleMicroNetoogle. I can probably continue to contribute there. At a high level for the foreseeable future. And I think it's unlikely that I'll be fired or laid off any time soon. I said the thing I'm working on won't make an impact. But that probably won't significantly count against me. I've told several levels of managers that it won't make an impact, for what that's worth. But it still has to happen and so I'll finish it. Once that's done, the next thing I work on might make an impact...but even if it does, I'm not sure that would move the needle for me as far as job satisfaction.<p>I've thought about leaving Silicon Valley. Going somewhere cheaper. But how can someone give up an earning opportunity like this? On the one hand I feel kind of prisoner to it. And on the other hand I feel incredibly ungrateful and entitled to be even considering giving up a paycheck that's 10x what a lot of people would be grateful for.<p>I think to some degree the crazy pay and the crazy costs are a treadmill. I guess my question is, if anyone else has gotten off that treadmill. And if so, how has it affected your life?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway_cmon",
    "url": "https://news.ycombinator.com/user?id=throwaway_cmon"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30873861",
  "sameAs": "https://news.ycombinator.com/item?id=30873861",
  "dateCreated": "2022-04-01T00:43:21.151Z",
  "datePublished": "2022-04-01T00:26:06.000Z",
  "dateModified": "2022-04-01T00:43:21.151Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你何时会放弃硅谷？",
  "headline_zh-Hant": "Ask HN: 你何時會放棄硅谷？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我已经在一家FAANG公司（称之为FaceAppleMicroNetoogle）工作了几年。我的年薪是80万美元。我住在海湾地区，把我赚到的很多钱（税后和401k）花在住房和我妻子和两个孩子的其他基本需求上。<p>我最近有某种程度的忧郁。我在FaceAppleMicroNetoogle的团队也许正朝着与我不同的方向发展。关于我的特定垂直领域的软件工程实践。我正在做一些我认为并不重要的事情。但是为了达到一些目标，无论如何都必须要做。我可以而且会做那件事。<p>我在FaceAppleMicroNetoogle感到有一定的工作保障。我可能可以继续在那里做出贡献。在可预见的未来，我可以在一个较高的水平上作出贡献。而且我认为我不太可能在短期内被解雇或裁员。我说我正在做的事情不会产生影响。但这可能不会明显地算到我头上。我已经告诉了几级经理，它不会产生影响，这很有价值。但它仍然必须发生，所以我将完成它。一旦完成，我所做的下一件事可能会产生影响......但即使如此，我也不确定就工作满意度而言，这是否会对我产生影响。去一个更便宜的地方。但是，一个人怎么能放弃这样一个赚钱的机会呢？一方面，我觉得自己是个囚犯。另一方面，我觉得自己非常不知足，甚至有权考虑放弃10倍于很多人的薪水。<p>我认为在某种程度上，疯狂的薪水和疯狂的费用是一种跑步机。我想我的问题是，是否有其他人已经离开了这个跑步机。如果是的话，它对你的生活有什么影响？",
  "description_zh-Hant": "我已經在一家FAANG公司（稱之為FaceAppleMicroNetoogle）工作了幾年。我的年薪是80萬美元。我住在海灣地區，把我賺到的很多錢（稅後和401k）花在住房和我妻子和兩個孩子的其他基本需求上。<p>我最近有某種程度的憂鬱。我在FaceAppleMicroNetoogle的團隊也許正朝著與我不同的方向發展。關於我的特定垂直領域的軟件工程實踐。我正在做一些我認為並不重要的事情。但是為了達到一些目標，無論如何都必須要做。我可以而且會做那件事。<p>我在FaceAppleMicroNetoogle感到有一定的工作保障。我可能可以繼續在那裡做出貢獻。在可預見的未來，我可以在一個較高的水平上作出貢獻。而且我認為我不太可能在短期內被解僱或裁員。我說我正在做的事情不會產生影響。但這可能不會明顯地算到我頭上。我已經告訴了幾級經理，它不會產生影響，這很有價值。但它仍然必須發生，所以我將完成它。一旦完成，我所做的下一件事可能會產生影響......但即使如此，我也不確定就工作滿意度而言，這是否會對我產生影響。去一個更便宜的地方。但是，一個人怎麼能放棄這樣一個賺錢的機會呢？一方面，我覺得自己是個囚犯。另一方面，我覺得自己非常不知足，甚至有權考慮放棄10倍於很多人的薪水。<p>我認為在某種程度上，瘋狂的薪水和瘋狂的費用是一種跑步機。我想我的問題是，是否有其他人已經離開了這個跑步機。如果是的話，它對你的生活有什麼影響？"
}