{
  "@type": "NewsArticle",
  "identifier": "2022--03--21--en--askhn--HackerNews--NewsArticle--30755447",
  "url": "https://news.ycombinator.com/item?id=30755447",
  "headline": "Ask HN: Why was it hard to criticize Freedom Fries hysteria while it lasted?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This question is, of course, related to Russia's invasion and the various reactions in so called Western countries.<p>Recently, the main dairy company of Sweden cancelled Kefir (Russian Yoghurt), with a political explanation that the logo looks similar to the famous church near the Red Square. And there's been a lot of these things lately. When I've talked to friends and acquaintances about it, we can agree that it's a ridiculous thing that doesn't change anything. Yet, in PR, media, and other popularity-based professions, there seems to be a very different arrangement of perspectives and emotions.<p>In my opinion, this is an era where more people should be exposed to Chomsky's &quot;Manufacturing Consent&quot; and similar perspectives, but all we get is some sort of synthetic flock mentality.<p>I was too young to notice all the details in people's behaviour in the post-2001 political climate. Anyone with some interesting perspectives who remembers?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "acadapter",
    "url": "https://news.ycombinator.com/user?id=acadapter"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30755447",
  "sameAs": "https://news.ycombinator.com/item?id=30755447",
  "dateCreated": "2022-03-21T15:52:12.763Z",
  "datePublished": "2022-03-21T15:49:13.000Z",
  "dateModified": "2022-03-21T15:52:12.763Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么在自由薯条歇斯底里的时候很难对其进行批评？",
  "headline_zh-Hant": "Ask HN: 為什麼在自由薯條歇斯底里的時候很難對其進行批評？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这个问题当然与俄罗斯的入侵和所谓的西方国家的各种反应有关。<p>最近，瑞典的主要乳品公司取消了Kefir（俄罗斯酸奶），其政治解释是该标志与红场附近的著名教堂相似。而且最近有很多这样的事情。当我与朋友和熟人谈及此事时，我们都能同意这是一件可笑的事情，不会改变任何事情。然而，在公关、媒体和其他基于人气的职业中，似乎有一个非常不同的观点和情绪安排。<p>在我看来，这是一个应该让更多人接触乔姆斯基的&quot;制造同意&quot;和类似观点的时代，但我们得到的只是某种合成的羊群心态。<p>我当时太年轻，没有注意到2001年后政治气候中人们行为的所有细节。有没有人记得一些有趣的观点？",
  "description_zh-Hant": "這個問題當然與俄羅斯的入侵和所謂的西方國家的各種反應有關。<p>最近，瑞典的主要乳品公司取消了Kefir（俄羅斯酸奶），其政治解釋是該標誌與紅場附近的著名教堂相似。而且最近有很多這樣的事情。當我與朋友和熟人談及此事時，我們都能同意這是一件可笑的事情，不會改變任何事情。然而，在公關、媒體和其他基於人氣的職業中，似乎有一個非常不同的觀點和情緒安排。<p>在我看來，這是一個應該讓更多人接觸喬姆斯基的&quot;製造同意&quot;和類似觀點的時代，但我們得到的只是某種合成的羊群心態。<p>我當時太年輕，沒有注意到2001年後政治氣候中人們行為的所有細節。有沒有人記得一些有趣的觀點？"
}