{
  "@type": "NewsArticle",
  "identifier": "2022--03--01--en--askhn--HackerNews--NewsArticle--30515912",
  "url": "https://news.ycombinator.com/item?id=30515912",
  "headline": "Ask HN: Why have chorded keyboards not become popular among software engineers?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Software engineers as a group tend to spend many hours per day at a computer, and much of that time involves typing. Software engineers also seem to enjoy discussing (and buying) exotic &amp; expensive keyboards with split designs and customized mechanical keyswitches. They spend time learning modal text editors like vim or emacs to more efficiently edit files. Sometimes they even switch to alternative keyboard layouts like dvorak. Basically, they seem to enjoy exploring moderately-exotic productivity-improvement methods generally. Yet very rarely do chorded keyboards crop up in the many keyboard discussions found online. The only chorded keyboard I've ever seen in real life was used by a stenographer assigned during lectures to help a fellow college student with hearing difficulties.<p>I myself have not yet tried to learn how to use a chorded keyboard, but the idea seems interesting on several levels. For one they're often one-handed, leaving the other hand free to use a pointing device or whatever else. Two, they seem much more ergonomic than a standard keyboard - what could be more natural than grasping a keyer in any orientation that feels right? - and three they are extremely portable which opens them up for use with laptops or HMDs. Of course there are the obvious input speed benefits but those are hidden behind the learning curve.<p>Why haven't chorded keyboards become popular? Is it the momentum of QWERTY being taught in primary school? Is it the dubious productivity benefit given the large learning investment? Is it just one of those things that hasn't hit critical mass so people hear about them? Are vim and emacs just a sort of backdoor method of bringing chorded keyboarding to QWERTY? It's just strange given how many people seem to be 3D printing their own keyboard layouts or whatever, and they're all fundamentally staying within the same input paradigm. Nobody I've heard of is boldly forging into the 3D-printed custom chorded keyboard space.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ahelwer",
    "url": "https://news.ycombinator.com/user?id=ahelwer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30515912",
  "sameAs": "https://news.ycombinator.com/item?id=30515912",
  "dateCreated": "2022-03-01T16:16:30.280Z",
  "datePublished": "2022-03-01T16:10:41.000Z",
  "dateModified": "2022-03-01T16:16:30.280Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么和弦式键盘没有在软件工程师中流行起来？",
  "headline_zh-Hant": "Ask HN: 為什麼和絃式鍵盤沒有在軟件工程師中流行起來？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "软件工程师作为一个群体，往往每天在电脑前花费很多时间，其中大部分时间涉及打字。软件工程师似乎也喜欢讨论（和购买）异国情调的amp；带有分体式设计和定制机械按键的昂贵键盘。他们花时间学习模式化的文本编辑器，如vim或emacs，以更有效地编辑文件。有时他们甚至改用另一种键盘布局，如Dvorak。基本上，他们似乎很喜欢探索适度奇特的提高生产力的方法。然而，在网上的许多键盘讨论中，和弦式键盘却很少出现。我在现实生活中见过的唯一一个和弦式键盘是由一位速记员在授课时用来帮助一位有听力障碍的大学同学。首先，它们通常是单手操作的，另一只手可以自由地使用指向性设备或其他东西。第二，它们似乎比标准键盘更符合人体工程学--还有什么比以任何感觉正确的方向抓握键盘更自然的呢？- 第三，它们非常便于携带，这使它们可以与笔记本电脑或HMD一起使用。当然，还有明显的输入速度优势，但这些都隐藏在学习曲线的后面。<p>为什么和弦式键盘没有流行起来？是小学里教QWERTY的势头吗？是由于大量的学习投资而带来的令人怀疑的生产力效益吗？它只是那些还没有达到临界质量的东西之一，所以人们听说了它们？vim和emacs是否只是一种将和弦式键盘引入QWERTY的后门方法？这很奇怪，因为很多人似乎都在3D打印他们自己的键盘布局或其他什么，而且他们都从根本上保持在相同的输入范式中。我没有听说过有人大胆地进入3D打印的定制和弦键盘领域。",
  "description_zh-Hant": "軟件工程師作為一個群體，往往每天在電腦前花費很多時間，其中大部分時間涉及打字。軟件工程師似乎也喜歡討論（和購買）異國情調的amp；帶有分體式設計和定製機械按鍵的昂貴鍵盤。他們花時間學習模式化的文本編輯器，如vim或emacs，以更有效地編輯文件。有時他們甚至改用另一種鍵盤佈局，如Dvorak。基本上，他們似乎很喜歡探索適度奇特的提高生產力的方法。然而，在網上的許多鍵盤討論中，和絃式鍵盤卻很少出現。我在現實生活中見過的唯一一個和絃式鍵盤是由一位速記員在授課時用來幫助一位有聽力障礙的大學同學。首先，它們通常是單手操作的，另一隻手可以自由地使用指向性設備或其他東西。第二，它們似乎比標準鍵盤更符合人體工程學--還有什麼比以任何感覺正確的方向抓握鍵盤更自然的呢？- 第三，它們非常便於攜帶，這使它們可以與筆記本電腦或HMD一起使用。當然，還有明顯的輸入速度優勢，但這些都隱藏在學習曲線的後面。<p>為什麼和絃式鍵盤沒有流行起來？是小學裡教QWERTY的勢頭嗎？是由於大量的學習投資而帶來的令人懷疑的生產力效益嗎？它只是那些還沒有達到臨界質量的東西之一，所以人們聽說了它們？vim和emacs是否只是一種將和絃式鍵盤引入QWERTY的後門方法？這很奇怪，因為很多人似乎都在3D打印他們自己的鍵盤佈局或其他什麼，而且他們都從根本上保持在相同的輸入範式中。我沒有聽說過有人大膽地進入3D打印的定製和絃鍵盤領域。"
}