{
  "@type": "NewsArticle",
  "identifier": "2022--02--19--en--askhn--HackerNews--NewsArticle--30395294",
  "url": "https://news.ycombinator.com/item?id=30395294",
  "headline": "Ask HN: What are the West's offesive cyber attack capabilities toward Russia?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "For a couple decades, Russian military-adjacent  hacker farms have treated Western businesses as a free-fire zone for ransomware, malware and data exfiltration. There seems to be a general assumption and fear that, if ordered to, Russian cyber gangs could bring down critical infrastructure, up to the point of causing mass casualties across the West. To this point, Russian incursions have mostly been met with targeted sanctions, without major cyber reprisals along the lines of, e.g. Israel's attack on the Iranian nuclear programme at Netanz. (That we know of).<p>There also seems to be a lingering feeling that Russia isn't as dependent on network technology as the West is, therefore they have a somewhat asymmetrical advantage in this form of warfare. But surely that's not true now, if it ever was.<p>If NATO were to take the gloves off and attack Russia in cyberspace, what would its capabilities be, and what would such a war look like? Would we see nuclear plants exploding on both sides? Which force is actually superior offensively in this theater?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "noduerme",
    "url": "https://news.ycombinator.com/user?id=noduerme"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30395294",
  "sameAs": "https://news.ycombinator.com/item?id=30395294",
  "dateCreated": "2022-02-19T08:32:35.869Z",
  "datePublished": "2022-02-19T08:10:14.000Z",
  "dateModified": "2022-02-19T08:32:35.869Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 西方对俄罗斯的进攻性网络攻击能力是什么？",
  "headline_zh-Hant": "Ask HN: 西方對俄羅斯的進攻性網絡攻擊能力是什麼？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几十年来，与军事相邻的俄罗斯黑客农场一直将西方企业视为勒索软件、恶意软件和数据外流的自由射击区。似乎有一种普遍的假设和恐惧，即如果得到命令，俄罗斯网络团伙可以使关键基础设施瘫痪，甚至造成整个西方国家的大规模伤亡。在这一点上，俄罗斯的入侵大多受到有针对性的制裁，没有像以色列在Netanz对伊朗核计划的攻击那样的重大网络报复。(<p>似乎还有一种挥之不去的感觉，即俄罗斯不像西方那样依赖网络技术，因此他们在这种形式的战争中具有某种不对称的优势。但现在肯定不是这样，如果曾经是的话。<p>如果北约脱下手套，在网络空间攻击俄罗斯，其能力将是什么，这样的战争会是什么样子？我们会看到双方的核电站爆炸吗？在这个战场上，哪支部队的进攻能力实际上更强？",
  "description_zh-Hant": "幾十年來，與軍事相鄰的俄羅斯黑客農場一直將西方企業視為勒索軟件、惡意軟件和數據外流的自由射擊區。似乎有一種普遍的假設和恐懼，即如果得到命令，俄羅斯網絡團伙可以使關鍵基礎設施癱瘓，甚至造成整個西方國家的大規模傷亡。在這一點上，俄羅斯的入侵大多受到有針對性的制裁，沒有像以色列在Netanz對伊朗核計劃的攻擊那樣的重大網絡報復。(<p>似乎還有一種揮之不去的感覺，即俄羅斯不像西方那樣依賴網絡技術，因此他們在這種形式的戰爭中具有某種不對稱的優勢。但現在肯定不是這樣，如果曾經是的話。<p>如果北約脫下手套，在網絡空間攻擊俄羅斯，其能力將是什麼，這樣的戰爭會是什麼樣子？我們會看到雙方的核電站爆炸嗎？在這個戰場上，哪支部隊的進攻能力實際上更強？"
}