{
  "@type": "NewsArticle",
  "identifier": "2022--04--04--en--askhn--HackerNews--NewsArticle--30905095",
  "url": "https://news.ycombinator.com/item?id=30905095",
  "headline": "Ask HN: How are people not making tech salaries getting by?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am single and make decent money, enough to not worry about monthly budget. However, even I have noticed how little I am able to get for the same money. Only few years ago I would be hauling 4-5 bags back home for $30, now it's barely 2 bags. Milk has gone from $2 to $5. Rents are easily near $3k. I have found myself not buying lot of things I used to buy, less eating out, less random stuff/gadgets, less travelling...less of everything.<p>But what are people doing who are making around 70k.. They are already on budget. I can't see how current govt will win next election, silent majority has heavily been hurt and pretty sure they will take it out in elections.<p>Inflation and housing prices/rents are basically killing this country. I personally know few immigrants who left because despite their humble living standard they are unable to save anything anymore to make their time worth it here.<p>I am no economist, but I have this gut feeling, this is it. Economy has cracked. Remember seeing great depression photos? That feels like the next few decades. Maybe I'm hungry and being pessimistic or maybe it's as dim as I feel it.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lifeplusplus",
    "url": "https://news.ycombinator.com/user?id=lifeplusplus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30905095",
  "sameAs": "https://news.ycombinator.com/item?id=30905095",
  "dateCreated": "2022-04-04T10:50:57.938Z",
  "datePublished": "2022-04-04T10:45:40.000Z",
  "dateModified": "2022-04-04T10:50:57.938Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 不拿技术工资的人是如何过日子的？",
  "headline_zh-Hant": "Ask HN: 不拿技術工資的人是如何過日子的？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是单身，赚的钱还不错，足以让我不担心每月的预算。然而，即使是我也注意到，同样的钱，我能够得到的东西太少了。就在几年前，我还能花30美元拖4-5袋东西回家，而现在只剩两袋了。牛奶从2美元涨到了5美元，房租很容易接近3千美元。我发现自己不再买很多以前买的东西，减少外出就餐，减少随机的东西/小工具，减少旅行......减少一切。他们已经在预算之内了。我看不出目前的政府会如何赢得下一次选举，沉默的大多数人已经受到了严重的伤害，而且非常肯定他们会在选举中把它拿出来。<p>通货膨胀和房价/租金基本上是在杀害这个国家。我个人知道有几个移民离开了，因为尽管他们的生活水平很低，但他们无法再存下任何东西，使他们在这里的时间值得。经济已经崩溃了。还记得看到大萧条的照片吗？那感觉就像接下来的几十年。也许是我太饿了，太悲观了，也可能是我感觉到的那样暗淡。",
  "description_zh-Hant": "我是單身，賺的錢還不錯，足以讓我不擔心每月的預算。然而，即使是我也注意到，同樣的錢，我能夠得到的東西太少了。就在幾年前，我還能花30美元拖4-5袋東西回家，而現在只剩兩袋了。牛奶從2美元漲到了5美元，房租很容易接近3千美元。我發現自己不再買很多以前買的東西，減少外出就餐，減少隨機的東西/小工具，減少旅行......減少一切。他們已經在預算之內了。我看不出目前的政府會如何贏得下一次選舉，沉默的大多數人已經受到了嚴重的傷害，而且非常肯定他們會在選舉中把它拿出來。<p>通貨膨脹和房價/租金基本上是在殺害這個國家。我個人知道有幾個移民離開了，因為儘管他們的生活水平很低，但他們無法再存下任何東西，使他們在這裡的時間值得。經濟已經崩潰了。還記得看到大蕭條的照片嗎？那感覺就像接下來的幾十年。也許是我太餓了，太悲觀了，也可能是我感覺到的那樣暗淡。"
}