{
  "@type": "NewsArticle",
  "identifier": "2022--03--30--en--askhn--HackerNews--NewsArticle--30859371",
  "url": "https://news.ycombinator.com/item?id=30859371",
  "headline": "Ask HN: Where to Find Bad Developers?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Tried this before and got instantly flagged, so trying again. For the record, this is NOT illegal in my country and any contract that prohibits it is NOT enforceable here. Do your homework before you hire abroad! Don't get pissed because you don't understand the law in the country you try to get &quot;cheap&quot; workers from, because we WILL take advantage of your ignorance, guaranteed! Here goes:<p>I live in Ecuador with my wife. She recently got a remote developer gig through a US Silicon Valley company. They pay about $2K a month, but the work is insanely easy. She averages about an hour a day in meetings and I average about 20 minutes per day of coding to squash her tickets. I want to replicate this with people who can talk their way through a standup, but maybe don't have the skills to actually do the work very well. In other words, where can I find bad developers who can talk tech and are down to have one or more jobs where they juggle meetings? If I could find a few such people, I'm very certain that I could bank much more money than I ever put away in the US or EU for far less actual work and hassle. Does anyone know if this has been done by others and maybe how they got it going?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "erdos4d",
    "url": "https://news.ycombinator.com/user?id=erdos4d"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30859371",
  "sameAs": "https://news.ycombinator.com/item?id=30859371",
  "dateCreated": "2022-03-30T19:10:11.657Z",
  "datePublished": "2022-03-30T18:56:45.000Z",
  "dateModified": "2022-03-30T19:10:11.657Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 哪里可以找到坏的开发者？",
  "headline_zh-Hant": "Ask HN: 哪裡可以找到壞的開發者？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "以前试过这个，马上就被标记了，所以再试一次。声明一下，这在我的国家并不违法，任何禁止这样做的合同在这里都无法执行。在你雇用国外的人之前，请做好功课。不要因为你不了解你想找的廉价工人所在国家的法律而生气，因为我们会利用你的无知，保证！\"。下面是：<p>我和我妻子住在厄瓜多尔。她最近通过一家美国硅谷公司获得了一份远程开发的工作。他们每月支付约2K美元，但工作非常轻松。她平均每天开会约一小时，我平均每天编码约20分钟来压制她的票。我想把这种情况复制给那些能说会道，但也许不具备实际工作能力的人。换句话说，我在哪里可以找到那些能说会道，并能从事一份或多份兼顾会议的工作的坏开发人员？如果我能找到几个这样的人，我非常肯定，我可以用更少的实际工作和麻烦，存下比我在美国或欧盟放的钱多得多的钱。有谁知道其他人是否做过这样的事，以及他们是如何做到的？",
  "description_zh-Hant": "以前試過這個，馬上就被標記了，所以再試一次。聲明一下，這在我的國家並不違法，任何禁止這樣做的合同在這裡都無法執行。在你僱用國外的人之前，請做好功課。不要因為你不瞭解你想找的廉價工人所在國家的法律而生氣，因為我們會利用你的無知，保證！\"。下面是：<p>我和我妻子住在厄瓜多爾。她最近通過一家美國硅谷公司獲得了一份遠程開發的工作。他們每月支付約2K美元，但工作非常輕鬆。她平均每天開會約一小時，我平均每天編碼約20分鐘來壓制她的票。我想把這種情況複製給那些能說會道，但也許不具備實際工作能力的人。換句話說，我在哪裡可以找到那些能說會道，並能從事一份或多份兼顧會議的工作的壞開發人員？如果我能找到幾個這樣的人，我非常肯定，我可以用更少的實際工作和麻煩，存下比我在美國或歐盟放的錢多得多的錢。有誰知道其他人是否做過這樣的事，以及他們是如何做到的？"
}