{
  "@type": "NewsArticle",
  "identifier": "2022--03--28--en--askhn--HackerNews--NewsArticle--30828380",
  "url": "https://news.ycombinator.com/item?id=30828380",
  "headline": "Ask HN: How do you produce documents as artifacts?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Each day I encounter new concepts and techniques but rarely document them. As I see professionals being able to document even the tiniest detail or bug they find, I am surprised on how they manage time to do so!<p>What does it take for one to capture these kind of detail eg. mathematical background, debugging session, some new concepts, some old concepts, system design etc? With age, I feel like my memory can't sustain the amount of information I am accumulating. Therefore, I think I will need to build a quick reference or memorize things as I go.<p>Normally, I do not like note keeping because my notes are never authentic to the original source. Thus, they are rarely useful. I have a bad habit of going through the same source multiple times. It is highly effective but unsustainable because of the time constraint. It was well suited for college when I had time.<p>What are other alternatives for this issue? I would really like to get some insights from those who have gone through these issue or face the issue.<p>Thank you for your time!<p>Cheers.<p>PS: As we build a software, we get lot of artifacts as byproduct. I also want the snippets or highlights to be a byproduct of my work such that I will be motivated to build a proper documentation out it!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "going_ham",
    "url": "https://news.ycombinator.com/user?id=going_ham"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30828380",
  "sameAs": "https://news.ycombinator.com/item?id=30828380",
  "dateCreated": "2022-03-28T08:37:49.088Z",
  "datePublished": "2022-03-28T08:19:55.000Z",
  "dateModified": "2022-03-28T08:37:49.088Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何将文件制作成艺术品？",
  "headline_zh-Hant": "Ask HN: 你如何將文件製作成藝術品？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "每天我都会遇到新的概念和技术，但很少记录它们。当我看到专业人士能够记录他们发现的最微小的细节或错误时，我很惊讶他们是如何管理时间的！<p>一个人需要什么来捕捉这些细节，例如数学背景、调试过程、一些新概念、一些旧概念、系统设计等？随着年龄的增长，我觉得我的记忆力无法维持我所积累的信息量。因此，我认为我需要建立一个快速参考资料，或者边做边记。<p>通常情况下，我不喜欢记笔记，因为我的笔记从来不是真实的原始资料。因此，它们很少有用。我有一个坏习惯，就是多次翻阅同一个资料。这种做法非常有效，但由于时间的限制，无法持续下去。在我有时间的时候，这很适合在大学里使用。<p>对于这个问题，还有什么其他的替代方法？我真的想从那些经历过这些问题或面临这个问题的人那里得到一些见解。<p>谢谢你的时间！<p>干杯。<p>PS：当我们构建一个软件时，我们会得到很多工件作为副产品。我也希望这些片段或亮点能成为我工作的副产品，这样我就会有动力去建立一个合适的文档了",
  "description_zh-Hant": "每天我都會遇到新的概念和技術，但很少記錄它們。當我看到專業人士能夠記錄他們發現的最微小的細節或錯誤時，我很驚訝他們是如何管理時間的！<p>一個人需要什麼來捕捉這些細節，例如數學背景、調試過程、一些新概念、一些舊概念、系統設計等？隨著年齡的增長，我覺得我的記憶力無法維持我所積累的信息量。因此，我認為我需要建立一個快速參考資料，或者邊做邊記。<p>通常情況下，我不喜歡記筆記，因為我的筆記從來不是真實的原始資料。因此，它們很少有用。我有一個壞習慣，就是多次翻閱同一個資料。這種做法非常有效，但由於時間的限制，無法持續下去。在我有時間的時候，這很適合在大學裡使用。<p>對於這個問題，還有什麼其他的替代方法？我真的想從那些經歷過這些問題或面臨這個問題的人那裡得到一些見解。<p>謝謝你的時間！<p>乾杯。<p>PS：當我們構建一個軟件時，我們會得到很多工件作為副產品。我也希望這些片段或亮點能成為我工作的副產品，這樣我就會有動力去建立一個合適的文檔了"
}