{
  "@type": "NewsArticle",
  "identifier": "2022--04--09--en--askhn--HackerNews--NewsArticle--30967539",
  "url": "https://news.ycombinator.com/item?id=30967539",
  "headline": "Ask HN: Getting a master degree in CS abroad",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey guys, \nI am going to finish my Bachelor in CS soon. Currently studying in Germany and was looking forward to get a master degree abroad.\nI know that this will look good on my CV and I can get to know another culture/country and I really like that, but that is not my main reason. \nMy main reasons are to learn, expand my skills, network, but also find some friends for life.<p>For that reason I was looking into the University of the countires, which are considered to be the leading Cybernations (UK, US, Russia, China and Israel).<p>The US fees are way to expensive for me.<p>Do I need to explain why I dont want to go to Russia?<p>UK is a solid option imo.<p>I read a lot of different opinions about a master degree in China. Some say it's awesome, some people say u actually don't learn much, if u attend classes in english.\n(Of course I would learn the language, currently starting, but I don't think I can get good enough in one year to attend classes in chinese)<p>Israel is a solid option too, but the lectures of they top Universities are in hebrew, unless a student, who studies abroad for a semester, is attending the class. So i would need to get good in hebrew asap or did I missread something on their website?<p>Any advice or proposal of an other country/city would be greatly appreciated.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "hope693",
    "url": "https://news.ycombinator.com/user?id=hope693"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30967539",
  "sameAs": "https://news.ycombinator.com/item?id=30967539",
  "dateCreated": "2022-04-09T12:48:58.569Z",
  "datePublished": "2022-04-09T12:39:00.000Z",
  "dateModified": "2022-04-09T12:48:58.569Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在国外获得CS的硕士学位",
  "headline_zh-Hant": "Ask HN: 在國外獲得CS的碩士學位",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，伙计们。\n我即将完成我的CS学士学位。目前在德国学习，希望能在国外获得硕士学位。\n我知道这在我的简历上会很好看，我可以了解另一种文化/国家，我真的很喜欢，但这不是我的主要原因。\n我的主要原因是学习，扩大我的技能，建立网络，但也找到一些生活中的朋友。<p>出于这个原因，我正在研究被认为是领先的网络国家（英国、美国、俄罗斯、中国和以色列）的大学。<p>美国的费用对我来说太贵了。<p>我需要解释为什么我不想去俄罗斯吗？<p>英国是一个坚实的选择，我认为。有些人说它很棒，有些人说如果你用英语上课，你实际上学不到什么。\n(当然，我也会学习语言，目前正在开始，但我不认为我可以在一年内达到足够好的水平来听中文课）<p>以色列也是一个可靠的选择，但他们顶级大学的讲座是用希伯来语进行的，除非有一个在国外学习了一个学期的学生在上课。所以我需要尽快把希伯来语学好，还是我在他们的网站上错过了什么？<p>如果有任何其他国家/城市的建议或提议，将非常感激。",
  "description_zh-Hant": "嘿，夥計們。\n我即將完成我的CS學士學位。目前在德國學習，希望能在國外獲得碩士學位。\n我知道這在我的簡歷上會很好看，我可以瞭解另一種文化/國家，我真的很喜歡，但這不是我的主要原因。\n我的主要原因是學習，擴大我的技能，建立網絡，但也找到一些生活中的朋友。<p>出於這個原因，我正在研究被認為是領先的網絡國家（英國、美國、俄羅斯、中國和以色列）的大學。<p>美國的費用對我來說太貴了。<p>我需要解釋為什麼我不想去俄羅斯嗎？<p>英國是一個堅實的選擇，我認為。有些人說它很棒，有些人說如果你用英語上課，你實際上學不到什麼。\n(當然，我也會學習語言，目前正在開始，但我不認為我可以在一年內達到足夠好的水平來聽中文課）<p>以色列也是一個可靠的選擇，但他們頂級大學的講座是用希伯來語進行的，除非有一個在國外學習了一個學期的學生在上課。所以我需要儘快把希伯來語學好，還是我在他們的網站上錯過了什麼？<p>如果有任何其他國家/城市的建議或提議，將非常感激。"
}