{
  "@type": "NewsArticle",
  "identifier": "2022--02--25--en--askhn--HackerNews--NewsArticle--30471557",
  "url": "https://news.ycombinator.com/item?id=30471557",
  "headline": "Ask HN: How to keep tech running in the apocalypse?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The gist of this question is, &quot;how does one prep to keep technology operable?&quot;<p>Imagine a disaster causes widespread collapse, where resources are no longer easily available, power and internet access is erratic or non-existent, and then things calm down enough to where the necessities of life are available and society tries to resume functioning.<p>Now, suppose you'd like to make computers work. What sort of things would you need?Power, obviously, or a way to charge batteries. What else?<p>What if you wanted to have communication with other people, or perhaps data communication? Would you want packet radio? HAM gear?<p>What if you want to repair equipment? I don't know if the computers in cars &quot;break&quot;, for example [not that I imagine fuel being available]. I wonder about what sort of needs there might be to repurpose gear.<p>What if you need to keep an application running? Maybe you have a mesh network and people want a web app for some purpose. But, without documentation, it'd be incredibly tedious.<p>I can't help but think I've seen a linux distro designed for this scenario, where you have binaries, and all the code, and all the toolchains, and all the documentation.<p>The right answer might be &quot;don't bother&quot;, but I'm still curious.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "armagon",
    "url": "https://news.ycombinator.com/user?id=armagon"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30471557",
  "sameAs": "https://news.ycombinator.com/item?id=30471557",
  "dateCreated": "2022-02-25T20:10:44.672Z",
  "datePublished": "2022-02-25T19:52:20.000Z",
  "dateModified": "2022-02-25T20:10:44.672Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 8
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何在启示录中保持技术运行？",
  "headline_zh-Hant": "Ask HN: 如何在啟示錄中保持技術運行？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这个问题的要点是：&quot;如何准备以保持技术的可操作性？&quot;<p>想象一下，一场灾难导致广泛的崩溃，资源不再容易获得，电力和互联网接入不稳定或不存在，然后事情平静下来，生活必需品可以获得，社会试图恢复运作。你需要什么样的东西？电源，很明显，或者给电池充电的方法。还有什么？<p>如果你想与其他人进行交流，或者是数据交流呢？你会需要分组无线电吗？HAM装备？<p>如果你想修理设备呢？我不知道汽车中的电脑是否会&quot;破损&quot;，例如[不是说我想象中的燃料是可用的]。我想知道可能会有什么样的需求来重新利用装备。<p>如果你需要保持一个应用程序的运行呢？也许你有一个网状网络，而人们为了某种目的想要一个网络应用。<p>我不禁想到，我曾见过一个为这种情况而设计的Linux发行版，在那里你有二进制文件、所有的代码、所有的工具链和所有的文档。<p>正确的答案可能是&quot;不打扰&quot;，但我仍然很好奇。",
  "description_zh-Hant": "這個問題的要點是：&quot;如何準備以保持技術的可操作性？&quot;<p>想象一下，一場災難導致廣泛的崩潰，資源不再容易獲得，電力和互聯網接入不穩定或不存在，然後事情平靜下來，生活必需品可以獲得，社會試圖恢復運作。你需要什麼樣的東西？電源，很明顯，或者給電池充電的方法。還有什麼？<p>如果你想與其他人進行交流，或者是數據交流呢？你會需要分組無線電嗎？HAM裝備？<p>如果你想修理設備呢？我不知道汽車中的電腦是否會&quot;破損&quot;，例如[不是說我想象中的燃料是可用的]。我想知道可能會有什麼樣的需求來重新利用裝備。<p>如果你需要保持一個應用程序的運行呢？也許你有一個網狀網絡，而人們為了某種目的想要一個網絡應用。<p>我不禁想到，我曾見過一個為這種情況而設計的Linux發行版，在那裡你有二進制文件、所有的代碼、所有的工具鏈和所有的文檔。<p>正確的答案可能是&quot;不打擾&quot;，但我仍然很好奇。"
}