{
  "@type": "NewsArticle",
  "identifier": "2022--03--07--en--askhn--HackerNews--NewsArticle--30593884",
  "url": "https://news.ycombinator.com/item?id=30593884",
  "headline": "Ask HN: How can I best utilize $20k towards a startup idea?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I sold some shares and now I have ~20k USD extra. I'm in my 30s and I have been programming for about 5 years, and I'm kind of bored of the daily grind. I can't imagine spending another 5 years crushing Jira tickets or doing code reviews.<p>I have been working on building mobile apps to tackle problems I'm passionate about solving, and teaching myself as much as possible, and I feel comfortable now with building web/mobile apps, backend services, and I understand a bit about cloud providers and navigating AWS/GCP. I also been reading books through the pandemic on design and product management, and also learned to use various tools like Figma and notion to organize.<p>How can I best utilize my 20k and do something meaningful with that amount this year? I don't know any 1st hand connections/friends who own their own software business, so I want to ask here.<p>Should I use that amount to register a business, so that I can release apps under that entity?<p>Should I use that amount to hire a professional designer to build landing/product page so I can focus on building the app/service and talking to potential users?<p>Should I move to the bay area or another big city center? Unfortunately I don't have any software engineer friends in my area as I work remote..<p>Please help me out, I need some inspiration and advice. Thank you.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "me_me_mu_mu",
    "url": "https://news.ycombinator.com/user?id=me_me_mu_mu"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30593884",
  "sameAs": "https://news.ycombinator.com/item?id=30593884",
  "dateCreated": "2022-03-07T22:10:15.320Z",
  "datePublished": "2022-03-07T22:01:30.000Z",
  "dateModified": "2022-03-07T22:10:15.320Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我怎样才能最好地利用2万美元来实现一个创业想法？",
  "headline_zh-Hant": "Ask HN: 我怎樣才能最好地利用2萬美元來實現一個創業想法？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我卖了一些股票，现在我有~2万美元的额外收入。我已经30多岁了，从事编程工作大约5年了，我对每天的工作有点厌倦了。我无法想象再花5年时间来压制Jira票据或做代码审查。<p>我一直致力于建立移动应用程序来解决我热衷于解决的问题，并尽可能地自学，我现在对建立网络/移动应用程序、后端服务感到很舒服，而且我对云供应商和浏览AWS/GCP有一些了解。我也一直在阅读关于设计和产品管理的书籍，还学会了使用各种工具，如Figma和notion来组织。<p>今年我如何才能最好地利用我的2万块钱，用这笔钱做一些有意义的事情？我不认识任何拥有自己软件业务的第一手关系/朋友，所以我想在这里问一下。<p>我是否应该用这笔钱来注册一个企业，这样我就可以在这个实体下发布应用程序？<p>我是否应该用这笔钱来雇用一个专业的设计师来建立登陆/产品页面，这样我就可以专注于建立应用程序/服务并与潜在用户交谈？不幸的是，我没有任何软件工程师朋友在我的地区，因为我是远程工作。<p>请帮助我，我需要一些灵感和建议。谢谢你。",
  "description_zh-Hant": "我賣了一些股票，現在我有~2萬美元的額外收入。我已經30多歲了，從事編程工作大約5年了，我對每天的工作有點厭倦了。我無法想象再花5年時間來壓制Jira票據或做代碼審查。<p>我一直致力於建立移動應用程序來解決我熱衷於解決的問題，並儘可能地自學，我現在對建立網絡/移動應用程序、後端服務感到很舒服，而且我對雲供應商和瀏覽AWS/GCP有一些瞭解。我也一直在閱讀關於設計和產品管理的書籍，還學會了使用各種工具，如Figma和notion來組織。<p>今年我如何才能最好地利用我的2萬塊錢，用這筆錢做一些有意義的事情？我不認識任何擁有自己軟件業務的第一手關係/朋友，所以我想在這裡問一下。<p>我是否應該用這筆錢來註冊一個企業，這樣我就可以在這個實體下發布應用程序？<p>我是否應該用這筆錢來僱用一個專業的設計師來建立登陸/產品頁面，這樣我就可以專注於建立應用程序/服務並與潛在用戶交談？不幸的是，我沒有任何軟件工程師朋友在我的地區，因為我是遠程工作。<p>請幫助我，我需要一些靈感和建議。謝謝你。"
}