{
  "@type": "NewsArticle",
  "identifier": "2022--03--26--en--askhn--HackerNews--NewsArticle--30809129",
  "url": "https://news.ycombinator.com/item?id=30809129",
  "headline": "Ask HN: How does one affordably eat without cooking or cleaning?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've found myself in this weird position in which I'm spending more than the median US income on just eating and was wondering if there's any way out.<p>As far as I can tell it's the most economically rational thing for me to do, as my income is well into the six-figures and so as I don't particularly enjoy grocery shopping, cooking or cleaning it's a better use of my time to work and pay as much as I currently am ($2700 /month) to meet my daily nutritional needs. And yet, the situation seems insane to me from a common sense perspective and I'm trying to figure out if I'm missing something really obvious or doing something terribly stupid.<p>The market for food delivery, both at the facilitator and provider level, is so fragmented I don't really see there being much room for prices to be lower. Restaurants struggle, workers aren't paid very well, and the apps don't even make money. So maybe it's just as simple as that, the cost of living a cooking and cleaning free life in a high cost of living area is more than the median national income. But I have to wonder, as surely I'm not the only one in this conundrum [1], is there another way?<p>Cafeterias? Partner up with someone that likes cooking? Some sort of community meal thing? I'm open to any ideas or experiences people have navigating early adult life in this domain.<p>[1] I understand that this isn't a <i>real</i> problem, in the sense that many people struggle to cover the basic costs of food and other necessities, and that this could very well come off as elitist and out-of-touch privilege. But I'd love to live in a world where those that don't like to cook and clean dishes don't have to be rich, and the only way [2] to make that a reality is to raise people's income or make it more affordable—the focus of this question being on the latter.<p>[2] The only capitalistic way. There may be creative solutions involving the reorganization of people outside of the economic system to solve this, but the only one I've heard about that happens at scale is to partner up with someone willing to take on that role.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "explorefriendly",
    "url": "https://news.ycombinator.com/user?id=explorefriendly"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30809129",
  "sameAs": "https://news.ycombinator.com/item?id=30809129",
  "dateCreated": "2022-03-26T04:12:07.743Z",
  "datePublished": "2022-03-26T04:00:03.000Z",
  "dateModified": "2022-03-26T04:12:07.743Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 不做饭、不打扫卫生，怎么吃得起？",
  "headline_zh-Hant": "Ask HN: 不做飯、不打掃衛生，怎麼吃得起？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我发现自己处于这样一个奇怪的境地，我在吃饭上的花费超过了美国收入的中位数，我想知道是否有什么出路。<p>就我所知，这是我在经济上最合理的做法，因为我的收入已经达到了六位数，所以我并不特别喜欢买菜、做饭或打扫卫生，为了满足我的日常营养需求，我工作并支付像现在这样多的费用（2700美元/月）是更好的利用时间。然而，从常识的角度来看，这种情况对我来说似乎是疯狂的，我试图弄清楚我是否错过了一些非常明显的东西，或者做了一些非常愚蠢的事情。<p>食品配送的市场，无论是在促进者还是提供者层面，都是非常分散的，我真的不认为有什么空间可以降低价格。餐馆在挣扎，工人工资不高，而应用程序甚至不赚钱。所以，也许就是这么简单，在高生活成本地区过着没有烹饪和清洁的生活，其成本超过了国民收入的中位数。But I have to wonder, as surely I'm not the only one in this conundrum [1], is there another way?<p>Cafeterias? Partner up with someone that likes cooking? Some sort of community meal thing? 我很乐意听取大家在这个领域的早年生活中的任何想法或经验。<p>[1] 我知道这不是一个<i>真实的</i>问题，在这个意义上，许多人都在努力支付食物和其他必需品的基本费用，而且这很可能被视为精英主义和不合群的特权。但我很希望生活在一个不喜欢做饭和洗碗的人不一定要有钱的世界里，而让这成为现实的唯一方法[2]是提高人们的收入或让人们更容易负担得起--本问题的重点是后者。<p>[2]唯一的资本主义方式。可能有一些创造性的解决方案，涉及到经济体系之外的人的重组来解决这个问题，但我所听说的唯一一个大规模发生的解决方案是与愿意承担这个角色的人合作。",
  "description_zh-Hant": "我發現自己處於這樣一個奇怪的境地，我在吃飯上的花費超過了美國收入的中位數，我想知道是否有什麼出路。<p>就我所知，這是我在經濟上最合理的做法，因為我的收入已經達到了六位數，所以我並不特別喜歡買菜、做飯或打掃衛生，為了滿足我的日常營養需求，我工作並支付像現在這樣多的費用（2700美元/月）是更好的利用時間。然而，從常識的角度來看，這種情況對我來說似乎是瘋狂的，我試圖弄清楚我是否錯過了一些非常明顯的東西，或者做了一些非常愚蠢的事情。<p>食品配送的市場，無論是在促進者還是提供者層面，都是非常分散的，我真的不認為有什麼空間可以降低價格。餐館在掙扎，工人工資不高，而應用程序甚至不賺錢。所以，也許就是這麼簡單，在高生活成本地區過著沒有烹飪和清潔的生活，其成本超過了國民收入的中位數。But I have to wonder, as surely I'm not the only one in this conundrum [1], is there another way?<p>Cafeterias? Partner up with someone that likes cooking? Some sort of community meal thing? 我很樂意聽取大家在這個領域的早年生活中的任何想法或經驗。<p>[1] 我知道這不是一個<i>真實的</i>問題，在這個意義上，許多人都在努力支付食物和其他必需品的基本費用，而且這很可能被視為精英主義和不合群的特權。但我很希望生活在一個不喜歡做飯和洗碗的人不一定要有錢的世界裡，而讓這成為現實的唯一方法[2]是提高人們的收入或讓人們更容易負擔得起--本問題的重點是後者。<p>[2]唯一的資本主義方式。可能有一些創造性的解決方案，涉及到經濟體系之外的人的重組來解決這個問題，但我所聽說的唯一一個大規模發生的解決方案是與願意承擔這個角色的人合作。"
}