{
  "@type": "NewsArticle",
  "identifier": "2022--02--23--en--askhn--HackerNews--NewsArticle--30445418",
  "url": "https://news.ycombinator.com/item?id=30445418",
  "headline": "Ask HN: I don't know text editing shortcuts. Should I learn Vim/Emacs/My IDE?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I live most of the time inside JetBrains IDEs. I occasionally edit random files, mainly in terminal using Vim. I also write a blog (with different tools, mainly Obsidian and Typora). In Firefox and Chrome, I use Vimium for years.<p>Recently, I've realized that I don't really master any editing shortcuts. I'm able to navigate char by char, word by word, end and beginning of the line, as well as selecting text. But nothing more complex.<p>For any complex file editing, I resort to mouse. I know that JetBrains have tons of shortcuts to help with text editing, Vim has its own as well as Emacs.<p>Few years ago, I've switched to 60% keyboard (so my arrow keys are on CapsLock+ijkl) and I feel like my typing speed did increase. I'm looking to make a similar improvement in regards to text editing and I'm wondering what should I invest it.<p>I know that Emacs shortcuts are pretty much universally supported. You can get them in MacOS and JetBrains, you get the in the terminal, and obviously in Emacs (which I used 2 maybe 3 times in my life).<p>Vim gets more love (from what I see) compared to Emacs, and you can get IdeaVim or even terminal navigation with Vim.<p>And I feel like mastering JetBrains shortcuts will help with text editing, but only in JetBrains tools.<p>I'm leaning towards trying to master Vim, but wondering if Emacs might be more useful, since I also write non code related text and use mainly MacOS (which as far as I know, honors most Emacs shortcuts). Mastering JetBrains shortcuts feel the least appealing to me, since I can't transfer that knowledge to other programs.<p>What are your opinions?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "skwee357",
    "url": "https://news.ycombinator.com/user?id=skwee357"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30445418",
  "sameAs": "https://news.ycombinator.com/item?id=30445418",
  "dateCreated": "2022-02-23T19:49:57.768Z",
  "datePublished": "2022-02-23T19:45:23.000Z",
  "dateModified": "2022-02-23T19:49:57.768Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我不知道文本编辑的快捷方式。我应该学习Vim/Emacs/My IDE吗？",
  "headline_zh-Hant": "Ask HN: 我不知道文本編輯的快捷方式。我應該學習Vim/Emacs/My IDE嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我大部分时间都生活在JetBrains的IDE中。我偶尔会编辑一些随机文件，主要是在终端使用Vim。我还写博客（使用不同的工具，主要是Obsidian和Typora）。在Firefox和Chrome浏览器中，我使用Vimium多年。<p>最近，我意识到我并没有真正掌握任何编辑快捷方式。我能够逐个字符、逐个单词、行末和行首进行导航，也能选择文本。<p>对于任何复杂的文件编辑，我都要借助鼠标。我知道JetBrains有大量的快捷键来帮助文本编辑，Vim和Emacs也有自己的快捷键。<p>几年前，我改用60%的键盘（所以我的方向键在CapsLock+ijkl上），我感觉我的打字速度确实提高了。我想在文本编辑方面做出类似的改进，我想知道我应该投资什么。<p>我知道Emacs的快捷键几乎被普遍支持。你可以在MacOS和JetBrains中得到它们，你可以在终端中得到它们，显然在Emacs中也是如此（在我的生活中，我只用过2-3次）。<p>与Emacs相比，Vim得到了更多的爱（从我所看到的），你可以用Vim得到IdeaVim甚至终端导航。 <p>我觉得掌握JetBrains的快捷键会对文本编辑有帮助，但只是在JetBrains工具中。<p>我倾向于尝试掌握Vim，但不知道Emacs是否更有用，因为我也写与代码无关的文本，而且主要使用MacOS（据我所知，它对大多数Emacs的快捷键表示敬意）。掌握JetBrains的快捷键对我来说是最没有吸引力的，因为我无法将这些知识转移到其他程序中。",
  "description_zh-Hant": "我大部分時間都生活在JetBrains的IDE中。我偶爾會編輯一些隨機文件，主要是在終端使用Vim。我還寫博客（使用不同的工具，主要是Obsidian和Typora）。在Firefox和Chrome瀏覽器中，我使用Vimium多年。<p>最近，我意識到我並沒有真正掌握任何編輯快捷方式。我能夠逐個字符、逐個單詞、行末和行首進行導航，也能選擇文本。<p>對於任何複雜的文件編輯，我都要藉助鼠標。我知道JetBrains有大量的快捷鍵來幫助文本編輯，Vim和Emacs也有自己的快捷鍵。<p>幾年前，我改用60%的鍵盤（所以我的方向鍵在CapsLock+ijkl上），我感覺我的打字速度確實提高了。我想在文本編輯方面做出類似的改進，我想知道我應該投資什麼。<p>我知道Emacs的快捷鍵幾乎被普遍支持。你可以在MacOS和JetBrains中得到它們，你可以在終端中得到它們，顯然在Emacs中也是如此（在我的生活中，我只用過2-3次）。<p>與Emacs相比，Vim得到了更多的愛（從我所看到的），你可以用Vim得到IdeaVim甚至終端導航。 <p>我覺得掌握JetBrains的快捷鍵會對文本編輯有幫助，但只是在JetBrains工具中。<p>我傾向於嘗試掌握Vim，但不知道Emacs是否更有用，因為我也寫與代碼無關的文本，而且主要使用MacOS（據我所知，它對大多數Emacs的快捷鍵表示敬意）。掌握JetBrains的快捷鍵對我來說是最沒有吸引力的，因為我無法將這些知識轉移到其他程序中。"
}