{
  "@type": "NewsArticle",
  "identifier": "2022--03--18--en--askhn--HackerNews--NewsArticle--30720565",
  "url": "https://news.ycombinator.com/item?id=30720565",
  "headline": "Ask HN: I'm changing my job after a 15-year tenure. How should I proceed?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN, I've been at my current company for the past 15 years. I've taken on different roles where I started as a software engineer, before being promoted to lead, and then to staff engineer. I know my current company by heart. I know how to get things done. I know who to talk to and how to talk to the right people. I know the processes of my company in and out.<p>I decided to get out of my comfort zone. Try something new, I told myself on and on for the past 3 years. And I finally did it. I'm changing jobs.<p>I'm going to a new company, where I'll be doing something slightly similar to my previous role, but in a totally new field. I don't know anyone there. Although, the people seem extremely friendly and fun to work with. This is what I felt in the hiring process.<p>It feels like I forgot how I got good at this. Technically, I have no doubts to get things done. However, on the people level, I have no clue how to get started. How do I make &quot;new friends&quot; at work?<p>What do you usually do when you switch to a new company? How do you go from the &quot;new clueless person at work&quot; to &quot;oh hey Mike, I'll need your help this afternoon&quot;?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lma21",
    "url": "https://news.ycombinator.com/user?id=lma21"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30720565",
  "sameAs": "https://news.ycombinator.com/item?id=30720565",
  "dateCreated": "2022-03-18T11:09:31.922Z",
  "datePublished": "2022-03-18T10:51:16.000Z",
  "dateModified": "2022-03-18T11:09:31.922Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我在任职15年后要换工作。我应该如何进行？",
  "headline_zh-Hant": "Ask HN: 我在任職15年後要換工作。我應該如何進行？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN，我在我现在的公司已经工作了15年。我担任过不同的角色，我开始是一名软件工程师，后来被提拔为领导，再后来是员工工程师。我对我现在的公司了如指掌。我知道如何把事情做好。我知道该和谁谈，以及如何和正确的人谈。我对我公司的流程了如指掌。<p>我决定走出我的舒适区。我决定走出我的舒适区，尝试一些新的东西，在过去的3年里，我不断地告诉自己。而我终于做到了。我要换工作了。<p>我将去一家新公司，在那里我将做一些与我以前的角色略微相似的事情，但在一个完全新的领域。我不认识那里的任何人。虽然，那里的人看起来非常友好，工作起来很有趣。这是我在招聘过程中的感受。<p>我感觉我忘记了我是如何在这个领域获得成功的。在技术上，我毫不怀疑能把事情做好。然而，在人的层面上，我却不知道如何开始。我如何在工作中结交&quot;新朋友&quot;？<p>当你转到一家新公司时，你通常会做什么？你如何从工作中的&quot;新的无知者&quot;变成&quot;哦，嘿，迈克，我今天下午需要你帮忙&quot;？",
  "description_zh-Hant": "你好，HN，我在我現在的公司已經工作了15年。我擔任過不同的角色，我開始是一名軟件工程師，後來被提拔為領導，再後來是員工工程師。我對我現在的公司瞭如指掌。我知道如何把事情做好。我知道該和誰談，以及如何和正確的人談。我對我公司的流程瞭如指掌。<p>我決定走出我的舒適區。我決定走出我的舒適區，嘗試一些新的東西，在過去的3年裡，我不斷地告訴自己。而我終於做到了。我要換工作了。<p>我將去一家新公司，在那裡我將做一些與我以前的角色略微相似的事情，但在一個完全新的領域。我不認識那裡的任何人。雖然，那裡的人看起來非常友好，工作起來很有趣。這是我在招聘過程中的感受。<p>我感覺我忘記了我是如何在這個領域獲得成功的。在技術上，我毫不懷疑能把事情做好。然而，在人的層面上，我卻不知道如何開始。我如何在工作中結交&quot;新朋友&quot;？<p>當你轉到一家新公司時，你通常會做什麼？你如何從工作中的&quot;新的無知者&quot;變成&quot;哦，嘿，邁克，我今天下午需要你幫忙&quot;？"
}