{
  "@type": "NewsArticle",
  "identifier": "2022--02--22--en--askhn--HackerNews--NewsArticle--30430553",
  "url": "https://news.ycombinator.com/item?id=30430553",
  "headline": "Ask HN: I just gave myself a panic attack. How do I stop this?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "UI Lead here - managing a few projects at any given time, mentoring junior developers, working with the backend team on endpoints, etc... most of you know the drill.<p>Pulled master branch, no build errors, Angular isn't complaining but I know the problem is in the UI side, probably with graphQL (angular apollo). I cannot get a single VSCode extension to work to help debug it so a junior is going through and commenting out code they changed to try to find it.<p>There is no way this project is done on time and the entire software department is looking at it. I'm 1 of 3 leads on it.<p>Quite literally just gave myself a panic attack thinking about it and the looming deadline.<p>This isn't the first time; I've been dealing with this for months now. It went away for a bit (2-3 months) and now it's back. I've been drinking all kinds of clamming teas, supplements, trying to change my diet, walk more, etc...<p>I just can't stop them :( 99% of the time it's chest pain or back pain or etc... every once in a while it escalates into a panic attack.<p>I keep trying to tell myself f' it - it doesn't matter. Fire me if you want to; we're doing the best we can. But it's not sinking in...<p>I.do.not.know.what.to.do.anymore. Vacation? FMLA? Career change? wtf would I do if not web development (been doing it 20+ years)<p>help.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lsiunsuex",
    "url": "https://news.ycombinator.com/user?id=lsiunsuex"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30430553",
  "sameAs": "https://news.ycombinator.com/item?id=30430553",
  "dateCreated": "2022-02-22T17:18:20.141Z",
  "datePublished": "2022-02-22T17:14:49.000Z",
  "dateModified": "2022-02-22T17:18:20.141Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我刚刚让自己的恐慌症发作。我怎样才能停止这一切呢？",
  "headline_zh-Hant": "Ask HN: 我剛剛讓自己的恐慌症發作。我怎樣才能停止這一切呢？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是UI负责人--在任何时候都要管理几个项目，指导初级开发人员，与后端团队合作开发端点，等等......你们大多数人都知道这些。<p>拉了主分支，没有构建错误，Angular没有抱怨，但我知道问题出在UI方面，可能是graphQL（angular apollo）。我无法获得一个VSCode扩展来帮助调试它，所以一个新手正在浏览并注释他们改变的代码，试图找到它。<p>这个项目不可能按时完成，整个软件部门都在关注它。我是这个项目的3个负责人之一。<p>想到这个项目和迫在眉睫的最后期限，我简直要惊慌失措了。<p>这不是第一次了，我已经处理这个问题好几个月了。它消失了一段时间（2-3个月），现在它又回来了。我一直在喝各种蛤蜊茶、补充剂，试图改变我的饮食习惯，多走路，等等......<p>我就是无法阻止它们：（99%的时间是胸痛或背痛或等等......每隔一段时间就会升级为恐慌症。<p>我一直试图告诉自己，f' it--这不重要。如果你想解雇我，我们正在尽力而为。但这并没有让我沉浸其中......<p>我不知道该怎么做了。休假？FMLA？如果不做网络开发，我还能做什么呢（已经做了20多年了）<p>帮助。",
  "description_zh-Hant": "我是UI負責人--在任何時候都要管理幾個項目，指導初級開發人員，與後端團隊合作開發端點，等等......你們大多數人都知道這些。<p>拉了主分支，沒有構建錯誤，Angular沒有抱怨，但我知道問題出在UI方面，可能是graphQL（angular apollo）。我無法獲得一個VSCode擴展來幫助調試它，所以一個新手正在瀏覽並註釋他們改變的代碼，試圖找到它。<p>這個項目不可能按時完成，整個軟件部門都在關注它。我是這個項目的3個負責人之一。<p>想到這個項目和迫在眉睫的最後期限，我簡直要驚慌失措了。<p>這不是第一次了，我已經處理這個問題好幾個月了。它消失了一段時間（2-3個月），現在它又回來了。我一直在喝各種蛤蜊茶、補充劑，試圖改變我的飲食習慣，多走路，等等......<p>我就是無法阻止它們：（99%的時間是胸痛或背痛或等等......每隔一段時間就會升級為恐慌症。<p>我一直試圖告訴自己，f' it--這不重要。如果你想解僱我，我們正在盡力而為。但這並沒有讓我沉浸其中......<p>我不知道該怎麼做了。休假？FMLA？如果不做網絡開發，我還能做什麼呢（已經做了20多年了）<p>幫助。"
}