{
  "@type": "NewsArticle",
  "identifier": "2022--03--24--en--askhn--HackerNews--NewsArticle--30796778",
  "url": "https://news.ycombinator.com/item?id=30796778",
  "headline": "Ask HN: Should people move away from cities?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "“Everywhere is over. It’s not happening anywhere. There’s no point in city-chasing.” - Eric Weinstein.<p>Since Covid, there's been a lot of talk about leaving cities and moving to smaller towns and the country-side. I also saw a growing interest in ideas like coliving, eco villages, and digital nomads.<p>It seems to me that a lot of people are either looking for a change, or for community - and aren't finding it in the cities. The internet seems to have subsumed all of culture and everyone's energy, so that you're either in the rat race, working for the interests of the internet, or escaping to the country-side to farm potatoes.<p>Of course, I understand many people are perfectly happy and have strong roots where they live, and many people who feel that living in the city is just... well, better. That's not what I'm talking about. There are many people who are unrooted. I don't care about the restaurants, the shops, or the concerts. Don't care about beautiful architecture or finding a group to play Dungeons &amp; Dragons with. Those things, for many people, sound good on paper but the reality is often very disappointing. For me, the city is a place to come to once a month to do one thing then leave - but I wouldn't know where to leave to.<p>What I'm not seeing anywhere is a grounded movement of people doing something cool. Not consuming, not escaping, but doing. I'm tired of talking to people who are &quot;just looking around&quot; or &quot;studying&quot;. My eyes instantly glaze over when someone starts telling me about their incomprehensible job, or the amazingly inconsequential places they've been to, or their favorite consumables.<p>Another quote that resonates with me, from a song called Seattle Party: &quot;Your tattoos are so deep, they really make me think /s&quot;, perfectly encapsulates my utter despair with living in the city.<p>What I'm talking about is in the quote from Eric Weinstein. Where are you supposed to go when you want something more (or less)? Where are the Willy Wonkas at? Where are the easy riders?<p>Are cities in general dead places? Is it just me?<p>inb4 Burning Man.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "prohobo",
    "url": "https://news.ycombinator.com/user?id=prohobo"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30796778",
  "sameAs": "https://news.ycombinator.com/item?id=30796778",
  "dateCreated": "2022-03-24T23:30:38.786Z",
  "datePublished": "2022-03-24T23:23:32.000Z",
  "dateModified": "2022-03-24T23:30:38.786Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 人们应该搬离城市吗？",
  "headline_zh-Hant": "Ask HN: 人們應該搬離城市嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "\"每个地方都结束了。任何地方都没有发生。追逐城市是没有意义的\"。- Eric Weinstein.<p>自Covid以来，有很多关于离开城市，搬到小城镇和乡村的讨论。在我看来，很多人都在寻找改变，或者寻找社区--但在城市里却找不到。互联网似乎已经吞噬了所有的文化和每个人的精力，所以你要么在老鼠赛跑中，为互联网的利益而工作，要么逃到乡下种土豆。<p>当然，我知道许多人非常高兴，在他们居住的地方有强大的根基，许多人觉得生活在城市只是......嗯，更好。这不是我在说的。有很多人是没有根的。我不关心餐馆、商店或音乐会。不关心美丽的建筑，也不关心找一个团体一起玩《龙与地下城》。这些东西，对许多人来说，在纸面上听起来很好，但现实往往是非常令人失望的。对我来说，这个城市是一个每月来做一件事然后离开的地方--但我不知道该去哪里。<p>我在任何地方都没有看到一个接地气的运动，人们在做一些很酷的事情。不是消费，不是逃避，而是行动。我已经厌倦了和那些只顾着到处看的人谈话，或者是学习。当有人开始告诉我他们令人费解的工作，或他们去过的令人惊讶的无足轻重的地方，或他们最喜欢的消费品时，我的眼睛立刻瞪得大大的。<p>另一句与我产生共鸣的话，来自一首名为《西雅图派对》的歌曲：&quot;你的纹身如此深刻，它们真的让我思考/s&quot;，完美概括了我对生活在这座城市的彻底绝望。当你想要更多（或更少）的东西时，你应该去哪里？威利-旺卡们在哪里？哪里有轻松的人？<p>一般来说，城市是死寂的地方吗？只有我是这样吗？<p></p><p>\"火人\"。",
  "description_zh-Hant": "\"每個地方都結束了。任何地方都沒有發生。追逐城市是沒有意義的\"。- Eric Weinstein.<p>自Covid以來，有很多關於離開城市，搬到小城鎮和鄉村的討論。在我看來，很多人都在尋找改變，或者尋找社區--但在城市裡卻找不到。互聯網似乎已經吞噬了所有的文化和每個人的精力，所以你要麼在老鼠賽跑中，為互聯網的利益而工作，要麼逃到鄉下種土豆。<p>當然，我知道許多人非常高興，在他們居住的地方有強大的根基，許多人覺得生活在城市只是......嗯，更好。這不是我在說的。有很多人是沒有根的。我不關心餐館、商店或音樂會。不關心美麗的建築，也不關心找一個團體一起玩《龍與地下城》。這些東西，對許多人來說，在紙面上聽起來很好，但現實往往是非常令人失望的。對我來說，這個城市是一個每月來做一件事然後離開的地方--但我不知道該去哪裡。<p>我在任何地方都沒有看到一個接地氣的運動，人們在做一些很酷的事情。不是消費，不是逃避，而是行動。我已經厭倦了和那些只顧著到處看的人談話，或者是學習。當有人開始告訴我他們令人費解的工作，或他們去過的令人驚訝的無足輕重的地方，或他們最喜歡的消費品時，我的眼睛立刻瞪得大大的。<p>另一句與我產生共鳴的話，來自一首名為《西雅圖派對》的歌曲：&quot;你的紋身如此深刻，它們真的讓我思考/s&quot;，完美概括了我對生活在這座城市的徹底絕望。當你想要更多（或更少）的東西時，你應該去哪裡？威利-旺卡們在哪裡？哪裡有輕鬆的人？<p>一般來說，城市是死寂的地方嗎？只有我是這樣嗎？<p></p><p>\"火人\"。"
}