{
  "@type": "NewsArticle",
  "identifier": "2022--03--15--en--askhn--HackerNews--NewsArticle--30681574",
  "url": "https://news.ycombinator.com/item?id=30681574",
  "headline": "Ask HN: Why do most Americans only care about Ukraine, and not even America?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So most Americans seem to be doing that whole “pro Ukraine” thing. And good for them I guess. I’m taking a neutral stance on this one though and I see many problems with Ukraine and Russia both, but that’s not the point of this post. Why are Americans throwing tantrums over a couple incidents of collateral damage in the war, but not our own people dying? 66k fentanyl overdoses will happen this year. It’s all coming from the border. 46k suicides. And the rest obesity. How come these people never speak up to things that actually matter? Is it media brainwashing? Something else? They called trump so many names when he wanted to protect our border and people. It’s so disgusting to see the hypocrisy. I like games, so I don’t really care that they’re making this all a messed up game of who cares about what, but it just makes no sense. Who’s winning at this point? Because it’s not Americans. I’m very curious as to what y’all think here. The whole “pro democracy” thing comes off as really gross and corrupt. The “pro-democracy” people do and support the nastiest things just for political reasons. I hate liars. And I don’t mean innocent lies, I mean gross purely political lies, because not at lies (or omissions) are really bad things. Is it low self confidence on America’s end though? Why is everyone so deluded.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "nikolqy",
    "url": "https://news.ycombinator.com/user?id=nikolqy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30681574",
  "sameAs": "https://news.ycombinator.com/item?id=30681574",
  "dateCreated": "2022-03-15T04:12:39.959Z",
  "datePublished": "2022-03-15T04:08:45.000Z",
  "dateModified": "2022-03-15T04:12:39.959Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么大多数美国人只关心乌克兰，甚至不关心美国？",
  "headline_zh-Hant": "Ask HN: 為什麼大多數美國人只關心烏克蘭，甚至不關心美國？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "所以大多数美国人似乎都在做 \"支持乌克兰 \"的事情。我想这对他们来说是好事。我在这个问题上采取中立立场，我看到乌克兰和俄罗斯都有很多问题，但这不是本帖的重点。为什么美国人对战争中的几起附带损害事件大发脾气，而不是对我们自己的人民的死亡大发脾气？今年将发生6.6万起芬太尼过量的事件。这都是来自边境的。4.6万起自杀事件。其余的是肥胖症。为什么这些人从不对真正重要的事情发表意见？是媒体在洗脑吗？还是别的什么原因？当特朗普想保护我们的边境和人民时，他们骂了他那么多名字。看到这种虚伪，真让人恶心。我喜欢游戏，所以我并不关心他们把这一切变成一个混乱的游戏，谁在乎什么，但它只是没有意义。在这一点上，谁在赢？因为不是美国人。我非常好奇你们在这里的想法。整个 \"支持民主 \"的事情让人觉得非常恶心和堕落。那些 \"支持民主 \"的人只是为了政治原因而做和支持最肮脏的事情。我讨厌说谎者。我指的不是无辜的谎言，我指的是粗暴的纯粹的政治谎言，因为不在谎言（或遗漏）是真正的坏事。不过，是美国方面的自信心不足吗？为什么每个人都这么痴心妄想。",
  "description_zh-Hant": "所以大多數美國人似乎都在做 \"支持烏克蘭 \"的事情。我想這對他們來說是好事。我在這個問題上採取中立立場，我看到烏克蘭和俄羅斯都有很多問題，但這不是本帖的重點。為什麼美國人對戰爭中的幾起附帶損害事件大發脾氣，而不是對我們自己的人民的死亡大發脾氣？今年將發生6.6萬起芬太尼過量的事件。這都是來自邊境的。4.6萬起自殺事件。其餘的是肥胖症。為什麼這些人從不對真正重要的事情發表意見？是媒體在洗腦嗎？還是別的什麼原因？當特朗普想保護我們的邊境和人民時，他們罵了他那麼多名字。看到這種虛偽，真讓人噁心。我喜歡遊戲，所以我並不關心他們把這一切變成一個混亂的遊戲，誰在乎什麼，但它只是沒有意義。在這一點上，誰在贏？因為不是美國人。我非常好奇你們在這裡的想法。整個 \"支持民主 \"的事情讓人覺得非常噁心和墮落。那些 \"支持民主 \"的人只是為了政治原因而做和支持最骯髒的事情。我討厭說謊者。我指的不是無辜的謊言，我指的是粗暴的純粹的政治謊言，因為不在謊言（或遺漏）是真正的壞事。不過，是美國方面的自信心不足嗎？為什麼每個人都這麼痴心妄想。"
}