{
  "@type": "NewsArticle",
  "identifier": "2022--04--08--en--askhn--HackerNews--NewsArticle--30957460",
  "url": "https://news.ycombinator.com/item?id=30957460",
  "headline": "Ask HN: Doubious Remote Work Policy?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm in the last stage of an interview and they have handed me over an offer later where it states that I can work remotely but on certain occasions I will have to travel to the office. These occasions are: important company-wide announcements, team events, roadmap events. They cannot predict how often these events will happen, but they say it could be roughly once per quarter.<p>I have asked them many times about their remote work policy and they honestly say that they are not 100% sure how it will turn out in the future. Right now they are 100% remote, but they cannot assure me it will stay as such in the future. It may be that for people who live in a city where they have offices, then an hybrid model may be applied (I don't live in a city where they have an office).<p>I understand that they cannot guarantee me anything regarding the future if they actually don't know (many companies are still figuring this whole WFH situation out).<p>My gut feelings tell me: don't accept if 100% remote is not guaranteed... but somehow I think I'm being too pessimistic (the people I have interviewed with are normal and nice, no red flags. Also the project looks interesting). Any opinions?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "sdevonoes",
    "url": "https://news.ycombinator.com/user?id=sdevonoes"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30957460",
  "sameAs": "https://news.ycombinator.com/item?id=30957460",
  "dateCreated": "2022-04-08T14:54:42.319Z",
  "datePublished": "2022-04-08T14:41:51.000Z",
  "dateModified": "2022-04-08T14:54:42.319Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 怀疑远程工作政策？",
  "headline_zh-Hant": "Ask HN: 懷疑遠程工作政策？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我正处于面试的最后阶段，他们后来给我发了一份offer，上面写着我可以远程工作，但在某些场合我必须到办公室去。这些场合是：全公司的重要公告、团队活动、路线图活动。他们无法预测这些事件发生的频率，但他们说可能大约每季度一次。<p>我曾多次询问他们的远程工作政策，他们诚实地说，他们并不100%确定未来会如何发展。现在他们是100%的远程工作，但他们不能向我保证将来会保持这样的状态。<p>我明白，如果他们真的不知道，就不能向我保证任何有关未来的事情（许多公司仍在摸索整个WFH的情况）。<p>我的直觉告诉我：如果不能保证100%的远程工作，就不要接受......但不知为什么，我觉得我太悲观了（我面试的人都很正常，很好，没有红旗。而且这个项目看起来很有趣）。有什么意见吗？",
  "description_zh-Hant": "我正處於面試的最後階段，他們後來給我發了一份offer，上面寫著我可以遠程工作，但在某些場合我必須到辦公室去。這些場合是：全公司的重要公告、團隊活動、路線圖活動。他們無法預測這些事件發生的頻率，但他們說可能大約每季度一次。<p>我曾多次詢問他們的遠程工作政策，他們誠實地說，他們並不100%確定未來會如何發展。現在他們是100%的遠程工作，但他們不能向我保證將來會保持這樣的狀態。<p>我明白，如果他們真的不知道，就不能向我保證任何有關未來的事情（許多公司仍在摸索整個WFH的情況）。<p>我的直覺告訴我：如果不能保證100%的遠程工作，就不要接受......但不知為什麼，我覺得我太悲觀了（我面試的人都很正常，很好，沒有紅旗。而且這個項目看起來很有趣）。有什麼意見嗎？"
}