{
  "@type": "NewsArticle",
  "identifier": "2022--03--04--en--askhn--HackerNews--NewsArticle--30550901",
  "url": "https://news.ycombinator.com/item?id=30550901",
  "headline": "Ask HN: What have you gotten wrong?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Seeing Cunningham's Law on the front page, I'm curious: What are some of your past views that you now disagree with?<p>These could be personal, technological, or otherwise. I'll start:<p>When news of COVID-19 first broke from China in early 2020, I recall downplaying the severity of the virus to a friend. I wiseacrely remarked that the media erroneously referred to it as the COVID-19 virus, not SARS-CoV-2. Even after he shared his Chinese family members' experiences with the illness, I wasn't convinced.<p>It wasn't until it came to America that I paid closer attention. Reading the reports of the toll it took on our healthcare system, I took it more seriously as quickly as the virus was spreading. Regardless of the debate over death attribution and symptomatic severity, I never anticipated the pandemic to be in the top 10 deadliest epidemics by death count.<p>I think exceptionalism and ignorance played important roles in my initial take: &quot;It's just like ebola, SARS, or H1N1. If it comes to the US, our superior infrastructure will render the virus a mere nuisance!&quot;<p>P.S. Here's an incorrect technological prediction from a friend who had studied aerospace and ocean engineering: &quot;SpaceX could never land a rocket on a moving ocean platform!&quot;",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kvathupo",
    "url": "https://news.ycombinator.com/user?id=kvathupo"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30550901",
  "sameAs": "https://news.ycombinator.com/item?id=30550901",
  "dateCreated": "2022-03-04T05:10:29.372Z",
  "datePublished": "2022-03-04T05:03:57.000Z",
  "dateModified": "2022-03-04T05:10:29.372Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你错了什么？",
  "headline_zh-Hant": "Ask HN: 你錯了什麼？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "看到头版的坎宁安定律，我很好奇：你过去有哪些观点是你现在不同意的？<p>这些观点可能是个人的，也可能是技术的，或者是其他的。我先说：<p>2020年初，当COVID-19的消息首次从中国传出时，我记得我对一个朋友淡化了病毒的严重性。我明智地表示，媒体错误地将其称为COVID-19病毒，而不是SARS-CoV-2。即使在他分享了他的中国家庭成员的患病经历后，我也没有被说服。<p>直到它来到美国，我才仔细注意到。在阅读了关于它对我们的医疗系统造成的损失的报告后，我更加重视它，因为病毒正在迅速蔓延。不管关于死亡归属和症状严重程度的争论如何，我从未预料到这种大流行病会进入按死亡人数计算的十大最致命流行病之列。<p>我认为例外主义和无知在我最初的看法中起了重要作用：&quot;这就像埃博拉、SARS或H1N1。如果它来到美国，我们优越的基础设施将使病毒成为一个纯粹的麻烦！&quot;<p>P.S. 这里有一个错误的技术预测，来自一个研究航空航天和海洋工程的朋友：&quot;SpaceX不可能让火箭降落在一个移动的海洋平台上！&quot;",
  "description_zh-Hant": "看到頭版的坎寧安定律，我很好奇：你過去有哪些觀點是你現在不同意的？<p>這些觀點可能是個人的，也可能是技術的，或者是其他的。我先說：<p>2020年初，當COVID-19的消息首次從中國傳出時，我記得我對一個朋友淡化了病毒的嚴重性。我明智地表示，媒體錯誤地將其稱為COVID-19病毒，而不是SARS-CoV-2。即使在他分享了他的中國家庭成員的患病經歷後，我也沒有被說服。<p>直到它來到美國，我才仔細注意到。在閱讀了關於它對我們的醫療系統造成的損失的報告後，我更加重視它，因為病毒正在迅速蔓延。不管關於死亡歸屬和症狀嚴重程度的爭論如何，我從未預料到這種大流行病會進入按死亡人數計算的十大最致命流行病之列。<p>我認為例外主義和無知在我最初的看法中起了重要作用：&quot;這就像埃博拉、SARS或H1N1。如果它來到美國，我們優越的基礎設施將使病毒成為一個純粹的麻煩！&quot;<p>P.S. 這裡有一個錯誤的技術預測，來自一個研究航空航天和海洋工程的朋友：&quot;SpaceX不可能讓火箭降落在一個移動的海洋平臺上！&quot;"
}