{
  "@type": "NewsArticle",
  "identifier": "2022--03--16--en--askhn--HackerNews--NewsArticle--30698813",
  "url": "https://news.ycombinator.com/item?id=30698813",
  "headline": "Ask HN: Rekindling Intrinsic Motivation",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I work at one of a small group of companies that develops a somewhat niche technology that I fell in love with many years ago. For several years, I had a driving intrinsic motivation and truly enjoyed my work. At some point I was “discovered” by a successful manager, who elevated me to a more visible position, and in the intervening years, I also had a lot of success and monetary rewards. But I’ve come to realize that my intrinsic motivation has flipped almost entirely to extrinsic, and I am now acting conservatively in my career and have become too cynical about my work and contributions. I still appreciate the tech itself, but I can’t see it the way I used to. In my early 40’s, I recognize that I’m acting responsibly for myself and my family when I consider my financial benefits and stability. But I deeply miss the intrinsic motivation that went away with a perspective shift. Have any of you been through something similar and shifted your perspective back to what you found to be a more healthy and exciting motivation? I am not just asking about finding something new and interesting here, but rather about countering a more cautious and deadening habit of mind.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "aBitPlayer",
    "url": "https://news.ycombinator.com/user?id=aBitPlayer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30698813",
  "sameAs": "https://news.ycombinator.com/item?id=30698813",
  "dateCreated": "2022-03-16T14:10:00.698Z",
  "datePublished": "2022-03-16T13:52:02.000Z",
  "dateModified": "2022-03-16T14:10:00.698Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 重新激发内在动力",
  "headline_zh-Hant": "Ask HN: 重新激發內在動力",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在一小群公司中的一家工作，该公司开发一种有点小众的技术，我多年前就爱上了这种技术。几年来，我有一种内在的驱动力，并真正享受我的工作。在某个时候，我被一位成功的经理 \"发现\"，他把我提升到一个更明显的位置，在这几年中，我也有很多成功和金钱上的回报。但我逐渐意识到，我的内在动机几乎完全翻转为外在动机，我现在在事业上表现得很保守，对自己的工作和贡献变得过于愤世嫉俗。我仍然欣赏技术本身，但我不能像以前那样看待它。在我40岁出头的时候，我认识到，当我考虑到我的经济利益和稳定性时，我的行为是对自己和家庭负责任的。但我深深地怀念那种随着视角转变而消失的内在动力。你们中是否有人经历过类似的事情，并将视角转回到你们认为更健康、更激动人心的动机上？我问的不仅仅是在这里找到新的、有趣的东西，而是要对抗一种更谨慎、更死板的思维习惯。",
  "description_zh-Hant": "我在一小群公司中的一家工作，該公司開發一種有點小眾的技術，我多年前就愛上了這種技術。幾年來，我有一種內在的驅動力，並真正享受我的工作。在某個時候，我被一位成功的經理 \"發現\"，他把我提升到一個更明顯的位置，在這幾年中，我也有很多成功和金錢上的回報。但我逐漸意識到，我的內在動機幾乎完全翻轉為外在動機，我現在在事業上表現得很保守，對自己的工作和貢獻變得過於憤世嫉俗。我仍然欣賞技術本身，但我不能像以前那樣看待它。在我40歲出頭的時候，我認識到，當我考慮到我的經濟利益和穩定性時，我的行為是對自己和家庭負責任的。但我深深地懷念那種隨著視角轉變而消失的內在動力。你們中是否有人經歷過類似的事情，並將視角轉回到你們認為更健康、更激動人心的動機上？我問的不僅僅是在這裡找到新的、有趣的東西，而是要對抗一種更謹慎、更死板的思維習慣。"
}