{
  "@type": "NewsArticle",
  "identifier": "2022--03--24--en--askhn--HackerNews--NewsArticle--30795244",
  "url": "https://news.ycombinator.com/item?id=30795244",
  "headline": "Ask HN: Selling hardware company assets/IP",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I need some advice HN. I've been working on my hardware company for about 7 years (https://geminicomplex.com). I developed a benchtop tester that can do functional verification of chips/electronics. I designed all the hardware (main board, test board) and software (lib, driver, compiler, RTL cores, on-board website, simulation) myself, most of which I have recently open-sourced (https://github.com/geminicomplex). I've had a few potential deals fall through and now I'm thinking real hard what to do next.<p>I've tried to raise money from YC (interviewed twice). I didn't get in because I didn't have a cofounder and they wanted me to talk to potential customers, which I've now done. I know that what I need to do is raise like $10m and hire people that can do sales, part procurement, manufacturing and more. I'm just finding it difficult to get myself to do that. I also have a hunch that most angels/VCs wouldn't invest in something like this because it doesn't have the potential for quickly becoming a unicorn. I am understandably burned out. So I'm wondering what my options are in regards to selling/liquidating the company including all its valuable IP and assets?<p>P.S. this board is way more than just a tester. You can write vector programs that execute with perfect cycle accuracy and nanosecond latency. You can also write test programs using the power of Lisp to coordinate the running of vector programs. Both of these things would work quite well for robotics if some parallelism and IPC was introduced at the hardware level.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "monological",
    "url": "https://news.ycombinator.com/user?id=monological"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30795244",
  "sameAs": "https://news.ycombinator.com/item?id=30795244",
  "dateCreated": "2022-03-24T21:28:48.713Z",
  "datePublished": "2022-03-24T20:58:09.000Z",
  "dateModified": "2022-03-24T21:28:48.713Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 出售硬件公司资产/IP",
  "headline_zh-Hant": "Ask HN: 出售硬件公司資產/IP",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我需要一些建议，HN。我在我的硬件公司工作了大约7年（https://geminicomplex.com）。我开发了一个台式测试仪，可以对芯片/电子元件进行功能验证。我自己设计了所有的硬件（主板、测试板）和软件（lib、驱动、编译器、RTL核、板载网站、仿真），其中大部分我最近已经开源了（https://github.com/geminicomplex）。我有几笔潜在的交易失败了，现在我在认真思考下一步该怎么做。<p>我曾试图从YC筹集资金（面试过两次）。我没有被录取，因为我没有一个联合创始人，他们希望我与潜在客户交谈，我现在已经做到了。我知道我需要做的是筹集大约1000万美元的资金，并雇用能做销售、零件采购、制造和更多的人。我只是发现很难让自己去做这件事。我也有预感，大多数天使/风险投资人不会投资这样的东西，因为它不具备迅速成为独角兽的潜力。我可以理解，我已经精疲力竭了。所以我想知道我在出售/清算公司包括其所有有价值的知识产权和资产方面有什么选择？你可以编写矢量程序，以完美的周期精度和纳秒级的延迟执行。你还可以利用Lisp的力量编写测试程序，协调矢量程序的运行。如果在硬件层面上引入一些并行性和IPC，这两件事对机器人技术来说都会有很好的效果。",
  "description_zh-Hant": "我需要一些建議，HN。我在我的硬件公司工作了大約7年（https://geminicomplex.com）。我開發了一個臺式測試儀，可以對芯片/電子元件進行功能驗證。我自己設計了所有的硬件（主板、測試板）和軟件（lib、驅動、編譯器、RTL核、板載網站、仿真），其中大部分我最近已經開源了（https://github.com/geminicomplex）。我有幾筆潛在的交易失敗了，現在我在認真思考下一步該怎麼做。<p>我曾試圖從YC籌集資金（面試過兩次）。我沒有被錄取，因為我沒有一個聯合創始人，他們希望我與潛在客戶交談，我現在已經做到了。我知道我需要做的是籌集大約1000萬美元的資金，並僱用能做銷售、零件採購、製造和更多的人。我只是發現很難讓自己去做這件事。我也有預感，大多數天使/風險投資人不會投資這樣的東西，因為它不具備迅速成為獨角獸的潛力。我可以理解，我已經精疲力竭了。所以我想知道我在出售/清算公司包括其所有有價值的知識產權和資產方面有什麼選擇？你可以編寫矢量程序，以完美的週期精度和納秒級的延遲執行。你還可以利用Lisp的力量編寫測試程序，協調矢量程序的運行。如果在硬件層面上引入一些並行性和IPC，這兩件事對機器人技術來說都會有很好的效果。"
}