{
  "@type": "NewsArticle",
  "identifier": "2022--03--21--en--askhn--HackerNews--NewsArticle--30749590",
  "url": "https://news.ycombinator.com/item?id=30749590",
  "headline": "Ask HN: Does browsing old online forums make you feel bad about the Web today?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "When looking for Autohotkey scripts or solutions to ancient Windows problems, I find myself on old forums with people that may or may not be alive now. What I find interesting is the enthusiasm that they showed to answer questions and contribute to forums often for free. I myself was on a couple of these forums long ago, and I remember the excitement of hitting refresh every now and then and getting a reply to what I had posted. There was no such notifications on your phone, most people did not have fancy profiles and images, and a profile on site X was not connected to the same person's profile on site Y. There was no login with Google/FB/Apple/etc., and the forums did not have neither minimalist designs nor modern web JS bs.<p>Some of those forums still exist today, and I often wonder &quot;who's still on them?!&quot; In the age of fast information, sadly, the social construct of forums is no more, at least for average people who only know the Web through FB pages, tiktok videos, Discord, etc.<p>It makes me both nostalgic and sad to compare the current state of the Web with the gem we had not too long ago. Maybe I'm not alone. In that case, what are your thoughts on this?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "behnamoh",
    "url": "https://news.ycombinator.com/user?id=behnamoh"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30749590",
  "sameAs": "https://news.ycombinator.com/item?id=30749590",
  "dateCreated": "2022-03-21T03:02:39.253Z",
  "datePublished": "2022-03-21T02:51:15.000Z",
  "dateModified": "2022-03-21T03:02:39.253Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 浏览旧的网上论坛是否让你对今天的网络感到不爽？",
  "headline_zh-Hant": "Ask HN: 瀏覽舊的網上論壇是否讓你對今天的網絡感到不爽？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "当我在寻找Autohotkey脚本或解决古老的Windows问题时，我发现自己在老的论坛上，这些人现在可能还活着，也可能不在了。我觉得有趣的是，他们在回答问题和为论坛做贡献方面所表现出来的热情，往往是免费的。我自己很久以前也上过几个这样的论坛，我还记得每隔一段时间点击刷新就能得到我所发帖子的回复的激动心情。当时你的手机上没有这样的通知，大多数人没有漂亮的个人资料和图片，X网站上的个人资料与Y网站上同一个人的个人资料没有联系。<p>这些论坛中的一些今天仍然存在，而我经常想&quot;谁还在上面？&quot;在快速信息时代，可悲的是，论坛的社会结构已经不复存在，至少对于那些只通过FB页面、Tiktok视频、Discord等了解网络的普通人来说是这样。也许我并不孤单。在这种情况下，你对此有什么看法？",
  "description_zh-Hant": "當我在尋找Autohotkey腳本或解決古老的Windows問題時，我發現自己在老的論壇上，這些人現在可能還活著，也可能不在了。我覺得有趣的是，他們在回答問題和為論壇做貢獻方面所表現出來的熱情，往往是免費的。我自己很久以前也上過幾個這樣的論壇，我還記得每隔一段時間點擊刷新就能得到我所發帖子的回覆的激動心情。當時你的手機上沒有這樣的通知，大多數人沒有漂亮的個人資料和圖片，X網站上的個人資料與Y網站上同一個人的個人資料沒有聯繫。<p>這些論壇中的一些今天仍然存在，而我經常想&quot;誰還在上面？&quot;在快速信息時代，可悲的是，論壇的社會結構已經不復存在，至少對於那些只通過FB頁面、Tiktok視頻、Discord等了解網絡的普通人來說是這樣。也許我並不孤單。在這種情況下，你對此有什麼看法？"
}