{
  "@type": "NewsArticle",
  "identifier": "2022--04--08--en--askhn--HackerNews--NewsArticle--30959782",
  "url": "https://news.ycombinator.com/item?id=30959782",
  "headline": "Ask HN: What to do when struggling as junior swe?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello all,<p>I got my first swe job this past August and it honestly has not gone well.  I've enjoyed it, but it is clear that I am not seen as reliable and definitely not known for completing things fast and correctly.<p>I know this sounds like a normal junior dev, but I mean more than a normal beginner.  Example:  I have now been on this team for 8 months, and I made 2 costly mistake back-to-back that is pushing back the release of a production feature by a while month at this point.<p>Long story short, screwed up a step I had done before in the fall without realizing, then immediately after an unrelated issue came up and I spent a week and half trying to fix it instead of telling team members.  Then when it was fixed I submitted a ticket for a prod systems account rather than a QA one not realizing there would be a difference. (Just so many mistakes all in a row).<p>The struggles came way before this though.  Almost every new story I am assigned, I have no idea where to begin.  I end up asking tons of questions and running blindly in circles.  I was sometimes assigned stories no one else on the team had done anything remotely like before, so at times I couldn't even ask the senior devs for help.<p>This gets down to the issue.  I don't think my team is necessarily the most ideal to learn on (my manager has been gone since December and when he was around was busy managing 2 other teams so we didn't talk much).  The senior engineers also seem to assume I have basic knowledge of things (like the credentials above, it seems obvious there would be an account for QA and one for Prod, but I didn't know to assume that). But, the thing is though, this team isn't a bad one. I can make excuses all I want, but a barely more experienced engineer joined the same time I did and he knew more by week 3 than I know now.<p>I have identified some issues. I certainly didn't ask enough questions when I started and I definitely will wait around for people to get back to me sometimes rather then be proactive.  I also tend to spend hours tackling an issue or trying to fix something I think I messed up rather than raise it to the team that I am having an issue. The problem is at this point I have been on the team too long to ask any basic questions, one of the senior engineers even pointed out they shouldn't be helping me with certain processes at this point.<p>I've been trying to identify other problems and possibly my memory is terrible?  I sometimes can't remember the things we went over or every step of things we did in the fall.<p>Honestly, I am also super deflated.  I know imposter syndrome is a thing, but that doesn't count when I am actively slowing the team down and causing problems.  Imposter syndrome is worrying everyone will find out you are a fake even though you are doing your work well enough.  I am not doing it well and I am not worried about people finding out because people already know I am bad. The amount of time I delayed our release (3 weeks) probably equals the amount of time it would take the senior engineers to do all the work I have done in these 8 months.  I did well in school in my CS classes and worked hard, and so its a huge kick in the gut to just feel like my team actively is disappointed in me and that if any issue came up, I am probably the last engineer anyone would want to help (and probably the first they would assume caused it).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "3a2d29",
    "url": "https://news.ycombinator.com/user?id=3a2d29"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30959782",
  "sameAs": "https://news.ycombinator.com/item?id=30959782",
  "dateCreated": "2022-04-08T17:35:32.327Z",
  "datePublished": "2022-04-08T17:09:40.000Z",
  "dateModified": "2022-04-08T17:35:32.327Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 当作为初级汗水的挣扎时，该怎么做？",
  "headline_zh-Hant": "Ask HN: 當作為初級汗水的掙扎時，該怎麼做？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>今年8月我得到了我的第一份汗水工作，说实话，它并不顺利。 我很喜欢这份工作，但很明显，我不被认为是可靠的，而且绝对不是以快速和正确地完成事情而闻名。<p>我知道这听起来像一个普通的初级开发人员，但我的意思是比普通的初学者更多。 例如。 <p>长话短说，我在秋天时搞砸了一个我曾经做过的步骤而没有意识到，然后紧接着就出现了一个不相关的问题，我花了一个半星期的时间试图修复它而没有告诉团队成员。 然后，当它被修复时，我提交了一个prod系统账户而不是QA账户的票据，没有意识到会有区别。(只是连续犯了这么多错误)。<p>在这之前，我就已经有了挣扎。 几乎每一个分配给我的新故事，我都不知道从哪里开始。 最后我问了一大堆问题，盲目地绕着圈子跑。 有时，我被分配到团队中没有人做过类似的故事，所以有时我甚至无法向高级开发人员寻求帮助。 我不认为我的团队是最理想的学习环境（我的经理从12月起就不在了，当他在的时候，他忙着管理其他两个团队，所以我们没怎么说话）。 高级工程师们似乎也认为我有基本的知识（就像上面的证书一样，似乎很明显会有一个QA的账户和一个Prod的账户，但我不知道要假设这个）。但是，问题是，虽然这个团队并不坏。我可以随便找借口，但是一个几乎没有经验的工程师和我同时加入，他在第三周知道的东西比我现在还多。我开始的时候肯定没有问够问题，而且我有时肯定会等着别人给我答复，而不是主动出击。 我也倾向于花几个小时来解决一个问题，或试图修复我认为自己搞砸了的东西，而不是向团队提出我有一个问题。问题是在这一点上，我已经在团队中呆了太长时间，无法提出任何基本问题，其中一位高级工程师甚至指出，在这一点上，他们不应该帮助我处理某些流程。<p>我一直试图找出其他问题，可能我的记忆力很差？ 我有时记不住我们在秋天所做的事情或每一步。<p>说实话，我也是超级泄气的。 我知道冒名顶替综合症是一种东西，但当我主动拖累团队并造成问题时，这不算数。 冒名顶替综合症是担心每个人都会发现你是个骗子，即使你的工作做得足够好。 我做得不好，但我不担心人们会发现，因为人们已经知道我很差。我推迟我们发布的时间（3周）可能相当于高级工程师在这8个月里做完我所有工作所需的时间。 我在学校的CS课程中表现得很好，工作也很努力，所以感觉我的团队对我很失望，如果出现任何问题，我可能是最不愿意帮助的工程师（而且可能是第一个他们认为造成这种情况的人），这对我的内心是一个巨大的打击。",
  "description_zh-Hant": "大家好，<p>今年8月我得到了我的第一份汗水工作，說實話，它並不順利。 我很喜歡這份工作，但很明顯，我不被認為是可靠的，而且絕對不是以快速和正確地完成事情而聞名。<p>我知道這聽起來像一個普通的初級開發人員，但我的意思是比普通的初學者更多。 例如。 <p>長話短說，我在秋天時搞砸了一個我曾經做過的步驟而沒有意識到，然後緊接著就出現了一個不相關的問題，我花了一個半星期的時間試圖修復它而沒有告訴團隊成員。 然後，當它被修復時，我提交了一個prod系統賬戶而不是QA賬戶的票據，沒有意識到會有區別。(只是連續犯了這麼多錯誤)。<p>在這之前，我就已經有了掙扎。 幾乎每一個分配給我的新故事，我都不知道從哪裡開始。 最後我問了一大堆問題，盲目地繞著圈子跑。 有時，我被分配到團隊中沒有人做過類似的故事，所以有時我甚至無法向高級開發人員尋求幫助。 我不認為我的團隊是最理想的學習環境（我的經理從12月起就不在了，當他在的時候，他忙著管理其他兩個團隊，所以我們沒怎麼說話）。 高級工程師們似乎也認為我有基本的知識（就像上面的證書一樣，似乎很明顯會有一個QA的賬戶和一個Prod的賬戶，但我不知道要假設這個）。但是，問題是，雖然這個團隊並不壞。我可以隨便找藉口，但是一個幾乎沒有經驗的工程師和我同時加入，他在第三週知道的東西比我現在還多。我開始的時候肯定沒有問夠問題，而且我有時肯定會等著別人給我答覆，而不是主動出擊。 我也傾向於花幾個小時來解決一個問題，或試圖修復我認為自己搞砸了的東西，而不是向團隊提出我有一個問題。問題是在這一點上，我已經在團隊中呆了太長時間，無法提出任何基本問題，其中一位高級工程師甚至指出，在這一點上，他們不應該幫助我處理某些流程。<p>我一直試圖找出其他問題，可能我的記憶力很差？ 我有時記不住我們在秋天所做的事情或每一步。<p>說實話，我也是超級洩氣的。 我知道冒名頂替綜合症是一種東西，但當我主動拖累團隊並造成問題時，這不算數。 冒名頂替綜合症是擔心每個人都會發現你是個騙子，即使你的工作做得足夠好。 我做得不好，但我不擔心人們會發現，因為人們已經知道我很差。我推遲我們發佈的時間（3周）可能相當於高級工程師在這8個月裡做完我所有工作所需的時間。 我在學校的CS課程中表現得很好，工作也很努力，所以感覺我的團隊對我很失望，如果出現任何問題，我可能是最不願意幫助的工程師（而且可能是第一個他們認為造成這種情況的人），這對我的內心是一個巨大的打擊。"
}