{
  "@type": "NewsArticle",
  "identifier": "2022--04--06--en--askhn--HackerNews--NewsArticle--30935918",
  "url": "https://news.ycombinator.com/item?id=30935918",
  "headline": "Ask HN: Do you believe in GNU's Free Software?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "&quot;“Free software” means software that respects users' freedom and community. Roughly, it means that the users have the freedom to run, copy, distribute, study, change and improve the software. Thus, “free software” is a matter of liberty, not price. To understand the concept, you should think of “free” as in “free speech,” not as in “free beer.” We sometimes call it “libre software,” borrowing the French or Spanish word for “free” as in freedom, to show we do not mean the software is gratis.\nYou may have paid money to get copies of a free program, or you may have obtained copies at no charge. But regardless of how you got your copies, you always have the freedom to copy and change the software, even to sell copies.&quot; - From the GNU Website.<p>Do you believe in Free Software? People often talk about the benefits of open source, but they tend to switch to proprietary, partly-proprietary (Jetbrains is a good example. Only parts of their products are open source), or corporate controlled open source (Corporations like Microsoft who espouse open source, but not free software because most of their stack is proprietary), when there's convenience to be had.<p>Is free software a lost cause? If we believe in things like right to repair, must we also believe in free software? Is using free software for financial benefit and then not contributing back simply by promoting and using free software immoral? Are we building a bad future for software by not fighting for something like the Free Software movement?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ilovecaching",
    "url": "https://news.ycombinator.com/user?id=ilovecaching"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30935918",
  "sameAs": "https://news.ycombinator.com/item?id=30935918",
  "dateCreated": "2022-04-06T18:53:35.957Z",
  "datePublished": "2022-04-06T18:44:16.000Z",
  "dateModified": "2022-04-06T18:53:35.957Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你相信GNU的自由软件吗？",
  "headline_zh-Hant": "Ask HN: 你相信GNU的自由軟件嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "&quot; \"自由软件 \"是指尊重用户自由和社区的软件。粗略地说，它意味着用户有运行、复制、分发、研究、改变和改进软件的自由。因此，\"自由软件 \"是一个自由问题，而不是价格问题。要理解这个概念，你应该把 \"自由 \"想成是 \"自由言论\"，而不是 \"免费啤酒 \"的意思。我们有时称它为 \"自由软件\"，借用法语或西班牙语中 \"自由 \"的意思，以表明我们并不意味着软件是免费的。\n你可能付过钱来获得免费程序的拷贝，或者你可能免费获得拷贝。但不管你是如何得到拷贝的，你总是有复制和改变软件的自由，甚至可以出售拷贝。<p>你相信自由软件吗？人们经常谈论开源的好处，但他们往往会在有方便的时候转向专有的、部分专有的（Jetbrains就是一个很好的例子。 他们的产品只有部分是开源的），或者企业控制的开源（像微软这样的企业，他们支持开源，但不支持自由软件，因为他们的大部分堆栈是专有的）。<p>自由软件是一个失败的事业吗？如果我们相信像维修权这样的东西，我们也必须相信自由软件吗？为了经济利益而使用自由软件，然后仅仅通过推广和使用自由软件而不做任何贡献，这是否是不道德的？我们不为自由软件运动这样的东西而奋斗，是不是在为软件建立一个糟糕的未来？",
  "description_zh-Hant": "&quot; \"自由軟件 \"是指尊重用戶自由和社區的軟件。粗略地說，它意味著用戶有運行、複製、分發、研究、改變和改進軟件的自由。因此，\"自由軟件 \"是一個自由問題，而不是價格問題。要理解這個概念，你應該把 \"自由 \"想成是 \"自由言論\"，而不是 \"免費啤酒 \"的意思。我們有時稱它為 \"自由軟件\"，借用法語或西班牙語中 \"自由 \"的意思，以表明我們並不意味著軟件是免費的。\n你可能付過錢來獲得免費程序的拷貝，或者你可能免費獲得拷貝。但不管你是如何得到拷貝的，你總是有複製和改變軟件的自由，甚至可以出售拷貝。<p>你相信自由軟件嗎？人們經常談論開源的好處，但他們往往會在有方便的時候轉向專有的、部分專有的（Jetbrains就是一個很好的例子。 他們的產品只有部分是開源的），或者企業控制的開源（像微軟這樣的企業，他們支持開源，但不支持自由軟件，因為他們的大部分堆棧是專有的）。<p>自由軟件是一個失敗的事業嗎？如果我們相信像維修權這樣的東西，我們也必須相信自由軟件嗎？為了經濟利益而使用自由軟件，然後僅僅通過推廣和使用自由軟件而不做任何貢獻，這是否是不道德的？我們不為自由軟件運動這樣的東西而奮鬥，是不是在為軟件建立一個糟糕的未來？"
}