{
  "@type": "NewsArticle",
  "identifier": "2022--04--14--en--askhn--HackerNews--NewsArticle--31026049",
  "url": "https://news.ycombinator.com/item?id=31026049",
  "headline": "Ask HN: Phishing – ever fallen to a scam? Or dodged an attempt?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Most of us see ourselves as pretty tech-savvy. But have you ever fallen to a phishing attempt? Or came close to falling for a scam? Or did one of your relatives fall victim to a phishing attempt?<p>I've been fortunate to have not been a victim of phishing. The closest was a text message phishing attempt.<p>I received a text message saying I had missed a parcel delivery and to re-arrange delivery and pay a re-delivery charge. I almost fell for it because I <i>was</i> expecting a parcel delivery on that day. Text messages use shortened URLs that hide their full URL, but when I clicked the URL in the text message the website that opened in my mobile browser was a convincing reproduction of a delivery company. Luckily, I realised this was a phishing attempt when I looked at the URL. (Some mobile browsers hide the URL until you scroll up the page.)<p>On subsequent occasions I received similar text messages but I knew immediately they were fake because I wasn't expecting any parcel deliveries. Given that many people expect parcel deliveries regularly, I suspect some users fall for this scam when the fake text message coincidences with an actual delivery. I also wonder how my mobile number managed to get on to some scammer's list of phone numbers and where else it’s being circulating.<p>So, have you ever fallen to a phishing attempt? Or came close to falling for a scam? Or did one of your relatives fall victim to a phishing attempt?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "vanilla-almond",
    "url": "https://news.ycombinator.com/user?id=vanilla-almond"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31026049",
  "sameAs": "https://news.ycombinator.com/item?id=31026049",
  "dateCreated": "2022-04-14T12:58:15.011Z",
  "datePublished": "2022-04-14T12:34:04.000Z",
  "dateModified": "2022-04-14T12:58:15.011Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 网络钓鱼--曾经落入骗局吗？还是躲过了一次企图？",
  "headline_zh-Hant": "Ask HN: 網絡釣魚--曾經落入騙局嗎？還是躲過了一次企圖？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们中的大多数人都认为自己是相当精通技术的。但是，你是否曾经落入过网络钓鱼的企图？或者差点上当受骗？或者你的某个亲戚成为了网络钓鱼的受害者？<p>我很幸运，没有成为网络钓鱼的受害者。The closest was a text message phishing attempt.<p>I received a text message saying I had missed a parcel delivery and to re-arrange delivery and pay a re-delivery charge. I almost fell for it because I <i>was</i> expecting a parcel delivery on that day. 短信使用缩短的URL，隐藏其完整的URL，但当我点击短信中的URL时，在手机浏览器中打开的网站是一个令人信服的快递公司的复制品。幸运的是，当我看到网址时，我意识到这是一个网络钓鱼的尝试。(有些手机浏览器会隐藏网址，直到你向上滚动页面。）<p>在随后的几次中，我收到了类似的短信，但我立即知道它们是假的，因为我并不期待任何包裹的交付。鉴于许多人经常期待包裹的交付，我怀疑有些用户在假短信与实际交付相吻合的情况下上当受骗。我还想知道，我的手机号码是如何进入一些骗子的电话号码清单的，以及它还在哪里流传。<p>那么，你有没有上过当？或者差点上当受骗？或者你的某个亲戚成为了网络钓鱼的受害者？",
  "description_zh-Hant": "我們中的大多數人都認為自己是相當精通技術的。但是，你是否曾經落入過網絡釣魚的企圖？或者差點上當受騙？或者你的某個親戚成為了網絡釣魚的受害者？<p>我很幸運，沒有成為網絡釣魚的受害者。The closest was a text message phishing attempt.<p>I received a text message saying I had missed a parcel delivery and to re-arrange delivery and pay a re-delivery charge. I almost fell for it because I <i>was</i> expecting a parcel delivery on that day. 短信使用縮短的URL，隱藏其完整的URL，但當我點擊短信中的URL時，在手機瀏覽器中打開的網站是一個令人信服的快遞公司的複製品。幸運的是，當我看到網址時，我意識到這是一個網絡釣魚的嘗試。(有些手機瀏覽器會隱藏網址，直到你向上滾動頁面。）<p>在隨後的幾次中，我收到了類似的短信，但我立即知道它們是假的，因為我並不期待任何包裹的交付。鑑於許多人經常期待包裹的交付，我懷疑有些用戶在假短信與實際交付相吻合的情況下上當受騙。我還想知道，我的手機號碼是如何進入一些騙子的電話號碼清單的，以及它還在哪裡流傳。<p>那麼，你有沒有上過當？或者差點上當受騙？或者你的某個親戚成為了網絡釣魚的受害者？"
}