{
  "@type": "NewsArticle",
  "identifier": "2022--03--23--en--askhn--HackerNews--NewsArticle--30781838",
  "url": "https://news.ycombinator.com/item?id=30781838",
  "headline": "Ask HN: Information on common commercial “encrypted email” systems?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The short story: my broker keeps sending me email with the subject beginning with &quot;Encrypt:&quot; and assuring me that the contents are encrypted.  They aren't.  Anyone who has any clue can clearly look at the raw message and see that the contents are not encrypted.  This has happened to me from various parties for many, many years, and I've always assumed they have some sort of internal encrypted email concept where the client can encrypt/decrypt transparently, but that when it exits the company, it's necessarily sent in the clear (they don't know what kind of mail system is on the receiving end).<p>I'm well-versed in security.  I know fundamental truths like that I can't possibly be reading an encrypted email without having access to a decryption key, and that systems to manage such keys are Hard Problems that simply have no widespread implementation that would feasibly work between my broker and my gmail.  And further, I know how to look at the raw contents of an email and see that it's clearly just a base64-encoded PDF that I can open and view without any kind of shared secret.<p>What I <i>don't</i> know is .. what are these various email systems that claim to encrypt and send &quot;secure&quot; email actually <i>doing</i>?  I'm looking for references that give the technical details of how various types of encrypted email systems actually work.  I want to eliminate the magic and be able to have a conversation that doesn't stop at the other person saying, &quot;I don't know, IT says it's encrypted.&quot;",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "heleninboodler",
    "url": "https://news.ycombinator.com/user?id=heleninboodler"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30781838",
  "sameAs": "https://news.ycombinator.com/item?id=30781838",
  "dateCreated": "2022-03-23T18:54:03.377Z",
  "datePublished": "2022-03-23T18:47:09.000Z",
  "dateModified": "2022-03-23T18:54:03.377Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 关于普通商业 \"加密电子邮件 \"系统的信息？",
  "headline_zh-Hant": "Ask HN: 關於普通商業 \"加密電子郵件 \"系統的信息？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "简而言之：我的经纪人不断向我发送主题以&quot;加密:&quot;开头的电子邮件，并向我保证内容是加密的。 其实不然。 任何有线索的人都可以清楚地看到原始信息，并看到内容没有被加密。 很多很多年来，这种情况都发生在我身上，我一直以为他们有某种内部加密电子邮件的概念，客户可以透明地加密/解密，但当它离开公司时，它必然是以透明方式发送的（他们不知道接收端是什么样的邮件系统）。 I know fundamental truths like that I can't possibly be reading an encrypted email without having access to a decryption key, and that systems to manage such keys are Hard Problems that simply have no widespread implementation that would feasibly work between my broker and my gmail.  And further, I know how to look at the raw contents of an email and see that it's clearly just a base64-encoded PDF that I can open and view without any kind of shared secret.<p>What I <i>don't</i> know is .. what are these various email systems that claim to encrypt and send &quot;secure&quot; email actually <i>doing</i>?  I'm looking for references that give the technical details of how various types of encrypted email systems actually work.  我想消除魔法，并且能够进行对话，而不是止于对方说：\"我不知道，IT部门说它是加密的\"。",
  "description_zh-Hant": "簡而言之：我的經紀人不斷向我發送主題以&quot;加密:&quot;開頭的電子郵件，並向我保證內容是加密的。 其實不然。 任何有線索的人都可以清楚地看到原始信息，並看到內容沒有被加密。 很多很多年來，這種情況都發生在我身上，我一直以為他們有某種內部加密電子郵件的概念，客戶可以透明地加密/解密，但當它離開公司時，它必然是以透明方式發送的（他們不知道接收端是什麼樣的郵件系統）。 I know fundamental truths like that I can't possibly be reading an encrypted email without having access to a decryption key, and that systems to manage such keys are Hard Problems that simply have no widespread implementation that would feasibly work between my broker and my gmail.  And further, I know how to look at the raw contents of an email and see that it's clearly just a base64-encoded PDF that I can open and view without any kind of shared secret.<p>What I <i>don't</i> know is .. what are these various email systems that claim to encrypt and send &quot;secure&quot; email actually <i>doing</i>?  I'm looking for references that give the technical details of how various types of encrypted email systems actually work.  我想消除魔法，並且能夠進行對話，而不是止於對方說：\"我不知道，IT部門說它是加密的\"。"
}