{
  "@type": "NewsArticle",
  "identifier": "2022--04--08--en--askhn--HackerNews--NewsArticle--30953177",
  "url": "https://news.ycombinator.com/item?id=30953177",
  "headline": "Ask HN: Does anyone else get obsessively attached to things/people?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "For me it happens when I care too much about other people's reaction, judgment, or just attention in general. And I mean obsessed like a real addiction.<p>Right now as I'm typing this my body is shaking and my mind is locked onto a recent Ask HN post I started about something personal [0]. My heart and mind are racing wondering if people are going to see it, how they're gonna react, etc. And now I'm also doing the same in anticipation of this one.<p>This attachment can be a negative, anxious worrying, or it can be a euphoric high if it's positive (eg a well received HN post). Either one, I get completely fixated on it, become extremely erratic, and would act impulsively, doing things that can have detrimental effects, including neglecting real responsibilities (eg risk being late for work because I <i>had</i> to reply to something).<p>I get it when I try to contact classmates hoping to make friends. The feeling is actually worst when I don't get any response, because then my mind starts wondering about all the possible reasons for the silence.<p>I know I've had childhood trauma linked with neglect, and I'm pretty sure I have the avoidant attachment style. I also recently found out about Rejection Sensitive Dysphoria (linked to ADHD). I definitely have this.<p>I used to get separation anxiety when my relationship was shaky, but that's all gone now because the relationship is much much better and stable.<p>Recently I've been more active in trying to make friends, and have become more involved in certain communities (like HN). So I'm suddenly experiencing a lot of this and I'm just kinda shocked that it's still happening.<p>Does anyone else experience this level of intensity regarding attachments? How did you cope?<p>[0]: https://news.ycombinator.com/item?id=30952648",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30953177",
  "sameAs": "https://news.ycombinator.com/item?id=30953177",
  "dateCreated": "2022-04-08T04:12:04.380Z",
  "datePublished": "2022-04-08T03:55:11.000Z",
  "dateModified": "2022-04-08T04:12:04.380Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 还有人对事物/人有强迫性的依恋吗？",
  "headline_zh-Hant": "Ask HN: 還有人對事物/人有強迫性的依戀嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "对我来说，当我太在乎别人的反应、判断，或者只是一般的关注时，就会发生这种情况。<p>现在，当我打字的时候，我的身体在颤抖，我的头脑被锁定在我最近开始的一篇关于个人事务的Ask HN帖子[0]。我的心和头脑都在飞速运转，想知道人们是否会看到它，他们会有什么反应，等等。<p>这种依恋可能是一种消极的、焦虑的担心，如果是积极的（例如一篇广受好评的HN帖子），它也可能是一种兴奋的高潮。无论哪种情况，我都会完全沉迷于此，变得极不稳定，并且会冲动行事，做一些可能产生有害影响的事情，包括忽视真正的责任（例如，因为我<i>必须</i>回复什么，所以有可能上班迟到）。当我没有得到任何回应时，这种感觉实际上是最糟糕的，因为我的大脑开始思考所有可能的沉默原因。<p>我知道我的童年创伤与忽视有关，我非常确定我有回避型依恋风格。我最近还发现了对拒绝敏感的焦虑症（与多动症有关）。我肯定有这种情况。<p>以前我的关系不稳定时，我会有分离焦虑，但现在都没有了，因为关系好了很多，也稳定了很多。<p>最近，我更积极地尝试交朋友，并更多地参与某些社区（如HN）。所以我突然经历了很多这样的事情，我只是有点震惊，因为它还在发生。<p>还有人经历过这种关于依恋的激烈程度吗？你是如何应对的？<p>[0]: https://news.ycombinator.com/item?id=30952648",
  "description_zh-Hant": "對我來說，當我太在乎別人的反應、判斷，或者只是一般的關注時，就會發生這種情況。<p>現在，當我打字的時候，我的身體在顫抖，我的頭腦被鎖定在我最近開始的一篇關於個人事務的Ask HN帖子[0]。我的心和頭腦都在飛速運轉，想知道人們是否會看到它，他們會有什麼反應，等等。<p>這種依戀可能是一種消極的、焦慮的擔心，如果是積極的（例如一篇廣受好評的HN帖子），它也可能是一種興奮的高潮。無論哪種情況，我都會完全沉迷於此，變得極不穩定，並且會衝動行事，做一些可能產生有害影響的事情，包括忽視真正的責任（例如，因為我<i>必須</i>回覆什麼，所以有可能上班遲到）。當我沒有得到任何迴應時，這種感覺實際上是最糟糕的，因為我的大腦開始思考所有可能的沉默原因。<p>我知道我的童年創傷與忽視有關，我非常確定我有迴避型依戀風格。我最近還發現了對拒絕敏感的焦慮症（與多動症有關）。我肯定有這種情況。<p>以前我的關係不穩定時，我會有分離焦慮，但現在都沒有了，因為關係好了很多，也穩定了很多。<p>最近，我更積極地嘗試交朋友，並更多地參與某些社區（如HN）。所以我突然經歷了很多這樣的事情，我只是有點震驚，因為它還在發生。<p>還有人經歷過這種關於依戀的激烈程度嗎？你是如何應對的？<p>[0]: https://news.ycombinator.com/item?id=30952648"
}