{
  "@type": "NewsArticle",
  "identifier": "2022--04--04--en--askhn--HackerNews--NewsArticle--30911925",
  "url": "https://news.ycombinator.com/item?id=30911925",
  "headline": "Ask HN: Do you believe Russia murdered innocent civilians?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "More often than not, after the fact we learn that we weren't fully informed.<p>This time, russia is accused of mass-murdering innocent civilians. Not sure if you even heard of what I'm referring to, I'm in germany and we're being bombarded with messages how evil russia is, and so on.<p>I'm neither russian, nor a mass-murderer, nor someone even remotely close to liking a mass-murderer. I'm not russian, for that matter, I don't have a relation at all to russians, aside from liking the now destroyed AN-225 engineering marvel.<p>I don't use facebook, aside from occasionally noticing mails from remote family branches posting an update there, which I (with a bad conscience) ignored for as long as I can remember.<p>I don't like Putin. He's the head of a shithole country pampering intellectually challenged folks which happened to be at the right place in time to own lots of natural resources (&quot;oligarchs&quot;).<p>But still, I don't buy any of the propaganda regarding the current conflict. It's not true to me that Russia is trying to destroy Ukraine. If they wanted to, and if they really don't care about nuclear destruction, why didn't they drop an A-Bomb over Kyiv yet?<p>We're intelligent folks, most of us at least. Please do your own research.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "firebaze",
    "url": "https://news.ycombinator.com/user?id=firebaze"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30911925",
  "sameAs": "https://news.ycombinator.com/item?id=30911925",
  "dateCreated": "2022-04-04T21:10:16.464Z",
  "datePublished": "2022-04-04T21:06:05.000Z",
  "dateModified": "2022-04-04T21:10:16.464Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你相信俄罗斯谋杀了无辜的平民吗？",
  "headline_zh-Hant": "Ask HN: 你相信俄羅斯謀殺了無辜的平民嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "更多的时候，事后我们才知道，我们并没有得到充分的信息。<p>这一次，俄罗斯被指控大规模屠杀无辜平民。不知道你是否听说过我指的是什么，我在德国，我们被轰炸的信息是俄罗斯有多邪恶，等等。<p>我既不是俄罗斯人，也不是大屠杀者，更不是接近于喜欢大屠杀者的人。我不是俄罗斯人，就这一点而言，我和俄罗斯人一点关系都没有，除了喜欢现在被摧毁的安-225工程奇迹。<p>我不使用脸书，除了偶尔注意到远程家庭分支的邮件在那里发布的更新，从我记得的时候起，我（凭着坏良心）就忽略了这些。他是一个宠爱智力有问题的人的狗屁国家的首脑，而这些人恰好在正确的时间拥有大量的自然资源（&quot;寡头&quot;）。<p>但是，我仍然不相信任何有关当前冲突的宣传。在我看来，俄罗斯试图摧毁乌克兰的说法并不真实。如果他们想，如果他们真的不在乎核毁灭，为什么他们还不在基辅上空投下一颗原子弹呢？<p>我们是聪明人，至少我们中的大多数人是聪明人。请你自己做研究。",
  "description_zh-Hant": "更多的時候，事後我們才知道，我們並沒有得到充分的信息。<p>這一次，俄羅斯被指控大規模屠殺無辜平民。不知道你是否聽說過我指的是什麼，我在德國，我們被轟炸的信息是俄羅斯有多邪惡，等等。<p>我既不是俄羅斯人，也不是大屠殺者，更不是接近於喜歡大屠殺者的人。我不是俄羅斯人，就這一點而言，我和俄羅斯人一點關係都沒有，除了喜歡現在被摧毀的安-225工程奇蹟。<p>我不使用臉書，除了偶爾注意到遠程家庭分支的郵件在那裡發佈的更新，從我記得的時候起，我（憑著壞良心）就忽略了這些。他是一個寵愛智力有問題的人的狗屁國家的首腦，而這些人恰好在正確的時間擁有大量的自然資源（&quot;寡頭&quot;）。<p>但是，我仍然不相信任何有關當前衝突的宣傳。在我看來，俄羅斯試圖摧毀烏克蘭的說法並不真實。如果他們想，如果他們真的不在乎核毀滅，為什麼他們還不在基輔上空投下一顆原子彈呢？<p>我們是聰明人，至少我們中的大多數人是聰明人。請你自己做研究。"
}