{
  "@type": "NewsArticle",
  "identifier": "2022--04--07--en--askhn--HackerNews--NewsArticle--30948415",
  "url": "https://news.ycombinator.com/item?id=30948415",
  "headline": "Ask HN: How do I prevent my phone number from leaking via LinkedIn?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Sometimes when I am bored I like to pick up unknown caller/spam calls just to see what they are peddling, and this morning I was in one of those moods. However, when I answered I was surprised to hear a real person on the other end of the line that knew my name, my employer, and my role. They were trying to sell me on their startup product which is aimed at people in my position.<p>I was quite surprised how he had all this information on me, and I asked where he got my phone number thinking perhaps we have a mutual connection that put us in touch. Instead, he said he found me and my phone number on LinkedIn. We had a bit of back-and-forth, and I politely ended the call.<p>I have double checked, and there is no phone number connected to my LinkedIn account. Instead, I suspect this seller has some sort of Chrome extension which is adding extra contact info metadata to public LinkedIn profiles. With that, a seller can look for people with my job title, and then use that contact info to do cold outreach.<p>Is that likely what happened in this case, or is there another avenue I am not considering? How might I prevent these creepy calls in the future? I suspect if there are 1-2 large players who offer this service I could ask them to delete my data. I don't want to delete my LinkedIn account over this as I have found it relatively handy.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "calrueb",
    "url": "https://news.ycombinator.com/user?id=calrueb"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30948415",
  "sameAs": "https://news.ycombinator.com/item?id=30948415",
  "dateCreated": "2022-04-07T18:36:33.054Z",
  "datePublished": "2022-04-07T18:22:49.000Z",
  "dateModified": "2022-04-07T18:36:33.054Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何防止我的电话号码通过LinkedIn泄露出去？",
  "headline_zh-Hant": "Ask HN: 如何防止我的電話號碼通過LinkedIn洩露出去？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "有时，当我无聊时，我喜欢接听不明来电/垃圾电话，只是想看看他们在兜售什么，今天早上我就有这种心情。然而，当我接听时，我惊讶地听到电话那头是一个真正的人，他知道我的名字，我的雇主，以及我的角色。他们试图向我推销他们的创业产品，而该产品正是针对我这个职位的人。<p>我很惊讶他怎么会有我的这些信息，我问他从哪里得到我的电话号码，以为也许我们有一个共同的联系，让我们联系。相反，他说他在LinkedIn上找到了我和我的电话号码。<p>我仔细检查了一下，没有任何电话号码与我的LinkedIn账户相连。相反，我怀疑这个卖家有某种Chrome扩展程序，在公开的LinkedIn资料中添加了额外的联系信息元数据。<p>在这种情况下，卖家可以寻找有我工作头衔的人，然后利用这些联系信息进行冷处理。<p>在这种情况下，是否有可能发生这种情况，还是有其他我没有考虑的途径？我怎样才能防止将来出现这些令人毛骨悚然的电话？我怀疑如果有1-2个提供这种服务的大公司，我可以要求他们删除我的数据。我不想因此而删除我的LinkedIn账户，因为我发现它比较方便。",
  "description_zh-Hant": "有時，當我無聊時，我喜歡接聽不明來電/垃圾電話，只是想看看他們在兜售什麼，今天早上我就有這種心情。然而，當我接聽時，我驚訝地聽到電話那頭是一個真正的人，他知道我的名字，我的僱主，以及我的角色。他們試圖向我推銷他們的創業產品，而該產品正是針對我這個職位的人。<p>我很驚訝他怎麼會有我的這些信息，我問他從哪裡得到我的電話號碼，以為也許我們有一個共同的聯繫，讓我們聯繫。相反，他說他在LinkedIn上找到了我和我的電話號碼。<p>我仔細檢查了一下，沒有任何電話號碼與我的LinkedIn賬戶相連。相反，我懷疑這個賣家有某種Chrome擴展程序，在公開的LinkedIn資料中添加了額外的聯繫信息元數據。<p>在這種情況下，賣家可以尋找有我工作頭銜的人，然後利用這些聯繫信息進行冷處理。<p>在這種情況下，是否有可能發生這種情況，還是有其他我沒有考慮的途徑？我怎樣才能防止將來出現這些令人毛骨悚然的電話？我懷疑如果有1-2個提供這種服務的大公司，我可以要求他們刪除我的數據。我不想因此而刪除我的LinkedIn賬戶，因為我發現它比較方便。"
}