{
  "@type": "NewsArticle",
  "identifier": "2022--04--01--en--askhn--HackerNews--NewsArticle--30884486",
  "url": "https://news.ycombinator.com/item?id=30884486",
  "headline": "Ask HN: How do you find a job that makes you happy?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": " Hey HN,<p>I'm on my 3rd consecutive job that I hate. I'm a manager, though I've remained very technical and actively coding. I've liked all the teams I hired, and always had really good feedback from them and well above average survey ratings. I want to feel happy about work again.<p>Despite spending more and more time carefully picking a job, it always feels like I'm either deceived, or missed some stuff I should have caught earlier.<p>I can't get out of bed, am tired all the time. Sometimes on the brink of tears. I'm at a spot where it's very obvious to me that I'm depressed, it's impacting my family life. I'm losing my time, and should look elsewhere. But I've had 4 different jobs over the past 6y, and I'd love to settle somewhere. When stuff is f-ed up 3 times in a row, it's time to look at yourself in the mirror ; either I have the wrong expectations, not enough patience, or I don't know how to find a job that is right for me. I think it's a combination of all three.<p>What really f-ed me up is a brief, recent period of feeling love towards my job when I had hope to change the scope towards something more useful, that reminded me how it can feel.<p>If you love the job you're in, how did you find it? What are the concessions you made? What are the red flags (or the right signs) to tell you a job is the right one? Did you manage to reform a shitty job in something at least tenable?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "charles_f",
    "url": "https://news.ycombinator.com/user?id=charles_f"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30884486",
  "sameAs": "https://news.ycombinator.com/item?id=30884486",
  "dateCreated": "2022-04-01T23:49:53.945Z",
  "datePublished": "2022-04-01T23:46:49.000Z",
  "dateModified": "2022-04-01T23:49:53.945Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何找到一份让你满意的工作？",
  "headline_zh-Hant": "Ask HN: 你如何找到一份讓你滿意的工作？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": " Hey HN,<p>我已经连续做了3份我讨厌的工作。我是一名经理，虽然我一直保持着很高的技术水平，并积极进行编码。我喜欢我雇用的所有团队，并且总是从他们那里得到非常好的反馈和远高于平均水平的调查评级。我想再次感受到工作的快乐。<p>尽管我花了越来越多的时间仔细挑选工作，但总觉得我不是被欺骗了，就是错过了一些我应该早点发现的东西。<p>我无法下床，一直很累。有时甚至到了流泪的边缘。我正处于一个对我来说非常明显的位置，即我的抑郁症，它影响了我的家庭生活。我正在失去我的时间，应该寻找其他地方。但在过去的6年里，我已经有了4份不同的工作，我很想在某个地方定居下来。当事情连续3次被搞砸时，是时候照照镜子了；要么我有错误的期望，没有足够的耐心，要么我不知道如何找到一份适合我的工作。我认为这是三者的结合。<p>真正让我崩溃的是，最近有一段短暂的时间，我对我的工作产生了爱的感觉，当时我有希望改变范围，走向更有用的东西，这让我想起了它的感觉。<p>如果你爱你现在的工作，你是怎么找到的？你做了哪些让步？有哪些红旗（或正确的标志）可以告诉你一份工作是正确的？你是否设法将一份糟糕的工作改造成至少可以维持的工作？",
  "description_zh-Hant": " Hey HN,<p>我已經連續做了3份我討厭的工作。我是一名經理，雖然我一直保持著很高的技術水平，並積極進行編碼。我喜歡我僱用的所有團隊，並且總是從他們那裡得到非常好的反饋和遠高於平均水平的調查評級。我想再次感受到工作的快樂。<p>儘管我花了越來越多的時間仔細挑選工作，但總覺得我不是被欺騙了，就是錯過了一些我應該早點發現的東西。<p>我無法下床，一直很累。有時甚至到了流淚的邊緣。我正處於一個對我來說非常明顯的位置，即我的抑鬱症，它影響了我的家庭生活。我正在失去我的時間，應該尋找其他地方。但在過去的6年裡，我已經有了4份不同的工作，我很想在某個地方定居下來。當事情連續3次被搞砸時，是時候照照鏡子了；要麼我有錯誤的期望，沒有足夠的耐心，要麼我不知道如何找到一份適合我的工作。我認為這是三者的結合。<p>真正讓我崩潰的是，最近有一段短暫的時間，我對我的工作產生了愛的感覺，當時我有希望改變範圍，走向更有用的東西，這讓我想起了它的感覺。<p>如果你愛你現在的工作，你是怎麼找到的？你做了哪些讓步？有哪些紅旗（或正確的標誌）可以告訴你一份工作是正確的？你是否設法將一份糟糕的工作改造成至少可以維持的工作？"
}