{
  "@type": "NewsArticle",
  "identifier": "2022--03--23--en--askhn--HackerNews--NewsArticle--30783406",
  "url": "https://news.ycombinator.com/item?id=30783406",
  "headline": "Ask HN: I'm in a position to move to anywhere in the USA, where should I go?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm facing a sort of analysis paralysis and would greatly appreciate some assistance and input to help me at least narrow down my options.<p>I'm single with a remote job. No pets, no one I need to consider but myself.<p>Here is what's important to me in order of importance:<p>1. Affordability. \n    -&gt; So no SF or NYC. Ideally a place where housing falls at or under the nations average COL index of 100.<p>2. Opportunity\n    -&gt; I don't want to be <i>too</i> far from at least one major population center in case I happen to lose my remote job and need to get reemployed ASAP. Ideally within a 90 minute drive of a city with a pop of at least 500k, these numbers are just estimates so a little longer of a drive or lower pop would be alright if it's otherwise worth the tradeoff.<p>3. Weather\n    -&gt; I don't deal well with heat and would prefer somewhere that doesn't have blistering summers. High levels of rainfall is also a big plus.<p>4. Distance\n    -&gt; I currently live in Washington DC. If I could find a place that met these requirements near by rather than across the country that'd be preferable, but this isn't nearly as important as the other considerations.<p>Again, any input is welcome and appreciated, thank you.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "MathCodeLove",
    "url": "https://news.ycombinator.com/user?id=MathCodeLove"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30783406",
  "sameAs": "https://news.ycombinator.com/item?id=30783406",
  "dateCreated": "2022-03-23T21:25:16.912Z",
  "datePublished": "2022-03-23T21:08:42.000Z",
  "dateModified": "2022-03-23T21:25:16.912Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "Ask HN: 我有能力搬到美国的任何地方，我应该去哪里？",
  "headline_zh-Hant": "Ask HN: 我有能力搬到美國的任何地方，我應該去哪裡？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我正面临着一种分析瘫痪症，如果能得到一些帮助和意见，以帮助我至少缩小我的选择范围，我将非常感激。没有宠物，除了我自己，没有人需要考虑。<p>以下是对我来说重要的东西，按重要性排序：<p>1. 负担得起的。\n    -&gt; 所以没有旧金山或纽约市。Ideally a place where housing falls at or under the nations average COL index of 100.<p>2. Opportunity\n    -&gt; I don't want to be <i>too</i> far from at least one major population center in case I happen to lose my remote job and need to get reemployed ASAP. 理想的情况是，在90分钟车程内有一个至少50万人口的城市，这些数字只是估计，所以如果值得取舍的话，车程长一点或人口少一点也没关系。\n    -我不太喜欢炎热的天气，我希望能有一个没有炎热夏天的地方。高水平的降雨量也是一个很大的优点。<p>4.距离\n    -&gt; 我目前住在华盛顿特区。如果我可以在附近找到一个符合这些要求的地方，而不是在全国各地，那就更好了，但这并不像其他考虑因素那么重要。<p>另外，欢迎任何意见，谢谢。",
  "description_zh-Hant": "我正面臨著一種分析癱瘓症，如果能得到一些幫助和意見，以幫助我至少縮小我的選擇範圍，我將非常感激。沒有寵物，除了我自己，沒有人需要考慮。<p>以下是對我來說重要的東西，按重要性排序：<p>1. 負擔得起的。\n    -&gt; 所以沒有舊金山或紐約市。Ideally a place where housing falls at or under the nations average COL index of 100.<p>2. Opportunity\n    -&gt; I don't want to be <i>too</i> far from at least one major population center in case I happen to lose my remote job and need to get reemployed ASAP. 理想的情況是，在90分鐘車程內有一個至少50萬人口的城市，這些數字只是估計，所以如果值得取捨的話，車程長一點或人口少一點也沒關係。\n    -我不太喜歡炎熱的天氣，我希望能有一個沒有炎熱夏天的地方。高水平的降雨量也是一個很大的優點。<p>4.距離\n    -&gt; 我目前住在華盛頓特區。如果我可以在附近找到一個符合這些要求的地方，而不是在全國各地，那就更好了，但這並不像其他考慮因素那麼重要。<p>另外，歡迎任何意見，謝謝。"
}