{
  "@type": "NewsArticle",
  "identifier": "2022--03--03--en--askhn--HackerNews--NewsArticle--30546466",
  "url": "https://news.ycombinator.com/item?id=30546466",
  "headline": "Ask HN: How do I hack love?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "It is the only aspect of life where I just cannot even get started. \nI am 29 and my experience so far is, I got a kiss from a girl when I was 28, and we had a very brief moment, a week, where we were a couple. Then she decided she had no feelings. That week was the happiest week of my life. It felt like I had been cured from a decade long depression.<p>I wanted to ask the community here because it is one of the sanest places on the internet. In particular I wanted to ask about books or other resources written by people whose career is not based around selling books about how to get love/sex/women. Books that might give some genuine insight, ideally backed by science, or even psychology, or even books about ways to cope when you are such a man as myself who has such difficulty finding somebody who appreciates them for who they are.<p>You are also welcome to give your own personal advice too, although I doubt it will apply to me, unless you are a significantly below average looking immigrant living in Germany.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwawayiay",
    "url": "https://news.ycombinator.com/user?id=throwawayiay"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30546466",
  "sameAs": "https://news.ycombinator.com/item?id=30546466",
  "dateCreated": "2022-03-03T20:30:52.448Z",
  "datePublished": "2022-03-03T20:26:37.000Z",
  "dateModified": "2022-03-03T20:30:52.448Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我怎样才能黑掉爱情？",
  "headline_zh-Hant": "Ask HN: 我怎樣才能黑掉愛情？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这是生活中唯一一个我甚至无法开始的方面。\n我今年29岁，到目前为止我的经验是，我28岁时得到了一个女孩的吻，我们有一个非常短暂的时刻，一个星期，我们是一对。然后她决定她没有感觉。那一周是我生命中最快乐的一周。我感觉自己从长达十年的抑郁症中被治愈了。<p>我想在这里询问社区，因为它是互联网上最理智的地方之一。我特别想问的是，那些职业不是围绕着销售关于如何获得爱情/性/女人的书籍的人所写的书籍或其他资源。这些书可能会提供一些真正的见解，最好是有科学依据的，甚至是心理学方面的，甚至是关于当你是像我这样的人，很难找到欣赏自己的人时，如何应对的书。<p>也欢迎你给出自己的个人建议，虽然我怀疑它是否适用于我，除非你是一个生活在德国的明显低于平均水平的移民。",
  "description_zh-Hant": "這是生活中唯一一個我甚至無法開始的方面。\n我今年29歲，到目前為止我的經驗是，我28歲時得到了一個女孩的吻，我們有一個非常短暫的時刻，一個星期，我們是一對。然後她決定她沒有感覺。那一週是我生命中最快樂的一週。我感覺自己從長達十年的抑鬱症中被治癒了。<p>我想在這裡詢問社區，因為它是互聯網上最理智的地方之一。我特別想問的是，那些職業不是圍繞著銷售關於如何獲得愛情/性/女人的書籍的人所寫的書籍或其他資源。這些書可能會提供一些真正的見解，最好是有科學依據的，甚至是心理學方面的，甚至是關於當你是像我這樣的人，很難找到欣賞自己的人時，如何應對的書。<p>也歡迎你給出自己的個人建議，雖然我懷疑它是否適用於我，除非你是一個生活在德國的明顯低於平均水平的移民。"
}