{
  "@type": "NewsArticle",
  "identifier": "2022--03--12--en--askhn--HackerNews--NewsArticle--30649839",
  "url": "https://news.ycombinator.com/item?id=30649839",
  "headline": "Ask HN: Was RT the only intl, non-US-aligned TV station of any significance?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I often rotate amongst various international (and rarely, domestic news) tv stations/outlets to see small glimpses of intelligent news coverage, esp regarding Ukraine.<p>By 'intelligent', I mean...mostly brain dead and useless hype-training and pat-ourselves-on-the-back-ism, but for some reason I can deal with it better coming from international anchors.<p>My typical rotation over the past couple of weeks, in order of the amount of time I spend on each, has been:\n* Sky News (US/UK?) -- not the Aussie-based cast\n* Al Jazeera English (Qatar)\n* France 24 English (France)\n* DW (Germany)\n* TRT (Turkey)\n* CGTN (China)\n* NDTV (India)\n* DemocracyNow (US)* (just 1 hr/day, M-F)<p>PressTV (Iran) went away this past summer.<p>RT (Russia) went away the past day or so.<p>DemocracyNow gets an honorable mention because it's indy media and really good, even if it's only a few hours a week.<p>And Fox News deserves a mention even tho I don't watch it -- it at least occasionally provides a counter to whatever CBS/NBS/etc. are saying, and that alternative message, despite all the racism and bigotry and covid denial and the rest -- I guess you could make an argument that it could, in the case of a Biden admin dragging us into WW3, Fox News _could_ help slow that train down. I just don't see anything from the other mainstream US media except POTUS talking points, and the international TV stations that are still on the air do the same -- just toned down a bit.<p>I guess you could say with some accuracy that Fox News (US) is anti-US, at least anti-Democrats, and anti-US-when-there-is-a-Democrat-POTUS, so it really does provide another point of view on things, at least occassionally, which is a good thing, imo.<p>CGTN (China) was, up until a couple of weeks ago, anti-US in the sense that they weren't actively supporting the White House line on everything, but the past couple of weeks - during war on ukraine - they just show a repeating loop of Xi giving a speech to some factory workers.<p>NDTV (India) has been fulltime on their elections - not sure if they're going to cover Ukraine - doesn't look like it so far.<p>If a station is very pro-US or doesn't say anything too bad about US intentions, they get labeled on youtube as:<p>&gt; [TV Station] is sponsored in whole or in part by the government of [Country]<p>If, on the other hand, a station is _rabidly_ pro-US, they get labeled:<p>&gt; [TV Station Name] is a [Country/French/Turkish/etc.] public service'<p>If a station hates on US policy/intentions/anything, they're off the air/net.<p>What international news channels (or others?) am I missing -- that are still on the air/internet?<p>TYT -- young turks? No.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "readonthegoapp",
    "url": "https://news.ycombinator.com/user?id=readonthegoapp"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30649839",
  "sameAs": "https://news.ycombinator.com/item?id=30649839",
  "dateCreated": "2022-03-12T08:11:48.920Z",
  "datePublished": "2022-03-12T08:07:18.000Z",
  "dateModified": "2022-03-12T08:11:48.920Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: RT是唯一一个国际的、不与美国结盟的电视台，有什么意义吗？",
  "headline_zh-Hant": "Ask HN: RT是唯一一個國際的、不與美國結盟的電視臺，有什麼意義嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我经常在各种国际（很少是国内新闻）电视台/频道之间轮换，以看到一些明智的新闻报道，特别是关于乌克兰的新闻报道。<p>所谓 \"明智\"，我的意思是......大多数是脑残的、无用的炒作训练和拍拍屁股走人，但由于某些原因，我可以更好地处理来自国际主播的报道。<p>在过去几周，我典型的轮换，按照我在每个人身上花费的时间排序，是。\n* 天空新闻（美国/英国）--不是以澳大利亚为基地的节目组。\n* 半岛电视台英语(卡塔尔)\n* 法国24小时英语（法国）\n* DW (德国)\n* TRT (土耳其)\n* CGTN (中国)\n* NDTV (印度)\n<p>PressTV（伊朗）在去年夏天消失了。<p>RT（俄罗斯）在过去的一天左右消失了。<p>DemocracyNow值得一提，因为它是独立媒体，而且真的很好，即使它每周只有几个小时。<p>福克斯新闻值得一提，尽管我不看它 -- 它至少偶尔会提供一个反驳CBS/NBS/etc. 我想你可以提出一个论点，在拜登政府将我们拖入第三次世界大战的情况下，福克斯新闻_可以帮助减缓这列火车。<p>我想你可以准确地说，福克斯新闻（美国）是反美国的，至少是反民主党的，当有一个民主党人--总统时是反美国的，所以它确实对事情提供了另一种观点，至少偶尔是这样，这是件好事，我想。 <p>CGTN（中国）直到几周前都是反美的，因为他们并不积极支持白宫在所有事情上的路线，但在过去几周--在乌克兰战争期间--他们只是重复播放习近平对一些工厂工人的讲话。 <p>NDTV（印度）一直在全职报道他们的选举--不确定他们是否会报道乌克兰--到目前为止看起来还没有。 <p>如果一个电视台非常亲美，或者没有说任何关于美国意图的坏话，他们会在youtube上被标记为：<p>&gt; [电视台]全部或部分由[国家]政府赞助<p>另一方面，如果一个电视台_非常亲美，他们会被标记为：<p>&gt; [电视台名称]是一个[国家/法国/土耳其/等等。 <p>如果一个电视台讨厌美国的政策/意图/任何东西，他们就会被停播/停网。<p>我错过了哪些国际新闻频道（或其他频道）--仍在播出/停网？没有。",
  "description_zh-Hant": "我經常在各種國際（很少是國內新聞）電視臺/頻道之間輪換，以看到一些明智的新聞報道，特別是關於烏克蘭的新聞報道。<p>所謂 \"明智\"，我的意思是......大多數是腦殘的、無用的炒作訓練和拍拍屁股走人，但由於某些原因，我可以更好地處理來自國際主播的報道。<p>在過去幾周，我典型的輪換，按照我在每個人身上花費的時間排序，是。\n* 天空新聞（美國/英國）--不是以澳大利亞為基地的節目組。\n* 半島電視臺英語(卡塔爾)\n* 法國24小時英語（法國）\n* DW (德國)\n* TRT (土耳其)\n* CGTN (中國)\n* NDTV (印度)\n<p>PressTV（伊朗）在去年夏天消失了。<p>RT（俄羅斯）在過去的一天左右消失了。<p>DemocracyNow值得一提，因為它是獨立媒體，而且真的很好，即使它每週只有幾個小時。<p>福克斯新聞值得一提，儘管我不看它 -- 它至少偶爾會提供一個反駁CBS/NBS/etc. 我想你可以提出一個論點，在拜登政府將我們拖入第三次世界大戰的情況下，福克斯新聞_可以幫助減緩這列火車。<p>我想你可以準確地說，福克斯新聞（美國）是反美國的，至少是反民主黨的，當有一個民主黨人--總統時是反美國的，所以它確實對事情提供了另一種觀點，至少偶爾是這樣，這是件好事，我想。 <p>CGTN（中國）直到幾周前都是反美的，因為他們並不積極支持白宮在所有事情上的路線，但在過去幾周--在烏克蘭戰爭期間--他們只是重複播放習近平對一些工廠工人的講話。 <p>NDTV（印度）一直在全職報道他們的選舉--不確定他們是否會報道烏克蘭--到目前為止看起來還沒有。 <p>如果一個電視臺非常親美，或者沒有說任何關於美國意圖的壞話，他們會在youtube上被標記為：<p>&gt; [電視臺]全部或部分由[國家]政府贊助<p>另一方面，如果一個電視臺_非常親美，他們會被標記為：<p>&gt; [電視臺名稱]是一個[國家/法國/土耳其/等等。 <p>如果一個電視臺討厭美國的政策/意圖/任何東西，他們就會被停播/停網。<p>我錯過了哪些國際新聞頻道（或其他頻道）--仍在播出/停網？沒有。"
}