{
  "@type": "NewsArticle",
  "identifier": "2022--03--13--en--askhn--HackerNews--NewsArticle--30664898",
  "url": "https://news.ycombinator.com/item?id=30664898",
  "headline": "Ask HN: How do you plan and track your tasks?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "TLDR: I use Todoist, Clockify, Gitlab issues, Google Calendar to plan and track my work, but also have to use notion and slack in relation to tasks. I also used Trello extensively in the past.<p>My problem is that none of the tools I use covers all variants of things I need.<p>1-Clockify is good to track where my time goes (and is used by my employer to roughly track how much resource is used per project and kind of activity. It has no planning ability. So I should plan somewhere else and then use Clockify to track the time.\n2-We use Gitlab issues for tasks that relate to product features, bugs, ..., but it's not usable for meetings and such activities.\n3-Todoist is a good personal Todo list. It's good for things that either should be done on a specific time, or should be done in priority. Not good for things that should be done periodically, especially if you have many of those.\n4-For meetings, using a common calendar is a must. To be able to find free time, etc.\n5-Trello is great for a simple Kanban experience and for its core features, but for things like time tracking it rapidly becomes difficult to use.<p>So I end up having to check Todoist, Calendar, Gitlab issues regularly to decide what to do next. I also need to use Clockify to track the time of the task I chose from those products. If something from Todoist escalates to become a team task that should not go into Gitlab, I have to delegate it, and keep the task open in Todoist to remember the follow-up.<p>I think that experience is not optimal: I like to have one tool (that ideally integrates well with Calendar, Clockify, etc), but check one single place to decide what to do next, and track my time from there, and if I delegate, it should go in a separate list, and ideally I should get an even better experience if some of my team also use the same product.<p>I'm even ready to start a project if none exists, but I hope I can find something, as I know it would be a non-trivial effort.<p>1-How do you plan your team's tasks and your work related tasks ans personal tasks?\n2-Are you aware of such an all-in-one product?\n3-If not, do you think there is a reasonable demand for such a service?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "aljgz",
    "url": "https://news.ycombinator.com/user?id=aljgz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30664898",
  "sameAs": "https://news.ycombinator.com/item?id=30664898",
  "dateCreated": "2022-03-13T19:49:52.193Z",
  "datePublished": "2022-03-13T19:35:02.000Z",
  "dateModified": "2022-03-13T19:49:52.193Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何计划和跟踪你的任务？",
  "headline_zh-Hant": "Ask HN: 你如何計劃和跟蹤你的任務？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "TLDR：我使用Todoist、Clockify、Gitlab issues、Google Calendar来计划和跟踪我的工作，但也不得不使用与任务有关的notion和slack。<p>我的问题是，我使用的所有工具都没有涵盖我所需要的所有变量。<p>1-Clockify适合追踪我的时间去向（我的雇主也用它来大致追踪每个项目和活动种类使用了多少资源。它没有计划能力。所以我应该在其他地方计划，然后用Clockify来追踪时间。\n2-我们使用Gitlab issues来处理与产品功能、bug等有关的任务，但它不能用于会议和这类活动。\n3-Todoist是一个不错的个人Todo列表。它适合于那些应该在特定时间完成的事情，或者应该优先完成的事情。对于那些应该定期完成的事情，特别是如果你有很多这样的事情，就不太适合了。\n4-对于会议，使用一个共同的日历是必须的。为了能够找到空闲时间，等等。\n5-Trello对于简单的看板体验和核心功能来说是很好的，但对于像时间跟踪这样的事情，它很快就变得难以使用。<p>所以我最终不得不定期检查Todoist、日历、Gitlab问题，以决定下一步该做什么。我还需要使用Clockify来跟踪我从这些产品中选择的任务的时间。如果Todoist中的事情升级为团队任务，不应该进入Gitlab，我必须委托它，并在Todoist中保持任务开放，以记住后续工作。<p>我认为这种体验并不理想：我喜欢有一个工具（最好能与日历、Clockify等很好地整合），但只检查一个地方来决定下一步做什么，并从那里跟踪我的时间，如果我委托，它应该进入一个单独的列表，最好是我的一些团队也使用同一个产品，我应该得到更好的体验。 <p>如果没有的话，我甚至准备启动一个项目，但我希望能找到一些东西，因为我知道这将是一项非同小可的工作。<p>1-你是如何计划你的团队的任务和你的工作相关的任务Ans个人任务？\n2-你是否知道有这样一个一体化的产品？\n3-如果没有，你认为对这样的服务有合理的需求吗？",
  "description_zh-Hant": "TLDR：我使用Todoist、Clockify、Gitlab issues、Google Calendar來計劃和跟蹤我的工作，但也不得不使用與任務有關的notion和slack。<p>我的問題是，我使用的所有工具都沒有涵蓋我所需要的所有變量。<p>1-Clockify適合追蹤我的時間去向（我的僱主也用它來大致追蹤每個項目和活動種類使用了多少資源。它沒有計劃能力。所以我應該在其他地方計劃，然後用Clockify來追蹤時間。\n2-我們使用Gitlab issues來處理與產品功能、bug等有關的任務，但它不能用於會議和這類活動。\n3-Todoist是一個不錯的個人Todo列表。它適合於那些應該在特定時間完成的事情，或者應該優先完成的事情。對於那些應該定期完成的事情，特別是如果你有很多這樣的事情，就不太適合了。\n4-對於會議，使用一個共同的日曆是必須的。為了能夠找到空閒時間，等等。\n5-Trello對於簡單的看板體驗和核心功能來說是很好的，但對於像時間跟蹤這樣的事情，它很快就變得難以使用。<p>所以我最終不得不定期檢查Todoist、日曆、Gitlab問題，以決定下一步該做什麼。我還需要使用Clockify來跟蹤我從這些產品中選擇的任務的時間。如果Todoist中的事情升級為團隊任務，不應該進入Gitlab，我必須委託它，並在Todoist中保持任務開放，以記住後續工作。<p>我認為這種體驗並不理想：我喜歡有一個工具（最好能與日曆、Clockify等很好地整合），但只檢查一個地方來決定下一步做什麼，並從那裡跟蹤我的時間，如果我委託，它應該進入一個單獨的列表，最好是我的一些團隊也使用同一個產品，我應該得到更好的體驗。 <p>如果沒有的話，我甚至準備啟動一個項目，但我希望能找到一些東西，因為我知道這將是一項非同小可的工作。<p>1-你是如何計劃你的團隊的任務和你的工作相關的任務Ans個人任務？\n2-你是否知道有這樣一個一體化的產品？\n3-如果沒有，你認為對這樣的服務有合理的需求嗎？"
}