{
  "@type": "NewsArticle",
  "identifier": "2022--03--10--en--askhn--HackerNews--NewsArticle--30615777",
  "url": "https://news.ycombinator.com/item?id=30615777",
  "headline": "Has anyone made a fulfilling career out of tech/engineering support?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Like many people in my field (DevOps / SRE), I started my career working technical support. First it was low-level stuff for my university, but my first post-graduation job (CS degree) was doing Engineering Support at AWS. It was actually an extremely fun and rewarding job in most ways. Still, I got out of there as soon as I got a DevOps job offer somewhere. I think I just associated anything with &quot;support&quot; in the title as being a low-status and low-wage job. There's sort of an idea that being skilled at something is somewhat at odds with working on a shift like that and picking up phone calls from strangers.<p>But these days, especially when I find myself immersed in on-call type work, I actually find myself kind of nostalgic for support. It was a pretty good fit for me, for a few different reasons I can get into if asked.<p>But the core of my question, is there anyone here who actually did try to build a career moving up ladder for technical/engineering support? How is that working out? Do you ever think about switching into something else?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "sudosteph",
    "url": "https://news.ycombinator.com/user?id=sudosteph"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30615777",
  "sameAs": "https://news.ycombinator.com/item?id=30615777",
  "dateCreated": "2022-03-10T09:08:09.811Z",
  "datePublished": "2022-03-09T15:51:21.000Z",
  "dateModified": "2022-03-10T09:08:09.811Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      },
      "@version": 1.1
    }
  ],
  "description_zh-Hans": "和我所在领域的许多人一样（DevOps/SRE），我的职业生涯是从技术支持开始的。首先是为我的大学做低级别的工作，但我毕业后的第一份工作（CS学位）是在AWS做工程支持。这实际上是一份在大多数方面都非常有趣和有价值的工作。不过，我一得到DevOps的工作机会就马上离开了那里。我想我只是把标题中带有 \"支持 \"字样的工作与低地位和低工资的工作联系起来。有一种观点认为，熟练掌握某项技能与从事这样的工作和接听陌生人的电话是不相符的。<p>但这些天，特别是当我发现自己沉浸在待命的工作中时，我实际上发现自己有点怀念支持。这对我来说是一个很好的选择，因为有几个不同的原因，如果有人问我，我可以说出来。<p>但我问题的核心是，这里有没有人 [...]  [...] ",
  "description_zh-Hant": "和我所在領域的許多人一樣（DevOps/SRE），我的職業生涯是從技術支持開始的。首先是為我的大學做低級別的工作，但我畢業後的第一份工作（CS學位）是在AWS做工程支持。這實際上是一份在大多數方面都非常有趣和有價值的工作。不過，我一得到DevOps的工作機會就馬上離開了那裡。我想我只是把標題中帶有 \"支持 \"字樣的工作與低地位和低工資的工作聯繫起來。有一種觀點認為，熟練掌握某項技能與從事這樣的工作和接聽陌生人的電話是不相符的。<p>但這些天，特別是當我發現自己沉浸在待命的工作中時，我實際上發現自己有點懷念支持。這對我來說是一個很好的選擇，因為有幾個不同的原因，如果有人問我，我可以說出來。<p>但我問題的核心是，這裡有沒有人 [...]  [...] "
}