{
  "@type": "NewsArticle",
  "identifier": "2022--03--29--en--askhn--HackerNews--NewsArticle--30840992",
  "url": "https://news.ycombinator.com/item?id=30840992",
  "headline": "Ask HN: Tips on writing long-form non-fiction?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm currently in the midst of a pretty substantial non-fiction writing project (a series of critical essays altogether roughly the length of a short book).<p>I've written short essays before, but nothing of this scale. I've developed most of the ideas, fleshed them out, written rough explanations, etc. I know roughly how everything will string together. But I'm feeling kinda stuck and overwhelmed with the task before me, of assembling everything together, knowing where to put what, concerned whether I'll over-explain or repeat myself, etc etc.<p>One particular problem I'm experiencing is that, while I know and remember all the points I'm trying to make, I feel like I've kinda &quot;lost touch&quot; with some of them, like I'm just robotically piecing ideas together. It's hard to explain, but I hope that makes some sense.<p>Obviously, I'll probably figure out some of these things as I go, but it'd be nice to hear how others have navigated big complex (non-fiction) writing projects like this.<p>So, writers of long-form non-fiction (or non-fiction book writers even): What's your process for navigating all this?<p>Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30840992",
  "sameAs": "https://news.ycombinator.com/item?id=30840992",
  "dateCreated": "2022-03-29T11:26:43.056Z",
  "datePublished": "2022-03-29T10:54:54.000Z",
  "dateModified": "2022-03-29T11:26:43.056Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 写作长篇非小说的技巧？",
  "headline_zh-Hant": "Ask HN: 寫作長篇非小說的技巧？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我目前正在进行一个相当大的非虚构写作项目（一系列批评性文章，总长度约为一本短书）。<p>我以前也写过短文，但没有这种规模。我已经发展了大部分的想法，充实了它们，写了粗略的解释，等等。我大致知道所有的东西将如何串联起来。<p>我遇到的一个特别的问题是，虽然我知道并记住了我要表达的所有观点，但我觉得我对其中的一些观点有点失去了联系，就像我只是在机械地把观点拼凑起来。这很难解释，但我希望这有一定的意义。<p>显然，我可能会在工作中弄清楚其中的一些事情，但如果能听到其他人是如何驾驭这样复杂的（非小说类）大型写作项目的，那就更好了。<p>那么，长篇非小说类作家（甚至是非小说类图书作家）。你是如何驾驭这一切的呢？<p>谢谢!",
  "description_zh-Hant": "我目前正在進行一個相當大的非虛構寫作項目（一系列批評性文章，總長度約為一本短書）。<p>我以前也寫過短文，但沒有這種規模。我已經發展了大部分的想法，充實了它們，寫了粗略的解釋，等等。我大致知道所有的東西將如何串聯起來。<p>我遇到的一個特別的問題是，雖然我知道並記住了我要表達的所有觀點，但我覺得我對其中的一些觀點有點失去了聯繫，就像我只是在機械地把觀點拼湊起來。這很難解釋，但我希望這有一定的意義。<p>顯然，我可能會在工作中弄清楚其中的一些事情，但如果能聽到其他人是如何駕馭這樣複雜的（非小說類）大型寫作項目的，那就更好了。<p>那麼，長篇非小說類作家（甚至是非小說類圖書作家）。你是如何駕馭這一切的呢？<p>謝謝!"
}