{
  "@type": "NewsArticle",
  "identifier": "2022--03--28--en--askhn--HackerNews--NewsArticle--30827301",
  "url": "https://news.ycombinator.com/item?id=30827301",
  "headline": "Ask HN: Looking for a Tech Talk from Gov.uk",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Many years ago, I remember watching a tech talk from Gov.uk about how they design their websites. The general thrust of this talk was that, as a government service they had to be accessible to <i>literally</i> everyone in the UK. This included not just typical accessibility work, but also things like:<p>- They had to support positively ancient browsers like IE6 far longer than the rest of the internet, because some people had no choice of computing device, and the government had to serve them anyway.<p>- The people looking for information on Gov.uk usually aren't at their best or sharpest: they're usually stressed because they're in some kind of legal or health issue they're desperately looking to resolve, and the site had to accommodate for that with clear and understandable navigation.<p>- They ran user studies on usability and found that fancy date pickers tended to confuse people, and that it was far easier to just let people type dates with their keyboard. I think there were some other design notes in this vein throughout the talk.<p>Basically the whole thing was contrasting their approach with the typical, flashy, &quot;cutting-edge&quot; web development of the time. It ended (naturally) with a call for developers to apply to work there.<p>Try as I might I haven't been able to find this talk again. Does anyone know what this talk might be or where I might be able to find it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Kronopath",
    "url": "https://news.ycombinator.com/user?id=Kronopath"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30827301",
  "sameAs": "https://news.ycombinator.com/item?id=30827301",
  "dateCreated": "2022-03-28T05:10:09.326Z",
  "datePublished": "2022-03-28T05:03:17.000Z",
  "dateModified": "2022-03-28T05:10:09.326Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 寻找来自Gov.uk的技术讲座",
  "headline_zh-Hant": "Ask HN: 尋找來自Gov.uk的技術講座",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Many years ago, I remember watching a tech talk from Gov.uk about how they design their websites. 这个讲座的主旨是，作为一项政府服务，他们必须让英国的每个人都能访问。这不仅包括典型的无障碍工作，还包括：<p>- 他们必须支持像IE6这样的古老浏览器，时间远远超过互联网的其他部分，因为有些人无法选择计算设备，而政府必须为他们服务。 <p>- 在Gov.uk上寻找信息的人通常不是处于最佳状态或最敏锐的状态：他们通常处于紧张状态，因为他们正处于某种法律或健康问题中，他们急切地想要解决这些问题，而网站必须通过清晰易懂的导航来适应这种情况。<p>- 他们对可用性进行了用户研究，发现花哨的日期选择器往往会使人们感到困惑，而让人们用键盘输入日期要容易得多。我想在整个讲座中还有一些其他的设计说明。<p>基本上，整个讲座是将他们的方法与当时典型的、华丽的、&quot;前沿的&quot;网络开发进行对比。最后（自然）呼吁开发者申请在那里工作。<p>尽管我很努力，但还是没能再次找到这个讲座。有没有人知道这个讲座是什么，或者我在哪里可以找到它？",
  "description_zh-Hant": "Many years ago, I remember watching a tech talk from Gov.uk about how they design their websites. 這個講座的主旨是，作為一項政府服務，他們必須讓英國的每個人都能訪問。這不僅包括典型的無障礙工作，還包括：<p>- 他們必須支持像IE6這樣的古老瀏覽器，時間遠遠超過互聯網的其他部分，因為有些人無法選擇計算設備，而政府必須為他們服務。 <p>- 在Gov.uk上尋找信息的人通常不是處於最佳狀態或最敏銳的狀態：他們通常處於緊張狀態，因為他們正處於某種法律或健康問題中，他們急切地想要解決這些問題，而網站必須通過清晰易懂的導航來適應這種情況。<p>- 他們對可用性進行了用戶研究，發現花哨的日期選擇器往往會使人們感到困惑，而讓人們用鍵盤輸入日期要容易得多。我想在整個講座中還有一些其他的設計說明。<p>基本上，整個講座是將他們的方法與當時典型的、華麗的、&quot;前沿的&quot;網絡開發進行對比。最後（自然）呼籲開發者申請在那裡工作。<p>儘管我很努力，但還是沒能再次找到這個講座。有沒有人知道這個講座是什麼，或者我在哪裡可以找到它？"
}