{
  "@type": "NewsArticle",
  "identifier": "2022--04--01--en--askhn--HackerNews--NewsArticle--30874032",
  "url": "https://news.ycombinator.com/item?id=30874032",
  "headline": "Ask HN: Patterns or anti-patterns for driving technical change within an org?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm currently a senior software engineer at my company, and my medium-term career goal is to be promoted to staff engineer (and eventually, principal).  I'm aware that one marker of staff-plus engineers is the ability to drive technical change within the organization, and part of doing this is building organizational alignment around such a change.<p>There is a specific, major technical change that I'd love to see implemented in our org.  The details of the change aren't relevant here, but I am interested in hearing about specific patterns or anti-patterns around proposing such a change and building alignment around it.  I look at this process as very sales-like in nature, so things like:<p>-how to identify the key decision-makers (people who need to say yes, as well as people who get to say no).<p>-where in the org to start building support for the idea (i.e. top-down vs. bottom-up).<p>-how to frame the value proposition in order to maximize its appeal to my audience.<p>Side note- as I'm writing this, I'm realizing that this process is quite similar to enterprise sales, but from within the org as opposed to outside of it.  So anyone with enterprise sales experience, please share your hard-won lessons here.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "toomanyrichies",
    "url": "https://news.ycombinator.com/user?id=toomanyrichies"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30874032",
  "sameAs": "https://news.ycombinator.com/item?id=30874032",
  "dateCreated": "2022-04-01T02:41:37.045Z",
  "datePublished": "2022-04-01T00:52:51.000Z",
  "dateModified": "2022-04-01T02:41:37.045Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在一个组织内推动技术变革的模式或反模式？",
  "headline_zh-Hant": "Ask HN: 在一個組織內推動技術變革的模式或反模式？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我目前是公司的高级软件工程师，我的中期职业目标是晋升为职员工程师（最终是校长）。 我知道，职员以上的工程师的一个标志是有能力在组织内推动技术变革，而这样做的一部分是围绕这种变革建立组织的一致性。<p>有一个具体的、重大的技术变革，我很想看到在我们的组织中实施。 变化的细节在这里并不重要，但我想听听关于提出这种变化和围绕它建立一致性的具体模式或反模式。 我认为这个过程在本质上非常类似于销售，所以诸如：<p>如何确定关键的决策者（需要说 \"是 \"的人，以及可以说 \"不 \"的人）。<p>在组织中从哪里开始为这个想法建立支持（即自上而下与自下而上）。<p>如何确定价值主张的框架，以便最大限度地吸引我的听众。<p>附带说明--当我写这篇文章时，我意识到这个过程与企业销售非常相似，但是从组织内部而非外部。 因此，任何有企业销售经验的人，请在这里分享你来之不易的经验。",
  "description_zh-Hant": "我目前是公司的高級軟件工程師，我的中期職業目標是晉升為職員工程師（最終是校長）。 我知道，職員以上的工程師的一個標誌是有能力在組織內推動技術變革，而這樣做的一部分是圍繞這種變革建立組織的一致性。<p>有一個具體的、重大的技術變革，我很想看到在我們的組織中實施。 變化的細節在這裡並不重要，但我想聽聽關於提出這種變化和圍繞它建立一致性的具體模式或反模式。 我認為這個過程在本質上非常類似於銷售，所以諸如：<p>如何確定關鍵的決策者（需要說 \"是 \"的人，以及可以說 \"不 \"的人）。<p>在組織中從哪裡開始為這個想法建立支持（即自上而下與自下而上）。<p>如何確定價值主張的框架，以便最大限度地吸引我的聽眾。<p>附帶說明--當我寫這篇文章時，我意識到這個過程與企業銷售非常相似，但是從組織內部而非外部。 因此，任何有企業銷售經驗的人，請在這裡分享你來之不易的經驗。"
}