{
  "@type": "NewsArticle",
  "identifier": "2022--04--14--en--askhn--HackerNews--NewsArticle--31030740",
  "url": "https://news.ycombinator.com/item?id=31030740",
  "headline": "Ask HN: How can I best assist my wife with a career transition?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Some background first: I've been a software engineer for ~7 years now. I have a decently paying job, but we're definitely in the first base stretch of home ownership and have 2 children (~1 and ~4 years old).<p>My wife has a strong academic background in pedagogy and LOVES teaching high school, but with the pandemic teaching has really affected her relationship with our girls due to the sheer amount of work being dumped on her. Teacher and admin attrition at her school was suffering terribly and it was leading to her being forced to pick either continuing to work as a teacher and sacrifice all of her time with our kids or figure something else out. I was in awe of my wife's capacity for work and the number of plates she can keep spinning while still getting the highest teacher evaluation scores at her school... Only to be met with blanks stares when asked for assistance or any sort of compensation or promotion for the amount of work she was picking up.<p>So she left.<p>After some reflection, we're both worried that teaching in general is at a place where most schools will be similar. On top of this, she originally went into teaching thinking that I'd take mornings (get the kids ready and to school/ daycare) and she'd get afternoons since schools are usually out ~3pm. But since the pandemic school hours continue to stretch, further cutting down on what little time she can be with our children.<p>So, back to my question: She's at a crossroads, but my professional experience doesn't overlap much and most of my connections are not adjacent to education or instructional design. I'm poking my network and friends and family, but it's pretty difficult to find anyone willing to give her a chance outside of education. My gut is that she needs to talk with people because throwing resumes into the void isn't going to work if you're switching industries and don't have the right key words.<p>I'm very open to any advice, both to help her with some direction or for me with how I can best support her. Up until this point her career has been fairly straight forward, so I can tell it's weighing on her that she's not getting calls back from applications or much positive feedback.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "bluesroo",
    "url": "https://news.ycombinator.com/user?id=bluesroo"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31030740",
  "sameAs": "https://news.ycombinator.com/item?id=31030740",
  "dateCreated": "2022-04-14T18:12:20.272Z",
  "datePublished": "2022-04-14T18:01:25.000Z",
  "dateModified": "2022-04-14T18:12:20.272Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我如何才能最好地协助我的妻子进行职业转型？",
  "headline_zh-Hant": "Ask HN: 我如何才能最好地協助我的妻子進行職業轉型？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "首先是一些背景：我做软件工程师已经有7年了。我有一份收入不错的工作，但我们肯定是在买房的第一个阶段，有两个孩子（~1岁和~4岁）。<p>我的妻子有很强的教育学学术背景，喜欢在高中教书，但由于大流行病的影响，她和我们的女儿的关系真的受到影响，因为大量的工作被倾倒在她身上。她所在学校的教师和行政人员流失严重，这导致她被迫选择要么继续当老师，牺牲她与孩子们在一起的所有时间，要么想别的办法。我很敬畏我妻子的工作能力，以及她在学校获得最高教师评价分数的同时，还能不断旋转的盘子数量...... <p>所以她离开了。<p>经过一些思考，我们都担心，一般来说，教学工作处于一个大多数学校都会类似的位置。除此之外，她最初去教书的时候，以为我负责上午（把孩子准备好，去学校/托儿所），她负责下午，因为学校通常在下午~3点放学。但是，自从大流行以来，学校的上课时间不断延长，进一步削减了她与孩子们在一起的有限时间。她正处在一个十字路口，但我的专业经验并没有太多的重叠，而且我的大多数关系都与教育或教学设计不相干。我正在打听我的网络和朋友及家人，但很难找到愿意在教育之外给她一个机会的人。我的直觉是，她需要与人交谈，因为如果你要转换行业，而且没有正确的关键词，把简历扔到空白处是行不通的。<p>我非常愿意听取任何建议，既可以帮助她找到一些方向，也可以让我知道如何才能最好地支持她。在这之前，她的职业生涯一直是相当平坦的，所以我可以告诉她，她没有收到申请的电话或很多积极的反馈，这对她来说是个压力。",
  "description_zh-Hant": "首先是一些背景：我做軟件工程師已經有7年了。我有一份收入不錯的工作，但我們肯定是在買房的第一個階段，有兩個孩子（~1歲和~4歲）。<p>我的妻子有很強的教育學學術背景，喜歡在高中教書，但由於大流行病的影響，她和我們的女兒的關係真的受到影響，因為大量的工作被傾倒在她身上。她所在學校的教師和行政人員流失嚴重，這導致她被迫選擇要麼繼續當老師，犧牲她與孩子們在一起的所有時間，要麼想別的辦法。我很敬畏我妻子的工作能力，以及她在學校獲得最高教師評價分數的同時，還能不斷旋轉的盤子數量...... <p>所以她離開了。<p>經過一些思考，我們都擔心，一般來說，教學工作處於一個大多數學校都會類似的位置。除此之外，她最初去教書的時候，以為我負責上午（把孩子準備好，去學校/託兒所），她負責下午，因為學校通常在下午~3點放學。但是，自從大流行以來，學校的上課時間不斷延長，進一步削減了她與孩子們在一起的有限時間。她正處在一個十字路口，但我的專業經驗並沒有太多的重疊，而且我的大多數關係都與教育或教學設計不相干。我正在打聽我的網絡和朋友及家人，但很難找到願意在教育之外給她一個機會的人。我的直覺是，她需要與人交談，因為如果你要轉換行業，而且沒有正確的關鍵詞，把簡歷扔到空白處是行不通的。<p>我非常願意聽取任何建議，既可以幫助她找到一些方向，也可以讓我知道如何才能最好地支持她。在這之前，她的職業生涯一直是相當平坦的，所以我可以告訴她，她沒有收到申請的電話或很多積極的反饋，這對她來說是個壓力。"
}