{
  "@type": "NewsArticle",
  "identifier": "2022--03--21--en--askhn--HackerNews--NewsArticle--30750951",
  "url": "https://news.ycombinator.com/item?id=30750951",
  "headline": "Ask HN: GDPR Secure Database with Microservices/Service API",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, I’m a fairly senior Danish developer with a challenge. We’re building a database that needs to accommodate different users, and different applications with different data access on a field/column level. We want to mask certain forms of data and ideally we want to build it code-first. It’ll be setup using Azure, very likely Azure SQL. I have been reading through the official documentation, and in a non-code-first situation the Azure SQL functionality seems to tick most of the boxes, but Entity Framework seems to lack behind, or maybe I’m just not understanding the EF documentation correctly. We’ve discussed handling the security in an one-ring-to-rule-them-all API, possibly using .Net and Microsoft Odata with EF, but we’re already seeing a lot of users with that considering we rub react fronts and do a lot of computing in various Azure Functions.<p>An example “use case” is two asset and one investment manager accessing an asset where they all have different access to the information. The asset managers get access based on their team and seniority/responsibility, the investment manager gets access to GDPR sensitive data. Now add this scenarios a hundred times, and also add this happening in 3rd party data consumers.<p>In the future most of the access will happen through a MDM, but the future is an enterprise architecture abstract.<p>How would you approach this? Do you know a place to read up on best practices for this?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "EnKopVand",
    "url": "https://news.ycombinator.com/user?id=EnKopVand"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30750951",
  "sameAs": "https://news.ycombinator.com/item?id=30750951",
  "dateCreated": "2022-03-21T06:55:13.382Z",
  "datePublished": "2022-03-21T06:37:42.000Z",
  "dateModified": "2022-03-21T06:55:13.382Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 具有微服务/服务API的GDPR安全数据库",
  "headline_zh-Hant": "Ask HN: 具有微服務/服務API的GDPR安全數據庫",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，我是一个相当资深的丹麦开发者，有一个挑战。我们正在建立一个数据库，需要适应不同的用户，以及不同的应用程序在字段/列层面上的不同数据访问。我们想屏蔽某些形式的数据，最好是以代码先行的方式来构建。它将使用Azure设置，很可能是Azure SQL。我一直在阅读官方文档，在非代码优先的情况下，Azure SQL的功能似乎可以满足大部分的要求，但Entity Framework似乎还不够，也许我只是没有正确理解EF文档。我们已经讨论过在一个 \"一环套一环 \"的API中处理安全问题，可能会使用.Net和Microsoft Odata与EF，但考虑到我们在各种Azure功能中揉搓反应战线并进行大量的计算，我们已经看到很多用户使用这个功能。<p>一个 \"用例 \"是两个资产经理和一个投资经理访问一个资产，他们对信息都有不同的权限。资产经理根据他们的团队和资历/责任获得访问权，投资经理获得对GDPR敏感数据的访问权。现在将这种情况增加一百倍，并且还将这种情况发生在第三方数据消费者身上。<p>在未来，大多数访问将通过MDM发生，但未来是企业架构的抽象。<p>你将如何处理这个问题？你知道有什么地方可以读到这方面的最佳实践吗？",
  "description_zh-Hant": "嗨，HN，我是一個相當資深的丹麥開發者，有一個挑戰。我們正在建立一個數據庫，需要適應不同的用戶，以及不同的應用程序在字段/列層面上的不同數據訪問。我們想屏蔽某些形式的數據，最好是以代碼先行的方式來構建。它將使用Azure設置，很可能是Azure SQL。我一直在閱讀官方文檔，在非代碼優先的情況下，Azure SQL的功能似乎可以滿足大部分的要求，但Entity Framework似乎還不夠，也許我只是沒有正確理解EF文檔。我們已經討論過在一個 \"一環套一環 \"的API中處理安全問題，可能會使用.Net和Microsoft Odata與EF，但考慮到我們在各種Azure功能中揉搓反應戰線並進行大量的計算，我們已經看到很多用戶使用這個功能。<p>一個 \"用例 \"是兩個資產經理和一個投資經理訪問一個資產，他們對信息都有不同的權限。資產經理根據他們的團隊和資歷/責任獲得訪問權，投資經理獲得對GDPR敏感數據的訪問權。現在將這種情況增加一百倍，並且還將這種情況發生在第三方數據消費者身上。<p>在未來，大多數訪問將通過MDM發生，但未來是企業架構的抽象。<p>你將如何處理這個問題？你知道有什麼地方可以讀到這方面的最佳實踐嗎？"
}