{
  "@type": "NewsArticle",
  "identifier": "2022--03--18--en--askhn--HackerNews--NewsArticle--30718974",
  "url": "https://news.ycombinator.com/item?id=30718974",
  "headline": "Ask HN: How do Russia sanctions affect large tech companies?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I was able to find a couple HN articles from a few small entrepreneurs about the effect of sanctions [1] [2].<p>Does anyone know how sanctions apply to large tech companies?<p>For example, is Microsoft legally required to block Russian users from being able to download Windows security updates from Microsoft?  Seems like black hats will soon have a free-for-all on any and all Russian Windows machines if that's the case.<p>For that matter, what about the Internet itself?  Are companies in sanctioning countries legally required to firewall IP addresses that geolocate to Russia?  Are ISP's in sanctioning countries legally required to blackhole IP traffic coming to or from Russia?  Are transatlantic or land-based fiber optics running from EU, Japan or the US to Russia legally required to be shut down or even physically severed?<p>How do the companies that own those fibers pay for the fibers' operational and capital costs, considering that money now can't flow into or out of Russia?  Even if the fibers are <i>legally</i> allowed to operate, wouldn't there be a <i>financial</i> incentive to shut them off, because nobody's allowed to pay for them because of sanctions?  Are governments using tax dollars to replace the lost revenue, to keep those fibers open and allow some semblance of freedom of speech (and/or Western propaganda) to reach Russia?<p>Do the sanctions destroy Russian users' ability to access DRM-protected products they've already bought?  For example if you're in Russia and you bought X game on Steam pre-sanctions, is Steam legally required to say &quot;Sorry, because of sanctions I can't let you connect to the DRM server&quot; and the game's existing DRM checks then say &quot;Sorry, since you can't connect to the DRM server you can't play the game&quot;?<p>[1] https://news.ycombinator.com/item?id=30539958<p>[2] https://news.ycombinator.com/item?id=30505819",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "csense",
    "url": "https://news.ycombinator.com/user?id=csense"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30718974",
  "sameAs": "https://news.ycombinator.com/item?id=30718974",
  "dateCreated": "2022-03-18T05:27:52.559Z",
  "datePublished": "2022-03-18T05:18:48.000Z",
  "dateModified": "2022-03-18T05:27:52.559Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 俄罗斯制裁如何影响大型科技公司？",
  "headline_zh-Hant": "Ask HN: 俄羅斯制裁如何影響大型科技公司？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我能够从一些小企业家那里找到几篇关于制裁影响的HN文章[1][2]。<p>有谁知道制裁如何适用于大型科技公司？<p>例如，微软是否在法律上要求阻止俄罗斯用户从微软下载Windows安全更新？ 如果是这样的话，似乎黑帽子很快就会在任何和所有的俄罗斯Windows机器上自由活动。<p>就这个问题而言，互联网本身呢？ 受制裁国家的公司是否被法律要求对定位到俄罗斯的IP地址进行防火墙？ 受制裁国家的ISP是否被法律要求对进出俄罗斯的IP流量进行黑洞检测？ Are transatlantic or land-based fiber optics running from EU, Japan or the US to Russia legally required to be shut down or even physically severed?<p>How do the companies that own those fibers pay for the fibers' operational and capital costs, considering that money now can't flow into or out of Russia?  Even if the fibers are <i>legally</i> allowed to operate, wouldn't there be a <i>financial</i> incentive to shut them off, because nobody's allowed to pay for them because of sanctions?  政府是否用税收来替代损失的收入，以保持这些纤维的开放，并允许某种形式的言论自由（和/或西方宣传）进入俄罗斯？<p>制裁是否破坏了俄罗斯用户访问他们已经购买的受DRM保护的产品的能力？ 例如，如果你在俄罗斯，并在制裁前在Steam上购买了X游戏，Steam是否在法律上需要说&quot;对不起，由于制裁，我不能让你连接到DRM服务器&quot;，然后游戏的现有DRM检查说&quot;对不起，由于你不能连接到DRM服务器，你不能玩这个游戏&quot;？<p>[1] https://news.ycombinator.com/item?id=30539958<p>[2] https://news.ycombinator.com/item?id=30505819",
  "description_zh-Hant": "我能夠從一些小企業家那裡找到幾篇關於制裁影響的HN文章[1][2]。<p>有誰知道制裁如何適用於大型科技公司？<p>例如，微軟是否在法律上要求阻止俄羅斯用戶從微軟下載Windows安全更新？ 如果是這樣的話，似乎黑帽子很快就會在任何和所有的俄羅斯Windows機器上自由活動。<p>就這個問題而言，互聯網本身呢？ 受制裁國家的公司是否被法律要求對定位到俄羅斯的IP地址進行防火牆？ 受制裁國家的ISP是否被法律要求對進出俄羅斯的IP流量進行黑洞檢測？ Are transatlantic or land-based fiber optics running from EU, Japan or the US to Russia legally required to be shut down or even physically severed?<p>How do the companies that own those fibers pay for the fibers' operational and capital costs, considering that money now can't flow into or out of Russia?  Even if the fibers are <i>legally</i> allowed to operate, wouldn't there be a <i>financial</i> incentive to shut them off, because nobody's allowed to pay for them because of sanctions?  政府是否用稅收來替代損失的收入，以保持這些纖維的開放，並允許某種形式的言論自由（和/或西方宣傳）進入俄羅斯？<p>制裁是否破壞了俄羅斯用戶訪問他們已經購買的受DRM保護的產品的能力？ 例如，如果你在俄羅斯，並在制裁前在Steam上購買了X遊戲，Steam是否在法律上需要說&quot;對不起，由於制裁，我不能讓你連接到DRM服務器&quot;，然後遊戲的現有DRM檢查說&quot;對不起，由於你不能連接到DRM服務器，你不能玩這個遊戲&quot;？<p>[1] https://news.ycombinator.com/item?id=30539958<p>[2] https://news.ycombinator.com/item?id=30505819"
}