{
  "@type": "NewsArticle",
  "identifier": "2022--02--28--en--askhn--HackerNews--NewsArticle--30501321",
  "url": "https://news.ycombinator.com/item?id=30501321",
  "headline": "Ask HN: How do you judge if an employee should be retained?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi all!\nAs a disclaimer, this is a theoretical exercise which I want to understand more for myself so that I can negotiate better in the future.<p>I'm looking at how companies should answer the question: &quot;Should we give this employee the raise they are asking for right now or risk losing them in the near future?&quot;.<p>To do this, I want to know what it means when an employee is 'valuable' to their employer. In a nutshell, if an employee's value outweighs their new proposed salary, then it seems to me that they should be retained for their requested salary rather than risk losing them to another employer who will pay that and perhaps more.<p>Now the question is: &quot;How do I judge how valuable an employee is to their employer?&quot; I see a couple of variables to start off:<p>MARKET VALUE\nWhat is the employee worth to another employer? This can be judged fairly easily with some quick googling and job posts.<p>SKILL SET\nHow many people with the same skill set exist that could replace this person? Similar question to market value.<p>HISTORY\nWith the historical and legacy knowledge this person holds, how long and how difficult would it be to get someone with the same knowledge?<p>Do you have any other ideas on how to judge whether the employer should agree to an increase in their salary? Or in other words, how can I show my employer that I am worth the increase in salary I propose?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cauliflower99",
    "url": "https://news.ycombinator.com/user?id=cauliflower99"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30501321",
  "sameAs": "https://news.ycombinator.com/item?id=30501321",
  "dateCreated": "2022-02-28T16:12:47.743Z",
  "datePublished": "2022-02-28T15:59:56.000Z",
  "dateModified": "2022-02-28T16:12:47.743Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何判断一个员工是否应该被留用？",
  "headline_zh-Hant": "Ask HN: 你如何判斷一個員工是否應該被留用？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好!\n<p>我正在研究公司应该如何回答这个问题：&quot;我们应该给这个员工现在所要求的加薪，还是冒着在不久的将来失去他们的风险?&quot;。简而言之，如果一个员工的价值超过了他们新提出的工资，那么在我看来，应该以他们要求的工资留住他们，而不是冒着失去他们的风险，让另一个雇主支付这个工资甚至更多。<p>现在的问题是：&quot;我如何判断一个员工对其雇主的价值？&quot; 我认为有几个变量可以开始：<p>市场价值\n该员工对另一个雇主的价值是什么？这一点可以通过一些快速的谷歌搜索和招聘帖子来判断。<p>技能组合\n有多少具有相同技能的人可以取代这个人？与市场价值类似的问题。<p>历史\n以这个人所拥有的历史和遗留知识，要找一个拥有同样知识的人需要多长时间，有多大难度？<p>对于如何判断雇主是否应该同意增加他们的薪水，你有什么其他想法吗？或者换句话说，我怎样才能让雇主知道，我值得我提出的加薪？",
  "description_zh-Hant": "大家好!\n<p>我正在研究公司應該如何回答這個問題：&quot;我們應該給這個員工現在所要求的加薪，還是冒著在不久的將來失去他們的風險?&quot;。簡而言之，如果一個員工的價值超過了他們新提出的工資，那麼在我看來，應該以他們要求的工資留住他們，而不是冒著失去他們的風險，讓另一個僱主支付這個工資甚至更多。<p>現在的問題是：&quot;我如何判斷一個員工對其僱主的價值？&quot; 我認為有幾個變量可以開始：<p>市場價值\n該員工對另一個僱主的價值是什麼？這一點可以通過一些快速的谷歌搜索和招聘帖子來判斷。<p>技能組合\n有多少具有相同技能的人可以取代這個人？與市場價值類似的問題。<p>歷史\n以這個人所擁有的歷史和遺留知識，要找一個擁有同樣知識的人需要多長時間，有多大難度？<p>對於如何判斷僱主是否應該同意增加他們的薪水，你有什麼其他想法嗎？或者換句話說，我怎樣才能讓僱主知道，我值得我提出的加薪？"
}