{
  "@type": "NewsArticle",
  "identifier": "2022--03--24--en--askhn--HackerNews--NewsArticle--30793197",
  "url": "https://news.ycombinator.com/item?id=30793197",
  "headline": "Ask HN: I am stateless – trouble learning from feedback",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "TLDR: I am stateless in the sense that indirect and direct feedback of any kind is not incorporated into my behavior tomorrow. I feel like I am constantly being reset. I do not learn from what happened yesterday. I can learn a little bit over time, and change my opinion, but tomorrow I will most likely forget. I seem to be entirely dependent on my 'active memory' and situational cues as to what is going on. I define 'active memory' as being what has happened since I have woken up. It seems that 'recent memory' is defined officially as having a 30-second cutoff, and that is is not an issue with me, so be aware I am using a new term.<p>---<p>For a long time I have thought I suffered solely from the Dunning-Kruger effect. I would think I know how to do something, and then find out it took a lot more effort than usual, and thus I proved to myself that I was not that competent. Thus, I diagnosed myself as feeling superficially competent in areas where I have no expertise. Dunning-Kruger, right? I assumed a lot of people suffer from it, and I must be another moron. But despite this awareness of this self-diagnosis, and thinking about how I might be acting on it, I still feel competent in new areas when I should not. I wake the next day, and behold, I still see myself as competent.<p>But what I am suffering from is not limited to my beliefs about myself, which is unlike Dunning-Kruger. I have trouble changing any belief. For example, let's say that I ask a group of people about who knows git well - and someone starts to talk who I had previously never thought of as being competent in that area. The next day I will see that person the same way as I did before they helped me with the git issue. It is easy for me to think &quot;Wow, she really knows git well!&quot; and to change my opinion in that moment, but it is almost impossible for me to remember that the next day. On the next day I can partially remember that person being an expert in git, but somehow my opinion is separate and unchanging and I will still see them as not knowing git well. So lo and behold, in the same way, on waking the next way I see that person the same way as before.<p>I believe I have trouble learning from direct or indirect feedback (I am ignoring 'feedback' as business jargon for when a person talks to you about your performance, and that most google searches result for me). I keep 'touching the hot stove' and making the same judgement, having the same behavior, etc. The number one sign of stupidity is making the same mistake again and again, and I definitely fall into that category.<p>I also feel like I have to recreate my knowledge-base in my active memory each day. It is normal for me to be very confused, and to make inferences based on what I can deduce based on first-principles and almost no knowledge. I will take every situational cue I can to my advantage, as I cannot trust my memory. When it comes to learning something, I am heavily dependent on notes I have taken to teach myself how something works the next day. I am awful in the sense that I constantly try to appear smart to others, as I want to blend in as another competent individual.<p>Some questions:<p>Do you know what the technical term is of what I am going through, so I could learn more about it?<p>What does it mean when my mind seems to reset its opinions to the previous 24 hours?<p>What does it mean when your beliefs do not change, and despite being aware of it, you do not know how to stop it?<p>Do you have trouble remembering feedback? What is your hypothesis as to why?<p>How do you incorporate feedback into changing your opinion about yourself or someone or something into your long-term memory?<p>Are others stuck acting off of active memory only? Do people on HN suffer from memory deficits?<p>What happens when you get feedback from a mistake or learn something? What efforts do you take, either in your head or with tools to stay aware of it tomorrow?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "servytor",
    "url": "https://news.ycombinator.com/user?id=servytor"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30793197",
  "sameAs": "https://news.ycombinator.com/item?id=30793197",
  "dateCreated": "2022-03-24T17:54:34.870Z",
  "datePublished": "2022-03-24T17:48:27.000Z",
  "dateModified": "2022-03-24T17:54:34.870Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我是无国籍人--难以从反馈中学习",
  "headline_zh-Hant": "Ask HN: 我是無國籍人--難以從反饋中學習",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "TLDR：我是无状态的，因为任何形式的间接和直接反馈都没有纳入我明天的行为中。我感觉自己在不断地被重置。我不会从昨天的事情中学习。随着时间的推移，我可以学到一点东西，改变我的看法，但明天我很可能会忘记。我似乎完全依赖我的 \"主动记忆 \"和情景提示来判断发生了什么。我把'主动记忆'定义为自我醒来后所发生的事情。似乎'最近的记忆'被官方定义为有一个30秒的截止时间，这对我来说不是一个问题，所以请注意我在使用一个新的术语。<p>------<p>长期以来，我一直认为我只患有邓宁-克鲁格效应。我认为我知道如何做某件事情，然后发现它比平时花了更多的精力，因此我向自己证明，我并不是那么有能力。因此，我对自己的诊断是，在我没有专业知识的领域，我觉得自己的能力很肤浅。邓宁-克鲁格，对吗？我以为很多人都有这种情况，而我一定是另一个白痴。但是，尽管意识到了这种自我诊断，并思考了我可能是如何行事的，我仍然觉得自己在新的领域有能力，而我不应该这样。第二天醒来，看啊，我仍然认为自己有能力。<p>但我所遭受的并不限于我对自己的信念，这与邓宁-克鲁格的情况不同。我很难改变任何信念。例如，假设我向一群人询问谁对git很了解--有人开始说话，而我之前从未认为他在这方面有能力。第二天，我对这个人的看法会和他们帮助我解决git问题之前一样。我很容易想到&quot;哇，她真的很了解git！&quot;并在那一刻改变我的看法，但我几乎不可能在第二天记住这一点。第二天，我可以部分记住那个人是git专家，但不知为何，我的观点是独立的、不变的，我仍然会认为他们不了解git。所以，看吧，以同样的方式，在第二天醒来的时候，我对那个人的看法和以前一样。<p>我相信我很难从直接或间接的反馈中学习（我忽略了'反馈'这个商业行话，指的是当一个人和你谈论你的表现时，大多数谷歌搜索结果对我来说是这样的）。我一直在'摸着热炉'，做出同样的判断，有同样的行为，等等。愚蠢的头号标志是一而再再而三地犯同样的错误，而我绝对属于这一类。<p>我还觉得我每天都要在我的主动记忆中重新创建我的知识库。对我来说，非常困惑是正常的，我根据第一原则和几乎没有的知识所能推断出的东西进行推论。我会利用一切可以利用的情境线索，因为我不能相信自己的记忆。当涉及到学习某样东西时，我在很大程度上依赖于我所做的笔记，以便在第二天教自己某样东西如何运作。我很糟糕，因为我不断地试图在别人面前表现得很聪明，因为我想融入另一个有能力的人。<p>一些问题：<p>你知道我正在经历的事情的技术术语是什么吗，这样我可以了解更多？<p>当我的头脑似乎将其意见重置到前24小时时，这意味着什么？<p>当你的信念没有改变，尽管你意识到了，但你不知道如何阻止它，这意味着什么？<p>你在记忆反馈方面有问题吗？你对其原因的假设是什么？<p>你如何将反馈纳入改变你对自己或某人或某事的看法的长期记忆中？<p>其他人是否只停留在主动记忆的基础上行事？HN上的人有记忆缺陷吗？<p>当你从一个错误中得到反馈或学到一些东西时会发生什么？你做了哪些努力，无论是在你的头脑中还是用工具来保持明天的意识？",
  "description_zh-Hant": "TLDR：我是無狀態的，因為任何形式的間接和直接反饋都沒有納入我明天的行為中。我感覺自己在不斷地被重置。我不會從昨天的事情中學習。隨著時間的推移，我可以學到一點東西，改變我的看法，但明天我很可能會忘記。我似乎完全依賴我的 \"主動記憶 \"和情景提示來判斷髮生了什麼。我把'主動記憶'定義為自我醒來後所發生的事情。似乎'最近的記憶'被官方定義為有一個30秒的截止時間，這對我來說不是一個問題，所以請注意我在使用一個新的術語。<p>------<p>長期以來，我一直認為我只患有鄧寧-克魯格效應。我認為我知道如何做某件事情，然後發現它比平時花了更多的精力，因此我向自己證明，我並不是那麼有能力。因此，我對自己的診斷是，在我沒有專業知識的領域，我覺得自己的能力很膚淺。鄧寧-克魯格，對嗎？我以為很多人都有這種情況，而我一定是另一個白痴。但是，儘管意識到了這種自我診斷，並思考了我可能是如何行事的，我仍然覺得自己在新的領域有能力，而我不應該這樣。第二天醒來，看啊，我仍然認為自己有能力。<p>但我所遭受的並不限於我對自己的信念，這與鄧寧-克魯格的情況不同。我很難改變任何信念。例如，假設我向一群人詢問誰對git很瞭解--有人開始說話，而我之前從未認為他在這方面有能力。第二天，我對這個人的看法會和他們幫助我解決git問題之前一樣。我很容易想到&quot;哇，她真的很瞭解git！&quot;並在那一刻改變我的看法，但我幾乎不可能在第二天記住這一點。第二天，我可以部分記住那個人是git專家，但不知為何，我的觀點是獨立的、不變的，我仍然會認為他們不瞭解git。所以，看吧，以同樣的方式，在第二天醒來的時候，我對那個人的看法和以前一樣。<p>我相信我很難從直接或間接的反饋中學習（我忽略了'反饋'這個商業行話，指的是當一個人和你談論你的表現時，大多數谷歌搜索結果對我來說是這樣的）。我一直在'摸著熱爐'，做出同樣的判斷，有同樣的行為，等等。愚蠢的頭號標誌是一而再再而三地犯同樣的錯誤，而我絕對屬於這一類。<p>我還覺得我每天都要在我的主動記憶中重新創建我的知識庫。對我來說，非常困惑是正常的，我根據第一原則和幾乎沒有的知識所能推斷出的東西進行推論。我會利用一切可以利用的情境線索，因為我不能相信自己的記憶。當涉及到學習某樣東西時，我在很大程度上依賴於我所做的筆記，以便在第二天教自己某樣東西如何運作。我很糟糕，因為我不斷地試圖在別人面前表現得很聰明，因為我想融入另一個有能力的人。<p>一些問題：<p>你知道我正在經歷的事情的技術術語是什麼嗎，這樣我可以瞭解更多？<p>當我的頭腦似乎將其意見重置到前24小時時，這意味著什麼？<p>當你的信念沒有改變，儘管你意識到了，但你不知道如何阻止它，這意味著什麼？<p>你在記憶反饋方面有問題嗎？你對其原因的假設是什麼？<p>你如何將反饋納入改變你對自己或某人或某事的看法的長期記憶中？<p>其他人是否只停留在主動記憶的基礎上行事？HN上的人有記憶缺陷嗎？<p>當你從一個錯誤中得到反饋或學到一些東西時會發生什麼？你做了哪些努力，無論是在你的頭腦中還是用工具來保持明天的意識？"
}