{
  "@type": "NewsArticle",
  "identifier": "2022--02--21--en--askhn--HackerNews--NewsArticle--30421782",
  "url": "https://news.ycombinator.com/item?id=30421782",
  "headline": "Ask HN: Is remote work killing your network?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "After two years of being beaten into this <i>new</i> way of working I honestly feel more at a loss for what my career is than any other time in my life.<p>I've been doing software work about four years now, first year or so was at a big co. next two were at a series B startup (8 mo. in person the rest remote due to covid).<p>I took a full-remote job at another startup thinking their processes would be better calibrated and I'm finding being social / building any kind of work relationships being nothing but an uphill battle.  I'm not incredibly social outside of work, sure I can go to a bar and meet new people relative to a group of friends and don't necessarily think I have serious social anxiety (more than the average person) but the idea of 80% of accessible work for me (looking at my level of ability / experience / leetcode foo) is sort of freaking depressing.<p>My growth has without a doubt stalled, I can focus sort of but working from home with an office isn't great and having to pay for a noisy co-working space isn't exactly a &quot;win&quot; either.<p>I'm in New York currently, sort of decided to hold out while I have a group of friends here / sort of took a risk hoping office culture would sort of come back.  Realizing that's likely not looking like a probable outcome at this point and curious what others on HN think about this.  Even at the Big Co. I could get lunch with people, found mentorship relatively easily etc.  Now, it's this bizarre constant process of scheduling, trying to &quot;leverage&quot; the time of who you're talking to and all feels very effete and robotic.  I should also add that if I ever have to start doing meetings in VR I'll willingly just become a lumberjack and chuck my MacBook into the nearest river.<p>Basically, I'm on the fence in terms of moving into a rural area with cool outdoor things (and lower CoL) since why live in New York without an office.  Or stay in NYC for the &quot;network&quot; but what's the point if I'm not super social and if I don't have the chops to really see the comp gains you get working here?<p>The Future of Work TM is looking pretty bleak - what do you kind folks think?<p>Cheers!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "71a54xd",
    "url": "https://news.ycombinator.com/user?id=71a54xd"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30421782",
  "sameAs": "https://news.ycombinator.com/item?id=30421782",
  "dateCreated": "2022-02-21T23:10:37.471Z",
  "datePublished": "2022-02-21T22:51:49.000Z",
  "dateModified": "2022-02-21T23:10:37.471Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 远程工作是否正在扼杀你的网络？",
  "headline_zh-Hant": "Ask HN: 遠程工作是否正在扼殺你的網絡？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在被打入这种<i>新</i>工作方式的两年后，说实话，我比我生命中的任何时候都更不知自己的职业是什么。<p>我从事软件工作已经有四年了，第一年左右是在一家大公司，接下来两年是在一家B轮创业公司（8个月。<p>我在另一家创业公司接受了一份完全远程的工作，以为他们的流程会更好，但我发现社交/建立任何形式的工作关系都是一场艰难的战斗。 我在工作之外并不擅长社交，当然我可以去酒吧，相对于一群朋友来说，我可以认识新的人，而且不一定认为我有严重的社交焦虑（比一般人更多），但80%的无障碍工作对我来说（看我的能力/经验/leetcode foo的水平）的想法是有点吓人的沮丧。 <p>毫无疑问，我的成长已经停滞不前，我可以集中精力，但在家里办公不是很好，而且还得花钱买一个嘈杂的联合办公空间，这也不完全是一种&quot;赢&quot;。<p>我目前在纽约，在我有一群朋友在这里的时候，我有点决定坚持下去/有点冒险希望办公室文化会有点回来。 我意识到这很可能不是一个可能的结果，我很好奇HN上的其他人对此有何看法。 即使是在大公司，我也能与人共进午餐，相对容易地找到导师等等。 现在，这是一个奇怪的不断安排时间的过程，试图利用你正在交谈的人的时间，所有这些都让人感觉很累，很机械化。 我还应该补充说，如果我不得不开始在VR中进行会议，我会心甘情愿地成为一个伐木工人，把我的MacBook扔进最近的河里。<p>基本上，我正在犹豫是否要搬到一个有很酷的户外活动（和较低的CoL）的农村地区，因为为什么住在纽约没有办公室。 但是，如果我不善于社交，如果我没有能力真正看到在这里工作的薪酬收益，那又有什么意义呢？<p>工作的未来TM看起来很暗淡--你们这些好心人怎么看？",
  "description_zh-Hant": "在被打入這種<i>新</i>工作方式的兩年後，說實話，我比我生命中的任何時候都更不知自己的職業是什麼。<p>我從事軟件工作已經有四年了，第一年左右是在一家大公司，接下來兩年是在一家B輪創業公司（8個月。<p>我在另一家創業公司接受了一份完全遠程的工作，以為他們的流程會更好，但我發現社交/建立任何形式的工作關係都是一場艱難的戰鬥。 我在工作之外並不擅長社交，當然我可以去酒吧，相對於一群朋友來說，我可以認識新的人，而且不一定認為我有嚴重的社交焦慮（比一般人更多），但80%的無障礙工作對我來說（看我的能力/經驗/leetcode foo的水平）的想法是有點嚇人的沮喪。 <p>毫無疑問，我的成長已經停滯不前，我可以集中精力，但在家裡辦公不是很好，而且還得花錢買一個嘈雜的聯合辦公空間，這也不完全是一種&quot;贏&quot;。<p>我目前在紐約，在我有一群朋友在這裡的時候，我有點決定堅持下去/有點冒險希望辦公室文化會有點回來。 我意識到這很可能不是一個可能的結果，我很好奇HN上的其他人對此有何看法。 即使是在大公司，我也能與人共進午餐，相對容易地找到導師等等。 現在，這是一個奇怪的不斷安排時間的過程，試圖利用你正在交談的人的時間，所有這些都讓人感覺很累，很機械化。 我還應該補充說，如果我不得不開始在VR中進行會議，我會心甘情願地成為一個伐木工人，把我的MacBook扔進最近的河裡。<p>基本上，我正在猶豫是否要搬到一個有很酷的戶外活動（和較低的CoL）的農村地區，因為為什麼住在紐約沒有辦公室。 但是，如果我不善於社交，如果我沒有能力真正看到在這裡工作的薪酬收益，那又有什麼意義呢？<p>工作的未來TM看起來很暗淡--你們這些好心人怎麼看？"
}