{
  "@type": "NewsArticle",
  "identifier": "2022--03--05--en--askhn--HackerNews--NewsArticle--30571333",
  "url": "https://news.ycombinator.com/item?id=30571333",
  "headline": "Ask HN: A “Schindler's List” for our community affected by Ukraine invasion?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been reading with intense sadness about the evacuations of Russians and Ukrainians during this conflict. Even if they get out of harms way, they need to find a new place to live in the short term and then find alternative sources of income in the long term if their company is Russian.<p>Could we create a technology solution that aids people affected by this conflict in a way that helps both short and long term problems?<p>Fraud seems like an obvious issue. But when people post here, I can read their profile and see their GitHub contributions and know they are in my community. So I feel like we could help people in a way that limits fraud.<p>I'm feeling very helpless about this war. I'll happily contribute $500 directly to people if they need short term income or whatever, so please point me to those who need help right now and I'll do it. It's not a lot (I'm in a startup and don't have consistent income right now) but this world seems so crazy right now and I want to take some action to help.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "xrd",
    "url": "https://news.ycombinator.com/user?id=xrd"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30571333",
  "sameAs": "https://news.ycombinator.com/item?id=30571333",
  "dateCreated": "2022-03-05T20:10:35.833Z",
  "datePublished": "2022-03-05T20:01:53.000Z",
  "dateModified": "2022-03-05T20:10:35.833Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为我们受乌克兰入侵影响的社区制定 \"辛德勒的名单\"？",
  "headline_zh-Hant": "Ask HN: 為我們受烏克蘭入侵影響的社區制定 \"辛德勒的名單\"？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我一直在以强烈的悲伤心情阅读关于这场冲突中俄罗斯人和乌克兰人的疏散情况。即使他们脱离了危险，他们也需要在短期内找到新的住处，如果他们的公司是俄罗斯的，则需要在长期内找到其他的收入来源。<p>我们能否创造一个技术解决方案，以帮助受这场冲突影响的人，同时帮助解决短期和长期的问题？<p>欺诈似乎是一个明显的问题。但当人们在这里发帖时，我可以阅读他们的资料，看到他们在GitHub上的贡献，知道他们在我的社区里。所以我觉得我们可以通过限制欺诈的方式来帮助人们。<p>我对这场战争感到非常无助。如果人们需要短期收入或其他什么，我很乐意直接捐出500美元，所以请指给我那些现在需要帮助的人，我就会这么做。这不是很多（我在一家初创公司，现在没有稳定的收入），但这个世界现在看起来很疯狂，我想采取一些行动来帮助他们。",
  "description_zh-Hant": "我一直在以強烈的悲傷心情閱讀關於這場衝突中俄羅斯人和烏克蘭人的疏散情況。即使他們脫離了危險，他們也需要在短期內找到新的住處，如果他們的公司是俄羅斯的，則需要在長期內找到其他的收入來源。<p>我們能否創造一個技術解決方案，以幫助受這場衝突影響的人，同時幫助解決短期和長期的問題？<p>欺詐似乎是一個明顯的問題。但當人們在這裡發帖時，我可以閱讀他們的資料，看到他們在GitHub上的貢獻，知道他們在我的社區裡。所以我覺得我們可以通過限制欺詐的方式來幫助人們。<p>我對這場戰爭感到非常無助。如果人們需要短期收入或其他什麼，我很樂意直接捐出500美元，所以請指給我那些現在需要幫助的人，我就會這麼做。這不是很多（我在一家初創公司，現在沒有穩定的收入），但這個世界現在看起來很瘋狂，我想採取一些行動來幫助他們。"
}