{
  "@type": "NewsArticle",
  "identifier": "2022--04--10--en--askhn--HackerNews--NewsArticle--30976497",
  "url": "https://news.ycombinator.com/item?id=30976497",
  "headline": "Ask HN: Am I being too ambitious?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN!<p>Before I get into it, I just want to thank you all for the overwhelming responses I've received on my recent Ask HN (the one about my interest in many disciplines [0], I bring this up because it's all kinda related).<p>Sorry that this post is going to be long, because it's, well, ambitious. More ambitious than anything I've done with my life.<p>In short, I'm working on something that involves writing a series of long-form critical essays to be published on a website of my own. It's going to be a long process, so I'm hoping to get some feedback on the feasibility of it all.<p>I've been trying to keep this a secret for fear of judgement and of &quot;leaking my ideas&quot;, but I'm starting to think that keeping it so private may be doing more harm than good.<p>I'm sharing all this here now because I trust HN to give a diverse set of honest and critical feedback, which I really need. I also feel that HN is going to be the audience that will understand my overarching theses the most. I know there will be some people here that will disagree with my points, but that's part of the process and I'm prepared for that.<p>Anyway, there's a lot to unpack. I'll start with my backstory, as for me there really was a interesting narrative that led up to all this.<p>... (due to character limits, I'll have to continue in the comments) ...",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30976497",
  "sameAs": "https://news.ycombinator.com/item?id=30976497",
  "dateCreated": "2022-04-10T12:49:14.228Z",
  "datePublished": "2022-04-10T12:44:53.000Z",
  "dateModified": "2022-04-10T12:49:14.228Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 我是不是太有野心了？",
  "headline_zh-Hant": "Ask HN: 我是不是太有野心了？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，HN！<p>在我进入正题之前，我只想感谢大家对我最近的 \"提问HN\"（关于我对许多学科的兴趣[0]，我提出来是因为这一切都有点关系）的热烈回应。<p>很抱歉，这篇文章会很长，因为它，嗯，雄心勃勃。<p>简而言之，我正在做一件事，就是写一系列长篇批评文章，在我自己的网站上发表。这将是一个漫长的过程，所以我希望能得到一些关于这一切的可行性的反馈。<p>我一直在努力保守这个秘密，因为我害怕评判，害怕&quot;泄露我的想法&quot;，但我开始认为，如此保密可能是弊大于利。<p>我现在在这里分享这一切，因为我相信HN会给出一套多样化的诚实和批评的反馈，我真的需要这些。我还觉得，HN将是最能理解我的总体论点的受众。我知道这里会有一些人不同意我的观点，但这是这个过程的一部分，我已经做好了准备。<p>无论如何，有很多东西需要解读。我将从我的背景故事开始，因为对我来说，确实有一个有趣的叙述，导致了这一切。(由于字符的限制，我必须在评论中继续）......",
  "description_zh-Hant": "嘿，HN！<p>在我進入正題之前，我只想感謝大家對我最近的 \"提問HN\"（關於我對許多學科的興趣[0]，我提出來是因為這一切都有點關係）的熱烈迴應。<p>很抱歉，這篇文章會很長，因為它，嗯，雄心勃勃。<p>簡而言之，我正在做一件事，就是寫一系列長篇批評文章，在我自己的網站上發表。這將是一個漫長的過程，所以我希望能得到一些關於這一切的可行性的反饋。<p>我一直在努力保守這個秘密，因為我害怕評判，害怕&quot;洩露我的想法&quot;，但我開始認為，如此保密可能是弊大於利。<p>我現在在這裡分享這一切，因為我相信HN會給出一套多樣化的誠實和批評的反饋，我真的需要這些。我還覺得，HN將是最能理解我的總體論點的受眾。我知道這裡會有一些人不同意我的觀點，但這是這個過程的一部分，我已經做好了準備。<p>無論如何，有很多東西需要解讀。我將從我的背景故事開始，因為對我來說，確實有一個有趣的敘述，導致了這一切。(由於字符的限制，我必須在評論中繼續）......"
}