{
  "@type": "NewsArticle",
  "identifier": "2022--04--10--en--askhn--HackerNews--NewsArticle--30980095",
  "url": "https://news.ycombinator.com/item?id=30980095",
  "headline": "Ask HN: Why has iOS never had a control for restricting an app's network access?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "iPhoneOS/iOS/iPadOS has typically been good at providing privacy controls to the user, allowing them to choose whether to give an app access to their contacts, media, location, etc. They've also iterated on this over the years — moving from allowing you to only share all of your media or none of your media to allowing you to select which media can be accessed by an app. Similarly for location, instead of either sharing your precise location or not, you can now choose whether to give an app precise location, or a more general location.<p>However — I've thought on and off for years — I feel like an omission is a toggle to restrict an app's network access. I would be much more willing to give an app other permissions if I knew my data couldn't be uploaded somewhere. But in its current state, I almost never give an app permission to access (for example) my contacts because I assume that data will be uploaded and stored.<p>---<p>If I remember correctly, custom keyboard extensions don't have access to the network by default, unless you explicitly give them that permission. Why hasn't this been extended to all apps?<p>---<p>This also brings up another question — why has iOS never had fine-grained control over which contacts you share with an app? (Similar to how they updated the photos/media permissions in the last few years.)",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "davidbarker",
    "url": "https://news.ycombinator.com/user?id=davidbarker"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30980095",
  "sameAs": "https://news.ycombinator.com/item?id=30980095",
  "dateCreated": "2022-04-10T18:36:01.597Z",
  "datePublished": "2022-04-10T18:27:43.000Z",
  "dateModified": "2022-04-10T18:36:01.597Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么iOS从来没有限制应用程序的网络访问的控件？",
  "headline_zh-Hant": "Ask HN: 為什麼iOS從來沒有限制應用程序的網絡訪問的控件？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "iPhoneOS/iOS/iPadOS通常善于向用户提供隐私控制，允许他们选择是否让一个应用程序访问他们的联系人、媒体、位置等。多年来，他们在这方面也进行了迭代--从允许你只分享你的所有媒体或不分享你的媒体，到允许你选择哪些媒体可以被一个应用程序访问。<p>然而--我已经断断续续想了好几年了--我觉得一个遗漏是限制一个应用程序的网络访问的切换键。如果我知道我的数据不能被上传到某个地方，我就会更愿意给一个应用其他的权限。但在目前的状态下，我几乎从来没有给一个应用程序访问（例如）我的联系人的权限，因为我认为这些数据会被上传和存储。<p>----<p>如果我没有记错的话，自定义键盘扩展默认情况下是不能访问网络的，除非你明确给他们这个权限。为什么没有扩展到所有的应用程序？<p>----<p>这也带来了另一个问题----为什么iOS从来没有细化控制你与应用程序共享的联系人？",
  "description_zh-Hant": "iPhoneOS/iOS/iPadOS通常善於向用戶提供隱私控制，允許他們選擇是否讓一個應用程序訪問他們的聯繫人、媒體、位置等。多年來，他們在這方面也進行了迭代--從允許你只分享你的所有媒體或不分享你的媒體，到允許你選擇哪些媒體可以被一個應用程序訪問。<p>然而--我已經斷斷續續想了好幾年了--我覺得一個遺漏是限制一個應用程序的網絡訪問的切換鍵。如果我知道我的數據不能被上傳到某個地方，我就會更願意給一個應用其他的權限。但在目前的狀態下，我幾乎從來沒有給一個應用程序訪問（例如）我的聯繫人的權限，因為我認為這些數據會被上傳和存儲。<p>----<p>如果我沒有記錯的話，自定義鍵盤擴展默認情況下是不能訪問網絡的，除非你明確給他們這個權限。為什麼沒有擴展到所有的應用程序？<p>----<p>這也帶來了另一個問題----為什麼iOS從來沒有細化控制你與應用程序共享的聯繫人？"
}