{
  "@type": "NewsArticle",
  "identifier": "2022--03--04--en--askhn--HackerNews--NewsArticle--30556674",
  "url": "https://news.ycombinator.com/item?id=30556674",
  "headline": "Ask HN: Please tell me what to do with my life",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Please remove if this is not appropriate.<p>I'm feeling lost and miserable and I think a lot of it has to do with my complete lack of direction. I'm hoping someone more experienced can just tell me what to do next so I have a goal to work towards. I feel too numb to set any goals of my own - none of the options get me out of bed.<p>Some background about me.<p>I'm 22. I graduated about a year ago with a degree in Economics from a respected public university in the US. I'm a self taught programmer - never taken a CS course but I'm competent with Python, know my way around Linux, and learning Go. I'm fairly intelligent but not a genius.<p>I am working in a financial non-engineering role since graduation, but dropped my hours to part time because my anxiety and depression were getting worse and worse. So now I have a lot of free time. I'm still living at home.<p>Panic attacks have been getting worse but I'm seeing a therapist now and discussing medication so I am working on that.<p>I've thought about CS Masters programs or trying to get a real programming job but I worry my skills aren't up to scratch and I don't have enough projects on GitHub. I'd love to start a business but I have no idea which excites me.<p>I wish someone could just tell me &quot;Do X&quot; and I will just work toward that, setting sub-goals until I reach X. I feel like I'm on the verge of slipping into a failed life.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "o00ooo0o0oo0",
    "url": "https://news.ycombinator.com/user?id=o00ooo0o0oo0"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30556674",
  "sameAs": "https://news.ycombinator.com/item?id=30556674",
  "dateCreated": "2022-03-04T21:49:56.988Z",
  "datePublished": "2022-03-04T16:11:16.000Z",
  "dateModified": "2022-03-04T21:49:56.988Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 请告诉我，我的生活该怎么做",
  "headline_zh-Hant": "Ask HN: 請告訴我，我的生活該怎麼做",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "如果不合适，请删除。<p>我感到迷茫和痛苦，我认为这很大程度上与我完全缺乏方向有关。我希望有更有经验的人可以告诉我下一步该怎么做，这样我就有了一个可以努力的目标。我觉得自己太麻木了，无法设定任何自己的目标--没有一个选项能让我下床。<p>关于我的一些背景。大约一年前，我从美国一所受人尊敬的公立大学毕业，取得了经济学学位。我是一个自学成才的程序员--从未上过CS课程，但我能胜任Python，对Linux有一定的了解，并在学习Go。我相当聪明，但不是天才。<p>毕业后，我一直在从事非工程类的金融工作，但由于我的焦虑和抑郁症越来越严重，我的工作时间降到了兼职。所以现在我有很多空闲时间。我仍然住在家里。<p>恐慌症发作的情况越来越严重，但我现在正在看治疗师，并讨论药物治疗，所以我正在努力。<p>我想过CS硕士课程，或试图找到一份真正的编程工作，但我担心我的技能不符合要求，我在GitHub上没有足够的项目。<p>我希望有人能告诉我&quot;做X&quot;，我就会朝着这个方向努力，设定子目标，直到我达到X。",
  "description_zh-Hant": "如果不合適，請刪除。<p>我感到迷茫和痛苦，我認為這很大程度上與我完全缺乏方向有關。我希望有更有經驗的人可以告訴我下一步該怎麼做，這樣我就有了一個可以努力的目標。我覺得自己太麻木了，無法設定任何自己的目標--沒有一個選項能讓我下床。<p>關於我的一些背景。大約一年前，我從美國一所受人尊敬的公立大學畢業，取得了經濟學學位。我是一個自學成才的程序員--從未上過CS課程，但我能勝任Python，對Linux有一定的瞭解，並在學習Go。我相當聰明，但不是天才。<p>畢業後，我一直在從事非工程類的金融工作，但由於我的焦慮和抑鬱症越來越嚴重，我的工作時間降到了兼職。所以現在我有很多空閒時間。我仍然住在家裡。<p>恐慌症發作的情況越來越嚴重，但我現在正在看治療師，並討論藥物治療，所以我正在努力。<p>我想過CS碩士課程，或試圖找到一份真正的編程工作，但我擔心我的技能不符合要求，我在GitHub上沒有足夠的項目。<p>我希望有人能告訴我&quot;做X&quot;，我就會朝著這個方向努力，設定子目標，直到我達到X。"
}