{
  "@type": "NewsArticle",
  "identifier": "2022--04--12--en--askhn--HackerNews--NewsArticle--31008477",
  "url": "https://news.ycombinator.com/item?id=31008477",
  "headline": "Ask HN: I'm feeling stuck, how do I get out of it?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I’m a team lead but the job feels more like senior developer with some management responsibilities. In my previous job I had the same role but with much less hands on work and had the opportunity to lead multiple teams. I prefer that so I started looking for engineering management jobs.\nHere are some stats: ~30 applications out of ~100 reviewed job postings. Got 7 interviews out of which I didn’t pass the first or second interview step in 4. In the remaining 3 I didn’t pass the last interview with the hiring director or VP. These 3 interview processes took me a lot of time and energy. On average I had 6 interviews in each of them.<p>I’m not happy at my current job but I really try to be positive and productive as much as I can. The interviews are taking significant portion of my time and that affects my performance. At my current job I’m in the middle of very complex project which causes me a lot of stress. I joined this company with no previous experience in their tech stack. Somehow that didn’t matter for them and me. I thought this would be similar job to the previous one where I didn’t do much IC work. It isn’t and I think I made a mistake. Actually I took this job because I didn’t get another manager job I was interviewing for at the same time and the salary was much better than the one I had.<p>I don’t think I can leave my job right now to have more time for the job search. The financial risk will just increase my stress and it will negatively affect my interviews.<p>For the interviews I think I do everything I should (obviously not) by learning about the companies and their products, answering to questions with real examples from my experience (combined with how you are supposed to answer leadership/management questions), and being generally positive and enthusiastic about the jobs. I don’t get feedback from the companies even when I ask. Which I guess is expected due to possible legal risk or they just don’t bother.<p>The reason I’m looking for manager instead of team lead roles is that I don’t think I’m good with combining management and IC responsibilities. I feel way more confident when focusing only on one of them. I could go back to IC only role (I still get the thrill of solving problems with code) but I strongly prefer management responsibilities at this point. I understand that in a lot of companies managers are expected to be hands on but there are some that this is not the case and I got rejected at those.<p>So I really don’t know for how long I can keep doing this. It has been 4 months since I started looking for a new job and the current one is just getting more stressful due to mainly how I respond to the whole situation I’m in.<p>Does anyone with similar experiences have some ideas about how I can help myself?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "almostright",
    "url": "https://news.ycombinator.com/user?id=almostright"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31008477",
  "sameAs": "https://news.ycombinator.com/item?id=31008477",
  "dateCreated": "2022-04-12T21:41:42.097Z",
  "datePublished": "2022-04-12T21:32:41.000Z",
  "dateModified": "2022-04-12T21:41:42.097Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我觉得自己被困住了，如何才能摆脱困境？",
  "headline_zh-Hant": "Ask HN: 我覺得自己被困住了，如何才能擺脫困境？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个团队领导，但这个工作感觉更像是高级开发人员，有一些管理职责。在我之前的工作中，我也有同样的角色，但动手能力要差得多，而且有机会领导多个团队。我更喜欢这样，所以我开始寻找工程管理方面的工作。\n这里有一些统计数据。~在经过审查的约100个招聘信息中，有30份申请。得到了7个面试，其中4个面试我没有通过第一或第二步骤，在剩下的3个面试中，我没有通过与招聘主管或副总裁的最后面试。这三个面试过程花费了我大量的时间和精力。<p>我对我目前的工作并不满意，但我真的尽力做到积极和高效。面试占用了我很大一部分时间，这影响了我的表现。在我目前的工作中，我正处在一个非常复杂的项目中，这给我带来了很大的压力。我加入这家公司时，对他们的技术栈没有任何经验。不知何故，这对他们和我来说并不重要。我以为这将是一份类似于以前的工作，我没有做太多的IC工作。但事实并非如此，我认为我犯了一个错误。事实上，我接受这份工作是因为我没有得到我同时面试的另一份经理工作，而且薪水比我之前的工作要好得多。<p>我不认为我现在可以离开我的工作，以便有更多的时间来寻找工作。<p>对于面试，我认为我做了我应该做的一切（显然不是）：了解公司和他们的产品，用我的经验中的真实例子回答问题（结合你应该如何回答领导/管理问题），并对工作普遍持积极和热情的态度。即使我提出要求，也没有得到公司的反馈。<p>我之所以要找经理而不是团队领导的角色，是因为我不认为自己擅长将管理和IC责任结合起来。当我只专注于其中一个时，我觉得更有信心。我可以回到只做IC的角色（我仍然能感受到用代码解决问题的快感），但我现在非常喜欢管理职责。我知道在很多公司里，经理都被要求亲力亲为，但也有一些公司不是这样的，我在那些公司被拒绝了。自从我开始寻找新工作以来，已经有4个月了，目前的工作压力越来越大，主要是因为我如何应对我所处的整个情况。<p>有类似经历的人对我如何帮助自己有一些想法吗？",
  "description_zh-Hant": "我是一個團隊領導，但這個工作感覺更像是高級開發人員，有一些管理職責。在我之前的工作中，我也有同樣的角色，但動手能力要差得多，而且有機會領導多個團隊。我更喜歡這樣，所以我開始尋找工程管理方面的工作。\n這裡有一些統計數據。~在經過審查的約100個招聘信息中，有30份申請。得到了7個面試，其中4個面試我沒有通過第一或第二步驟，在剩下的3個面試中，我沒有通過與招聘主管或副總裁的最後面試。這三個面試過程花費了我大量的時間和精力。<p>我對我目前的工作並不滿意，但我真的盡力做到積極和高效。面試佔用了我很大一部分時間，這影響了我的表現。在我目前的工作中，我正處在一個非常複雜的項目中，這給我帶來了很大的壓力。我加入這家公司時，對他們的技術棧沒有任何經驗。不知何故，這對他們和我來說並不重要。我以為這將是一份類似於以前的工作，我沒有做太多的IC工作。但事實並非如此，我認為我犯了一個錯誤。事實上，我接受這份工作是因為我沒有得到我同時面試的另一份經理工作，而且薪水比我之前的工作要好得多。<p>我不認為我現在可以離開我的工作，以便有更多的時間來尋找工作。<p>對於面試，我認為我做了我應該做的一切（顯然不是）：瞭解公司和他們的產品，用我的經驗中的真實例子回答問題（結合你應該如何回答領導/管理問題），並對工作普遍持積極和熱情的態度。即使我提出要求，也沒有得到公司的反饋。<p>我之所以要找經理而不是團隊領導的角色，是因為我不認為自己擅長將管理和IC責任結合起來。當我只專注於其中一個時，我覺得更有信心。我可以回到只做IC的角色（我仍然能感受到用代碼解決問題的快感），但我現在非常喜歡管理職責。我知道在很多公司裡，經理都被要求親力親為，但也有一些公司不是這樣的，我在那些公司被拒絕了。自從我開始尋找新工作以來，已經有4個月了，目前的工作壓力越來越大，主要是因為我如何應對我所處的整個情況。<p>有類似經歷的人對我如何幫助自己有一些想法嗎？"
}