{
  "@type": "NewsArticle",
  "identifier": "2022--03--05--en--askhn--HackerNews--NewsArticle--30567593",
  "url": "https://news.ycombinator.com/item?id=30567593",
  "headline": "Ask HN: How can we fix Wikipedia?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi, not sure whether this is a good topic to discuss here or not but I keep seeing issues with Wikipedia which are getting worse with time, with regards to neutrality and editorialisation.<p>While Wikipedia's model seems far better than an individual publishing house's encyclopedia one where they can draw editors from millions of people throughout the world and are not bound by ads or sales to keep them afloat, in terms of editing it hasn't been working well.<p>Not every editor has equal power on Wikipedia. The more you have stayed on the site and the more time you spend on the site, you tend to have more say on what gets inside the articles. I have seen talk pages where the same three editors who seem to be part of the same echo chamber discussing issues preventing any alternative opinion or tone to come in the article. A behaviour very similar to Reddit where some subreddit moderators can sustain echo chambers by moderating anything not falling in line. In Wikipedia's case this often even leads to some sources getting picked over the other specially when it comes to media or books.<p>Is it possible to break the grasp of &quot;editors&quot; or is every user curated platform doomed to reach this state?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "actuator",
    "url": "https://news.ycombinator.com/user?id=actuator"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30567593",
  "sameAs": "https://news.ycombinator.com/item?id=30567593",
  "dateCreated": "2022-03-05T14:09:46.379Z",
  "datePublished": "2022-03-05T13:53:00.000Z",
  "dateModified": "2022-03-05T14:09:46.379Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们如何能修复维基百科？",
  "headline_zh-Hant": "Ask HN: 我們如何能修復維基百科？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>虽然维基百科的模式似乎比个别出版社的百科全书要好得多，因为他们可以从世界各地的数百万人中吸引编辑，而且不受广告或销售的约束，以维持他们的生存，但在编辑方面，它一直运作得不好。你在网站上停留的时间越长，你在网站上花费的时间越多，你往往对文章中的内容有更多的发言权。我曾见过一些谈话页，同样的三个编辑似乎是同一个回声室的一部分，他们讨论问题，阻止任何其他意见或语气进入文章。这种行为与Reddit非常相似，在Reddit上，一些子版块的版主可以通过审核任何不符合要求的内容来维持回声室。在维基百科的案例中，这甚至经常导致一些消息来源被选中，特别是当涉及到媒体或书籍时。<p>是否有可能打破&quot;编辑&quot;的控制，或者每个用户策划的平台都注定要达到这种状态？",
  "description_zh-Hant": "<p>雖然維基百科的模式似乎比個別出版社的百科全書要好得多，因為他們可以從世界各地的數百萬人中吸引編輯，而且不受廣告或銷售的約束，以維持他們的生存，但在編輯方面，它一直運作得不好。你在網站上停留的時間越長，你在網站上花費的時間越多，你往往對文章中的內容有更多的發言權。我曾見過一些談話頁，同樣的三個編輯似乎是同一個回聲室的一部分，他們討論問題，阻止任何其他意見或語氣進入文章。這種行為與Reddit非常相似，在Reddit上，一些子版塊的版主可以通過審核任何不符合要求的內容來維持回聲室。在維基百科的案例中，這甚至經常導致一些消息來源被選中，特別是當涉及到媒體或書籍時。<p>是否有可能打破&quot;編輯&quot;的控制，或者每個用戶策劃的平臺都註定要達到這種狀態？"
}