{
  "@type": "NewsArticle",
  "identifier": "2022--03--09--en--askhn--HackerNews--NewsArticle--30613315",
  "url": "https://news.ycombinator.com/item?id=30613315",
  "headline": "Ask HN: How to recognise image when parts of it may be occluded?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Problem: Given a frame from a mobile camera's video stream, I need to pick a reference image (from a corpus of images) that the given frame most closely resembles.  Input: Mobile frame, Output: file name of reference image. Sort of like a mobile version of TinEye or Google image search, except that the corpus is at most a few thousand images.<p>I can constrain the problem further. I can make sure that the mobile camera is positioned at about the same angle that the reference images were taken; but the mobile used to capture the reference may not be the same as the one 'in the field'; given the differences in resolution, lighting, different types of mobile camera specs etc, the images are bound to differ.<p>Second, it is possible that some part of the image to be identified is occluded (like a hand or a paper weight).<p>This needs to work on Android (which I am new to), and I don't have much of a background in image recognition. Ideally, if there is a way to fingerprint/hash the image in a way that is resistant to occlusion, rotation etc, and perhaps even the angle it is viewed from, that would be nice.  I have thought of using Unity+Vuforia, OpenCV, perceptual hashing (phash) but I'd be very grateful for comments from experienced devs. Thank you all.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "sriram_malhar",
    "url": "https://news.ycombinator.com/user?id=sriram_malhar"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30613315",
  "sameAs": "https://news.ycombinator.com/item?id=30613315",
  "dateCreated": "2022-03-09T12:02:50.164Z",
  "datePublished": "2022-03-09T11:19:43.000Z",
  "dateModified": "2022-03-09T12:02:50.164Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 当图像的一部分可能被遮挡时，如何识别图像？",
  "headline_zh-Hant": "Ask HN: 當圖像的一部分可能被遮擋時，如何識別圖像？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "问题：给定一个手机摄像头视频流中的帧，我需要从一个图像库中挑选一个与该帧最相近的参考图像。 输入。手机帧，输出：参考图像的文件名。这有点像移动版的TinEye或Google图片搜索，只是语料库最多只有几千张图片。我可以确保手机摄像头的位置与拍摄参考图片的角度大致相同；但用于拍摄参考图片的手机可能与 \"现场 \"的手机不一样；考虑到分辨率、照明、不同类型的手机摄像头规格等方面的差异，图片肯定会有所不同。 <p>其次，要识别的图像的某些部分有可能被遮挡（比如一只手或一个纸团）。<p>这需要在安卓系统上工作（我是新手），而且我没有什么图像识别的背景。理想情况下，如果有一种方法能够以抗遮挡、旋转等方式对图像进行指纹/哈希处理，甚至可能是观察的角度，那就更好了。 我想过使用Unity+Vuforia、OpenCV、感知散列（phash），但我非常感谢有经验的开发者的意见。谢谢大家。",
  "description_zh-Hant": "問題：給定一個手機攝像頭視頻流中的幀，我需要從一個圖像庫中挑選一個與該幀最相近的參考圖像。 輸入。手機幀，輸出：參考圖像的文件名。這有點像移動版的TinEye或Google圖片搜索，只是語料庫最多隻有幾千張圖片。我可以確保手機攝像頭的位置與拍攝參考圖片的角度大致相同；但用於拍攝參考圖片的手機可能與 \"現場 \"的手機不一樣；考慮到分辨率、照明、不同類型的手機攝像頭規格等方面的差異，圖片肯定會有所不同。 <p>其次，要識別的圖像的某些部分有可能被遮擋（比如一隻手或一個紙團）。<p>這需要在安卓系統上工作（我是新手），而且我沒有什麼圖像識別的背景。理想情況下，如果有一種方法能夠以抗遮擋、旋轉等方式對圖像進行指紋/哈希處理，甚至可能是觀察的角度，那就更好了。 我想過使用Unity+Vuforia、OpenCV、感知散列（phash），但我非常感謝有經驗的開發者的意見。謝謝大家。"
}