{
  "@type": "NewsArticle",
  "identifier": "2022--03--29--en--askhn--HackerNews--NewsArticle--30848405",
  "url": "https://news.ycombinator.com/item?id=30848405",
  "headline": "Ask HN: Building a good life after leaving NYC or similar city by yourself?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Moved out due to pandemic and I'm realizing that I'm probably not going to move back, at least not for the next few years, due to high rent in NYC right now, some safety and quality of life concerns, and my new job being permanently remote. All my jobs for entire adult life were tech jobs in NYC. I have no partner or family so I'm not moving &quot;towards&quot; anything or &quot;with&quot; anyone, I'm just gonna be alone by myself typing on the computer in a new area where I don't know anybody, but now I'll have to find some other way to cheer myself up besides telling myself that I'm headed home to my techy, artsy friends any month now. The bright spot is that I love the new job. Anybody else WFH in tech deal with a transition like this? How did you deal with sadness/isolation and find happy, inspiring stuff in your new location? Did you just have to develop new non-city interests and change your whole deal? I am totally open to loving my current life even more than I loved NYC and I'm actually super extroverted and socially confident but I still feel so sad and lost and really afraid of what isolation will do to me over an additional 1-2 years if I don't figure out how to stop feeling so lonely outside of working hours. Thanks for your thoughts.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "SadLeavingNYC",
    "url": "https://news.ycombinator.com/user?id=SadLeavingNYC"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30848405",
  "sameAs": "https://news.ycombinator.com/item?id=30848405",
  "dateCreated": "2022-03-29T21:10:35.146Z",
  "datePublished": "2022-03-29T21:09:55.000Z",
  "dateModified": "2022-03-29T21:10:35.146Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在离开纽约市或类似城市后，自己建立一个良好的生活？",
  "headline_zh-Hant": "Ask HN: 在離開紐約市或類似城市後，自己建立一個良好的生活？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "由于大流行病，我搬了出去，我意识到我可能不会搬回来，至少在未来几年不会，因为现在纽约市的租金很高，有一些安全和生活质量方面的问题，而且我的新工作是永久性的偏远地区。我整个成年生活中的所有工作都是在纽约市的技术工作。我没有伴侣，也没有家人，所以我不会向任何东西移动，也不会和任何人在一起，我只是会一个人在一个新的地区打电脑，我不认识任何人，但现在我必须找到一些其他的方式来让自己开心，除了告诉自己，我随时会回家找我的技术和艺术的朋友。亮点是，我喜欢这份新工作。有谁在技术领域的WFH处理过这样的过渡？你是如何处理悲伤/孤独，并在新的地方找到快乐和鼓舞人心的东西的？你是否不得不发展新的非城市兴趣并改变你的整个交易？我完全可以爱我现在的生活，甚至比我爱纽约市还要爱，而且我实际上超级外向，对社交很有信心，但我仍然感到非常悲伤和失落，而且非常害怕如果我不弄清楚如何在工作时间之外不再感到如此孤独，那么在未来的1-2年内，孤独会对我造成什么影响。谢谢你的想法。",
  "description_zh-Hant": "由於大流行病，我搬了出去，我意識到我可能不會搬回來，至少在未來幾年不會，因為現在紐約市的租金很高，有一些安全和生活質量方面的問題，而且我的新工作是永久性的偏遠地區。我整個成年生活中的所有工作都是在紐約市的技術工作。我沒有伴侶，也沒有家人，所以我不會向任何東西移動，也不會和任何人在一起，我只是會一個人在一個新的地區打電腦，我不認識任何人，但現在我必須找到一些其他的方式來讓自己開心，除了告訴自己，我隨時會回家找我的技術和藝術的朋友。亮點是，我喜歡這份新工作。有誰在技術領域的WFH處理過這樣的過渡？你是如何處理悲傷/孤獨，並在新的地方找到快樂和鼓舞人心的東西的？你是否不得不發展新的非城市興趣並改變你的整個交易？我完全可以愛我現在的生活，甚至比我愛紐約市還要愛，而且我實際上超級外向，對社交很有信心，但我仍然感到非常悲傷和失落，而且非常害怕如果我不弄清楚如何在工作時間之外不再感到如此孤獨，那麼在未來的1-2年內，孤獨會對我造成什麼影響。謝謝你的想法。"
}