{
  "@type": "NewsArticle",
  "identifier": "2022--04--12--en--askhn--HackerNews--NewsArticle--30998663",
  "url": "https://news.ycombinator.com/item?id=30998663",
  "headline": "Ask HN: How Do I Start a Startup?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Background: I have a lot of experience in various industries in various capacities, many of them executive leadership or directional, but certainly everything from engineering to leadership. Those include existing large entities as well as being there on “Day One” for startups that have raised hundreds of millions of dollars and achieved the vaunted unicorn status. I feel like I may have contacts in the “industry” but maybe not.<p>So I decided to Start My Own Thing. Kind of. I feel like I have good intuition here, maybe not, but much of that was within confines of existing entities and more importantly structures. So, started my own thing. Under my name pitched something under software and got a $100k contract, very easily, based on my personal capability alone.<p>I do not care about $100k, and it is almost not noteworthy. Except I feel like based on my industry knowledge I can turn this small contract into goodwill that can snowball into lots and lots of “small” B2B contracts of similar sizes and maybe be a real thing. I have a lot of talented SWEs in my rolodex I could call. But, assuming maybe I’m right, and I can turn this small thing into a big thing, I really don’t know what to do here. I am used to fast growing things. I am thinking come up with a company name and start a Delaware c corp, and then the for contract #2 and then maybe start pinging outside contacts at various SV firms for some seed capital to expand to similar deals 3-10? I really don’t know.<p>Overall: I feel like I have the skills, have some market fit (?), have the personal history, and could theoretically build a well-heeled team. But I have never actually started a startup myself and am totally lost. Can someone suggest a roadmap to the practical aspects of Starting a Startup?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "deathandgravity",
    "url": "https://news.ycombinator.com/user?id=deathandgravity"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30998663",
  "sameAs": "https://news.ycombinator.com/item?id=30998663",
  "dateCreated": "2022-04-12T04:42:24.894Z",
  "datePublished": "2022-04-12T04:35:02.000Z",
  "dateModified": "2022-04-12T04:42:24.894Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我如何启动一个创业公司？",
  "headline_zh-Hant": "Ask HN: 我如何啟動一個創業公司？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "背景。我在各个行业都有很多经验，其中很多是行政领导或方向性的工作，但当然也有从工程到领导的各种经验。这些经验包括现有的大型实体，以及在 \"第一天 \"就为创业公司提供服务，这些公司已经筹集了数亿美元的资金，并取得了令人羡慕的独角兽地位。我觉得我可能在 \"行业 \"中有联系，但也许没有。<p>所以我决定开始我自己的事情。算是吧。我觉得我在这里有很好的直觉，也许不是，但大部分是在现有实体的范围内，更重要的是结构。所以，开始了我自己的事情。用我的名字推销软件下的东西，得到了10万美元的合同，非常容易，仅凭我的个人能力。<p>我并不关心10万美元，这几乎不值得一提。除了我觉得基于我的行业知识，我可以把这个小合同变成商誉，可以像滚雪球一样变成很多很多类似规模的 \"小 \"B2B合同，也许是一个真正的东西。我的名册上有很多有才能的SWE，我可以打电话给他们。但是，假设也许我是对的，我可以把这个小东西变成一个大东西，我真的不知道该怎么做。我习惯于快速成长的事情。我在想，想出一个公司的名字，成立一个特拉华州的C公司，然后签订第2号合同，然后也许开始在各种SV公司的外部联系人中寻找一些种子资金，以扩大到类似的3-10号交易？我真的不知道。<p>总的来说：我觉得我有技能，有一定的市场契合度（？），有个人历史，理论上可以建立一个富裕的团队。但我自己从来没有真正开始过创业，完全迷失了方向。谁能为我提供一份关于启动创业公司的实践方面的路线图？",
  "description_zh-Hant": "背景。我在各個行業都有很多經驗，其中很多是行政領導或方向性的工作，但當然也有從工程到領導的各種經驗。這些經驗包括現有的大型實體，以及在 \"第一天 \"就為創業公司提供服務，這些公司已經籌集了數億美元的資金，並取得了令人羨慕的獨角獸地位。我覺得我可能在 \"行業 \"中有聯繫，但也許沒有。<p>所以我決定開始我自己的事情。算是吧。我覺得我在這裡有很好的直覺，也許不是，但大部分是在現有實體的範圍內，更重要的是結構。所以，開始了我自己的事情。用我的名字推銷軟件下的東西，得到了10萬美元的合同，非常容易，僅憑我的個人能力。<p>我並不關心10萬美元，這幾乎不值得一提。除了我覺得基於我的行業知識，我可以把這個小合同變成商譽，可以像滾雪球一樣變成很多很多類似規模的 \"小 \"B2B合同，也許是一個真正的東西。我的名冊上有很多有才能的SWE，我可以打電話給他們。但是，假設也許我是對的，我可以把這個小東西變成一個大東西，我真的不知道該怎麼做。我習慣於快速成長的事情。我在想，想出一個公司的名字，成立一個特拉華州的C公司，然後簽訂第2號合同，然後也許開始在各種SV公司的外部聯繫人中尋找一些種子資金，以擴大到類似的3-10號交易？我真的不知道。<p>總的來說：我覺得我有技能，有一定的市場契合度（？），有個人歷史，理論上可以建立一個富裕的團隊。但我自己從來沒有真正開始過創業，完全迷失了方向。誰能為我提供一份關於啟動創業公司的實踐方面的路線圖？"
}