{
  "@type": "NewsArticle",
  "identifier": "2022--04--11--en--askhn--HackerNews--NewsArticle--30983983",
  "url": "https://news.ycombinator.com/item?id=30983983",
  "headline": "Ask HN: Is joining AWS a bad idea? (MSFT, Oracle options)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I live in Redmond and work at Microsoft. I'm 38 and have a family. I'm an &quot;SRE&quot; with a security clearance working on government cloud stuff. Mostly DevOps type work, but using tools that are pretty awful (running production systems on Windows, no linux or kubernetes etc).<p>I've been interviewing lately because I really don't enjoy the product and tech I'm working on. My work life balance is pretty good, very short commute and my on-call is just tedious boring shit during the day. I've <i>never</i> been paged outside of work hours in 2 years.<p>I have two offers (Seattle)<p>Current total comp at Microsoft is ~250k<p>AWS: $300k L5 Cloud Engineer - working on internal build/development tools for the government clouds:  Manager says 2am pages will happen, and the team works 45-50 hours per week by his estimation.<p>Oracle: $325k (no benefits, W-2 contract). Sounds like I would be working with linux, kubernetes, java, python and doing DevOps for some data science platform. While I'm contracting, there are some work/life balance gaurdrails beacuse &gt;40 hours means I get paid (same rate $156.25/hr).<p>In all 3 scenarios, on-call requires trip to secure facility to work on the issue. At MSFT this has been a non-issue for me because the product is only really used in the day.<p>Most people have said &quot;Stay at Microsoft for life&quot; even if the pay is less.<p>AWS promises the most career growth (?) and RSU upside, probably at the cost of work/life balance which at my age is precious to me.<p>Everyone is saying don't take the Oracle contract, but the work sounds most interesting to me, and it seems pretty chill from the people I have talked to. It also is highest pay, by a small amount (after insuring my family), for the first 2 years.<p>Everyone on &quot;BLIND&quot; says AWS is absolute hell, unless you luck out on team/manager.<p>Advice from the non-blind crowd?<p>Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "locusofself",
    "url": "https://news.ycombinator.com/user?id=locusofself"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30983983",
  "sameAs": "https://news.ycombinator.com/item?id=30983983",
  "dateCreated": "2022-04-11T03:31:31.731Z",
  "datePublished": "2022-04-11T02:41:33.000Z",
  "dateModified": "2022-04-11T03:31:31.731Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 8
    }
  ],
  "headline_zh-Hans": "Ask HN: 加入AWS是个坏主意吗？(MSFT, Oracle选项)",
  "headline_zh-Hant": "Ask HN: 加入AWS是個壞主意嗎？(MSFT, Oracle選項)",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我住在雷德蒙，在微软工作。我今年38岁，有一个家庭。我是一名拥有安全许可的SRE，从事政府云计算方面的工作。Mostly DevOps type work, but using tools that are pretty awful (running production systems on Windows, no linux or kubernetes etc).<p>I've been interviewing lately because I really don't enjoy the product and tech I'm working on. My work life balance is pretty good, very short commute and my on-call is just tedious boring shit during the day. 两年来，我从来没有在工作时间以外被呼唤过。<p>我有两份工作（西雅图）<p>目前在微软的总薪酬约为25万<p>AWS：30万L5云工程师--为政府云计算提供内部构建/开发工具。 经理说凌晨2点的页面会出现，据他估计，团队每周工作45-50小时。<p>Oracle：32.5万美元（无福利，W-2合同）。听起来，我将与linux、kubernetes、java、python一起工作，为一些数据科学平台做DevOps。虽然我是合同工，但也有一些工作/生活平衡的保障，因为40小时意味着我可以得到报酬（同样的费率为156.25美元/小时）。<p>在所有三种情况下，待命需要前往安全设施来解决问题。在MSFT，这对我来说不是问题，因为该产品只在白天使用。<p>大多数人都说，即使工资较低，也要终身留在微软。<p>AWS承诺的职业发展（？）和RSU上升空间最大，可能要以工作/生活平衡为代价，而在我这个年龄，工作/生活平衡对我来说是很宝贵的。<p>每个人都说不要接受Oracle的合同，但工作对我来说听起来最有趣，而且从我谈过的人看来很冷漠。<p>每个人都在&quot;BLIND&quot;上说AWS绝对是地狱，除非你在团队/经理上运气好。<p>非盲目人群的建议？",
  "description_zh-Hant": "我住在雷德蒙，在微軟工作。我今年38歲，有一個家庭。我是一名擁有安全許可的SRE，從事政府雲計算方面的工作。Mostly DevOps type work, but using tools that are pretty awful (running production systems on Windows, no linux or kubernetes etc).<p>I've been interviewing lately because I really don't enjoy the product and tech I'm working on. My work life balance is pretty good, very short commute and my on-call is just tedious boring shit during the day. 兩年來，我從來沒有在工作時間以外被呼喚過。<p>我有兩份工作（西雅圖）<p>目前在微軟的總薪酬約為25萬<p>AWS：30萬L5雲工程師--為政府雲計算提供內部構建/開發工具。 經理說凌晨2點的頁面會出現，據他估計，團隊每週工作45-50小時。<p>Oracle：32.5萬美元（無福利，W-2合同）。聽起來，我將與linux、kubernetes、java、python一起工作，為一些數據科學平臺做DevOps。雖然我是合同工，但也有一些工作/生活平衡的保障，因為40小時意味著我可以得到報酬（同樣的費率為156.25美元/小時）。<p>在所有三種情況下，待命需要前往安全設施來解決問題。在MSFT，這對我來說不是問題，因為該產品只在白天使用。<p>大多數人都說，即使工資較低，也要終身留在微軟。<p>AWS承諾的職業發展（？）和RSU上升空間最大，可能要以工作/生活平衡為代價，而在我這個年齡，工作/生活平衡對我來說是很寶貴的。<p>每個人都說不要接受Oracle的合同，但工作對我來說聽起來最有趣，而且從我談過的人看來很冷漠。<p>每個人都在&quot;BLIND&quot;上說AWS絕對是地獄，除非你在團隊/經理上運氣好。<p>非盲目人群的建議？"
}