{
  "@type": "NewsArticle",
  "identifier": "2022--04--13--en--askhn--HackerNews--NewsArticle--31019887",
  "url": "https://news.ycombinator.com/item?id=31019887",
  "headline": "Ask HN: How much do you learn about a role before interviewing or accepting?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Problem: Interviews are laborious - they take significant prep (which has to be done on my own time inside a busy life), involve a day off work (at least, per company), and are significantly stressful experiences for me. I'll accept that.<p>I don't have many shots in me to shoot before I burn out from the process, and I want to work on problems that are interesting with people that are interesting as well for respectable salary. \nIt feels unprofessional to quit after 6 months when I realize the work is mostly duct taping prod systems with people who's company I don't enjoy. \nI'm 1.5 years into &quot;trying it out&quot; at my current place, and feel unwilling to do this again without better information going in.<p>But companies will give me NONE of this information prior to giving me an offer!<p>- One startup wouldn't share even the slightest hint of their pay ranges for someone at my level.\n- Another I asked if I could have a coffee meeting to see if it was a fit - recruiter immediately declined.\n- Spoke to multiple FANGetc. companies, and they don't team match until offer time. Some don't even do that until you've gone through their &quot;bootcamp&quot;!<p>I don't want to work at these places for the brand name (I've got my stripes). I'm after the people and the problems. But I can't get even a hint about either of these things without accepting the job and doing it first.<p>--&gt; It seems like a broken process, like I have to marry someone before meeting them.<p>I'm around the senior band and have somewhat of a niche in database storage engines and distributed storage platforms. Willing to switch it up to a degree.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "wnolens",
    "url": "https://news.ycombinator.com/user?id=wnolens"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31019887",
  "sameAs": "https://news.ycombinator.com/item?id=31019887",
  "dateCreated": "2022-04-13T20:43:50.734Z",
  "datePublished": "2022-04-13T20:34:13.000Z",
  "dateModified": "2022-04-13T20:43:50.734Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在面试或接受之前，你对一个角色有多少了解？",
  "headline_zh-Hant": "Ask HN: 在面試或接受之前，你對一個角色有多少了解？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "问题：面试很费劲--需要大量的准备工作（必须在繁忙的生活中利用自己的时间来完成），需要请一天假（至少在每家公司），而且对我来说是很有压力的经历。我接受这个事实。<p>在我从这个过程中精疲力竭之前，我没有多少镜头可以拍，而且我想和那些有趣的人一起处理有趣的问题，并获得可敬的薪水。\n当我意识到我的工作主要是和那些我不喜欢的人一起用胶带粘住prod系统时，6个月后辞职感觉很不专业。\n我在目前的地方已经尝试了1年半，如果没有更好的信息，我不愿意再这样做。<p>但公司在给我报价之前不会给我任何信息！<p>--一家初创公司甚至不愿意分享他们对我这个级别的人的薪酬范围的丝毫提示。\n- 另一家公司，我问我是否可以喝杯咖啡，看看是否合适--招聘人员立即拒绝了。\n- 我和多家FANG等公司谈过，他们在录用前都不会进行团队匹配。有些公司甚至在你通过他们的 \"训练营 \"之前都不会这样做！<p>我不想在这些地方为品牌名称工作（我已经有了自己的条纹）。我追求的是人和问题。但是，如果不接受这份工作，不先去做，我连这两件事的暗示都得不到。<p>--&gt;这似乎是一个破碎的过程，就像我在认识某人之前必须先和他结婚一样。<p>我大约是个资深人士，在数据库存储引擎和分布式存储平台方面有一些专长。愿意在一定程度上进行转换。",
  "description_zh-Hant": "問題：面試很費勁--需要大量的準備工作（必須在繁忙的生活中利用自己的時間來完成），需要請一天假（至少在每家公司），而且對我來說是很有壓力的經歷。我接受這個事實。<p>在我從這個過程中精疲力竭之前，我沒有多少鏡頭可以拍，而且我想和那些有趣的人一起處理有趣的問題，並獲得可敬的薪水。\n當我意識到我的工作主要是和那些我不喜歡的人一起用膠帶粘住prod系統時，6個月後辭職感覺很不專業。\n我在目前的地方已經嘗試了1年半，如果沒有更好的信息，我不願意再這樣做。<p>但公司在給我報價之前不會給我任何信息！<p>--一家初創公司甚至不願意分享他們對我這個級別的人的薪酬範圍的絲毫提示。\n- 另一家公司，我問我是否可以喝杯咖啡，看看是否合適--招聘人員立即拒絕了。\n- 我和多家FANG等公司談過，他們在錄用前都不會進行團隊匹配。有些公司甚至在你通過他們的 \"訓練營 \"之前都不會這樣做！<p>我不想在這些地方為品牌名稱工作（我已經有了自己的條紋）。我追求的是人和問題。但是，如果不接受這份工作，不先去做，我連這兩件事的暗示都得不到。<p>--&gt;這似乎是一個破碎的過程，就像我在認識某人之前必須先和他結婚一樣。<p>我大約是個資深人士，在數據庫存儲引擎和分佈式存儲平臺方面有一些專長。願意在一定程度上進行轉換。"
}