{
  "@type": "NewsArticle",
  "identifier": "2022--04--10--en--askhn--HackerNews--NewsArticle--30982320",
  "url": "https://news.ycombinator.com/item?id=30982320",
  "headline": "Ask HN: How do I shutdown a project my users love?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a college student at Carnegie Mellon. I built a utility-based social network for CMU students.<p>https://starterpack.live/<p>CMU has a yearly Carnival which was this weekend, so I chose to launch it then. In our first day, we penetrated about 50% of all undergrads, and we are getting good use. My idea is simple<p>1) We find a niche online community \n2) We find their problems \n3) We see which alternatives they use\n4) We solve each problem in a simple micro-web-app \n5) We add all the apps into one &quot;starterpack&quot;<p>Youtube cannot get users to view livestreams, but we can easily get Dota or LoL starterpack users to view livestreams. Except I messed up and launched too quickly since the semester is already soon over. This is not the right time to expand to other schools since summer is coming.<p>Further, I'm poor! I've had a horrible response from investors (can't beat incumbents, doesn't scale, solo-founder, part-time, have to find product market fit for each community, Reddit can just copy). I grew up sporadically homeless and my family is still financially troubled, so I will be working remotely at my internship and at my family restaurant until 11pm everyday this summer. It is so frustrating.<p>For the CMU starterpack, I am making a daily Wordle-like puzzle, updating the fence, moderating, and adding new features. However, even as more CMU students use it, I want to discontinue it as I realize this will be more prohibitive come summer than beneficial.<p>How do I gracefully shutdown so that I may revive the project next school year?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mapsdkhsd",
    "url": "https://news.ycombinator.com/user?id=mapsdkhsd"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30982320",
  "sameAs": "https://news.ycombinator.com/item?id=30982320",
  "dateCreated": "2022-04-10T22:31:04.983Z",
  "datePublished": "2022-04-10T22:22:55.000Z",
  "dateModified": "2022-04-10T22:31:04.983Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何关闭我的用户喜欢的项目？",
  "headline_zh-Hant": "Ask HN: 如何關閉我的用戶喜歡的項目？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是卡内基梅隆大学的一名大学生。我为CMU的学生建立了一个基于效用的社交网络。<p>https://starterpack.live/<p>CMU每年都有一个嘉年华，这个周末就是嘉年华，所以我选择在那时推出。在第一天，我们就渗透到了所有本科生中的50%，而且我们得到了很好的使用。我的想法很简单<p>1）我们找到一个利基的在线社区 \n2) 我们找到他们的问题 \n3) 我们看到他们使用哪些替代品\n4) 我们在一个简单的微型网络应用中解决每个问题 \n5) 我们将所有的应用程序添加到一个&quot;启动包&quot;<p>Youtube无法让用户观看现场直播，但我们可以很容易地让Dota或LoL启动包的用户观看现场直播。只是我搞砸了，因为学期已经快结束了，所以推出得太快了。现在不是扩展到其他学校的合适时机，因为夏天就要来了。<p>此外，我很穷！我的朋友们都很穷。我从投资者那里得到了可怕的回应（不能打败现有的公司，不能扩大规模，单独创始人，兼职，必须为每个社区找到适合的产品市场，Reddit可以直接复制）。我从小到大都是零星的无家可归，我的家庭仍然有经济问题，所以这个夏天我将在我的实习单位和我的家庭餐馆远程工作到晚上11点。这真是太令人沮丧了。<p>对于CMU的启动包，我每天都在制作类似Wordle的谜题，更新围栏，主持工作，并增加新的功能。然而，即使有更多的CMU学生使用它，我也想停止它，因为我意识到这在夏天的时候会让人望而却步，而不是受益。<p>我怎样才能优雅地关闭，以便在下一学年重新启动这个项目？",
  "description_zh-Hant": "我是卡內基梅隆大學的一名大學生。我為CMU的學生建立了一個基於效用的社交網絡。<p>https://starterpack.live/<p>CMU每年都有一個嘉年華，這個週末就是嘉年華，所以我選擇在那時推出。在第一天，我們就滲透到了所有本科生中的50%，而且我們得到了很好的使用。我的想法很簡單<p>1）我們找到一個利基的在線社區 \n2) 我們找到他們的問題 \n3) 我們看到他們使用哪些替代品\n4) 我們在一個簡單的微型網絡應用中解決每個問題 \n5) 我們將所有的應用程序添加到一個&quot;啟動包&quot;<p>Youtube無法讓用戶觀看現場直播，但我們可以很容易地讓Dota或LoL啟動包的用戶觀看現場直播。只是我搞砸了，因為學期已經快結束了，所以推出得太快了。現在不是擴展到其他學校的合適時機，因為夏天就要來了。<p>此外，我很窮！我的朋友們都很窮。我從投資者那裡得到了可怕的迴應（不能打敗現有的公司，不能擴大規模，單獨創始人，兼職，必須為每個社區找到適合的產品市場，Reddit可以直接複製）。我從小到大都是零星的無家可歸，我的家庭仍然有經濟問題，所以這個夏天我將在我的實習單位和我的家庭餐館遠程工作到晚上11點。這真是太令人沮喪了。<p>對於CMU的啟動包，我每天都在製作類似Wordle的謎題，更新圍欄，主持工作，並增加新的功能。然而，即使有更多的CMU學生使用它，我也想停止它，因為我意識到這在夏天的時候會讓人望而卻步，而不是受益。<p>我怎樣才能優雅地關閉，以便在下一學年重新啟動這個項目？"
}