{
  "@type": "NewsArticle",
  "identifier": "2022--02--24--en--askhn--HackerNews--NewsArticle--30461825",
  "url": "https://news.ycombinator.com/item?id=30461825",
  "headline": "Ask HN: Advice on a live video processing project",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN, I'd love some advice on live video processing for a hobby project I'm working on.<p>I'm currently working on placing a live camera on a beach. My current setup leaves a lot to be desired, but my main problem has been with video-processing-related stuff which I have had no contact with as a developer until now.<p>It consists of a camera-equipped microcontroller connected to WiFi that is constantly sending JPEGs to a server through HTTP POST requests. On the server side, these JPEGs get saved as files in a folder which in turn are converted to an RTMP live video feed - using ffmpeg - which gets sent to a streaming platform (Twitch or Youtube).<p>There are problems with my current approach mainly that ffmpeg &quot;finishes&quot; converting my JPEGs mid &quot;transmission&quot; (I use quotes here because all that means is that my microcontroller is still sending JPEGs to the server).<p>I searched extensively but I've had trouble formulating the queries given how specific my use-case seems to be, and have had little success in this regard. That leads me into believing that I'm commiting mistakes in my approach to this project - which is of no surprise, given my lack of experience in video, specially streaming.<p>So I'd like some pointers or suggestions from you - it could be pointed at any part of the process I'm currently doing, though what made me write this in the first place was the video streaming problems I'm facing. It could be general resources into encoders, decoders, transcoders, video in general... Or even just comment what you'd change to make streaming work.<p>Perhaps as a way of being more direct: how does can &quot;generic&quot; - as in normal practice - livestreaming be achieved without the help of something like OBS?<p>Thank you.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pedrolins",
    "url": "https://news.ycombinator.com/user?id=pedrolins"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30461825",
  "sameAs": "https://news.ycombinator.com/item?id=30461825",
  "dateCreated": "2022-02-24T23:39:34.112Z",
  "datePublished": "2022-02-24T23:33:32.000Z",
  "dateModified": "2022-02-24T23:39:34.112Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 对一个现场视频处理项目的建议",
  "headline_zh-Hant": "Ask HN: 對一個現場視頻處理項目的建議",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，我想就我正在进行的一个业余项目的现场视频处理提供一些建议。<p>我目前正在研究在海滩上放置一个现场摄像机。我目前的设置还有很多不足之处，但我的主要问题是与视频处理相关的东西，而我作为一个开发者，直到现在还没有接触过这些东西。<p>它包括一个装有摄像头的微控制器，与WiFi相连，通过HTTP POST请求不断向服务器发送JPEG文件。在服务器端，这些JPEGs被保存为一个文件夹中的文件，这些文件又被转换为RTMP直播视频--使用ffmpeg--被发送到一个流媒体平台（Twitch或Youtube）。 <p>我目前的方法有一些问题，主要是ffmpeg&quot;完成&quot;转换我的JPEGs在&quot;传输&quot;（我在这里使用引号，因为所有这意味着我的微控制器仍在向服务器发送JPEGs）。<p>我广泛地搜索，但鉴于我的用例似乎很具体，我在制定查询时遇到了困难，在这方面没有什么成功。这让我相信我在这个项目上犯了错误--鉴于我在视频方面缺乏经验，特别是流媒体方面，这并不奇怪。<p>所以我希望你能提供一些指导或建议--可以针对我目前正在做的过程中的任何部分，尽管让我首先写这个的原因是我所面临的视频流媒体问题。它可以是关于编码器、解码器、转码器、视频的一般资源...... <p>也许作为一种更直接的方式：如果没有像OBS这样的东西的帮助，如何实现&quot;generic&quot;--也就是正常的实践--的现场直播？",
  "description_zh-Hant": "你好，我想就我正在進行的一個業餘項目的現場視頻處理提供一些建議。<p>我目前正在研究在海灘上放置一個現場攝像機。我目前的設置還有很多不足之處，但我的主要問題是與視頻處理相關的東西，而我作為一個開發者，直到現在還沒有接觸過這些東西。<p>它包括一個裝有攝像頭的微控制器，與WiFi相連，通過HTTP POST請求不斷向服務器發送JPEG文件。在服務器端，這些JPEGs被保存為一個文件夾中的文件，這些文件又被轉換為RTMP直播視頻--使用ffmpeg--被髮送到一個流媒體平臺（Twitch或Youtube）。 <p>我目前的方法有一些問題，主要是ffmpeg&quot;完成&quot;轉換我的JPEGs在&quot;傳輸&quot;（我在這裡使用引號，因為所有這意味著我的微控制器仍在向服務器發送JPEGs）。<p>我廣泛地搜索，但鑑於我的用例似乎很具體，我在制定查詢時遇到了困難，在這方面沒有什麼成功。這讓我相信我在這個項目上犯了錯誤--鑑於我在視頻方面缺乏經驗，特別是流媒體方面，這並不奇怪。<p>所以我希望你能提供一些指導或建議--可以針對我目前正在做的過程中的任何部分，儘管讓我首先寫這個的原因是我所面臨的視頻流媒體問題。它可以是關於編碼器、解碼器、轉碼器、視頻的一般資源...... <p>也許作為一種更直接的方式：如果沒有像OBS這樣的東西的幫助，如何實現&quot;generic&quot;--也就是正常的實踐--的現場直播？"
}