{
  "@type": "NewsArticle",
  "identifier": "2022--04--03--en--askhn--HackerNews--NewsArticle--30897879",
  "url": "https://news.ycombinator.com/item?id=30897879",
  "headline": "Ask HN: Is there a reason for spam accounts only sending a single message?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Every once in awhile, when I get a spam message on social media (Facebook, Instagram, Telegram, etc), I chat for a bit just to see what the strategy is, do a Turing test, etc. Typically, I used to get a few messages that mostly ignore the questions I ask, and then send me a link to some website asking for my credit card details or something. Every once in awhile, I'd find that even though it seemed to be a spam account, someone seeming to be a human being would chat with me for days. Once, I found that it was actually an ex trying to stalk me. But lately, I've noticed that a lot of these spam accounts send a single, one word message, like &quot;Hello&quot;, &quot;Hola&quot; or an emoji, and then never respond to any messages, never send any links, never actively try to get anything from me at all. So my question is, is there some sort of spam or fishing strategy that I'm missing here? Am I falling for something without realizing it? Are these just lazy scammers?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "yosito",
    "url": "https://news.ycombinator.com/user?id=yosito"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30897879",
  "sameAs": "https://news.ycombinator.com/item?id=30897879",
  "dateCreated": "2022-04-03T16:12:07.962Z",
  "datePublished": "2022-04-03T15:58:19.000Z",
  "dateModified": "2022-04-03T16:12:07.962Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 垃圾邮件账户只发送一条信息有什么原因吗？",
  "headline_zh-Hant": "Ask HN: 垃圾郵件賬戶只發送一條信息有什麼原因嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "每隔一段时间，当我在社交媒体（Facebook、Instagram、Telegram等）上收到一条垃圾信息时，我就会聊上几句，就想看看是什么策略，做个图灵测试等等。通常情况下，我过去会收到一些信息，这些信息大多无视我问的问题，然后给我发一个链接到一些网站，要求我提供信用卡信息或其他东西。每隔一段时间，我就会发现，尽管这似乎是一个垃圾邮件账户，但有一个看起来是人类的人，会和我聊上几天。有一次，我发现它实际上是一个试图跟踪我的前任。但是最近，我注意到很多这些垃圾邮件账户只发送一个字的信息，比如&quot;你好&quot;，&quot;Hola&quot;或一个表情符号，然后从不回应任何信息，从不发送任何链接，根本不主动尝试从我这里获得任何东西。因此，我的问题是，是否有某种垃圾邮件或钓鱼策略，我在这里错过了？我是不是在不知不觉中上当了？这些只是懒惰的骗子吗？",
  "description_zh-Hant": "每隔一段時間，當我在社交媒體（Facebook、Instagram、Telegram等）上收到一條垃圾信息時，我就會聊上幾句，就想看看是什麼策略，做個圖靈測試等等。通常情況下，我過去會收到一些信息，這些信息大多無視我問的問題，然後給我發一個鏈接到一些網站，要求我提供信用卡信息或其他東西。每隔一段時間，我就會發現，儘管這似乎是一個垃圾郵件賬戶，但有一個看起來是人類的人，會和我聊上幾天。有一次，我發現它實際上是一個試圖跟蹤我的前任。但是最近，我注意到很多這些垃圾郵件賬戶只發送一個字的信息，比如&quot;你好&quot;，&quot;Hola&quot;或一個表情符號，然後從不迴應任何信息，從不發送任何鏈接，根本不主動嘗試從我這裡獲得任何東西。因此，我的問題是，是否有某種垃圾郵件或釣魚策略，我在這裡錯過了？我是不是在不知不覺中上當了？這些只是懶惰的騙子嗎？"
}