{
  "@type": "NewsArticle",
  "identifier": "2022--03--09--en--askhn--HackerNews--NewsArticle--30611003",
  "url": "https://news.ycombinator.com/item?id=30611003",
  "headline": "Ask HN: What to do when you keep failing upwards?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am an average engineer. I am not extremely bright nor I am technically gifted. I am just your bang average IT person, but For the last two-three years, I seem to have been failing upwards in my career without any reason.<p>I know my basic way around servers. I can write simple python scripts. I can google my way around the problems but that is the end of my wits. The only redeeming quality that I have is that I get well along with everyone. I am seeing my peers writing amazing scripts and doing exceptional jobs but for some reason, I am the one who is getting promoted and getting raises instead of them. Everywhere around me I see people vastly more competent in what they do. And I'm pretty sure to them it's obvious I'm just copying what they do but worse.<p>Now I have started getting calls from Fortune 100 companies for management positions and I am not sure I would ever survive there. I don't know what to do here.<p>Has any of you ever experienced this?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "rootsu",
    "url": "https://news.ycombinator.com/user?id=rootsu"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30611003",
  "sameAs": "https://news.ycombinator.com/item?id=30611003",
  "dateCreated": "2022-03-09T04:55:47.708Z",
  "datePublished": "2022-03-09T04:39:08.000Z",
  "dateModified": "2022-03-09T04:55:47.708Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 当你不断往上失败时，该怎么办？",
  "headline_zh-Hant": "Ask HN: 當你不斷往上失敗時，該怎麼辦？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个普通的工程师。我不是非常聪明，也没有技术上的天赋。我只是一个普通的IT人，但在过去的两三年里，我似乎一直在没有任何理由地在我的职业生涯中不断失败。我可以编写简单的Python脚本。我可以用谷歌来解决这些问题，但这是我智慧的尽头。我唯一值得称道的品质是，我和大家相处得很好。我看到我的同龄人写出了令人惊叹的脚本，做了出色的工作，但由于某些原因，我是那个得到晋升和加薪的人，而不是他们。在我周围的每一个地方，我看到人们在他们的工作中都有很大的能力。我敢肯定，对他们来说，我显然只是在复制他们的工作，但更糟糕。<p>现在，我开始接到财富100强公司的管理职位的电话，我不确定我是否能在那里生存。我不知道该怎么办。<p>你们中有人遇到过这种情况吗？",
  "description_zh-Hant": "我是一個普通的工程師。我不是非常聰明，也沒有技術上的天賦。我只是一個普通的IT人，但在過去的兩三年裡，我似乎一直在沒有任何理由地在我的職業生涯中不斷失敗。我可以編寫簡單的Python腳本。我可以用谷歌來解決這些問題，但這是我智慧的盡頭。我唯一值得稱道的品質是，我和大家相處得很好。我看到我的同齡人寫出了令人驚歎的腳本，做了出色的工作，但由於某些原因，我是那個得到晉升和加薪的人，而不是他們。在我周圍的每一個地方，我看到人們在他們的工作中都有很大的能力。我敢肯定，對他們來說，我顯然只是在複製他們的工作，但更糟糕。<p>現在，我開始接到財富100強公司的管理職位的電話，我不確定我是否能在那裡生存。我不知道該怎麼辦。<p>你們中有人遇到過這種情況嗎？"
}