{
  "@type": "NewsArticle",
  "identifier": "2022--04--07--en--askhn--HackerNews--NewsArticle--30939120",
  "url": "https://news.ycombinator.com/item?id=30939120",
  "headline": "Ask HN: “Managing Up” – Working with the C-level",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This is from the perspective of someone on the IT side, non-dev, in the corporate trenches (2k-3k person org).<p>1) I like the people I work with, I moderately like the work I'm doing, but one of the constant blockers for having work done is that it runs through the CTO to complete stuff, like ordering equipment/software. They have explicitly stated before that the company doesn't have any issues spending yet they want to be involved in every approval, which can 1-2 weeks.<p>2) I'm trying to convince myself of the Amazon &quot;disagree and commit&quot; mantra but maybe I am not emotionally mature enough to do so? For some of the proposals and teams that I think have a high chance of failure and really don't move the needle on the change this person wants to see, I want to be able to shrug and tell myself that it is what it is but the thing is I'll be forced to but time and energy into mitigated it if it does fail.<p>Plenty of people would say 'Look for something else' but I was already passed up for role by this person because of my 'lack of experience'. The person that then took the role, when I passed over my docs and proposals, said they were amazing and they look forward to working on it. I've found myself at crossroads, don't really know where to go in the working world because I keep running into barriers like the above where I question if I'm even fit to work in a company at all.<p>Thanks for any advice. Feel free to PM.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "JBlue42",
    "url": "https://news.ycombinator.com/user?id=JBlue42"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30939120",
  "sameAs": "https://news.ycombinator.com/item?id=30939120",
  "dateCreated": "2022-04-07T00:39:50.174Z",
  "datePublished": "2022-04-07T00:19:42.000Z",
  "dateModified": "2022-04-07T00:39:50.174Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: \"向上管理\"--与C级人员合作",
  "headline_zh-Hant": "Ask HN: \"向上管理\"--與C級人員合作",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>1）我喜欢和我一起工作的人，我适度地喜欢我正在做的工作，但完成工作的一个经常性障碍是要通过CTO来完成东西，如订购设备/软件。他们之前明确表示，公司没有任何问题的支出，但他们却希望参与每一次的审批，这可能需要1-2周的时间。<p>2）我试图说服自己相信亚马逊的&quot;不同意和承诺&quot;口号，但也许我在情感上还不够成熟？对于一些我认为很有可能失败的提案和团队，而且确实无法推动这个人希望看到的变化，我希望能够耸耸肩，告诉自己，这就是它，但问题是，如果它真的失败了，我将被迫花时间和精力来缓解它。<p>很多人会说'寻找其他东西'，但我已经被这个人放弃了，因为我'缺乏经验'。当我把我的文件和建议传给他时，他说这些文件和建议非常好，他们期待着工作的开展。我发现自己处于十字路口，不知道该往哪里走，因为我总是遇到像上面那样的障碍，我怀疑自己是否适合在一家公司工作。如果您有任何建议，请随时联系我。",
  "description_zh-Hant": "<p>1）我喜歡和我一起工作的人，我適度地喜歡我正在做的工作，但完成工作的一個經常性障礙是要通過CTO來完成東西，如訂購設備/軟件。他們之前明確表示，公司沒有任何問題的支出，但他們卻希望參與每一次的審批，這可能需要1-2周的時間。<p>2）我試圖說服自己相信亞馬遜的&quot;不同意和承諾&quot;口號，但也許我在情感上還不夠成熟？對於一些我認為很有可能失敗的提案和團隊，而且確實無法推動這個人希望看到的變化，我希望能夠聳聳肩，告訴自己，這就是它，但問題是，如果它真的失敗了，我將被迫花時間和精力來緩解它。<p>很多人會說'尋找其他東西'，但我已經被這個人放棄了，因為我'缺乏經驗'。當我把我的文件和建議傳給他時，他說這些文件和建議非常好，他們期待著工作的開展。我發現自己處於十字路口，不知道該往哪裡走，因為我總是遇到像上面那樣的障礙，我懷疑自己是否適合在一家公司工作。如果您有任何建議，請隨時聯繫我。"
}