{
  "@type": "NewsArticle",
  "identifier": "2022--03--29--en--askhn--HackerNews--NewsArticle--30842263",
  "url": "https://news.ycombinator.com/item?id=30842263",
  "headline": "Ask HN: Can I get my Amazon account back?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I was recently contacted by an Amazon recruiter and asked to apply for a few jobs in my area. Upon realizing that I gave him the email of my regular Amazon account, I endeavored to re-activate it after it had previously been locked by Amazon for apparent suspicious activity. I'm fairly sure I called them at the time, with no result, but this time around, they're telling me to get fucked, essentially.<p>The first rep I spoke to said that because I had no purchase history in the last year, she was unable to verify my account, even after sending me a 2FA auth code, and refusing to accept any prior confirmation codes or information from any other receipts I had in my archive.<p>The second rep I spoke to said that my account &quot;did not have the information available to answer the questions needed to verify my account&quot; and that she &quot;can't tell me what that required information is, because my system tells me the account doesn't have it&quot;.<p>I've used this account for many years, and yes I haven't used it for purchases in a year, because largely I didn't have a job and didn't have the time to go through a lengthy phone tree. At no point was I told me account would become irrecoverable. Now though, they're telling me my only option is to re-create the account with the same email address, obviously losing my purchase history and any documents or other records I've uploaded over the years. This is all not to say there wasn't suspicious activity on the account. There was, and I did contact Amazon about this, and they were not able to help me before locking the account.<p>Do I have any recourse? This seems insane. I'm in Canada.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "brailsafe",
    "url": "https://news.ycombinator.com/user?id=brailsafe"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30842263",
  "sameAs": "https://news.ycombinator.com/item?id=30842263",
  "dateCreated": "2022-03-29T13:44:40.647Z",
  "datePublished": "2022-03-29T13:28:22.000Z",
  "dateModified": "2022-03-29T13:44:40.647Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 我可以拿回我的亚马逊账户吗？",
  "headline_zh-Hant": "Ask HN: 我可以拿回我的亞馬遜賬戶嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "最近，亚马逊的招聘人员与我联系，要求我申请我所在地区的几个工作。在意识到我给了他我的普通亚马逊账户的电子邮件后，我努力重新激活它，因为它之前因为明显的可疑活动被亚马逊锁定。我相当肯定当时我给他们打过电话，但没有结果，但这次，他们告诉我去死吧。<p>与我交谈的第一个代表说，由于我在过去一年中没有购买记录，她无法验证我的账户，即使向我发送了2FA认证代码，也拒绝接受我档案中任何先前的确认代码或任何其他收据的信息。 <p>与我交谈的第二个代表说，我的账户没有可用的信息来回答验证我的账户所需的问题，而且她不能告诉我所需的信息是什么，因为我的系统告诉我该账户没有这些信息，<p>我已经使用这个账户很多年了，是的，我已经一年没有用它来购物了，因为基本上我没有工作，没有时间去处理冗长的电话树。在任何时候，我都没有被告知我的账户将变得无法收回。但现在，他们告诉我，我唯一的选择是用相同的电子邮件地址重新创建账户，显然会失去我的购买历史和我多年来上传的任何文件或其他记录。这并不是说这个账户上没有可疑的活动。有，而且我确实就此事联系了亚马逊，他们在锁定账户之前无法帮助我。<p>我有任何追索权吗？这似乎太疯狂了。我在加拿大。",
  "description_zh-Hant": "最近，亞馬遜的招聘人員與我聯繫，要求我申請我所在地區的幾個工作。在意識到我給了他我的普通亞馬遜賬戶的電子郵件後，我努力重新激活它，因為它之前因為明顯的可疑活動被亞馬遜鎖定。我相當肯定當時我給他們打過電話，但沒有結果，但這次，他們告訴我去死吧。<p>與我交談的第一個代表說，由於我在過去一年中沒有購買記錄，她無法驗證我的賬戶，即使向我發送了2FA認證代碼，也拒絕接受我檔案中任何先前的確認代碼或任何其他收據的信息。 <p>與我交談的第二個代表說，我的賬戶沒有可用的信息來回答驗證我的賬戶所需的問題，而且她不能告訴我所需的信息是什麼，因為我的系統告訴我該賬戶沒有這些信息，<p>我已經使用這個賬戶很多年了，是的，我已經一年沒有用它來購物了，因為基本上我沒有工作，沒有時間去處理冗長的電話樹。在任何時候，我都沒有被告知我的賬戶將變得無法收回。但現在，他們告訴我，我唯一的選擇是用相同的電子郵件地址重新創建賬戶，顯然會失去我的購買歷史和我多年來上傳的任何文件或其他記錄。這並不是說這個賬戶上沒有可疑的活動。有，而且我確實就此事聯繫了亞馬遜，他們在鎖定賬戶之前無法幫助我。<p>我有任何追索權嗎？這似乎太瘋狂了。我在加拿大。"
}