{
  "@type": "NewsArticle",
  "identifier": "2022--04--05--en--askhn--HackerNews--NewsArticle--30924209",
  "url": "https://news.ycombinator.com/item?id=30924209",
  "headline": "Ask HN: How to Combat Imposter Syndrome?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN!<p>In recent years I’ve grown weary of working for large companies and have longingly looked at taking up either bigger roles in smaller firms or launching something myself.<p>I am, however, burdened with imposter syndrome and seemingly always tending towards IC roles where I can hide away.<p>I have technical knowledge. I’m a seller. I’ve digested plenty of books on the intersection between business, innovation, technology, and organisational psychology. I have recruiters calling me daily. And I’ve worked with some of the biggest companies on the planet but I cannot overcome the feeling that I shouldn’t be <i>there</i>.<p>When I’ve tried to push myself above the parapet in more personal-centric pursuits (e.g. posting to social media to develop my presence, or launching internal campaigns) I feel physically sick and often succumb to feelings of anxiety where I’ll either stop working on something or sabotage it. At current I find this is limiting my progress  and my ambition of taking on positions of leadership.<p>So, HN, my question more specifically is - how do you combat imposter syndrome, and are there any techniques that you’ve used to reduce it’s impact?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "sussexby",
    "url": "https://news.ycombinator.com/user?id=sussexby"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30924209",
  "sameAs": "https://news.ycombinator.com/item?id=30924209",
  "dateCreated": "2022-04-05T20:11:45.254Z",
  "datePublished": "2022-04-05T20:00:50.000Z",
  "dateModified": "2022-04-05T20:11:45.254Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何对抗冒名顶替综合症？",
  "headline_zh-Hant": "Ask HN: 如何對抗冒名頂替綜合症？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN！<p>近年来，我已经厌倦了为大公司工作，并渴望在小公司中担任更大的角色，或者自己发起一些活动。<p>然而，我被冒名顶替综合症所困扰，似乎总是倾向于我可以躲起来的IC角色。我是个卖家。我已经消化了大量关于商业、创新、技术和组织心理学之间的交叉点的书籍。每天都有招聘人员给我打电话。我曾与地球上一些最大的公司合作，但我无法克服一种感觉，即我不应该在那里<i></i>。<p>当我试图在更多以个人为中心的追求中把自己推到栏杆之上时（例如，在社交媒体上发布信息以发展我的存在，或发起内部活动），我感到身体不适，并经常屈服于焦虑的感觉，我要么停止工作，要么破坏它。目前，我发现这限制了我的进步和担任领导职务的雄心。<p>所以，HN，我的问题更具体的是--你是如何对抗冒名顶替综合症的，你是否有任何技巧来减少它的影响？",
  "description_zh-Hant": "嗨，HN！<p>近年來，我已經厭倦了為大公司工作，並渴望在小公司中擔任更大的角色，或者自己發起一些活動。<p>然而，我被冒名頂替綜合症所困擾，似乎總是傾向於我可以躲起來的IC角色。我是個賣家。我已經消化了大量關於商業、創新、技術和組織心理學之間的交叉點的書籍。每天都有招聘人員給我打電話。我曾與地球上一些最大的公司合作，但我無法克服一種感覺，即我不應該在那裡<i></i>。<p>當我試圖在更多以個人為中心的追求中把自己推到欄杆之上時（例如，在社交媒體上發佈信息以發展我的存在，或發起內部活動），我感到身體不適，並經常屈服於焦慮的感覺，我要麼停止工作，要麼破壞它。目前，我發現這限制了我的進步和擔任領導職務的雄心。<p>所以，HN，我的問題更具體的是--你是如何對抗冒名頂替綜合症的，你是否有任何技巧來減少它的影響？"
}