{
  "@type": "NewsArticle",
  "identifier": "2022--03--01--en--askhn--HackerNews--NewsArticle--30508654",
  "url": "https://news.ycombinator.com/item?id=30508654",
  "headline": "Ask HN: How Do Companies Innovate?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This question really bugs me, and am curious if anyone has any first hand experience seeing innovation 'happen' in a company. How do companies actually innovate? Especially when everyone is working on projects all the time?<p>For example, you may have seen this before, of 2 cavemen hauling a heavy load with a wheelbarrow with square wheels, with another showing them round wheels - &quot;sorry, we're too busy&quot; they exclaim and off they go: https://www.creativityatwork.com/wp-content/uploads/wheel.png.webp<p>You see most of my working life (programmer) all I've been is busy; working on projects non-stop as thats what I'm being paid to do - work. I've never once had time to innovate except maybe something minor on the fly. The project managers don't exactly innovate, as they're not tech focused so no one really innovates.<p>But then I see companies whom are obviously innovating all the time, ie chip companies: the process of 10mm to 7mm to 5mm is mind blowing to say the least, but theres no way they came up with the process on the fly? Did they? They must have had time to think, for a long time.<p>So how do they do it, are there specialised employees who are paid to sit around and 'ponder'? Are there employees being paid to do nothing but experiment with not a guarantee of ever solving any problem? How do companies actually innovate?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "wastoids",
    "url": "https://news.ycombinator.com/user?id=wastoids"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=30508654",
  "sameAs": "https://news.ycombinator.com/item?id=30508654",
  "dateCreated": "2022-03-01T02:55:16.946Z",
  "datePublished": "2022-03-01T02:40:03.000Z",
  "dateModified": "2022-03-01T02:55:16.946Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 公司如何创新？",
  "headline_zh-Hant": "Ask HN: 公司如何創新？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这个问题真的让我很困惑，我很好奇是否有人有看到创新在公司 \"发生 \"的第一手经验。公司究竟是如何创新的？特别是当每个人都一直在做项目的时候？<p>例如，你可能以前见过这样的场景：两个穴居人用一个带方形轮子的手推车拖着沉重的货物，另一个向他们展示圆形轮子--&quot;对不起，我们太忙了&quot;他们感叹道，然后他们就走了：https://www.creativityatwork.com/wp-content/uploads/wheel.png.webp<p>你看我工作生活的大部分时间（程序员），我一直都很忙；不停地做项目，因为我的工资就是用来做这个的。我从来没有时间去创新，除非是临时的小事情。但是，我看到那些明显一直在创新的公司，例如芯片公司：从10毫米到7毫米再到5毫米的过程至少可以说是令人震惊的，但他们不可能临时想出这个过程？他们有吗？他们一定有时间思考，而且是很长时间。<p>那么，他们是如何做到的，是否有专门的员工拿钱坐在那里 \"思考\"？是否有员工拿着工资什么都不做，只做实验，却不保证能解决任何问题？公司究竟是如何创新的？",
  "description_zh-Hant": "這個問題真的讓我很困惑，我很好奇是否有人有看到創新在公司 \"發生 \"的第一手經驗。公司究竟是如何創新的？特別是當每個人都一直在做項目的時候？<p>例如，你可能以前見過這樣的場景：兩個穴居人用一個帶方形輪子的手推車拖著沉重的貨物，另一個向他們展示圓形輪子--&quot;對不起，我們太忙了&quot;他們感嘆道，然後他們就走了：https://www.creativityatwork.com/wp-content/uploads/wheel.png.webp<p>你看我工作生活的大部分時間（程序員），我一直都很忙；不停地做項目，因為我的工資就是用來做這個的。我從來沒有時間去創新，除非是臨時的小事情。但是，我看到那些明顯一直在創新的公司，例如芯片公司：從10毫米到7毫米再到5毫米的過程至少可以說是令人震驚的，但他們不可能臨時想出這個過程？他們有嗎？他們一定有時間思考，而且是很長時間。<p>那麼，他們是如何做到的，是否有專門的員工拿錢坐在那裡 \"思考\"？是否有員工拿著工資什麼都不做，只做實驗，卻不保證能解決任何問題？公司究竟是如何創新的？"
}