{
  "@type": "NewsArticle",
  "identifier": "2022--07--22--en--askhn--HackerNews--NewsArticle--32191526",
  "url": "https://news.ycombinator.com/item?id=32191526",
  "headline": "Ask HN: What makes users want to share a game?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "A few months ago, I released a small game called Fast Flood[0]. It's a mix of the Flood game and Wordle.<p>It did well on launch (&gt;50k users played it in the first days) and has kept a group of ~300 loyal users that play the game every day, even though I didn't do anything to improve it for a long time[1]. These users spend an average of 6 minutes on the site and return every day or so.<p>The site has limited traffic today, but the users who visit are very engaged with the game, so I've started thinking about possible ways to get more people to play it. A week ago, I released an update that focused on fixing some existing bugs, a slight UI redesign, and, more importantly, tried to get people to share the game by adding a leaderboard[2]. Let me explain this last part.<p>Assuming that the game was engaging, my guess was that people shared games for three reasons:<p>1. Because the game dynamics require it (multiplayer-only games)<p>2. In-game or financial incentives (e.g., Play-to-earn, referrals programs, etc.)<p>3. Status (e.g., I feel good because I solved guessed today's Wordle quickly)<p>Given that doing 1 adds too much complexity, and I don't have the money for 2, I thought 3 could be a good option. I had two ideas. Either allow people to set up tournaments with friends where they could compete and compare results. Or a global leader board, where people could compete with everyone who played.<p>I chose the latter option and released these changes last week. It hasn't made much of a difference, making me wonder if my theory about why people share games is correct.<p>As a newcomer to game design, I hoped more experienced game developers/designers could provide insights about:<p>1. What makes users want to share games?<p>2. For daily puzzle games, have you seen any interesting approaches that make people more likely to share them?<p>Also, I have limited web dev experience. Please excuse me if my UI makes your eyes bleed :P<p>[0] https://fastflood.dylancastillo.co/<p>[1] https://twitter.com/_dylancastillo/status/1510655616607522822<p>[2] https://twitter.com/_dylancastillo/status/1550135314521284610",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "dylanjcastillo",
    "url": "https://news.ycombinator.com/user?id=dylanjcastillo"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32191526",
  "sameAs": "https://news.ycombinator.com/item?id=32191526",
  "dateCreated": "2022-07-22T13:45:12.454Z",
  "datePublished": "2022-07-22T13:12:02.000Z",
  "dateModified": "2022-07-22T13:45:12.454Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 是什么让用户愿意分享一个游戏？\n",
  "headline_zh-Hant": "Ask HN: 是什麼讓用戶願意分享一個遊戲？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几个月前，我发布了一个名为Fast Flood[0]的小游戏。它是Flood游戏和Wordle的混合体。<p>它在发布时表现不错（&gt;头几天就有5万用户玩过），并保持了一批~300名忠实用户，他们每天都在玩这个游戏，尽管我在很长一段时间内没有做任何改进[1]。这些用户在网站上平均花费6分钟，并且每天都会回来。<p>今天网站的流量有限，但访问的用户对游戏非常投入，所以我开始考虑可能的方法，让更多人玩这个游戏。一周前，我发布了一个更新，主要是修复一些现有的错误，稍微重新设计了一下用户界面，更重要的是，试图通过增加一个排行榜[2]来让人们分享这个游戏。让我解释一下最后这一部分。<p>假设游戏很吸引人，我的猜测是，人们分享游戏有三个原因：<p>1. 因为游戏的动力需要它（纯多人游戏）<p>2.游戏中或经济上的激励（例如，游戏赚钱，推荐计划等）<p>3.地位（例如，我感觉很好，因为我很快就解决了今天的Wordle猜测）<p>鉴于做1增加了太多的复杂性，而且我没有钱做2，我认为3可能是一个好的选择。我有两个想法。要么允许人们与朋友们建立锦标赛，在那里他们可以竞争并比较结果。<p>我选择了后者，并在上周发布了这些变化。它并没有带来多大的变化，这让我怀疑我关于人们为什么要分享游戏的理论是否正确。<p>作为一个游戏设计的新人，我希望更多有经验的游戏开发者/设计者能够提供以下见解：<p>1. 是什么让用户愿意分享游戏？<p>2.对于日常的益智游戏，你是否看到有什么有趣的方法让人们更愿意分享它们？<p>另外，我的网页设计经验有限。如果我的用户界面让你的眼睛流血，请原谅我：P<p>[0] https://fastflood.dylancastillo.co/<p>[1] https://twitter.com/_dylancastillo/status/1510655616607522822<p>[2] https://twitter.com/_dylancastillo/status/1550135314521284610\n",
  "description_zh-Hant": "幾個月前，我發佈了一個名為Fast Flood[0]的小遊戲。它是Flood遊戲和Wordle的混合體。<p>它在發佈時表現不錯（&gt;頭幾天就有5萬用戶玩過），並保持了一批~300名忠實用戶，他們每天都在玩這個遊戲，儘管我在很長一段時間內沒有做任何改進[1]。這些用戶在網站上平均花費6分鐘，並且每天都會回來。<p>今天網站的流量有限，但訪問的用戶對遊戲非常投入，所以我開始考慮可能的方法，讓更多人玩這個遊戲。一週前，我發佈了一個更新，主要是修復一些現有的錯誤，稍微重新設計了一下用戶界面，更重要的是，試圖通過增加一個排行榜[2]來讓人們分享這個遊戲。讓我解釋一下最後這一部分。<p>假設遊戲很吸引人，我的猜測是，人們分享遊戲有三個原因：<p>1. 因為遊戲的動力需要它（純多人遊戲）<p>2.遊戲中或經濟上的激勵（例如，遊戲賺錢，推薦計劃等）<p>3.地位（例如，我感覺很好，因為我很快就解決了今天的Wordle猜測）<p>鑑於做1增加了太多的複雜性，而且我沒有錢做2，我認為3可能是一個好的選擇。我有兩個想法。要麼允許人們與朋友們建立錦標賽，在那裡他們可以競爭並比較結果。<p>我選擇了後者，並在上週發佈了這些變化。它並沒有帶來多大的變化，這讓我懷疑我關於人們為什麼要分享遊戲的理論是否正確。<p>作為一個遊戲設計的新人，我希望更多有經驗的遊戲開發者/設計者能夠提供以下見解：<p>1. 是什麼讓用戶願意分享遊戲？<p>2.對於日常的益智遊戲，你是否看到有什麼有趣的方法讓人們更願意分享它們？<p>另外，我的網頁設計經驗有限。如果我的用戶界面讓你的眼睛流血，請原諒我：P<p>[0] https://fastflood.dylancastillo.co/<p>[1] https://twitter.com/_dylancastillo/status/1510655616607522822<p>[2] https://twitter.com/_dylancastillo/status/1550135314521284610\n"
}