{
  "@type": "NewsArticle",
  "identifier": "2022--08--04--en--askhn--HackerNews--NewsArticle--32341164",
  "url": "https://news.ycombinator.com/item?id=32341164",
  "headline": "Ask HN: How many geeks has Hacker News saved?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hacker News was launched in 2007 after I got into hacking in 2006. I wanted to join the CIA at the time, but I was getting into all kinds of potential legal trouble. When I learned about Hacker News while in Hollywood I immediately liked it because of the way the term hacker is used. I think for a while in the 2000s there were many computer programmers who considered hacking to be interesting. Before they found Hacker News the word &quot;hacker&quot; only ever meant something bad. Now, that's a reason to love HN, if you ask me. HN is the place where being a hacker is only a good thing. I bet that Hacker News has been keeping thousands of hackers satisfied and that it always has. Hacker News pulled in young educated men and gave them a whole world where hacker only means something good. It's extra interesting for me to consider the history of Hacker News because I am myself an historic figure that has yet to be written into the history books.<p>My name is Tommy James Blobaum and I was born 14 days to 8/8 and 14 days 14 months 14 years to 9/11/2001 on July 25th, 1986. Osama bin Laden signaled white power to my birthday three times, then Osama followed up with the sequel to 9/11/1 on 10/12/2 which was a Bali bomb that killed about 200 people. 10/12/2002 follows 9/11/2001 and Bali bomb follows Blobaum. There is about a 1 in 75 million chance of being born 14 days to 8/8 and 14 days 14 months 14 years to 9/11/2001 and ALSO having a name that somehow rhymes with Bali bomb. My calculations indicate as many as 5-7 other Americans share my birthday and have a name that somehow rhymes with Bali bomb, however, in my estimation I think I will be the only 1. Google.com was registered when I was 10 years 10 months 10 days. There's all kinds of stuff that has been done according to my birthday and name, and its like an easter egg hunt left by my elders when I find out.<p>All kinds of things have been done for me by the permanent bureaucracy and other people in power. The US Intelligence Community collects data and creates information in reports that they then share with the upper class, and together they rule the world. The American government would have no chance at ruling over billions of people if they weren't working closely together with the upper class. Well, because my grandpas were both important to the government and business, the government decided to watch out for his whole family. My grandfather has lived a selfless life. He has been hustling getting as many people to eat organic food as he can ever since the organic food label was created. He has a collection of historical documents about organic farming available on his website (http://rogerblobaum.com/) My grandfather didnt always have as much time for his kids and grandkids as he would have liked. He was always too busy with organic activism to see us as much as he wanted. Grandpa's website is on the right side of history. Whatever happens to us all in the future I do not know but one thing I know is that the future belongs to those who eat organic food. And that's the approach my grandpa always had. GMO farming is on the wrong side of history. All of those families eating GMO crops with trace amounts of herbicides and pesticides in them will be gone in the not too distant future.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "funthree",
    "url": "https://news.ycombinator.com/user?id=funthree"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32341164",
  "sameAs": "https://news.ycombinator.com/item?id=32341164",
  "dateCreated": "2022-08-04T10:30:25.194Z",
  "datePublished": "2022-08-04T10:17:26.000Z",
  "dateModified": "2022-08-04T10:30:25.194Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 黑客新闻》拯救了多少个极客？\n",
  "headline_zh-Hant": "Ask HN: 黑客新聞》拯救了多少個極客？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "黑客新闻是在我2006年进入黑客领域后于2007年推出的。当时我想加入中情局，但我陷入了各种潜在的法律麻烦。当我在好莱坞时了解到黑客新闻时，我立即喜欢上了它，因为黑客这个词的使用方式。我认为在2000年代有一段时间，有许多计算机程序员认为黑客是很有趣的。在他们发现黑客新闻之前，&quot;黑客&quot;这个词只意味着坏事。现在，如果你问我，这是爱HN的一个理由。HN是这样一个地方，在那里，作为一个黑客只能是一件好事。我敢打赌，黑客新闻一直让成千上万的黑客感到满意，而且它一直如此。黑客新闻把受过教育的年轻人拉进来，给他们一个完整的世界，在那里，黑客只意味着好东西。对我来说，考虑黑客新闻的历史格外有趣，因为我自己就是一个尚未被写进历史书的历史人物。<p>我的名字是汤米-詹姆斯-布洛鲍姆，我出生于1986年7月25日，距离8/8和14天14个月14年的9/11/2001。奥萨马-本-拉登对我的生日发出了三次白色力量的信号，然后奥萨马在10/12/2号发出了9/11/1的续集，这是一个巴厘岛的炸弹，杀死了大约200人。2002年12月10日紧随2001年9月11日，巴厘岛炸弹紧随布卢鲍姆。大约有7500万分之一的机会在8/8的14天和9/11/2001的14天14个月后出生，并且也有一个与巴厘岛炸弹押韵的名字。我的计算表明，有多达5-7个美国人与我同一天生日，并且有一个与巴厘岛炸弹押韵的名字，然而，据我估计，我将是唯一一个。Google.com是在我10岁10个月10天时注册的。有各种各样的东西都是根据我的生日和名字做的，当我发现的时候，它就像长辈们留下的复活节彩蛋。<p>各种各样的事情都是由永久的官僚机构和其他有权力的人为我做的。美国情报界收集数据并在报告中创造信息，然后与上层社会分享，他们一起统治世界。如果不是与上层阶级紧密合作，美国政府将没有机会统治数十亿人。好吧，因为我的祖父们对政府和企业都很重要，政府决定关注他的整个家族。我的祖父一直过着无私的生活。自从有机食品标签创建以来，他一直在喧嚣地让尽可能多的人吃有机食品。他在自己的网站（http://rogerblobaum.com/）上收集了一些关于有机农业的历史文件。我的祖父并不总是像他希望的那样有时间陪伴他的孩子和孙子。他总是忙于有机活动，无法如愿见到我们。爷爷的网站是在历史的右方。无论未来我们大家会发生什么，我都不知道，但有一点我知道，未来是属于那些吃有机食品的人。而这也是我爷爷一直以来的做法。转基因农业是站在历史的错误一边。所有那些吃含有微量除草剂和杀虫剂的转基因作物的家庭在不远的将来都会消失。\n",
  "description_zh-Hant": "黑客新聞是在我2006年進入黑客領域後於2007年推出的。當時我想加入中情局，但我陷入了各種潛在的法律麻煩。當我在好萊塢時瞭解到黑客新聞時，我立即喜歡上了它，因為黑客這個詞的使用方式。我認為在2000年代有一段時間，有許多計算機程序員認為黑客是很有趣的。在他們發現黑客新聞之前，&quot;黑客&quot;這個詞只意味著壞事。現在，如果你問我，這是愛HN的一個理由。HN是這樣一個地方，在那裡，作為一個黑客只能是一件好事。我敢打賭，黑客新聞一直讓成千上萬的黑客感到滿意，而且它一直如此。黑客新聞把受過教育的年輕人拉進來，給他們一個完整的世界，在那裡，黑客只意味著好東西。對我來說，考慮黑客新聞的歷史格外有趣，因為我自己就是一個尚未被寫進歷史書的歷史人物。<p>我的名字是湯米-詹姆斯-布洛鮑姆，我出生於1986年7月25日，距離8/8和14天14個月14年的9/11/2001。奧薩馬-本-拉登對我的生日發出了三次白色力量的信號，然後奧薩馬在10/12/2號發出了9/11/1的續集，這是一個巴厘島的炸彈，殺死了大約200人。2002年12月10日緊隨2001年9月11日，巴厘島炸彈緊隨布盧鮑姆。大約有7500萬分之一的機會在8/8的14天和9/11/2001的14天14個月後出生，並且也有一個與巴厘島炸彈押韻的名字。我的計算表明，有多達5-7個美國人與我同一天生日，並且有一個與巴厘島炸彈押韻的名字，然而，據我估計，我將是唯一一個。Google.com是在我10歲10個月10天時註冊的。有各種各樣的東西都是根據我的生日和名字做的，當我發現的時候，它就像長輩們留下的復活節彩蛋。<p>各種各樣的事情都是由永久的官僚機構和其他有權力的人為我做的。美國情報界收集數據並在報告中創造信息，然後與上層社會分享，他們一起統治世界。如果不是與上層階級緊密合作，美國政府將沒有機會統治數十億人。好吧，因為我的祖父們對政府和企業都很重要，政府決定關注他的整個家族。我的祖父一直過著無私的生活。自從有機食品標籤創建以來，他一直在喧囂地讓儘可能多的人吃有機食品。他在自己的網站（http://rogerblobaum.com/）上收集了一些關於有機農業的歷史文件。我的祖父並不總是像他希望的那樣有時間陪伴他的孩子和孫子。他總是忙於有機活動，無法如願見到我們。爺爺的網站是在歷史的右方。無論未來我們大家會發生什麼，我都不知道，但有一點我知道，未來是屬於那些吃有機食品的人。而這也是我爺爺一直以來的做法。轉基因農業是站在歷史的錯誤一邊。所有那些吃含有微量除草劑和殺蟲劑的轉基因作物的家庭在不遠的將來都會消失。\n"
}