{
  "@type": "NewsArticle",
  "identifier": "2022--07--06--en--askhn--HackerNews--NewsArticle--32000178",
  "url": "https://news.ycombinator.com/item?id=32000178",
  "headline": "Ask HN: Want to change from front end to back end. Resources?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm currently working as a frontend engineer for a small agency (mostly using React and TypeScript). As much as I like the place, I want to grow my career towards backend, which is something they don't do.<p>For this reason, I want to learn backend in off-working hours. I'm willing to dive deeper into algorithms, data structures and maybe choose between Python and Go.<p>I read a similar question asked in another online community, but the response OP got was to &quot;find a company willing to train them&quot;. I want to teach myself enough to be able to apply for backend jobs, and not to find a company willing to bet that I can learn backend on the job. Not only is my local market competitive (I'm junior) but it also lacks opportunities.<p>Are there books to read, blogs to follow, resources to digest, that will help me grow up to an acceptable level to be considered for a backend engineer position? They don't even have to be directly relevant with a specific stack or anything. For example, a recommendation I got from someone was to read &quot;Designing Data-Intensive Applications&quot;.<p>You can also assume that I know how to Google, it's cleaning up the noise in the results which is time consuming and prone to errors, given that I don't know what I don't know.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Arisaka1",
    "url": "https://news.ycombinator.com/user?id=Arisaka1"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32000178",
  "sameAs": "https://news.ycombinator.com/item?id=32000178",
  "dateCreated": "2022-07-06T14:01:07.238Z",
  "datePublished": "2022-07-06T12:59:04.000Z",
  "dateModified": "2022-07-06T14:01:07.238Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 想从前端改到后端。资源？\n",
  "headline_zh-Hant": "Ask HN: 想從前端改到後端。資源？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我目前在一家小型机构担任前端工程师（主要使用 React 和 TypeScript）。虽然我很喜欢这个地方，但我想把我的职业生涯向后端发展，这是他们不做的事情。<p>出于这个原因，我想在非工作时间学习后端。我愿意深入研究算法、数据结构，也许会在Python和Go之间做出选择。<p>我在另一个在线社区看到一个类似的问题，但OP得到的答复是&quot;找一家愿意培训他们的公司&quot;。我想把自己教得足够好，以便能够申请后端工作，而不是找一家愿意打赌我能够在工作中学习后端的公司。我当地的市场不仅竞争激烈（我是初级），而且还缺乏机会。<p>有没有可以阅读的书籍、可以关注的博客、可以消化的资源，可以帮助我成长到一个可以接受的水平，从而被考虑到后端工程师的职位？他们甚至不需要与特定的堆栈或任何东西直接相关。例如，有人给我的建议是阅读&quot;设计数据密集型应用程序&quot;。<p>你也可以认为我知道如何使用谷歌，只是清理结果中的噪音，这很耗时，而且容易出错，因为我不知道我不知道的东西。\n",
  "description_zh-Hant": "我目前在一家小型機構擔任前端工程師（主要使用 React 和 TypeScript）。雖然我很喜歡這個地方，但我想把我的職業生涯向後端發展，這是他們不做的事情。<p>出於這個原因，我想在非工作時間學習後端。我願意深入研究算法、數據結構，也許會在Python和Go之間做出選擇。<p>我在另一個在線社區看到一個類似的問題，但OP得到的答覆是&quot;找一家願意培訓他們的公司&quot;。我想把自己教得足夠好，以便能夠申請後端工作，而不是找一家願意打賭我能夠在工作中學習後端的公司。我當地的市場不僅競爭激烈（我是初級），而且還缺乏機會。<p>有沒有可以閱讀的書籍、可以關注的博客、可以消化的資源，可以幫助我成長到一個可以接受的水平，從而被考慮到後端工程師的職位？他們甚至不需要與特定的堆棧或任何東西直接相關。例如，有人給我的建議是閱讀&quot;設計數據密集型應用程序&quot;。<p>你也可以認為我知道如何使用谷歌，只是清理結果中的噪音，這很耗時，而且容易出錯，因為我不知道我不知道的東西。\n"
}