{
  "@type": "NewsArticle",
  "identifier": "2022--07--15--en--askhn--HackerNews--NewsArticle--32104005",
  "url": "https://news.ycombinator.com/item?id=32104005",
  "headline": "Ask HN: Do most SWEs actually code at BigTechCo jobs?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have worked at a BigTechCo for about 3 years and feel like my engineering skills are slowly and steadily deteriorating. Multiple people in my team, org, and other BigTechCos have expressed the same concern.<p>Essentially, everything we do is between other mammoth systems and thus most “work” is actually configuring systems to talk to each other or talking to other teams about guarantees, capacity etc. The actual engineering work is minimal and the development speed is glacial.<p>Previously I worked at a small consultancy, a green field company, and startups. Small teams, full stack, very fast paced, interesting work (dynamic programming, exotic schedulers, path planning, front end/back end, databases, events/streams, native mobile).<p>Now I feel I just slog through esoteric config or some custom DDL, language, or tool nobody else uses. No team can do anything meaningful by themselves, everything requires meetings and infinite Google Docs. The pay is more than 2x what I was making before and the promos keep coming but it all just feels like BS.<p>Does anyone else have this experience?<p>Note: I have definitely improved in cross team communication and collaboration etc. as well as big org politics. So not a total loss.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pcmoney",
    "url": "https://news.ycombinator.com/user?id=pcmoney"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32104005",
  "sameAs": "https://news.ycombinator.com/item?id=32104005",
  "dateCreated": "2022-07-15T02:42:44.109Z",
  "datePublished": "2022-07-15T02:34:36.000Z",
  "dateModified": "2022-07-15T02:42:44.109Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 大多数SWE实际上是在BigTechCo工作中编码的吗？\n",
  "headline_zh-Hant": "Ask HN: 大多數SWE實際上是在BigTechCo工作中編碼的嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在一家大型科技公司工作了大约3年，感觉自己的工程技能正在缓慢而稳定地退化。<p>基本上，我们所做的一切都在其他巨大的系统之间，因此大多数 \"工作 \"实际上是配置系统以相互交谈，或与其他团队讨论保证和能力等问题。实际的工程工作很少，开发速度也很慢。<p>以前我曾在一家小型咨询公司、一家绿地公司和初创公司工作。小团队，全栈，节奏非常快，工作很有趣（动态编程，异国调度器，路径规划，前端/后端，数据库，事件/流，原生移动）。<p>现在我觉得我只是在深奥的配置或一些自定义的DDL，语言，或别人不用的工具中苦苦挣扎。没有一个团队可以自己做任何有意义的事情，一切都需要开会和无限的谷歌文档。工资是我以前的2倍多，而且促销活动不断，但这一切都让我感觉像在做梦。<p>还有人有这样的经历吗？<p>注：我在跨团队沟通和协作等方面肯定有所提高，而且在大机构的政治方面也有所提高。所以并不是完全的损失。\n",
  "description_zh-Hant": "我在一家大型科技公司工作了大約3年，感覺自己的工程技能正在緩慢而穩定地退化。<p>基本上，我們所做的一切都在其他巨大的系統之間，因此大多數 \"工作 \"實際上是配置系統以相互交談，或與其他團隊討論保證和能力等問題。實際的工程工作很少，開發速度也很慢。<p>以前我曾在一家小型諮詢公司、一家綠地公司和初創公司工作。小團隊，全棧，節奏非常快，工作很有趣（動態編程，異國調度器，路徑規劃，前端/後端，數據庫，事件/流，原生移動）。<p>現在我覺得我只是在深奧的配置或一些自定義的DDL，語言，或別人不用的工具中苦苦掙扎。沒有一個團隊可以自己做任何有意義的事情，一切都需要開會和無限的谷歌文檔。工資是我以前的2倍多，而且促銷活動不斷，但這一切都讓我感覺像在做夢。<p>還有人有這樣的經歷嗎？<p>注：我在跨團隊溝通和協作等方面肯定有所提高，而且在大機構的政治方面也有所提高。所以並不是完全的損失。\n"
}