{
  "@type": "NewsArticle",
  "identifier": "2022--04--16--en--askhn--HackerNews--NewsArticle--31049463",
  "url": "https://news.ycombinator.com/item?id=31049463",
  "headline": "Ask HN: Should I Keep the Code?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Always keep the code…<p>TLDR: Keep the code, it’s your only defense against unscrupulous business d-bags<p>This is a throwaway account because I’m under negotiations and don’t want to expose the alleged criminals just yet.<p>So about 2 ½ years ago I found a job on upwork.com as an algorithmic developer. For 2 years, I developed the real algorithm and the algorithm returned 500% over five years and 50%  alone in 2021. It trades futures and has been trading for over 2 years. (I know that sounds a little outrageous, but can share actual trading records and backtested results, the volatility of 2020 helped profits.)<p>My job was to build a trading system and take a silly technical indicator that one of the partners had bought from someone else and turn it into profitable. The original code was in easy language/trade station so I know it wasn’t not terribly sophisticated. The other two partners were providing money with money and the ability to sell to clients. Sales skills are something I have always been deficient in.<p>It’s a complicated mess and mistakes were made on my part, but my salary was calculated from the profits of the monthly trading profits. In late 2019, I desperately wanted to get out of my low-stress, high-paid programming job, so I threw caution into the market and jumped in, unhedged.<p>So there were some months that I got nothing and then other months I got my full payment. Based on my contact, anytime I didn’t get paid it would be turned into deferred income. That deferred income has come out to be roughly $500k, for 2 years. Recently, I requested the financial statements of the company and that deferred income isn’t on the books.<p>I kept up my end by building the algorithm, but the two other partners never sold the algorithm to potential clients. I think in the end they weren’t good salespeople and didn’t understand that if you make money in the market you are also going to have days that you lose money. Just ask the man whole solved the market…<p>Since Oct 2021 the algorithm is on autopilot and I haven’t had much communication with the other partners. I have moved on, but the AWS server is in my name and my cost. Of course, it never occurred to the two partners that I essentially controlled all the servers/code.<p>I have asked for payment for the AWS costs, but now they don’t want to recognize my deferred income on the books, and they want me to move me down the list, in regards to payment if the company is ever profitable. They also want to give my code to another developer, who is going to take my work and probably make it a little better,  but this developer is going to get paid cash which would be ahead of me, in terms of payment.<p>So I have hired a lawyer, but they gave me some general advice / and said that I had a contract and the other partners were violating it. However, I can sue them, they can sue me, it’s LLC vs. LLC and there are tremendous costs in just getting the issue to the court… at least $10,000 for arbitration. So at this point, it’s becoming quite an emotional drain and I would like to resolve this on a positive note of all my hard work. ( I don’t anticipate ever getting the $500k, I just don’t want them ever to have the code.)<p>Are there any lawyers that might be interested in some form of contingency, with the possibility of intellectual property? (I also have my own algorithms, that are far better than the one I’m currently arguing over.) Any thoughts, advice, or ideas would be greatly appreciated. Any website/chat rooms for disgruntled coders?<p>So I have made some dumb mistakes, but at the end of the day, I have code, so sue me?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "punkst",
    "url": "https://news.ycombinator.com/user?id=punkst"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31049463",
  "sameAs": "https://news.ycombinator.com/item?id=31049463",
  "dateCreated": "2022-04-16T04:39:36.636Z",
  "datePublished": "2022-04-16T04:25:18.000Z",
  "dateModified": "2022-04-16T04:39:36.636Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该保留这个代码吗？",
  "headline_zh-Hant": "Ask HN: 我應該保留這個代碼嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "一定要保留代码......<p>TLDR：保留代码，这是你对无良商业d-bags的唯一防御<p>这是一个抛砖引玉的账户，因为我正在谈判，还不想暴露所谓的罪犯。<p>所以大约2年半前，我在upwork.com上找到一份工作，做算法开发。2年来，我开发了真正的算法，该算法在5年内回报了500%，在2021年单独回报了50%。它进行期货交易，并且已经交易了2年多。(我知道这听起来有点离谱，但可以分享实际的交易记录和回测结果，2020年的波动性有助于盈利。)<p>我的工作是建立一个交易系统，把其中一个合伙人从别人那里买来的一个愚蠢的技术指标，变成可以盈利的。原始代码是用简易语言/交易站编写的，所以我知道它并不是非常复杂。另外两个合伙人是用钱来提供资金，并有能力向客户销售。销售技巧是我一直以来的不足。<p>这是一个复杂的混乱，我也犯了错误，但我的工资是由每月的交易利润计算出来的。2019年底，我迫切希望摆脱低压力、高收入的编程工作，所以我把谨慎扔进市场，跳了进去，没有对冲。<p>所以有一些月份我什么都没有得到，然后其他月份我得到了我的全部报酬。根据我的接触，只要我没有得到报酬，就会变成递延收入。这笔递延收入大约有50万美元，为期2年。最近，我要求提供公司的财务报表，那笔递延收入并不在账面上。<p>我通过建立算法保持了我的承诺，但另外两个合伙人从未向潜在客户出售过该算法。我认为最终他们不是好的销售人员，不明白如果你在市场上赚钱，你也会有亏钱的时候。问问那个解决了市场问题的人就知道了......<p>自2021年10月以来，算法处于自动驾驶状态，我没有与其他合作伙伴有太多沟通。我已经转行了，但AWS服务器在我的名下，也是我的成本。当然，这两个合作伙伴从来没有想过，我基本上控制了所有的服务器/代码。<p>我已经要求支付AWS的费用，但现在他们不想在账面上承认我的递延收入，他们想让我在名单上往下移，如果公司有一天盈利了，就可以付款。他们还想把我的代码给另一个开发人员，他将接受我的工作，并可能使其更好一些，但这个开发人员将获得现金支付，这将在支付方面领先于我。<p>因此，我已经聘请了一名律师，但他们给了我一些一般性建议/并说我有一个合同，其他合作伙伴正在违反它。然而，我可以起诉他们，他们也可以起诉我，这是有限责任公司对有限责任公司，而且光是把问题提交给法院就有巨大的费用......至少有1万美元的仲裁费。因此，在这一点上，它已经成为一个相当大的情感消耗，我想在我所有的努力工作中积极解决这个问题。(<p>是否有任何律师可能对某种形式的应急措施感兴趣，并有可能提供知识产权？ (我也有自己的算法，比我现在争论的那个好得多。) 如果有任何想法、建议或主意，我们将非常感激。有任何网站/聊天室供不满的编码员使用吗？<p>所以我犯了一些愚蠢的错误，但在一天结束时，我有代码，所以起诉我？",
  "description_zh-Hant": "一定要保留代碼......<p>TLDR：保留代碼，這是你對無良商業d-bags的唯一防禦<p>這是一個拋磚引玉的賬戶，因為我正在談判，還不想暴露所謂的罪犯。<p>所以大約2年半前，我在upwork.com上找到一份工作，做算法開發。2年來，我開發了真正的算法，該算法在5年內回報了500%，在2021年單獨回報了50%。它進行期貨交易，並且已經交易了2年多。(我知道這聽起來有點離譜，但可以分享實際的交易記錄和回測結果，2020年的波動性有助於盈利。)<p>我的工作是建立一個交易系統，把其中一個合夥人從別人那裡買來的一個愚蠢的技術指標，變成可以盈利的。原始代碼是用簡易語言/交易站編寫的，所以我知道它並不是非常複雜。另外兩個合夥人是用錢來提供資金，並有能力向客戶銷售。銷售技巧是我一直以來的不足。<p>這是一個複雜的混亂，我也犯了錯誤，但我的工資是由每月的交易利潤計算出來的。2019年底，我迫切希望擺脫低壓力、高收入的編程工作，所以我把謹慎扔進市場，跳了進去，沒有對沖。<p>所以有一些月份我什麼都沒有得到，然後其他月份我得到了我的全部報酬。根據我的接觸，只要我沒有得到報酬，就會變成遞延收入。這筆遞延收入大約有50萬美元，為期2年。最近，我要求提供公司的財務報表，那筆遞延收入並不在賬面上。<p>我通過建立算法保持了我的承諾，但另外兩個合夥人從未向潛在客戶出售過該算法。我認為最終他們不是好的銷售人員，不明白如果你在市場上賺錢，你也會有虧錢的時候。問問那個解決了市場問題的人就知道了......<p>自2021年10月以來，算法處於自動駕駛狀態，我沒有與其他合作伙伴有太多溝通。我已經轉行了，但AWS服務器在我的名下，也是我的成本。當然，這兩個合作伙伴從來沒有想過，我基本上控制了所有的服務器/代碼。<p>我已經要求支付AWS的費用，但現在他們不想在賬面上承認我的遞延收入，他們想讓我在名單上往下移，如果公司有一天盈利了，就可以付款。他們還想把我的代碼給另一個開發人員，他將接受我的工作，並可能使其更好一些，但這個開發人員將獲得現金支付，這將在支付方面領先於我。<p>因此，我已經聘請了一名律師，但他們給了我一些一般性建議/並說我有一個合同，其他合作伙伴正在違反它。然而，我可以起訴他們，他們也可以起訴我，這是有限責任公司對有限責任公司，而且光是把問題提交給法院就有巨大的費用......至少有1萬美元的仲裁費。因此，在這一點上，它已經成為一個相當大的情感消耗，我想在我所有的努力工作中積極解決這個問題。(<p>是否有任何律師可能對某種形式的應急措施感興趣，並有可能提供知識產權？ (我也有自己的算法，比我現在爭論的那個好得多。) 如果有任何想法、建議或主意，我們將非常感激。有任何網站/聊天室供不滿的編碼員使用嗎？<p>所以我犯了一些愚蠢的錯誤，但在一天結束時，我有代碼，所以起訴我？"
}