{
  "@type": "NewsArticle",
  "identifier": "2022--06--29--en--askhn--HackerNews--NewsArticle--31923938",
  "url": "https://news.ycombinator.com/item?id=31923938",
  "headline": "Ask HN: How can I make links open in Incognito by default?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Whenever I click a link on my computer (e.g, from email or Messages), it opens by default in my browser of choice, but never in an Incognito window.<p>Nearly 100% of the time, I want it to open in Incognito, which I use whenever I'm visiting a site that I don't need to be logged into. My current workaround is to right-click the link, copy link, switch to my browser, open a new Incognito window, paste in the link and hit return. While this doesn't seem like that big a deal, it's actually a lot of clicks (11 key presses) — compared to just one click to open a link normally. Additionally, it puts the pasted link into my pasteboard manager, which is unnecessary and annoying when I go to retrieve a snippet that is now further down in the stack.<p>What's the best way to handle this? I've considered switching my default browser to a different browser that completely blocks cookies and forgets history all the time, but it seems like there should be a better solution.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "gnicholas",
    "url": "https://news.ycombinator.com/user?id=gnicholas"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31923938",
  "sameAs": "https://news.ycombinator.com/item?id=31923938",
  "dateCreated": "2022-06-29T18:35:54.059Z",
  "datePublished": "2022-06-29T18:27:40.000Z",
  "dateModified": "2022-06-29T18:35:54.059Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何使链接默认在隐蔽状态下打开？\n",
  "headline_zh-Hant": "Ask HN: 如何使鏈接默認在隱蔽狀態下打開？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "每当我在电脑上点击一个链接时（例如，从电子邮件或信息中），它都会默认在我选择的浏览器中打开，但从未在隐身窗口中打开。<p>几乎100%的时间，我都希望它在隐身窗口中打开，每当我访问一个不需要登录的网站时，我都会使用隐身窗口。我目前的解决方法是右击链接，复制链接，切换到我的浏览器，打开一个新的隐身窗口，粘贴链接并点击返回。虽然这看起来不是什么大问题，但实际上要点击很多次（按11次键）--相比之下，正常情况下只需点击一次就能打开一个链接。此外，它还将粘贴的链接放到我的粘贴板管理器中，当我去检索一个现在在堆栈中更靠下的片段时，这是不需要的，而且很烦人。<p>有什么最好的方法来处理这个问题？我曾考虑将我的默认浏览器切换到另一个完全阻止cookies并一直忘记历史的浏览器，但似乎应该有一个更好的解决方案。\n",
  "description_zh-Hant": "每當我在電腦上點擊一個鏈接時（例如，從電子郵件或信息中），它都會默認在我選擇的瀏覽器中打開，但從未在隱身窗口中打開。<p>幾乎100%的時間，我都希望它在隱身窗口中打開，每當我訪問一個不需要登錄的網站時，我都會使用隱身窗口。我目前的解決方法是右擊鏈接，複製鏈接，切換到我的瀏覽器，打開一個新的隱身窗口，粘貼鏈接並點擊返回。雖然這看起來不是什麼大問題，但實際上要點擊很多次（按11次鍵）--相比之下，正常情況下只需點擊一次就能打開一個鏈接。此外，它還將粘貼的鏈接放到我的粘貼板管理器中，當我去檢索一個現在在堆棧中更靠下的片段時，這是不需要的，而且很煩人。<p>有什麼最好的方法來處理這個問題？我曾考慮將我的默認瀏覽器切換到另一個完全阻止cookies並一直忘記歷史的瀏覽器，但似乎應該有一個更好的解決方案。\n"
}