{
  "@type": "NewsArticle",
  "identifier": "2022--07--29--en--askhn--HackerNews--NewsArticle--32282750",
  "url": "https://news.ycombinator.com/item?id=32282750",
  "headline": "Ask HN: Where are all the climate jobs?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm an avid climate change advocate. In 2010, my interactive software to give the public a chance to analyze Environment Canada's climate data was given honourable mention in BC's Apps 4 Climate Action contest. Around that time, I installed a solar hot water heater in my home. Three years ago, I developed a calculator to show the return-on-investment for an electric vehicle. I bought an EV in 2020 for many reasons: environmental, financial (8-year ROI), and to replace a 23-year-old dilapidated gas guzzler. In 2018, I collaborated with nearly two dozen scientific illustrators to write a free e-book that explains how we know what we know about climate change, tracing from the beginning of the universe to today.<p>Some radios made by the company I work for are used by researchers in Antarctica to increase the range they can safely travel, ergo study a larger environmental surface, while remaining in contact with their base station. I'm not directly involved, though I'm sure it's very cool work.<p>I am a capable, motivated, hard-working, high-tech worker. I'm not entrepreneurial. For over twelve years I've asked countless recruiters to find---and have myself searched for---opportunities to help develop systems that are directly related to ameliorating climate change. Anything. Battery tech, solar installations, nuclear fusion, wind power, electric transportation, carbon offsets, climate fintech, you name it. Nothing.<p>If work for software developers who want to help fight climate change is out there, it's hiding exceedingly well.<p>From my perspective, we need to put a great deal more effort into connecting people with climate change opportunities. Imagine the Horn of Plenty overflowing with opportunities to help tackle the greatest threat of our time.<p>How do we get more hands on deck?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "thangalin",
    "url": "https://news.ycombinator.com/user?id=thangalin"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32282750",
  "sameAs": "https://news.ycombinator.com/item?id=32282750",
  "dateCreated": "2022-07-29T23:26:16.731Z",
  "datePublished": "2022-07-29T23:14:00.000Z",
  "dateModified": "2022-07-29T23:26:16.731Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 所有的气候工作都在哪里？\n",
  "headline_zh-Hant": "Ask HN: 所有的氣候工作都在哪裡？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个狂热的气候变化倡导者。2010年，我的互动软件让公众有机会分析加拿大环境部的气候数据，在不列颠哥伦比亚省的Apps 4 Climate Action竞赛中获得了荣誉奖。大约在那个时候，我在家里安装了一个太阳能热水器。三年前，我开发了一个计算器来显示电动汽车的投资回报。我在2020年买了一辆电动车，原因有很多：环保、财务（8年的投资回报率），以及取代一辆23年的破旧汽油车。2018年，我与近二十位科学插画师合作编写了一本免费的电子书，解释了我们如何知道我们所知道的气候变化，从宇宙的开始追溯到今天。<p>我工作的公司生产的一些无线电被南极洲的研究人员用来增加他们可以安全旅行的范围，因此研究更大的环境表面，同时保持与基站的联系。我没有直接参与，尽管我确信这是一项非常酷的工作。<p>我是一个有能力、有动力、努力工作的高科技工作者。我没有企业家精神。十二年来，我一直要求无数的招聘人员寻找---并且自己也在寻找---帮助开发与改善气候变化直接相关的系统的机会。任何东西都可以。电池技术、太阳能装置、核聚变、风力发电、电动运输、碳抵消、气候金融技术，你可以说出来。<p>如果想帮助应对气候变化的软件开发人员的工作在那里，它隐藏得非常好。<p>从我的角度来看，我们需要投入更多的努力，将人们与气候变化的机会联系起来。想象一下，丰饶之角充斥着帮助解决我们这个时代最大威胁的机会。<p>我们如何让更多人参与进来？\n",
  "description_zh-Hant": "我是一個狂熱的氣候變化倡導者。2010年，我的互動軟件讓公眾有機會分析加拿大環境部的氣候數據，在不列顛哥倫比亞省的Apps 4 Climate Action競賽中獲得了榮譽獎。大約在那個時候，我在家裡安裝了一個太陽能熱水器。三年前，我開發了一個計算器來顯示電動汽車的投資回報。我在2020年買了一輛電動車，原因有很多：環保、財務（8年的投資回報率），以及取代一輛23年的破舊汽油車。2018年，我與近二十位科學插畫師合作編寫了一本免費的電子書，解釋了我們如何知道我們所知道的氣候變化，從宇宙的開始追溯到今天。<p>我工作的公司生產的一些無線電被南極洲的研究人員用來增加他們可以安全旅行的範圍，因此研究更大的環境表面，同時保持與基站的聯繫。我沒有直接參與，儘管我確信這是一項非常酷的工作。<p>我是一個有能力、有動力、努力工作的高科技工作者。我沒有企業家精神。十二年來，我一直要求無數的招聘人員尋找---並且自己也在尋找---幫助開發與改善氣候變化直接相關的系統的機會。任何東西都可以。電池技術、太陽能裝置、核聚變、風力發電、電動運輸、碳抵消、氣候金融技術，你可以說出來。<p>如果想幫助應對氣候變化的軟件開發人員的工作在那裡，它隱藏得非常好。<p>從我的角度來看，我們需要投入更多的努力，將人們與氣候變化的機會聯繫起來。想象一下，豐饒之角充斥著幫助解決我們這個時代最大威脅的機會。<p>我們如何讓更多人參與進來？\n"
}