{
  "@type": "NewsArticle",
  "identifier": "2022--06--04--en--askhn--HackerNews--NewsArticle--31619540",
  "url": "https://news.ycombinator.com/item?id=31619540",
  "headline": "Ask HN: How is ads Google's primary source of income when the tooling is awful?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So I've spent the entire day today trying to get one set of ads to run on Google Ads across multiple properties of theirs.<p>But the authoring tools are so awful! Sometimes the tabs hang, sometimes it looses data. You click the wrong thing and now it changed the campaign goal to be something else and you can't revert the change and have to beginning from the beginning. The UX is terrible in itself, but the technical issues overshadow the lack of UX by simply making the whole thing appear broken most of the time.<p>I've tried multiple browsers, different accounts and the experience is the same: fucking awful.<p>If this is the best they can offer for their supposedly main source of income, how is the company even profitable? Am I just plain stupid because I can't get things to work, or is this really the experience they offer people when they want to create ads in their network?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "capableweb",
    "url": "https://news.ycombinator.com/user?id=capableweb"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31619540",
  "sameAs": "https://news.ycombinator.com/item?id=31619540",
  "dateCreated": "2022-06-04T12:38:43.958Z",
  "datePublished": "2022-06-04T12:29:17.000Z",
  "dateModified": "2022-06-04T12:38:43.958Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 当工具很糟糕时，广告如何成为谷歌的主要收入来源？\n",
  "headline_zh-Hant": "Ask HN: 當工具很糟糕時，廣告如何成為谷歌的主要收入來源？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "因此，我今天花了一整天的时间，试图让一组广告在谷歌广告上运行，跨越他们的多个属性。<p>但是，创作工具太糟糕了！有时标签会挂起，有时会丢失数据。有时标签会挂起，有时会丢失数据。你点击了错误的东西，现在它把广告活动的目标改成了别的东西，而你却不能恢复这个变化，必须从头开始。用户体验本身就很糟糕，但技术问题掩盖了用户体验的不足，在大多数情况下，整个事情看起来都是坏的。<p>我试过多个浏览器，不同的账户，体验都是一样的：他妈的太糟糕了。<p>如果这是他们能提供的最好的所谓主要收入来源，那么该公司是如何盈利的？是我太笨了，因为我不能让事情顺利进行，还是这真的是他们为人们提供的体验，当他们想在他们的网络中创建广告时？\n",
  "description_zh-Hant": "因此，我今天花了一整天的時間，試圖讓一組廣告在谷歌廣告上運行，跨越他們的多個屬性。<p>但是，創作工具太糟糕了！有時標籤會掛起，有時會丟失數據。有時標籤會掛起，有時會丟失數據。你點擊了錯誤的東西，現在它把廣告活動的目標改成了別的東西，而你卻不能恢復這個變化，必須從頭開始。用戶體驗本身就很糟糕，但技術問題掩蓋了用戶體驗的不足，在大多數情況下，整個事情看起來都是壞的。<p>我試過多個瀏覽器，不同的賬戶，體驗都是一樣的：他媽的太糟糕了。<p>如果這是他們能提供的最好的所謂主要收入來源，那麼該公司是如何盈利的？是我太笨了，因為我不能讓事情順利進行，還是這真的是他們為人們提供的體驗，當他們想在他們的網絡中創建廣告時？\n"
}