{
  "@type": "NewsArticle",
  "identifier": "2022--08--04--en--askhn--HackerNews--NewsArticle--32338779",
  "url": "https://news.ycombinator.com/item?id=32338779",
  "headline": "Ask HN: What's up with these DoorDash dark patterns?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm in the Bay Area. We don't order using apps often, but when we do we find that so much of the selection consists of mediocre looking Chinese, Indian, pizza and Mexican.<p>Using the current Android mobile app, you can't actually drill into and read reviews which makes assessing the actual quality of the restaurant difficult.<p>And I've found that restaurants will run their own &quot;ghost kitchen&quot; shadow restaurant out of their main (poorly rated) location. This delivery specific restaurant has good reviews on DD, but when you Google that restaurant name nothing comes up aside from listings on the app. And then the food arrives and it's terrible and you match up the physical address and realize it's a poorly rated Indian restaurant by a different name.<p>Or, you order from one of these weird ghost kitchen brands and the actual restaurant doesn't actually get your order (despite the app telling you they confirmed it) and your second driver finally tells you to cancel the order.<p>Is it asking too much to have a service that's transparent, functions well and have the end product taste good?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "flycatcha",
    "url": "https://news.ycombinator.com/user?id=flycatcha"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32338779",
  "sameAs": "https://news.ycombinator.com/item?id=32338779",
  "dateCreated": "2022-08-04T03:46:59.815Z",
  "datePublished": "2022-08-04T02:48:48.000Z",
  "dateModified": "2022-08-04T03:46:59.815Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 7
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "Ask HN: 这些DoorDash的黑暗图案是怎么回事？\n",
  "headline_zh-Hant": "Ask HN: 這些DoorDash的黑暗圖案是怎麼回事？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在湾区。我们不经常使用应用程序订餐，但当我们这样做时，我们发现很多选择是由看起来很平庸的中国菜、印度菜、比萨饼和墨西哥菜组成的。<p>使用目前的安卓手机应用程序，你实际上无法钻研和阅读评论，这使得评估餐厅的实际质量很困难。<p>而且我发现，餐厅会在其主要（评价很差）地点之外经营自己的&quot;幽灵厨房&quot; 影子餐厅。这家特定的外卖餐厅在DD上有很好的评价，但当你在谷歌上搜索这家餐厅的名字时，除了应用程序上的列表外，什么都没有出现。<p>或者，你从这些奇怪的 \"幽灵厨房 \"品牌中订餐，而实际的餐厅并没有收到你的订单（尽管应用程序告诉你他们已经确认了），你的第二个司机最后告诉你取消订单。<p>拥有一个透明、功能良好、最终产品味道好的服务要求是不是太高了？\n",
  "description_zh-Hant": "我在灣區。我們不經常使用應用程序訂餐，但當我們這樣做時，我們發現很多選擇是由看起來很平庸的中國菜、印度菜、比薩餅和墨西哥菜組成的。<p>使用目前的安卓手機應用程序，你實際上無法鑽研和閱讀評論，這使得評估餐廳的實際質量很困難。<p>而且我發現，餐廳會在其主要（評價很差）地點之外經營自己的&quot;幽靈廚房&quot; 影子餐廳。這家特定的外賣餐廳在DD上有很好的評價，但當你在谷歌上搜索這家餐廳的名字時，除了應用程序上的列表外，什麼都沒有出現。<p>或者，你從這些奇怪的 \"幽靈廚房 \"品牌中訂餐，而實際的餐廳並沒有收到你的訂單（儘管應用程序告訴你他們已經確認了），你的第二個司機最後告訴你取消訂單。<p>擁有一個透明、功能良好、最終產品味道好的服務要求是不是太高了？\n"
}