{
  "@type": "NewsArticle",
  "identifier": "2022--07--07--en--askhn--HackerNews--NewsArticle--32019914",
  "url": "https://news.ycombinator.com/item?id=32019914",
  "headline": "Ask HN: Should I leave my socio-sentimental local minimum?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, obviously posting from a throwaway account. In the recent past, I struggled with depression, due to burnout at work + loneliness. I started getting better with therapy, but I hit another low when once I started recovering, tried to date people, and failed catastrophically at attracting women.<p>After a couple of relapses, today I can say that I feel way better than before. I have a decent work-life balance, I don't get stressed, I don't have anxiety, I don't have social anxiety, I do exercise, I basically don't care much about stuff. I'm really stable mentally, which to me is a big accomplishment, and have been consistently feeling like this for some months.<p>I'm usually alone (live alone and work on my own stuff, basically), but from time to time I meet 1 person for lunch (e.g., a colleague from work). I do this, say, once a week or so.<p>So, now I feel like I have a decent quality of life and good mental stability, a big accomplishment, but at the same time, it's true that I'm suppressing my instinct of trying to date people. I'm purposely avoiding any dating situation, because I know that with very, very high probability, the answer is going to be no, and this might affect my beloved mental stability. While it's tempting to think: &quot;it's a numbers game, it shouldn't affect you, you should try it&quot;, in one of the depression relapses I mentioned, what happened was precisely that I got lots of rejections in a row; enough rejections so that I don't take rejections personally anymore; a single rejection doesn't affect me, but what does affect me is having virtually always the same result: a rejection.<p>So, HNers who have been a similar situation, what would you do? Would you stick to my local minimum, or would you try to leave it by going back to the dating game? If so, any strategies for getting another relapse?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "canthrowaway",
    "url": "https://news.ycombinator.com/user?id=canthrowaway"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32019914",
  "sameAs": "https://news.ycombinator.com/item?id=32019914",
  "dateCreated": "2022-07-07T22:26:25.235Z",
  "datePublished": "2022-07-07T21:46:51.000Z",
  "dateModified": "2022-07-07T22:26:25.235Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该离开我的社会感性的地方最低限度吗？\n",
  "headline_zh-Hant": "Ask HN: 我應該離開我的社會感性的地方最低限度嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，显然是用一个扔掉的账户发帖。最近，我与抑郁症作斗争，原因是工作倦怠+孤独。我通过治疗开始好转，但当我开始康复时，我又陷入了另一个低谷，我试着与人约会，但在吸引女性方面失败得一塌糊涂。<p>经过几次复发，今天我可以说，我感觉比以前好得多。我的工作和生活平衡得很好，我没有压力，我没有焦虑，我没有社交焦虑，我做运动，我基本上不怎么关心东西。我的精神状态非常稳定，这对我来说是一个很大的成就，而且几个月来一直有这样的感觉。<p>我通常是一个人（一个人住，基本上是在自己的事情上工作），但时不时地会和1个人一起吃午饭（例如，工作中的同事）。我这样做，比如说，每周一次左右。<p>所以，现在我觉得我有一个体面的生活质量和良好的心理稳定性，这是一个很大的成就，但与此同时，我确实在压制我尝试与人约会的本能。我故意回避任何约会情况，因为我知道，以非常非常高的概率，答案将是否定的，而这可能会影响我心爱的精神稳定。虽然很容易想到：&quot;这是一个数字游戏，它不应该影响你，你应该试试&quot;，但在我提到的一次抑郁症复发中，发生的事情恰恰是我连续得到了很多拒绝；足够多的拒绝使我不再把拒绝放在心上；一次拒绝并不影响我，但影响我的是几乎总是有相同的结果：拒绝。<p>那么，有过类似情况的HNers，你会怎么做？你会坚持我在当地的最低限度，还是会试图通过回到约会游戏来离开它？如果是这样，有什么策略可以让你再次复发？\n",
  "description_zh-Hant": "嗨，HN，顯然是用一個扔掉的賬戶發帖。最近，我與抑鬱症作鬥爭，原因是工作倦怠+孤獨。我通過治療開始好轉，但當我開始康復時，我又陷入了另一個低谷，我試著與人約會，但在吸引女性方面失敗得一塌糊塗。<p>經過幾次復發，今天我可以說，我感覺比以前好得多。我的工作和生活平衡得很好，我沒有壓力，我沒有焦慮，我沒有社交焦慮，我做運動，我基本上不怎麼關心東西。我的精神狀態非常穩定，這對我來說是一個很大的成就，而且幾個月來一直有這樣的感覺。<p>我通常是一個人（一個人住，基本上是在自己的事情上工作），但時不時地會和1個人一起吃午飯（例如，工作中的同事）。我這樣做，比如說，每週一次左右。<p>所以，現在我覺得我有一個體面的生活質量和良好的心理穩定性，這是一個很大的成就，但與此同時，我確實在壓制我嘗試與人約會的本能。我故意迴避任何約會情況，因為我知道，以非常非常高的概率，答案將是否定的，而這可能會影響我心愛的精神穩定。雖然很容易想到：&quot;這是一個數字遊戲，它不應該影響你，你應該試試&quot;，但在我提到的一次抑鬱症復發中，發生的事情恰恰是我連續得到了很多拒絕；足夠多的拒絕使我不再把拒絕放在心上；一次拒絕並不影響我，但影響我的是幾乎總是有相同的結果：拒絕。<p>那麼，有過類似情況的HNers，你會怎麼做？你會堅持我在當地的最低限度，還是會試圖通過回到約會遊戲來離開它？如果是這樣，有什麼策略可以讓你再次復發？\n"
}