{
  "@type": "NewsArticle",
  "identifier": "2022--07--27--en--askhn--HackerNews--NewsArticle--32250823",
  "url": "https://news.ycombinator.com/item?id=32250823",
  "headline": "Ask HN: What are some good resources for micro service design?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm still quite early in my career, only at my second SW Dev job. My previous position was a monolith app with arguably poor design resulting in large parts of the app being very tightly coupled when they shouldn't be. Obviously this make testing some parts of the app very difficult  and of course those were the critical parts of them app (our integration test suite took over 24 hours to run at one point).<p>When I joined my current company they were in the process of breaking down their monolith into micro services which based on my work at my previous position seemed like a much better alternative. After some time here I feel like I'm unsure whether or not micro services are as amazing as they need to be but I'm currently chalking it up to my inexperience with them. It seems like there needs to be a balance of making sure that each service has a limited responsibility while also not having services too interdependent.<p>So basically I would like to learn more about good design practices and pitfalls to avoid. What resources have you guys used to learn more about micro services?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "n00bskoolbus",
    "url": "https://news.ycombinator.com/user?id=n00bskoolbus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32250823",
  "sameAs": "https://news.ycombinator.com/item?id=32250823",
  "dateCreated": "2022-07-27T14:44:37.774Z",
  "datePublished": "2022-07-27T14:30:50.000Z",
  "dateModified": "2022-07-27T14:44:37.774Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 有哪些关于微观服务设计的好资源？\n",
  "headline_zh-Hant": "Ask HN: 有哪些關於微觀服務設計的好資源？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的职业生涯还很早，只是在我的第二份SW Dev工作。我之前的工作是一个单片机应用，可以说设计得很差，导致应用的大部分部分都是非常紧密的耦合，而它们不应该是这样。<p>当我加入我现在的公司时，他们正在将他们的单片机分解成微服务，根据我之前的工作，这似乎是一个更好的选择。在这里工作了一段时间后，我觉得我不确定微服务是否像它们需要的那样令人惊叹，但我目前把它归结为我对它们的经验不足。似乎需要有一个平衡点，确保每个服务都有有限的责任，同时也不要让服务过于相互依赖。<p>所以基本上我想了解更多关于良好的设计实践和要避免的陷阱。你们用什么资源来了解更多关于微服务的信息？\n",
  "description_zh-Hant": "我的職業生涯還很早，只是在我的第二份SW Dev工作。我之前的工作是一個單片機應用，可以說設計得很差，導致應用的大部分部分都是非常緊密的耦合，而它們不應該是這樣。<p>當我加入我現在的公司時，他們正在將他們的單片機分解成微服務，根據我之前的工作，這似乎是一個更好的選擇。在這裡工作了一段時間後，我覺得我不確定微服務是否像它們需要的那樣令人驚歎，但我目前把它歸結為我對它們的經驗不足。似乎需要有一個平衡點，確保每個服務都有有限的責任，同時也不要讓服務過於相互依賴。<p>所以基本上我想了解更多關於良好的設計實踐和要避免的陷阱。你們用什麼資源來了解更多關於微服務的信息？\n"
}