{
  "@type": "NewsArticle",
  "identifier": "2022--04--26--en--askhn--HackerNews--NewsArticle--31169826",
  "url": "https://news.ycombinator.com/item?id=31169826",
  "headline": "Ask HN: What Is a Woman?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This question has been used as a &quot;gotcha&quot; by opponents of gender theory and gender reassignment. It's not an issue I'm particularly passionate about, but this question did stump me and I've spent a lot of time thinking about it.<p>Most dictionary definitions of woman define it essentially as an adult human female. Female, being a sex, would cause this definition to make it so that trans-women <i>aren't</i> technically women, and many people perceive that as a problem. But I, and my social circle, has been unable to think of a inclusive definition that still made sense.<p>Here are some of the forms of answers I've seen to this question:<p>1. Answers that include the word in its own definition. &quot;A woman is someone who identifies as a woman&quot; etc.<p>2. Answers that define by exclusion &quot;A woman is a gender that is not man or non-binary&quot; etc.<p>3. Answers that categorize instead of define. &quot;A woman is a social construct.&quot;<p>4. Avoidance. &quot;It's not for me to define what a woman is&quot;.<p>There's a lot of smart, reasonable people here. How do you tackle this problem? What's your answer?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "MathCodeLove",
    "url": "https://news.ycombinator.com/user?id=MathCodeLove"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31169826",
  "sameAs": "https://news.ycombinator.com/item?id=31169826",
  "dateCreated": "2022-04-26T17:18:12.422Z",
  "datePublished": "2022-04-26T16:51:19.000Z",
  "dateModified": "2022-04-26T17:18:12.422Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 什么是女人？",
  "headline_zh-Hant": "Ask HN: 什麼是女人？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这个问题已经被性别理论和性别重置的反对者用作&quot;getcha&quot;。It's not an issue I'm particularly passionate about, but this question did stump me and I've spent a lot of time thinking about it.<p>Most dictionary definitions of woman define it essentially as an adult human female. Female, being a sex, would cause this definition to make it so that trans-women <i>aren't</i> technically women, and many people perceive that as a problem. 但我和我的社交圈一直无法想到一个包容的定义，而这个定义仍然是有意义的。<p>以下是我对这个问题看到的一些答案形式：<p>1. <p>1.将该词包含在其本身的定义中的答案：&quot;一个女人是指被认定为女人的人&quot;等。 <p>2.通过排除法定义的答案：&quot;一个女人是指非男人或非二进制的性别&quot;等。 <p>3.以分类代替定义的答案：&quot;女人是一种社会结构&quot;<p>4.回避：&quot;不是由我来定义什么是女人&quot;<p>这里有很多聪明、合理的人。你如何解决这个问题？你的答案是什么？",
  "description_zh-Hant": "這個問題已經被性別理論和性別重置的反對者用作&quot;getcha&quot;。It's not an issue I'm particularly passionate about, but this question did stump me and I've spent a lot of time thinking about it.<p>Most dictionary definitions of woman define it essentially as an adult human female. Female, being a sex, would cause this definition to make it so that trans-women <i>aren't</i> technically women, and many people perceive that as a problem. 但我和我的社交圈一直無法想到一個包容的定義，而這個定義仍然是有意義的。<p>以下是我對這個問題看到的一些答案形式：<p>1. <p>1.將該詞包含在其本身的定義中的答案：&quot;一個女人是指被認定為女人的人&quot;等。 <p>2.通過排除法定義的答案：&quot;一個女人是指非男人或非二進制的性別&quot;等。 <p>3.以分類代替定義的答案：&quot;女人是一種社會結構&quot;<p>4.迴避：&quot;不是由我來定義什麼是女人&quot;<p>這裡有很多聰明、合理的人。你如何解決這個問題？你的答案是什麼？"
}