{
  "@type": "NewsArticle",
  "identifier": "2022--07--02--en--askhn--HackerNews--NewsArticle--31961938",
  "url": "https://news.ycombinator.com/item?id=31961938",
  "headline": "Ask HN: Mobile app for shared home budgeting?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Do you have any recommendation of a mobile app for shared home budgeting?<p>My criteria:<p>* Runs on Android<p>* Shares budget / synchronizes data between two users (my wife and I)<p>* Allows to break expenses by categories<p>* Simple to use, not too opinionated (I don't need a dashboard like a Boeing 747 since I'm not trying to run a Wall Street hedge fund; I don't want to be forced to assign an &quot;envelope budget&quot; upfront for every single category, I don't need nor want integration with my bank accounts, etc.)<p>You'd think these requirements don't set the bar particularly high, and yet it seems surprisingly hard to find an app in the Play Store that ticks all the boxes.<p>We've been using Monshare, which is far from perfect (buggy, doesn't work offline even in the most rudimentary sense), but it would mostly do the trick at least. Unfortunately, the creators have abandoned it without any warning: the API is dead, data is inaccessible, user support is off.<p>I've briefly tested several alternatives so far, but unfortunately all of them suck in one way or another (Spendee, iSaveMoney, Money manager, Money Manager (sic), Money Lover, Wallet, Jointo, YNAB, Yona, Bluecoins, Walnut, Finances).<p>Is there some quality app that I'm missing? I believe there might be - it similarly took me a while to find a perfect TODO app that didn't look like a Java desktop app from 1990s and was actually pleasant (Memorigi), maybe I'll see some luck with this one. As an Android dev myself, I feel tempted to write one, but as a newly dad, I don't really have much free time these days.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "V-2",
    "url": "https://news.ycombinator.com/user?id=V-2"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31961938",
  "sameAs": "https://news.ycombinator.com/item?id=31961938",
  "dateCreated": "2022-07-02T20:25:55.810Z",
  "datePublished": "2022-07-02T20:12:06.000Z",
  "dateModified": "2022-07-02T20:25:55.810Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 用于共享家庭预算的移动应用程序？\n",
  "headline_zh-Hant": "Ask HN: 用於共享家庭預算的移動應用程序？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你有什么推荐的共享住宅预算的手机应用吗？ <p>我的标准。 <p>* 在安卓系统上运行<p>* 在两个用户（我和妻子）之间共享预算/同步数据<p>* 允许按类别划分开支<p>* 使用简单，不要太有主见（我不需要像波音747那样的仪表盘，因为我不是要经营华尔街的对冲基金；我不想被迫为每个类别预先指定一个&quot;信封预算&quot;，我不需要也不想与银行账户集成，等等。 <p>你会认为这些要求并没有设置特别高的标准，但似乎在Play Store中很难找到一个符合所有条件的应用程序。<p>我们一直在使用Monshare，它远非完美（有缺陷，甚至在最基本的意义上不能离线工作），但它至少大部分会做这个技巧。不幸的是，创造者在没有任何警告的情况下放弃了它：API已死，数据无法访问，用户支持已关闭。<p>到目前为止，我已经简单地测试了几个替代品，但不幸的是，它们都在某种程度上很糟糕（Spendee、iSaveMoney、Money manager、Money Manager（原文如此）、Money Lover、Wallet、Jointo、YNAB、Yona、Bluecoins、Walnut、Finances）。<p>是否有一些优质应用被我错过？我相信可能会有--同样，我花了好长时间才找到一个完美的TODO应用程序，它不像90年代的Java桌面应用程序，而且实际上是令人愉快的（Memorigi），也许我在这个应用程序上会看到一些运气。作为一个Android开发者，我很想写一个，但作为一个新爸爸，我最近真的没有什么空闲时间。\n",
  "description_zh-Hant": "你有什麼推薦的共享住宅預算的手機應用嗎？ <p>我的標準。 <p>* 在安卓系統上運行<p>* 在兩個用戶（我和妻子）之間共享預算/同步數據<p>* 允許按類別劃分開支<p>* 使用簡單，不要太有主見（我不需要像波音747那樣的儀表盤，因為我不是要經營華爾街的對沖基金；我不想被迫為每個類別預先指定一個&quot;信封預算&quot;，我不需要也不想與銀行賬戶集成，等等。 <p>你會認為這些要求並沒有設置特別高的標準，但似乎在Play Store中很難找到一個符合所有條件的應用程序。<p>我們一直在使用Monshare，它遠非完美（有缺陷，甚至在最基本的意義上不能離線工作），但它至少大部分會做這個技巧。不幸的是，創造者在沒有任何警告的情況下放棄了它：API已死，數據無法訪問，用戶支持已關閉。<p>到目前為止，我已經簡單地測試了幾個替代品，但不幸的是，它們都在某種程度上很糟糕（Spendee、iSaveMoney、Money manager、Money Manager（原文如此）、Money Lover、Wallet、Jointo、YNAB、Yona、Bluecoins、Walnut、Finances）。<p>是否有一些優質應用被我錯過？我相信可能會有--同樣，我花了好長時間才找到一個完美的TODO應用程序，它不像90年代的Java桌面應用程序，而且實際上是令人愉快的（Memorigi），也許我在這個應用程序上會看到一些運氣。作為一個Android開發者，我很想寫一個，但作為一個新爸爸，我最近真的沒有什麼空閒時間。\n"
}