{
  "@type": "NewsArticle",
  "identifier": "2022--06--08--en--askhn--HackerNews--NewsArticle--31671714",
  "url": "https://news.ycombinator.com/item?id=31671714",
  "headline": "Ask HN: Transition from PHP WordPress development to full stack JavaScript",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "My career so far looks like this:<p>- First 3 years I have worked on a SaaS app (on and off, but I managed to get some 1.5 years of more than full time to work on it), was unsuccessful and quit it. First project, looking back, awful code quality,  VanillaJS and really messy, it was 2015 though. Got to the point of shipping an early access though.<p>- Next 2 years I work as a contractor adding custom functionality to client's websites by developing WordPress plugins<p>- Next 2 years, I keep the contracting but decrease the hours by a lot. Starting to work on a desktop app. Fixing all the mistakes I made over the then 5 years of unsupervised development (starting to use version control, writing tests where applicable, learning how to structure things better so things are more decoupled, learning how to comment properly) + learning modern web tech like React and Typescript.<p>This year, I realized that the desktop app is going to take more time. I was barely getting by with the contracting, living at my parents'. (I was taking very small, unprofitable projects, to average about 20h/week - so I could have 40h/week for my app). Now knowing that it will take more time, I can't follow this strategy anymore, it's clear that I need to get a well paid full time job, work it a bit (some 2 years) and then life off the savings to prepare for the launch.<p>I'd prefer to not go for a full time PHP / WP dev job. I'd rather aim to do work as a front-end developer or a full-stack developer, for which there's much more job offers + the salaries are higher (money is literally time here). Obviously if it does not work out, I would take a PHP job, but it's last resort.<p>So I was wondering, is it realistic for me to expect that I could get a remote front-end or full stack JS job in the US (I live in Europe) with my resume?<p>I can't really say that I have been working for 2 years on a desktop app and in the next 2 years I will quit the job to launch it, but maybe I could add that I was working on a desktop app under an NDA as part of the contracting. I'm also planning a 3 - 4 month break from contracting where I could spend 700h to develop a simple web app . If time allows, I also have 2 ideas for front-end libraries I could develop or at least release a beta version of.<p>So for a summary, my resume would look like this:<p>- The 700h side project I yet have to develop<p>- 5 years contracting, WP plugin development, web app development, desktop app development (won't hide that it was mostly WP plugin development, maybe add that I spent about 2,000h on a desktop app under an NDA)<p>- 3 years working on a SaaS app<p>So basically, do I even have a shot? Or is it not worth even trying, I should save myself time developing the side project and instead look for a lower paid WP dev job?<p>On a side note, what salaries could be expected from a remote full stack US dev job? Is 120k - 150k TC realistic?<p>Long term it does not matter that much, if the desktop app fails as a business, I will open source it and get some 5,000h worth of code published on GitHub + at least some 4 years experience working on a startup, surely enough to gain enough velocity to escape planet WP. However, getting a lower paid job means a lot more personal life sacrifices in the short term (I already sacrificed the past 2 years).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway_job_t",
    "url": "https://news.ycombinator.com/user?id=throwaway_job_t"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31671714",
  "sameAs": "https://news.ycombinator.com/item?id=31671714",
  "dateCreated": "2022-06-08T18:31:08.022Z",
  "datePublished": "2022-06-08T18:12:50.000Z",
  "dateModified": "2022-06-08T18:31:08.022Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 从PHP WordPress开发过渡到全栈JavaScript\n",
  "headline_zh-Hant": "Ask HN: 從PHP WordPress開發過渡到全棧JavaScript\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "到目前为止，我的职业生涯是这样的：<p>- 前3年，我在一个SaaS应用程序上工作（断断续续，但我设法得到了一些1.5年以上的全职工作），不成功，退出了。第一个项目，现在回想起来，代码质量很差，VanillaJS，而且真的很乱，不过那是2015年。<p>- 接下来的两年，我作为一个承包商，通过开发WordPress插件为客户的网站添加定制功能<p>- 接下来的两年，我继续承包工程，但时间减少了很多。开始着手开发一个桌面应用程序。修正我在过去5年无人监督的开发过程中所犯的所有错误（开始使用版本控制，在适当的地方写测试，学习如何更好地组织事情，使事情更加解耦，学习如何正确评论）+学习现代网络技术，如React和Typescript.<p>今年，我意识到桌面应用程序将需要更多时间。我住在父母家，靠承包工程勉强度日。(我接了一些很小的、无利可图的项目，平均每周20小时--这样我就可以有40小时/周的时间用于我的应用程序）。现在我知道这需要更多的时间，我不能再遵循这个策略了，很明显，我需要找一份高薪的全职工作，工作一段时间（大约2年），然后靠储蓄生活，为启动做准备。我的目标是做一个前端开发或全栈开发的工作，这样的工作机会更多，工资也更高（在这里钱就是时间）。<p>所以我在想，如果我期望在美国（我住在欧洲）用我的简历找到一份远程的前端或全栈JS工作，这是否现实？<p>我不能说我已经在一个桌面应用程序上工作了两年，并且在未来两年我将辞去工作来推出它，但也许我可以在合同中加入我在NDA下从事桌面应用程序的内容。我还计划从承包中休息3-4个月，在那里我可以花700小时来开发一个简单的网络应用。如果时间允许，我也有两个关于前端库的想法，我可以开发或至少发布一个测试版。 <p>所以总结一下，我的简历会是这样的：<p>- 我还需要开发的700小时的副业项目<p>- 5年的承包，WP插件开发，网络应用开发，桌面应用开发（不会隐瞒主要是WP插件开发，也许会加上我在NDA下花了大约2000小时开发桌面应用）<p>- 3年的SaaS应用工作<p>所以基本上，我是否有机会？还是不值得尝试，我应该为自己节省开发副业的时间，而去寻找工资较低的WP开发工作？<p>另外，一个远程全堆栈的美国开发工作的工资可以预期多少？<p>从长远来看，这并不重要，如果桌面应用程序的业务失败了，我会将其开源，并在GitHub上发布一些价值5000小时的代码+至少4年的创业公司工作经验，肯定足以获得足够的速度来逃离WP星球。然而，获得一份收入较低的工作意味着在短期内要做出更多的个人生活牺牲（我在过去的两年中已经做出了牺牲）。\n",
  "description_zh-Hant": "到目前為止，我的職業生涯是這樣的：<p>- 前3年，我在一個SaaS應用程序上工作（斷斷續續，但我設法得到了一些1.5年以上的全職工作），不成功，退出了。第一個項目，現在回想起來，代碼質量很差，VanillaJS，而且真的很亂，不過那是2015年。<p>- 接下來的兩年，我作為一個承包商，通過開發WordPress插件為客戶的網站添加定製功能<p>- 接下來的兩年，我繼續承包工程，但時間減少了很多。開始著手開發一個桌面應用程序。修正我在過去5年無人監督的開發過程中所犯的所有錯誤（開始使用版本控制，在適當的地方寫測試，學習如何更好地組織事情，使事情更加解耦，學習如何正確評論）+學習現代網絡技術，如React和Typescript.<p>今年，我意識到桌面應用程序將需要更多時間。我住在父母家，靠承包工程勉強度日。(我接了一些很小的、無利可圖的項目，平均每週20小時--這樣我就可以有40小時/周的時間用於我的應用程序）。現在我知道這需要更多的時間，我不能再遵循這個策略了，很明顯，我需要找一份高薪的全職工作，工作一段時間（大約2年），然後靠儲蓄生活，為啟動做準備。我的目標是做一個前端開發或全棧開發的工作，這樣的工作機會更多，工資也更高（在這裡錢就是時間）。<p>所以我在想，如果我期望在美國（我住在歐洲）用我的簡歷找到一份遠程的前端或全棧JS工作，這是否現實？<p>我不能說我已經在一個桌面應用程序上工作了兩年，並且在未來兩年我將辭去工作來推出它，但也許我可以在合同中加入我在NDA下從事桌面應用程序的內容。我還計劃從承包中休息3-4個月，在那裡我可以花700小時來開發一個簡單的網絡應用。如果時間允許，我也有兩個關於前端庫的想法，我可以開發或至少發佈一個測試版。 <p>所以總結一下，我的簡歷會是這樣的：<p>- 我還需要開發的700小時的副業項目<p>- 5年的承包，WP插件開發，網絡應用開發，桌面應用開發（不會隱瞞主要是WP插件開發，也許會加上我在NDA下花了大約2000小時開發桌面應用）<p>- 3年的SaaS應用工作<p>所以基本上，我是否有機會？還是不值得嘗試，我應該為自己節省開發副業的時間，而去尋找工資較低的WP開發工作？<p>另外，一個遠程全堆棧的美國開發工作的工資可以預期多少？<p>從長遠來看，這並不重要，如果桌面應用程序的業務失敗了，我會將其開源，並在GitHub上發佈一些價值5000小時的代碼+至少4年的創業公司工作經驗，肯定足以獲得足夠的速度來逃離WP星球。然而，獲得一份收入較低的工作意味著在短期內要做出更多的個人生活犧牲（我在過去的兩年中已經做出了犧牲）。\n"
}