{
  "@type": "NewsArticle",
  "identifier": "2022--06--12--en--askhn--HackerNews--NewsArticle--31718085",
  "url": "https://news.ycombinator.com/item?id=31718085",
  "headline": "Ask HN: How do you pick the right career path as a SWE?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Note: I'm posting under an anonymous account to prevent offending my current employer/co-workers who read HN.<p>Last year I self-taught my way into software, and published a fun music app that made a buzz right here on HN. I felt validated that I had something special to offer, and this gave me the confidence to interview. A month later, I had multiple offers in hand, and signed my first job as a SWE.<p>I am approaching a year at this job (full stack web, e-commerce) and worry I may have made the wrong choice. I am surrounded by talented, smart, even pleasant co-workers, and I am learning from them. But I feel like I'm spending precious time on a narrow path, learning this business's proprietary knowledge, processes, and challenges.<p>I fell in love with programming: engineering solutions to interesting problems by writing code. My music app was an example of this. Now, 90% of my work is convincing other engineers that we should refactor a flakey test suite or align on implementation details of form state management.<p>I thought I would be able to continue building fun, creative projects in my spare time, but I am totally burnt after the workday.<p>Friends tell me to look for another job, but they also tell me the current job sounds great compared to what they’ve experienced. I feel a bit lost and thought I should reach out to the community that helped me get my start.<p>Any advice?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "yellowBrickCode",
    "url": "https://news.ycombinator.com/user?id=yellowBrickCode"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31718085",
  "sameAs": "https://news.ycombinator.com/item?id=31718085",
  "dateCreated": "2022-06-12T20:57:15.324Z",
  "datePublished": "2022-06-12T20:44:12.000Z",
  "dateModified": "2022-06-12T20:57:15.324Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 作为一名SWE，你如何挑选正确的职业道路？\n",
  "headline_zh-Hant": "Ask HN: 作為一名SWE，你如何挑選正確的職業道路？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "注：我以匿名账户发帖，以防止冒犯我现在的雇主/阅读HN的同事。<p>去年我自学了软件，并发布了一个有趣的音乐应用程序，在HN上引起了轰动。我觉得自己有一些特别的东西可以提供，这让我有信心去面试。一个月后，我拿到了多个offer，并签下了我作为SWE的第一份工作。<p>我在这份工作（全栈网络，电子商务）即将满一年，我担心自己可能做了错误的选择。我身边有很多有才华、聪明、甚至讨人喜欢的同事，我也在向他们学习。但我觉得我在一条狭窄的道路上花费了宝贵的时间，学习这个企业的专有知识、流程和挑战。<p>我爱上了编程：通过编写代码来解决有趣的问题。我的音乐应用程序就是这样一个例子。现在，我90%的工作是说服其他工程师，我们应该重构一个脆弱的测试套件，或者在表单状态管理的实施细节上保持一致。<p>我以为我可以在业余时间继续构建有趣的、有创意的项目，但在工作日之后，我完全被烧毁了。<p>朋友们告诉我寻找另一份工作，但他们也告诉我目前的工作与他们所经历的相比听起来很不错。我感到有些失落，认为我应该向帮助我起步的社区伸出援手。<p>有什么建议吗？\n",
  "description_zh-Hant": "注：我以匿名賬戶發帖，以防止冒犯我現在的僱主/閱讀HN的同事。<p>去年我自學了軟件，併發布了一個有趣的音樂應用程序，在HN上引起了轟動。我覺得自己有一些特別的東西可以提供，這讓我有信心去面試。一個月後，我拿到了多個offer，並簽下了我作為SWE的第一份工作。<p>我在這份工作（全棧網絡，電子商務）即將滿一年，我擔心自己可能做了錯誤的選擇。我身邊有很多有才華、聰明、甚至討人喜歡的同事，我也在向他們學習。但我覺得我在一條狹窄的道路上花費了寶貴的時間，學習這個企業的專有知識、流程和挑戰。<p>我愛上了編程：通過編寫代碼來解決有趣的問題。我的音樂應用程序就是這樣一個例子。現在，我90%的工作是說服其他工程師，我們應該重構一個脆弱的測試套件，或者在表單狀態管理的實施細節上保持一致。<p>我以為我可以在業餘時間繼續構建有趣的、有創意的項目，但在工作日之後，我完全被燒燬了。<p>朋友們告訴我尋找另一份工作，但他們也告訴我目前的工作與他們所經歷的相比聽起來很不錯。我感到有些失落，認為我應該向幫助我起步的社區伸出援手。<p>有什麼建議嗎？\n"
}