{
  "@type": "NewsArticle",
  "identifier": "2022--07--05--en--askhn--HackerNews--NewsArticle--31988486",
  "url": "https://news.ycombinator.com/item?id=31988486",
  "headline": "Ask HN: Could my motivation to learn IT/Programming/Cybersecurity be misguided?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello everyone,<p>I will try to keep this as short as possible, but I can’t spare you a few details about myself. I’ll give you a tl;dr at the end.<p>I’m a European male in my mid-thirties and I have spent most of my working life as a cook (never a  head chef). A few years back I got a two-year degree in hotel-management (that’s a thing where I live) to escape the hell that is line-cooking. Originally I always wanted to become a head chef, but with more and more economic pressure and less talented or willing personnel everywhere, I’m not envious of anybody in that position anymore.<p>Also I thought I would drink less if I didn’t have to cook anymore, but it turned out that was a lie and I realized I was a bona fide alcoholic. I got treatment and I’m almost 2 years sober now and thankful for it. However, it also made me realize that without alcohol I’m a very shy and introverted person. I used drugs, alcohol and an ‘asshole persona’ to suppress feelings of abandonment and emotional abuse as a child.<p>Because I grew up with computers (created some websites with plain html back in the day) I thought maybe this could be my new career. There is less interpersonal contact in IT and I’m genuinely interested in various fields. However, despite that real interest that draws me in to open that IDE or do CTFs in the evening, I can’t help but feel that I’m again running away from something.<p>I’ve always written as a hobby and recently published some short-stories that were well received. Also I feel like I have valuable insights into trauma and addiction that want to be … how do I say it … turned into something helpful for others. Maybe in the form of a blog for men (because I noticed a lot of resources are skewed towards women, or written by women (not that that’s a problem, but it might not speak to everybody equally))\nSo a whole different path could be to study psychology in part-time, focus on healing myself and possibly helping others along the way. I feel like that’s what I should do, it feels ‘right’. But a part of me wants to be a tech-savvy hacker-type person, who doesn’t have to worry about a well-paying job. Plus there is a considerable amount of fear within me, that governments are turning increasingly authoritarian and will be using technology to control people. So I want to be prepared and possibly know computers well enough to protect my freedom. But that’s just fear, and fear is never a good captain they say. Also I have no idea how realistic any of this is. If the NSA creates software for a digital ID system, a former line-cook probably won’t crack the code in his spare time, amIright?<p>And lastly I do feel more agitated and stressed when I’ve been in front of the computer for extended periods. The sheer amount that is to learn and again more fear that I will never be any good, or possibly be even more stressed when I get an actual job than I was as a cook. I don’t enjoy conversations and the company of friends as much when I’ve coded for the last two days or more. My mind seems sluggish and my soul withdrawn. But meaningful relationships are an essential part of healing from what I’ve been through.<p>In trauma recovery there is a concept that many of us pour energy into misguided careers, with the hopes of ‘it’ll all be better once I get where I want to be’. But when we end up there everything stays the same, except we’re burnt out or close to it. Could this be just another attempt of my subconscious to do exactly that?<p>So here, the tl;dr<p>I want to get into IT, because I feel it would solve many problems I have. But I’m worried it’s just a fantasy and real-life will be just a different version of what I’m trying to avoid. Should somebody who is prone to stress-related illnesses maybe stay out of IT?<p>If you have read all of that I thank you sincerely. Harsh truths are welcome, just try to be kind. I’m sensitive these days.<p>Be healthy everyone.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Peach_blue",
    "url": "https://news.ycombinator.com/user?id=Peach_blue"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31988486",
  "sameAs": "https://news.ycombinator.com/item?id=31988486",
  "dateCreated": "2022-07-05T14:24:43.387Z",
  "datePublished": "2022-07-05T14:21:20.000Z",
  "dateModified": "2022-07-05T14:24:43.387Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我学习IT/编程/网络安全的动机会不会是被误导了？\n",
  "headline_zh-Hant": "Ask HN: 我學習IT/編程/網絡安全的動機會不會是被誤導了？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>我将尽量保持简短，但我不能放过关于自己的一些细节。<p>我是一个三十多岁的欧洲男性，我的工作生涯中大部分时间都是在做厨师（从未做过厨师长）。几年前，我获得了一个为期两年的酒店管理学位（在我住的地方有这种说法），以逃避排队做饭的地狱。原本我一直想成为一名厨师长，但随着经济压力越来越大，各地的人才越来越少，我不再羡慕任何人在那个位置上。<p>我还以为如果我不用再做饭，我就会少喝酒，但事实证明那是一个谎言，我意识到我是一个真正的酒鬼。我接受了治疗，现在已经戒酒近2年了，对此我很感激。然而，这也让我意识到，如果没有酒精，我是一个非常害羞和内向的人。我使用毒品、酒精和 \"混蛋角色 \"来压制童年时被遗弃和情感虐待的感觉。<p>因为我是与电脑一起长大的（当年用普通的html创建了一些网站），我想也许这可以成为我的新职业。IT行业的人际接触较少，而且我对各个领域都有真正的兴趣。然而，尽管这种真正的兴趣吸引我在晚上打开那个IDE或做CTF，但我不禁觉得我又在逃避什么。<p>我一直把写作作为一种爱好，最近出版了一些短篇小说，受到了好评。此外，我觉得我对创伤和成瘾有宝贵的见解，希望能......怎么说呢......变成对别人有帮助的东西。也许是以男性博客的形式（因为我注意到很多资源都偏向于女性，或者是由女性写的（不是说这是个问题，但它可能不会对每个人都平等地说话））。\n因此，一条完全不同的道路可能是兼职学习心理学，专注于治愈自己，并可能在此过程中帮助他人。我觉得这是我应该做的，感觉 \"正确\"。但我的一部分想成为一个精通技术的黑客型人，不必为高薪工作而担心。另外，我内心有一种相当大的恐惧，即政府正变得越来越专制，并将利用技术来控制人民。所以我想做好准备，可能对电脑有足够的了解，以保护我的自由。但这只是恐惧，他们说恐惧从来都不是一个好队长。另外，我不知道这些东西的现实性如何。如果国家安全局为数字身份证系统创建了软件，一个前线厨师可能不会在业余时间破解密码，对吗？<p>最后，当我长时间在电脑前工作时，我确实感到更加烦躁和紧张。要学习的东西太多，又更担心自己永远不会有什么出息，或者当我找到一份真正的工作时，可能会比当厨师时压力更大。当我在过去两天或更长时间里一直在编码时，我不太喜欢谈话和朋友的陪伴。我的头脑似乎很迟钝，我的灵魂很退缩。<p>在创伤恢复中，有一个概念，即我们中的许多人将精力倾注在被误导的事业上，希望 \"一旦我到达我想要的地方，一切都会好起来\"。但当我们最终到达那里时，一切都保持不变，除了我们被烧毁或接近烧毁。这是否只是我的潜意识的又一次尝试呢？<p>所以，在这里，我想说的是<p>我想进入IT行业，因为我觉得它可以解决我的许多问题。但我担心这只是一个幻想，而现实生活将只是我试图避免的一个不同版本。如果有人容易患与压力有关的疾病，也许应该远离IT行业？<p>如果你读完了这些，我真诚地感谢你。我们欢迎严酷的事实，但要尽量友善。我最近很敏感。<p>请大家保持健康。\n",
  "description_zh-Hant": "大家好，<p>我將盡量保持簡短，但我不能放過關於自己的一些細節。<p>我是一個三十多歲的歐洲男性，我的工作生涯中大部分時間都是在做廚師（從未做過廚師長）。幾年前，我獲得了一個為期兩年的酒店管理學位（在我住的地方有這種說法），以逃避排隊做飯的地獄。原本我一直想成為一名廚師長，但隨著經濟壓力越來越大，各地的人才越來越少，我不再羨慕任何人在那個位置上。<p>我還以為如果我不用再做飯，我就會少喝酒，但事實證明那是一個謊言，我意識到我是一個真正的酒鬼。我接受了治療，現在已經戒酒近2年了，對此我很感激。然而，這也讓我意識到，如果沒有酒精，我是一個非常害羞和內向的人。我使用毒品、酒精和 \"混蛋角色 \"來壓制童年時被遺棄和情感虐待的感覺。<p>因為我是與電腦一起長大的（當年用普通的html創建了一些網站），我想也許這可以成為我的新職業。IT行業的人際接觸較少，而且我對各個領域都有真正的興趣。然而，儘管這種真正的興趣吸引我在晚上打開那個IDE或做CTF，但我不禁覺得我又在逃避什麼。<p>我一直把寫作作為一種愛好，最近出版了一些短篇小說，受到了好評。此外，我覺得我對創傷和成癮有寶貴的見解，希望能......怎麼說呢......變成對別人有幫助的東西。也許是以男性博客的形式（因為我注意到很多資源都偏向於女性，或者是由女性寫的（不是說這是個問題，但它可能不會對每個人都平等地說話））。\n因此，一條完全不同的道路可能是兼職學習心理學，專注於治癒自己，並可能在此過程中幫助他人。我覺得這是我應該做的，感覺 \"正確\"。但我的一部分想成為一個精通技術的黑客型人，不必為高薪工作而擔心。另外，我內心有一種相當大的恐懼，即政府正變得越來越專制，並將利用技術來控制人民。所以我想做好準備，可能對電腦有足夠的瞭解，以保護我的自由。但這只是恐懼，他們說恐懼從來都不是一個好隊長。另外，我不知道這些東西的現實性如何。如果國家安全局為數字身份證系統創建了軟件，一個前線廚師可能不會在業餘時間破解密碼，對嗎？<p>最後，當我長時間在電腦前工作時，我確實感到更加煩躁和緊張。要學習的東西太多，又更擔心自己永遠不會有什麼出息，或者當我找到一份真正的工作時，可能會比當廚師時壓力更大。當我在過去兩天或更長時間裡一直在編碼時，我不太喜歡談話和朋友的陪伴。我的頭腦似乎很遲鈍，我的靈魂很退縮。<p>在創傷恢復中，有一個概念，即我們中的許多人將精力傾注在被誤導的事業上，希望 \"一旦我到達我想要的地方，一切都會好起來\"。但當我們最終到達那裡時，一切都保持不變，除了我們被燒燬或接近燒燬。這是否只是我的潛意識的又一次嘗試呢？<p>所以，在這裡，我想說的是<p>我想進入IT行業，因為我覺得它可以解決我的許多問題。但我擔心這只是一個幻想，而現實生活將只是我試圖避免的一個不同版本。如果有人容易患與壓力有關的疾病，也許應該遠離IT行業？<p>如果你讀完了這些，我真誠地感謝你。我們歡迎嚴酷的事實，但要儘量友善。我最近很敏感。<p>請大家保持健康。\n"
}