{
  "@type": "NewsArticle",
  "identifier": "2022--04--18--en--askhn--HackerNews--NewsArticle--31065876",
  "url": "https://news.ycombinator.com/item?id=31065876",
  "headline": "Ask HN: Are you lost / confused / stuck? I can try to help",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Ok this is quite a different kind of Ask HN, but I just can't help but feel saddened whenever I come across personal posts about how someone is lost, confused, stuck in a situation, feel lonely, uncertain what to do about xyz, etc.. What's more surprising to me, is how the comments mostly center around <i>external</i> solutions. I love the HN community and how good you folks are at helping people navigating the world. But, sometimes, <i>at least sometimes</i>, what we're missing is a way of navigating the <i>inner</i> world.<p>And surprisingly (or not surprisingly), the conventional methods like self-help advice or even therapy sometimes don't seem to help. I know this feeling, and had to explore around to find the tools and perspectives that finally made a difference.<p>Now I don't mean any kind of mystic / uber-spiritual stuff. I'm a pretty realistic guy; I just think a lot and feel a lot and had to go through a lot of inner work / personal development to get to where I am today. (If you want an idea what kind of person I am in real life, my personal instagram is https://www.instagram.com/samhuang.sh/)<p>To get to my point, I want to start some kind of service/platform where people can come to talk things through and have a sustained conversation about their experience of feeling lost, confused, stuck. (I won't be charging for this <i>ever</i>, because I don't believe in that. Though I'll probably have donations set up, but that's technicalities.)<p>I've been giving some people at work some advice and perspectives, and they were positively surprised by the things I talked about and it seemed to help them at least get out of the cloud of confusion. I'm not trained with any formal credentials, but somehow I've developed enough wisdom in this area to have useful things to say.<p>The problem is, because I don't quite know where my &quot;strengths&quot; and &quot;expertise&quot; are yet, I don't wanna just start some Substack and make a fool out of myself pretending to be some guru when I don't know what I'm doing yet.<p>So here in this thread, I'm hoping to invite people who are struggling with feeling lost, confused, stuck, for whatever reason, to come and seek help. And I'll do my best to see if I can offer perspectives that may be useful. It'll be a place where we can go deeper into some issues and have a sustained conversation about it all. And it would also be tremendously helpful to me to get some feedback on whether it did or did not help.<p>Much love,\nSam",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31065876",
  "sameAs": "https://news.ycombinator.com/item?id=31065876",
  "dateCreated": "2022-04-18T00:43:43.163Z",
  "datePublished": "2022-04-18T00:15:57.000Z",
  "dateModified": "2022-04-18T00:43:43.163Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你是否迷失/困惑/困顿？我可以尝试帮助你",
  "headline_zh-Hant": "Ask HN: 你是否迷失/困惑/困頓？我可以嘗試幫助你",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Ok this is quite a different kind of Ask HN, but I just can't help but feel saddened whenever I come across personal posts about how someone is lost, confused, stuck in a situation, feel lonely, uncertain what to do about xyz, etc.. What's more surprising to me, is how the comments mostly center around <i>external</i> solutions. I love the HN community and how good you folks are at helping people navigating the world. But, sometimes, <i>at least sometimes</i>, what we're missing is a way of navigating the <i>inner</i> world.<p>And surprisingly (or not surprisingly), the conventional methods like self-help advice or even therapy sometimes don't seem to help. 我知道这种感觉，不得不四处探索，以找到最终能发挥作用的工具和观点。<p>现在我不是指任何一种神秘主义/超精神的东西。我是一个相当现实的人；我只是想了很多，感觉了很多，并且不得不通过大量的内在工作/个人发展来达到我今天的位置。(If you want an idea what kind of person I am in real life, my personal instagram is https://www.instagram.com/samhuang.sh/)<p>To get to my point, I want to start some kind of service/platform where people can come to talk things through and have a sustained conversation about their experience of feeling lost, confused, stuck. (I won't be charging for this <i>ever</i>, because I don't believe in that. 虽然我可能会设立捐款，但这是技术性问题。）<p>我已经在工作中给一些人提供了一些建议和观点，他们对我谈论的事情感到积极的惊讶，这似乎帮助他们至少走出了困惑的阴霾。<p>问题是，因为我还不太清楚自己的&quot;优势&quot;和&quot;专长&quot;在哪里，我不想在我还不知道自己在做什么的时候就开始做一些Substack，让自己假装成一些大师的样子出丑。 <p>因此，在这个主题中，我希望邀请那些因迷失、困惑、困顿而挣扎的人，无论出于什么原因，来寻求帮助。我将尽我所能，看看我是否能提供可能有用的观点。这将是一个我们可以深入探讨一些问题并就这一切进行持续对话的地方。如果能得到一些关于是否有帮助的反馈，对我来说也是极大的帮助。<p>非常爱你。\n萨姆",
  "description_zh-Hant": "Ok this is quite a different kind of Ask HN, but I just can't help but feel saddened whenever I come across personal posts about how someone is lost, confused, stuck in a situation, feel lonely, uncertain what to do about xyz, etc.. What's more surprising to me, is how the comments mostly center around <i>external</i> solutions. I love the HN community and how good you folks are at helping people navigating the world. But, sometimes, <i>at least sometimes</i>, what we're missing is a way of navigating the <i>inner</i> world.<p>And surprisingly (or not surprisingly), the conventional methods like self-help advice or even therapy sometimes don't seem to help. 我知道這種感覺，不得不四處探索，以找到最終能發揮作用的工具和觀點。<p>現在我不是指任何一種神秘主義/超精神的東西。我是一個相當現實的人；我只是想了很多，感覺了很多，並且不得不通過大量的內在工作/個人發展來達到我今天的位置。(If you want an idea what kind of person I am in real life, my personal instagram is https://www.instagram.com/samhuang.sh/)<p>To get to my point, I want to start some kind of service/platform where people can come to talk things through and have a sustained conversation about their experience of feeling lost, confused, stuck. (I won't be charging for this <i>ever</i>, because I don't believe in that. 雖然我可能會設立捐款，但這是技術性問題。）<p>我已經在工作中給一些人提供了一些建議和觀點，他們對我談論的事情感到積極的驚訝，這似乎幫助他們至少走出了困惑的陰霾。<p>問題是，因為我還不太清楚自己的&quot;優勢&quot;和&quot;專長&quot;在哪裡，我不想在我還不知道自己在做什麼的時候就開始做一些Substack，讓自己假裝成一些大師的樣子出醜。 <p>因此，在這個主題中，我希望邀請那些因迷失、困惑、困頓而掙扎的人，無論出於什麼原因，來尋求幫助。我將盡我所能，看看我是否能提供可能有用的觀點。這將是一個我們可以深入探討一些問題並就這一切進行持續對話的地方。如果能得到一些關於是否有幫助的反饋，對我來說也是極大的幫助。<p>非常愛你。\n薩姆"
}