{
  "@type": "NewsArticle",
  "identifier": "2022--04--15--en--askhn--HackerNews--NewsArticle--31044127",
  "url": "https://news.ycombinator.com/item?id=31044127",
  "headline": "Ask HN: Why no GUI open source unarchive apps?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I know the simple answer is &quot;because the developers want them to be&quot; close but, and maybe my thinking is just off here, this seems like a category of project for which there would be plenty of open source apps with a GUI.<p>Take decompressing .RAR files on MacOS. There's The Unarchiver (proprietary) as well as Keka (proprietary). There's MacPar (proprietary).  All are free (as in beer) but all are proprietary.<p>I get that WinZip and WinRar are proprietary because they are shareware and there's a few other paid ones on Mac. I'm curious why The Unarchiver and Keka and MacPAR are not open source. Neither Keka nor MacPAR have any association I can tell with any other company or app so it's not like they're loss leaders to get people to look at some company's other paid products. The Unarchiver is a loss leader so I guess that one makes a little more sense. Still, surprised this category of software has no open source GUI app.<p>I'm also not demanding they be open source. Still, I'd trust them more of they are. AFAIK they're just trojans, especially Keka and MacPAR, as the fact that they're proprietary seems to have no point which leads to trying to think of motivations for keeping them closed.<p>This is not a complaint. It's just an observation. It seems out of the ordinary in 2022 for a free app to be proprietary unless it has some other way of making money and in particular, un-archive apps seem like a category that would have more open source alternatives and I'm surprised. That is all.<p>What other categories of software are similar? Similar that they it seems like they're be plenty of open source alternatives but there aren't but for some reason there's lots of free but proprietary apps with no form of monetization?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "gernb",
    "url": "https://news.ycombinator.com/user?id=gernb"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31044127",
  "sameAs": "https://news.ycombinator.com/item?id=31044127",
  "dateCreated": "2022-04-15T18:55:09.529Z",
  "datePublished": "2022-04-15T18:47:30.000Z",
  "dateModified": "2022-04-15T18:55:09.529Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么没有GUI的开源解压缩应用程序？",
  "headline_zh-Hant": "Ask HN: 為什麼沒有GUI的開源解壓縮應用程序？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我知道简单的答案是&quot;因为开发者希望他们是&quot;接近的，但是，也许我的想法只是在这里偏离了，这似乎是一个项目的类别，有很多带有GUI的开源应用程序。有 Unarchiver（专利）和 Keka（专利）。还有MacPar（专有）。 <p>我知道WinZip和WinRar是专有的，因为它们是共享软件，而且Mac上还有其他一些付费软件。我很好奇为什么Unarchiver和Keka以及MacPAR不是开源的。Keka和MacPAR与任何其他公司或应用程序都没有任何关系，所以它们并不是为了让人们去看一些公司的其他付费产品而造成的损失。Unarchiver是一个亏损领导者，所以我想这个产品更有意义。不过，让人惊讶的是，这类软件没有开源的GUI应用。<p>我也没有要求他们成为开源的。不过，如果他们是开源的，我还是会更信任他们。AFAIK它们只是木马，尤其是Kekka和MacPAR，因为它们是专有的这一事实似乎没有任何意义，这导致人们试图思考保持它们封闭的动机。<p>这不是一个抱怨。它只是一个观察。在2022年，一个免费的应用程序是专有的，这似乎是不正常的，除非它有一些其他的赚钱方式，特别是，非存档应用程序似乎是一个类别，会有更多的开源替代品，我很惊讶。就这样。<p>还有哪些类别的软件是类似的？类似的是，它们似乎有很多开源的替代品，但却没有，但由于某些原因，有很多免费但没有盈利形式的专有应用程序？",
  "description_zh-Hant": "我知道簡單的答案是&quot;因為開發者希望他們是&quot;接近的，但是，也許我的想法只是在這裡偏離了，這似乎是一個項目的類別，有很多帶有GUI的開源應用程序。有 Unarchiver（專利）和 Keka（專利）。還有MacPar（專有）。 <p>我知道WinZip和WinRar是專有的，因為它們是共享軟件，而且Mac上還有其他一些付費軟件。我很好奇為什麼Unarchiver和Keka以及MacPAR不是開源的。Keka和MacPAR與任何其他公司或應用程序都沒有任何關係，所以它們並不是為了讓人們去看一些公司的其他付費產品而造成的損失。Unarchiver是一個虧損領導者，所以我想這個產品更有意義。不過，讓人驚訝的是，這類軟件沒有開源的GUI應用。<p>我也沒有要求他們成為開源的。不過，如果他們是開源的，我還是會更信任他們。AFAIK它們只是木馬，尤其是Kekka和MacPAR，因為它們是專有的這一事實似乎沒有任何意義，這導致人們試圖思考保持它們封閉的動機。<p>這不是一個抱怨。它只是一個觀察。在2022年，一個免費的應用程序是專有的，這似乎是不正常的，除非它有一些其他的賺錢方式，特別是，非存檔應用程序似乎是一個類別，會有更多的開源替代品，我很驚訝。就這樣。<p>還有哪些類別的軟件是類似的？類似的是，它們似乎有很多開源的替代品，但卻沒有，但由於某些原因，有很多免費但沒有盈利形式的專有應用程序？"
}