{
  "@type": "NewsArticle",
  "identifier": "2022--07--10--en--askhn--HackerNews--NewsArticle--32046684",
  "url": "https://news.ycombinator.com/item?id=32046684",
  "headline": "Ask HN: Why do people get things when they “give up.”?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I recently found an extraordinary technical co-founder for my company, after years of trying every possible strategy. He's 100 times more creative, passionate, expert and an ideal fit for me personally and from a business perspective then others I'd met before, a friend I've known for years and seemingly popped back up out of the blue after I stopped trying and was ready to give up on the whole thing.<p>I've heard this advice of &quot;give up&quot; and it comes for years.<p>Give up on trying to find love and then you get the partner\nGive up doing a million interviews and then you get the job\nGive up trying to cure your alcoholic and your partner decides to go to AA on their own<p>I'm assuming this has something to do with the principal of &quot;non-attachment&quot; or not putting out a vibe of neediness, but it's still curious to me. Wondering if there's more to it than that.<p>Or possibly, it's just odds that a high percentage of people who had given up after trying really hard, got something. And then they wanted to share their story.<p>And is there any way to enforce this state? Seems pretty hard to give up on something as a means to get it, so there's an inherent paradox.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "actfrench",
    "url": "https://news.ycombinator.com/user?id=actfrench"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32046684",
  "sameAs": "https://news.ycombinator.com/item?id=32046684",
  "dateCreated": "2022-07-10T17:33:30.997Z",
  "datePublished": "2022-07-10T17:22:27.000Z",
  "dateModified": "2022-07-10T17:33:30.997Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么人们在 \"放弃 \"时能得到东西？\n",
  "headline_zh-Hant": "Ask HN: 為什麼人們在 \"放棄 \"時能得到東西？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在尝试了各种可能的策略多年之后，我最近为我的公司找到了一个非凡的技术联合创始人。他比我之前遇到的其他人更有创造力、更有激情、更专业，也更适合我个人和商业的角度，他是我认识多年的朋友，在我停止努力并准备放弃整个事情之后，他似乎又突然出现了。<p>我已经听到了这种&quot;放弃&quot;的建议，它已经出现了很多年。\n放弃做一百万次面试，然后你就得到了工作\n放弃尝试治愈你的酗酒者，而你的伴侣决定自己去戒酒会<p>我假设这与&quot;不执着&quot;的原则有关，或者不放出需要的氛围，但我仍然感到好奇。<p>也有可能，这只是很大比例的人在非常努力的情况下放弃了，得到了一些东西。然后他们想分享他们的故事。<p>而且有什么方法可以执行这种状态吗？似乎很难放弃某些东西作为获得它的手段，所以有一个内在的悖论。\n",
  "description_zh-Hant": "在嘗試了各種可能的策略多年之後，我最近為我的公司找到了一個非凡的技術聯合創始人。他比我之前遇到的其他人更有創造力、更有激情、更專業，也更適合我個人和商業的角度，他是我認識多年的朋友，在我停止努力並準備放棄整個事情之後，他似乎又突然出現了。<p>我已經聽到了這種&quot;放棄&quot;的建議，它已經出現了很多年。\n放棄做一百萬次面試，然後你就得到了工作\n放棄嘗試治癒你的酗酒者，而你的伴侶決定自己去戒酒會<p>我假設這與&quot;不執著&quot;的原則有關，或者不放出需要的氛圍，但我仍然感到好奇。<p>也有可能，這只是很大比例的人在非常努力的情況下放棄了，得到了一些東西。然後他們想分享他們的故事。<p>而且有什麼方法可以執行這種狀態嗎？似乎很難放棄某些東西作為獲得它的手段，所以有一個內在的悖論。\n"
}