{
  "@type": "NewsArticle",
  "identifier": "2022--07--15--en--askhn--HackerNews--NewsArticle--32103238",
  "url": "https://news.ycombinator.com/item?id=32103238",
  "headline": "Ask HN: What is your experience with SSRIs?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I value my intellect, but I've been rendered non-functional by OCD, anxiety et al. Strongly considering a medication, I now have a prescription for escitalopram 20mg.<p>I'm 27. For over 4 years, I've been in bed for 22+ hours of my day, browsing the internet from a smartphone, planning &amp; daydreaming how I'd like my life to be, battling delusions &amp; rituals. I went almost 3 years without bathing. I have not brushed my teeth in over 4 years. I feel like an old man when I get out of bed. I cannot perform the smallest &amp; most basic of actions without my OCD &amp; anxiety regulating &amp; controlling me.<p>With all of that, I still hesitate to try this psychiatric medication as I fear it will lead to some sort of permanent degeneration or alteration to my cognitive ability, which I hold highly without any good empirical reason. As a layman, I understand serotonin to, in general, bring relaxation and contentment with your situation, perhaps carelessness.<p>I know that you must have a balance, but I don't want to feel content with my horrible situation, and these do not seem like qualities that endow a personality which is motivated to and succeeds in solving hard problems and thinking critically through life, but more of the stereotyped apathetic, careless, and blunted &quot;zombie&quot; effect that echos with experiences I've already read.<p>I'm not sure that I could forgive myself if this medication neutered or sterilized my brain. It's all that I have.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "aidepast",
    "url": "https://news.ycombinator.com/user?id=aidepast"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32103238",
  "sameAs": "https://news.ycombinator.com/item?id=32103238",
  "dateCreated": "2022-07-15T02:42:44.095Z",
  "datePublished": "2022-07-15T00:49:18.000Z",
  "dateModified": "2022-07-15T02:42:44.095Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 9
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 27
    }
  ],
  "headline_zh-Hans": "Ask HN: 你对SSRIs有什么经验？\n",
  "headline_zh-Hant": "Ask HN: 你對SSRIs有什麼經驗？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我很重视我的智力，但我已经被强迫症、焦虑症等弄得无法正常工作了。强烈考虑药物治疗，我现在有一张艾司西酞普兰20毫克的处方。<p>我今年27岁。4年多来，我每天有22个小时以上的时间躺在床上，用智能手机浏览互联网，计划&amp;做白日梦，想让我的生活变得怎样，与妄想&amp;仪式作斗争。我几乎3年没有洗澡。我已经4年多没有刷牙了。当我下床时，我觉得自己像个老人。如果没有强迫症和焦虑症的调节和控制，我就无法完成最微小和最基本的行动。<p>尽管如此，我仍然对尝试这种精神药物治疗犹豫不决，因为我担心它会导致我的认知能力出现某种永久性的退化或改变，而我对这种认知能力的高度评价是没有任何好的经验理由的。作为一个门外汉，我理解血清素在一般情况下会带来放松和对自己处境的满足感，也许是大意。 <p>我知道你必须有一个平衡点，但我不想对我可怕的处境感到满足，而且这些似乎并不像赋予一个有动力并成功地解决困难问题和批判性地思考生活的个性的品质，而更像是刻板的冷漠、粗心和迟钝的&quot;僵尸&quot;效应，与我已经读过的经验相呼应。这是我的全部。\n",
  "description_zh-Hant": "我很重視我的智力，但我已經被強迫症、焦慮症等弄得無法正常工作了。強烈考慮藥物治療，我現在有一張艾司西酞普蘭20毫克的處方。<p>我今年27歲。4年多來，我每天有22個小時以上的時間躺在床上，用智能手機瀏覽互聯網，計劃&amp;做白日夢，想讓我的生活變得怎樣，與妄想&amp;儀式作鬥爭。我幾乎3年沒有洗澡。我已經4年多沒有刷牙了。當我下床時，我覺得自己像個老人。如果沒有強迫症和焦慮症的調節和控制，我就無法完成最微小和最基本的行動。<p>儘管如此，我仍然對嘗試這種精神藥物治療猶豫不決，因為我擔心它會導致我的認知能力出現某種永久性的退化或改變，而我對這種認知能力的高度評價是沒有任何好的經驗理由的。作為一個門外漢，我理解血清素在一般情況下會帶來放鬆和對自己處境的滿足感，也許是大意。 <p>我知道你必須有一個平衡點，但我不想對我可怕的處境感到滿足，而且這些似乎並不像賦予一個有動力併成功地解決困難問題和批判性地思考生活的個性的品質，而更像是刻板的冷漠、粗心和遲鈍的&quot;殭屍&quot;效應，與我已經讀過的經驗相呼應。這是我的全部。\n"
}