{
  "@type": "NewsArticle",
  "identifier": "2022--07--26--en--askhn--HackerNews--NewsArticle--32243961",
  "url": "https://news.ycombinator.com/item?id=32243961",
  "headline": "Ask HN: Transfer(wise) refuses to process a dispute claim. Any recourse?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I used my (Transfer)Wise MASTERCARD card to purchase a pair of Xiaomi earbuds in Turkey at a major retailer (think Barnes &amp; Noble). I tried them for a day and then tried to return them.<p>The ANC on the earbuds makes it so that I can barely hear the other person and they can barely hear me.<p>The retailer refused to refund the money. They sent them to another city for testing and said they're fine.<p>I filed a dispute 5 weeks ago and heard nothing from Wise. Now I've called them and they said my dispute was rejected by Wise.<p>Do I have any recourse? It's not the $60 loss that hurts. I like using Wise and I've been a customer for years, but if I have zero protection by using their card, then I'll stop using it.<p>&gt; Upon checking on the attachments you've sent, unfortunately, we cannot do anything on our end since the merchant claimed that the stuff you purchased is working fine and not defective.<p>&gt; Unfortunately, upon checking the attachments you submitted, we have no choice but to accept the seller's statement that the items you bought are in good condition and not damaged.<p>So they'd rather believe a merchant in Turkey over their long-time customer.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "unsupp0rted",
    "url": "https://news.ycombinator.com/user?id=unsupp0rted"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32243961",
  "sameAs": "https://news.ycombinator.com/item?id=32243961",
  "dateCreated": "2022-07-26T21:24:02.244Z",
  "datePublished": "2022-07-26T21:02:16.000Z",
  "dateModified": "2022-07-26T21:24:02.244Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 转让方拒绝处理争议索赔。有什么追索权吗？\n",
  "headline_zh-Hant": "Ask HN: 轉讓方拒絕處理爭議索賠。有什麼追索權嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我用我的(Transfer)Wise MASTERCARD卡在土耳其的一家大型零售商（如Barnes &amp; Noble）购买了一对小米耳塞。我试用了一天，然后试图退货。<p>耳塞上的ANC让我几乎听不到对方的声音，而对方也几乎听不到我的声音。<p>零售商拒绝退钱。他们把它们送到另一个城市进行测试，并说它们没有问题。<p>我在5个星期前提出了一个争议，但没有听到明智公司的任何消息。现在我给他们打电话，他们说我的争议被Wise拒绝了。<p>我有任何追索权吗？这不是60美元的损失，而是伤害。我喜欢使用Wise，我已经是多年的客户了，但如果我使用他们的卡，我的保障是零，那我就不使用了。<p>&gt; 经检查你所发的附件，不幸的是，由于商家声称你所购买的东西工作正常，没有缺陷，所以我们这边不能做任何事情。 <p>&gt; 不幸的是，经检查你提交的附件，我们别无选择，只能接受卖家的声明，即你购买的东西是完好的，没有损坏。<p>所以他们宁愿相信土耳其的一个商家，而不是他们的长期客户。\n",
  "description_zh-Hant": "我用我的(Transfer)Wise MASTERCARD卡在土耳其的一家大型零售商（如Barnes &amp; Noble）購買了一對小米耳塞。我試用了一天，然後試圖退貨。<p>耳塞上的ANC讓我幾乎聽不到對方的聲音，而對方也幾乎聽不到我的聲音。<p>零售商拒絕退錢。他們把它們送到另一個城市進行測試，並說它們沒有問題。<p>我在5個星期前提出了一個爭議，但沒有聽到明智公司的任何消息。現在我給他們打電話，他們說我的爭議被Wise拒絕了。<p>我有任何追索權嗎？這不是60美元的損失，而是傷害。我喜歡使用Wise，我已經是多年的客戶了，但如果我使用他們的卡，我的保障是零，那我就不使用了。<p>&gt; 經檢查你所發的附件，不幸的是，由於商家聲稱你所購買的東西工作正常，沒有缺陷，所以我們這邊不能做任何事情。 <p>&gt; 不幸的是，經檢查你提交的附件，我們別無選擇，只能接受賣家的聲明，即你購買的東西是完好的，沒有損壞。<p>所以他們寧願相信土耳其的一個商家，而不是他們的長期客戶。\n"
}