{
  "@type": "NewsArticle",
  "identifier": "2022--06--23--en--askhn--HackerNews--NewsArticle--31843654",
  "url": "https://news.ycombinator.com/item?id=31843654",
  "headline": "Ask HN: Quitting a job to get time to prepare for interviews",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So here is some background information for some context:\n- Am 25 yrs of age\n- I live in a developing country(if that matters)\n- I finished my studies in 2020 but graduated with a degree in computer technology in 2021 due to Covid\n- But I started developing real world applications in 2018, due to financial issues. The freelance contracts\n I got around that time, helped alleviate my financial woes including paying for my fees.\n- Got my first permanent software job at a remote startup in a developed country in 2019 and \nbeen working there ever since as one of the founding developers.<p>But now I have been interested in getting another job for some time due to a some issues affecting me in \nthe current company:\n- Working on some weekends, frequency increased in the past 8 months\n- The boss claims he will give me a weekday replacing the weekends worked but most of them are not\n replaced(giving an impression am working for free)\n- Occasionally, there is always a deadline leading to working 12 hours+ to meet it\n- The long working hours and weekends got so bad that I got burnt out and tried to quit a few months ago,\nbut boss told me he will replace them but the bad patterns have already emerged again \n- Changes in some of the clauses in the contract or per what we agreed without letting me before hand.\n- I suggest we follow best practices but the boss is more focused on how many features we can develop, \ntasks we can do.<p>I have applied to a couple of jobs(on and off) in that span of time and although I was able to get \nthem to have a call with me or get tested for my skills, I often failed the technical \nassessments due to lack of enough preparation(since most of the time am working and rest when I am free)\nAlso I see most jobs either requires to have experience in distributed systems(which I have no professional experience)\nand use industry standards to write software(which we never followed). This makes me feel like I need to learn\neven more things in order for those companies to see I am experienced and its not just fluff.<p>The current job limits my time but I want to grind hard on various technical questions so\nthat I can be considered for any role and at least reach the offer stages. I also have 4 months reserves\nto sustain my current lifestyle. I also heard you are more likely to get a job while you are on a job.\nNow comes my question, should I quit my current job then I practice for interviews to increase my chances of\nfind a better job?<p>Also any help on how to prepare for interviews and crafting a very attractive resume would be appreciated. Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "planethumanguy",
    "url": "https://news.ycombinator.com/user?id=planethumanguy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31843654",
  "sameAs": "https://news.ycombinator.com/item?id=31843654",
  "dateCreated": "2022-06-23T02:14:01.518Z",
  "datePublished": "2022-06-23T00:26:34.000Z",
  "dateModified": "2022-06-23T02:14:01.518Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 辞掉工作以获得时间准备面试\n",
  "headline_zh-Hant": "Ask HN: 辭掉工作以獲得時間準備面試\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "因此，这里有一些背景信息供参考。\n- 我的年龄是25岁\n- 我住在一个发展中国家（如果这很重要）。\n- 我在2020年完成学业，但由于Covid的原因，我在2021年获得了计算机技术学位。\n- 但由于经济问题，我在2018年开始开发现实世界的应用程序。自由职业者的合同\n 我在那个时候得到了，帮助缓解了我的财务困境，包括支付我的费用。\n- 2019年，我在一个发达国家的远程创业公司找到了第一份永久性的软件工作，并从那时起一直在那里工作，成为了该公司的一员。\n<p>但现在，由于一些问题影响了我在当前公司的工作，我已经有一段时间想找另一份工作了。\n现在的公司有一些问题影响到我，所以我一直想换一份工作。\n- 在一些周末工作，在过去8个月里频率增加了\n- 老板说他会给我一个工作日来代替周末的工作，但大部分的周末工作都没有\n 替换（给人一种免费工作的印象）。\n- 偶尔，总是有一个最后期限，导致工作12小时以上才能完成。\n- 长时间的工作和周末的工作让我疲惫不堪，几个月前就想辞职。\n但老板告诉我，他将取代他们，但坏的模式已经再次出现。\n- 合同中的一些条款或按照我们商定的内容进行修改，而没有事先让我知道。\n- 我建议我们遵循最佳实践，但老板更关注我们能开发多少功能。\n<p>在这段时间里，我已经申请了几份工作(时好时坏)，虽然我能够让他们与我通电话，或者让他们给我打电话。\n虽然我能够让他们与我进行电话沟通，或者对我的技能进行测试，但由于缺乏足够的准备，我经常在技术评估中失败。\n由于缺乏足够的准备，我经常没有通过技术评估（因为大部分时间都在工作，有空就休息）。\n此外，我看到大多数工作要么要求有分布式系统的经验（我没有这方面的专业经验）\n和使用工业标准来编写软件（我们从来没有遵循过）。这让我觉得我需要学习\n<p>目前的工作限制了我的时间，但我想努力学习各种技术问题，以便在任何职位上都能得到考虑。\n目前的工作限制了我的时间，但我想努力学习各种技术问题，这样我就可以被考虑担任任何角色，至少可以达到录用阶段。我还有4个月的储备\n以维持我目前的生活方式。我还听说在工作期间，你更有可能得到一份工作。\n现在我的问题来了，我应该辞掉目前的工作，然后练习面试，以增加我找到更好工作的机会。\n<p>另外，如果有任何关于如何准备面试和制作一份非常有吸引力的简历的帮助，将不胜感激。谢谢!\n",
  "description_zh-Hant": "因此，這裡有一些背景信息供參考。\n- 我的年齡是25歲\n- 我住在一個發展中國家（如果這很重要）。\n- 我在2020年完成學業，但由於Covid的原因，我在2021年獲得了計算機技術學位。\n- 但由於經濟問題，我在2018年開始開發現實世界的應用程序。自由職業者的合同\n 我在那個時候得到了，幫助緩解了我的財務困境，包括支付我的費用。\n- 2019年，我在一個發達國家的遠程創業公司找到了第一份永久性的軟件工作，並從那時起一直在那裡工作，成為了該公司的一員。\n<p>但現在，由於一些問題影響了我在當前公司的工作，我已經有一段時間想找另一份工作了。\n現在的公司有一些問題影響到我，所以我一直想換一份工作。\n- 在一些週末工作，在過去8個月裡頻率增加了\n- 老闆說他會給我一個工作日來代替週末的工作，但大部分的週末工作都沒有\n 替換（給人一種免費工作的印象）。\n- 偶爾，總是有一個最後期限，導致工作12小時以上才能完成。\n- 長時間的工作和週末的工作讓我疲憊不堪，幾個月前就想辭職。\n但老闆告訴我，他將取代他們，但壞的模式已經再次出現。\n- 合同中的一些條款或按照我們商定的內容進行修改，而沒有事先讓我知道。\n- 我建議我們遵循最佳實踐，但老闆更關注我們能開發多少功能。\n<p>在這段時間裡，我已經申請了幾份工作(時好時壞)，雖然我能夠讓他們與我通電話，或者讓他們給我打電話。\n雖然我能夠讓他們與我進行電話溝通，或者對我的技能進行測試，但由於缺乏足夠的準備，我經常在技術評估中失敗。\n由於缺乏足夠的準備，我經常沒有通過技術評估（因為大部分時間都在工作，有空就休息）。\n此外，我看到大多數工作要麼要求有分佈式系統的經驗（我沒有這方面的專業經驗）\n和使用工業標準來編寫軟件（我們從來沒有遵循過）。這讓我覺得我需要學習\n<p>目前的工作限制了我的時間，但我想努力學習各種技術問題，以便在任何職位上都能得到考慮。\n目前的工作限制了我的時間，但我想努力學習各種技術問題，這樣我就可以被考慮擔任任何角色，至少可以達到錄用階段。我還有4個月的儲備\n以維持我目前的生活方式。我還聽說在工作期間，你更有可能得到一份工作。\n現在我的問題來了，我應該辭掉目前的工作，然後練習面試，以增加我找到更好工作的機會。\n<p>另外，如果有任何關於如何準備面試和製作一份非常有吸引力的簡歷的幫助，將不勝感激。謝謝!\n"
}