{
  "@type": "NewsArticle",
  "identifier": "2022--07--01--en--askhn--HackerNews--NewsArticle--31953054",
  "url": "https://news.ycombinator.com/item?id=31953054",
  "headline": "Ask HN: Value of reading a book without comprehension?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I wonder if reading a book or listening to audio book without comprehending it at the time of reading/listening is still valuable?<p>Case 1. Imagine you are reading (your eyes going through text) and brain got distracted while trying to comprehend and compare what you are reading with your experience from the past. You realize it after 1 page is done. Do you think your brain still can store chunks of data?<p>Case 2. You are reading super insightful book, which has 10 primary insights per page, but you only understand 1 insight.\nDo you think your brain still saved other insights and eventually will reveal it to you?<p>Case 3. You are listening audiobook and your brain didn't keep up with the content (language understanding or trying to comprehend past sentences made you think about it too much, and anything else) Because going back and forth can slow down the listening, do you think continuing listening is still valuable and gives enough insights?<p>Why am I asking? I have mild ADHD and reading books is difficult to me, add into this language understanding (English is not my native language) and I am spending 10-15 minutes per page, trying to understand everything.<p>At the same time, OReilly subscription makes me really sad, by telling book with ~200 pages takes 5h to finish.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ikkah",
    "url": "https://news.ycombinator.com/user?id=ikkah"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31953054",
  "sameAs": "https://news.ycombinator.com/item?id=31953054",
  "dateCreated": "2022-07-01T21:23:50.248Z",
  "datePublished": "2022-07-01T21:16:43.000Z",
  "dateModified": "2022-07-01T21:23:50.248Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 读书不理解的价值？\n",
  "headline_zh-Hant": "Ask HN: 讀書不理解的價值？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我想知道，在阅读/收听时没有理解的情况下，阅读一本书或收听有声书是否仍有价值？想象一下，你正在阅读（你的眼睛正在阅读文本），而大脑在试图理解和比较你正在阅读的内容与你过去的经验时分心了。你在读完一页后意识到了这一点。你认为你的大脑还能储存大块的数据吗？<p>案例2。你正在读一本超级有见地的书，每页有10个主要见地，但你只理解了一个见地。\n你认为你的大脑仍然保存着其他的见解，并最终会向你揭示它吗？<p>案例3。你在听有声读物，而你的大脑没有跟上内容（语言理解或试图理解过去的句子使你想得太多，以及其他任何事情）因为来回走动会减慢听的速度，你认为继续听还是有价值的，能给人足够的洞察力吗？<p>我为什么要问？我有轻微的多动症，看书对我来说很困难，再加上对语言的理解（英语不是我的母语），我每页要花10-15分钟，试图理解所有的东西。<p>同时，OReilly的订阅让我非常难过，他说有200页的书需要5小时才能完成。\n",
  "description_zh-Hant": "我想知道，在閱讀/收聽時沒有理解的情況下，閱讀一本書或收聽有聲書是否仍有價值？想象一下，你正在閱讀（你的眼睛正在閱讀文本），而大腦在試圖理解和比較你正在閱讀的內容與你過去的經驗時分心了。你在讀完一頁後意識到了這一點。你認為你的大腦還能儲存大塊的數據嗎？<p>案例2。你正在讀一本超級有見地的書，每頁有10個主要見地，但你只理解了一個見地。\n你認為你的大腦仍然保存著其他的見解，並最終會向你揭示它嗎？<p>案例3。你在聽有聲讀物，而你的大腦沒有跟上內容（語言理解或試圖理解過去的句子使你想得太多，以及其他任何事情）因為來回走動會減慢聽的速度，你認為繼續聽還是有價值的，能給人足夠的洞察力嗎？<p>我為什麼要問？我有輕微的多動症，看書對我來說很困難，再加上對語言的理解（英語不是我的母語），我每頁要花10-15分鐘，試圖理解所有的東西。<p>同時，OReilly的訂閱讓我非常難過，他說有200頁的書需要5小時才能完成。\n"
}