{
  "@type": "NewsArticle",
  "identifier": "2022--04--24--en--askhn--HackerNews--NewsArticle--31142811",
  "url": "https://news.ycombinator.com/item?id=31142811",
  "headline": "Ask HN: Is Dropbox implying I’m storing sexually exploitative content?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This is my Dropbox Horror Story.<p>A few days ago Dropbox disabled my account.\nAfter several emails inquiring about why my account was disabled I received this response:<p>Dropbox’s Acceptable Use Policy prohibits, among other things, use of the Dropbox Services in conjunction with materials that “constitute child sexually exploitative material (including material which may not be illegal child sexual abuse material but which nonetheless sexually exploits or promotes the sexual exploitation of minors), unlawful pornography, or are otherwise indecent.” Your account was determined to be in violation of these policies. In accordance with our Terms of Service, Dropbox reserves the right to terminate your access to the Services without notice when you are in material breach of our terms, when providing notice would cause Dropbox to incur legal liability or compromise our ability to provide Services to other users, or when we are prohibited from providing such notice by law.<p>When I read this my heart sank. Being accused of having files that &quot;constitute child sexually exploitative material&quot;  is one of the worst things I can think of.\nI wondered, how the hell would I have that in my account? Was it compromised? Does their system have a software error?<p>However, they did mention other things in that response.\ncontent deemed &quot;otherwise indecent&quot;<p>we will get to that, but first, I let them know that\ncontent that sexually exploits children goes against everything I stand for and I told them that If have any unlawful pornography or anything &quot;constitutes child sexually exploitative material&quot; on my account let us go to the police and investigate the matter.<p>Now the language about &quot;indecent content&quot; is wild and opens a whole can of worms. What may be indecent to one person may not be indecent to others. Something so arbitrary should not give Dropbox the right to ruin people.<p>Dropbox has shut down access to my all files and messed up my computer setup without due process and seemingly no recourse.<p>As you can imagine, this is a major problem for me because sometime last year I went all-in on Dropbox, because I’ve had very bad luck with hard drives and I’ve been using Dropbox for over a decade with no problems. So I fully integrated my Mac with Dropbox, after my limited Dropbox setup help save me from major disk drive failure. I’ve also been using Dropbox Paper for much of my work files. When Dropbox disabled my account I lost access to everything on Dropbox and Dropbox Paper. It is very hard for me to get work done, and they are not responding to my messages in a timely manner. I have years of my work as a musician stored on Dropbox as well. Yes,  I messed up royally for trusting a company with all my work, lesson learned.<p>I plan to sue Dropbox and get an injunction but that will take a lot of time and resources. So I wondering if the community can help me find out what is really happening, and perhaps help get my account restored faster.  I’ve seen the HN community help in situations like this.  I’m running out of time for business-related deadlines.<p>If you can help you can reach me at\ntheheavyrocker@gmail.com<p>much thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "rockarage",
    "url": "https://news.ycombinator.com/user?id=rockarage"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31142811",
  "sameAs": "https://news.ycombinator.com/item?id=31142811",
  "dateCreated": "2022-04-24T10:50:58.913Z",
  "datePublished": "2022-04-24T10:41:36.000Z",
  "dateModified": "2022-04-24T10:50:58.913Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: Dropbox是否暗示我在储存性剥削的内容？",
  "headline_zh-Hant": "Ask HN: Dropbox是否暗示我在儲存性剝削的內容？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这是我的Dropbox恐怖故事。<p>几天前，Dropbox禁用了我的账户。\n在发了几封电子邮件询问我的账户被禁用的原因后，我收到了这样的回复：<p>Dropbox的可接受使用政策禁止与 \"构成儿童性剥削的材料（包括可能不是非法的儿童性虐待材料，但仍对未成年人进行性剥削或促进性剥削的材料）、非法色情或其他不雅的材料一起使用Dropbox服务。你的账户被确定为违反了这些政策。根据我们的服务条款，当您严重违反我们的条款时，当提供通知会导致Dropbox承担法律责任或损害我们向其他用户提供服务的能力时，或当法律禁止我们提供此类通知时，Dropbox保留不经通知终止您对服务的访问。被指控拥有构成儿童性剥削材料的文件，是我能想到的最糟糕的事情之一。\n我想知道，我的账户里到底怎么会有这些东西？它被破坏了吗？他们的系统是否出现了软件错误？<p>不过，他们在答复中确实提到了其他事情。\n被认为是 \"不雅 \"的内容<p>我们将讨论这个问题，但首先，我让他们知道\n我告诉他们，如果我的账户上有任何非法的色情制品或任何构成对儿童性剥削的材料，让我们去找警察并调查此事。<p>现在，关于 \"不雅内容 \"的语言是疯狂的，并打开了一整罐虫子。对一个人来说可能是不雅的东西，对其他人来说可能不是不雅的。<p>Dropbox关闭了对我所有文件的访问，并在没有正当程序和似乎没有追索权的情况下搞乱了我的计算机设置。<p>正如你可以想象的那样，这对我来说是一个大问题，因为去年某个时候我全身心地投入到Dropbox中，因为我的硬盘运气很差，而我使用Dropbox已经有十多年了，没有任何问题。因此，在我有限的Dropbox设置帮助我从重大的磁盘驱动器故障中拯救出来之后，我将我的Mac与Dropbox完全整合在一起。我也一直在使用Dropbox Paper来处理我的大部分工作文件。当Dropbox禁用我的账户时，我失去了对Dropbox和Dropbox Paper上所有内容的访问。我很难完成工作，他们也没有及时回复我的信息。我作为一个音乐家，在Dropbox上也储存了多年的作品。是的，我把所有的工作都交给了一家公司，这是我的教训。<p>我计划起诉Dropbox并获得禁令，但这将需要大量的时间和资源。所以我想知道社区是否能帮助我找出真正发生的事情，也许能帮助我更快地恢复账户。 我已经看到HN社区在这样的情况下提供帮助。 我已经没有时间了，因为与业务有关的最后期限。<p>如果你能提供帮助，你可以通过以下方式联系我\ntheheavyrocker@gmail.com<p>非常感谢。",
  "description_zh-Hant": "這是我的Dropbox恐怖故事。<p>幾天前，Dropbox禁用了我的賬戶。\n在發了幾封電子郵件詢問我的賬戶被禁用的原因後，我收到了這樣的回覆：<p>Dropbox的可接受使用政策禁止與 \"構成兒童性剝削的材料（包括可能不是非法的兒童性虐待材料，但仍對未成年人進行性剝削或促進性剝削的材料）、非法色情或其他不雅的材料一起使用Dropbox服務。你的賬戶被確定為違反了這些政策。根據我們的服務條款，當您嚴重違反我們的條款時，當提供通知會導致Dropbox承擔法律責任或損害我們向其他用戶提供服務的能力時，或當法律禁止我們提供此類通知時，Dropbox保留不經通知終止您對服務的訪問。被指控擁有構成兒童性剝削材料的文件，是我能想到的最糟糕的事情之一。\n我想知道，我的賬戶裡到底怎麼會有這些東西？它被破壞了嗎？他們的系統是否出現了軟件錯誤？<p>不過，他們在答覆中確實提到了其他事情。\n被認為是 \"不雅 \"的內容<p>我們將討論這個問題，但首先，我讓他們知道\n我告訴他們，如果我的賬戶上有任何非法的色情製品或任何構成對兒童性剝削的材料，讓我們去找警察並調查此事。<p>現在，關於 \"不雅內容 \"的語言是瘋狂的，並打開了一整罐蟲子。對一個人來說可能是不雅的東西，對其他人來說可能不是不雅的。<p>Dropbox關閉了對我所有文件的訪問，並在沒有正當程序和似乎沒有追索權的情況下搞亂了我的計算機設置。<p>正如你可以想象的那樣，這對我來說是一個大問題，因為去年某個時候我全身心地投入到Dropbox中，因為我的硬盤運氣很差，而我使用Dropbox已經有十多年了，沒有任何問題。因此，在我有限的Dropbox設置幫助我從重大的磁盤驅動器故障中拯救出來之後，我將我的Mac與Dropbox完全整合在一起。我也一直在使用Dropbox Paper來處理我的大部分工作文件。當Dropbox禁用我的賬戶時，我失去了對Dropbox和Dropbox Paper上所有內容的訪問。我很難完成工作，他們也沒有及時回覆我的信息。我作為一個音樂家，在Dropbox上也儲存了多年的作品。是的，我把所有的工作都交給了一家公司，這是我的教訓。<p>我計劃起訴Dropbox並獲得禁令，但這將需要大量的時間和資源。所以我想知道社區是否能幫助我找出真正發生的事情，也許能幫助我更快地恢復賬戶。 我已經看到HN社區在這樣的情況下提供幫助。 我已經沒有時間了，因為與業務有關的最後期限。<p>如果你能提供幫助，你可以通過以下方式聯繫我\ntheheavyrocker@gmail.com<p>非常感謝。"
}