{
  "@type": "NewsArticle",
  "identifier": "2022--04--20--en--askhn--HackerNews--NewsArticle--31095306",
  "url": "https://news.ycombinator.com/item?id=31095306",
  "headline": "Ask HN: Unconventional Role?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm seeking direction and guidance. I'm between roles. I've been trying to carve out an unconventional role for myself, doing what I enjoy doing and what I'm best at. I'm seeking advice because I'm not sure what role best matches what I'm looking for.<p>I've come through software development. I juked the Management track and stayed on the IC track. Senior, Team Lead, Principal. But I don't want to strictly do software engineering anymore. I'd like to do systems engineering, or business engineering, or something.<p>I'd like to make the lives of customers and employees better, through making possible what was not possible before, or reducing burden.<p>I'd like to do that by helping businesses build systems _beyond just software_ that, having both internal and external effects. This could be having a hand in the product offering, business organisation and operation, commissioning software teams or shaping organisational culture. I'd also like to help coach the software engineering teams that build the software, because that's where I've come from.<p>I feel like I'm looking for something between a principal engineer, a product manager and an engineering director. I want to keep my boots on the ground, but help shape what is going on above.<p>I'm applying for principal engineer roles, however the companys I've interviewed for are looking for this role to be primarily focussed on moving tickets across a JIRA board, which isn't really what I'm shooting for. I want to help businesses and teams move the appropriate tickets across JIRA boards. I'm getting really great feedback, but they just aren't hiring for _that_ role.<p>Is there another role I could consider in my position?<p>Any and all advice is appreciated.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "beaker52",
    "url": "https://news.ycombinator.com/user?id=beaker52"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31095306",
  "sameAs": "https://news.ycombinator.com/item?id=31095306",
  "dateCreated": "2022-04-20T11:28:44.703Z",
  "datePublished": "2022-04-20T11:24:36.000Z",
  "dateModified": "2022-04-20T11:28:44.703Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 非常规的角色？",
  "headline_zh-Hant": "Ask HN: 非常規的角色？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在寻求方向和指导。我正处于角色之间。我一直在努力为自己开辟一个非常规的角色，做我喜欢做的事，做我最擅长的事。我在寻求建议，因为我不确定什么角色最符合我的要求。<p>我经历过软件开发。我跳过了管理轨道，留在了IC轨道上。高级、团队领导、负责人。但我不想再严格地做软件工程了。我想做系统工程，或者商业工程之类的工作。<p>我想让客户和员工的生活变得更好，通过使以前不可能的事情成为可能，或者减少负担。<p>我想通过帮助企业建立系统_而不仅仅是软件_来做到这一点，从而产生内部和外部效应。这可能是在产品供应、业务组织和运营、委托软件团队或塑造组织文化方面有所作为。我也想帮助指导构建软件的软件工程团队，因为这是我的出身。<p>我觉得我正在寻找一个介于首席工程师、产品经理和工程总监之间的职位。<p>我正在申请首席工程师的职位，但是我所面试的公司都希望这个职位主要侧重于在JIRA板上移动票据，这并不是我真正想要的。我想帮助企业和团队在JIRA板上移动适当的票据。我得到了非常好的反馈，但他们就是不招聘这个角色。<p>在我的位置上，是否有其他角色可以考虑？",
  "description_zh-Hant": "我在尋求方向和指導。我正處於角色之間。我一直在努力為自己開闢一個非常規的角色，做我喜歡做的事，做我最擅長的事。我在尋求建議，因為我不確定什麼角色最符合我的要求。<p>我經歷過軟件開發。我跳過了管理軌道，留在了IC軌道上。高級、團隊領導、負責人。但我不想再嚴格地做軟件工程了。我想做系統工程，或者商業工程之類的工作。<p>我想讓客戶和員工的生活變得更好，通過使以前不可能的事情成為可能，或者減少負擔。<p>我想通過幫助企業建立系統_而不僅僅是軟件_來做到這一點，從而產生內部和外部效應。這可能是在產品供應、業務組織和運營、委託軟件團隊或塑造組織文化方面有所作為。我也想幫助指導構建軟件的軟件工程團隊，因為這是我的出身。<p>我覺得我正在尋找一個介於首席工程師、產品經理和工程總監之間的職位。<p>我正在申請首席工程師的職位，但是我所面試的公司都希望這個職位主要側重於在JIRA板上移動票據，這並不是我真正想要的。我想幫助企業和團隊在JIRA板上移動適當的票據。我得到了非常好的反饋，但他們就是不招聘這個角色。<p>在我的位置上，是否有其他角色可以考慮？"
}