{
  "@type": "NewsArticle",
  "identifier": "2022--07--13--en--askhn--HackerNews--NewsArticle--32088377",
  "url": "https://news.ycombinator.com/item?id=32088377",
  "headline": "Ask HN: What is the definition of a “founding engineer”?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm asking this question in response to this thread: https://news.ycombinator.com/item?id=32085475.<p>The reason I'm asking is because the comp listed in that thread is &quot;in the $160-180K range and equity around 1.5-2.0%&quot;. I'm assuming that actual founders (not &quot;founding engineers&quot;) will have equity stakes that are an order of magnitude more at that point in the company (though perhaps much lower cash salaries? not sure).<p>Now, of course, actual founders at this point have already done a ton more work and had more initial risk - they came up with the idea, did the work to get into YC, etc. But, going forward, the founding engineer is probably going to be working just as hard as the founders, and has just as much risk as the whole thing going belly up.<p>So, I don't mean this to come across as overly negative, but being a &quot;founding engineer&quot; seems like a pretty bad deal. If the company hits, you are going to have put in nearly as much work as the founders, but will be probably making ~10x less in equity. If the company fails, you're out of a job but are otherwise in a similar boat as the founders. I guess my overall point is, if you're considering being a &quot;founding engineer&quot;, why not just become a founder? Case in point, Nathan Blecharczyk, who was CTO and basically original engineer for AirBnB, was an actual cofounder and is now worth multi billions of dollars. If he were a &quot;founding engineer&quot;, he would probably put in nearly as much work, for 10x or more less payoff.<p>Would be interested in folks with more experience who could actually comment on the economics and thoughts on the risk/reward of this. Perhaps I'm just reacting to the phrase &quot;founding engineer&quot;, because it seems like it's trying to conflate the role of founder with much less of the benefit.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "hn_throwaway_99",
    "url": "https://news.ycombinator.com/user?id=hn_throwaway_99"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32088377",
  "sameAs": "https://news.ycombinator.com/item?id=32088377",
  "dateCreated": "2022-07-13T20:46:42.329Z",
  "datePublished": "2022-07-13T20:32:32.000Z",
  "dateModified": "2022-07-13T20:46:42.329Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: \"创始工程师 \"的定义是什么？\n",
  "headline_zh-Hant": "Ask HN: \"創始工程師 \"的定義是什麼？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我问这个问题是为了回应这个主题：https://news.ycombinator.com/item?id=32085475。<p>我之所以问这个问题是因为该主题中列出的薪酬是&quot;在16-18万美元之间，股权约为1.5-2.0%&quot;。我假设实际的创始人（而不是创始工程师）在公司的这一阶段将拥有更多的股权（尽管现金工资可能要低得多，但不确定）。<p>当然，实际的创始人在这一阶段已经做了大量的工作，并承担了更多的初始风险--他们提出了想法，为进入YC做了工作，等等。但是，在未来，创始工程师可能会像创始人一样努力工作，并承担着整个公司倒闭的风险。<p>因此，我并不是说这句话过于消极，但作为一个创始工程师似乎是一个相当糟糕的交易。如果公司成功了，你所付出的努力几乎和创始人一样多，但你所获得的股权可能会少10倍。如果公司失败了，你就失去了工作，但在其他方面与创始人的处境相似。我想我的总体观点是，如果你考虑成为一名 \"创始工程师\"，为什么不直接成为一名创始人？例如，Nathan Blecharczyk是AirBnB的首席技术官和基本的原始工程师，他是一个真正的联合创始人，现在身价数十亿美元。如果他是一名创始工程师，他可能会投入几乎同样多的工作，但回报却少了10倍甚至更多。<p>我希望有更多经验的人能够真正评论经济学和关于风险/回报的想法。也许我只是对&quot;创始工程师&quot;这个短语有反应，因为它似乎试图将创始人的角色与更少的利益混为一谈。\n",
  "description_zh-Hant": "我問這個問題是為了回應這個主題：https://news.ycombinator.com/item?id=32085475。<p>我之所以問這個問題是因為該主題中列出的薪酬是&quot;在16-18萬美元之間，股權約為1.5-2.0%&quot;。我假設實際的創始人（而不是創始工程師）在公司的這一階段將擁有更多的股權（儘管現金工資可能要低得多，但不確定）。<p>當然，實際的創始人在這一階段已經做了大量的工作，並承擔了更多的初始風險--他們提出了想法，為進入YC做了工作，等等。但是，在未來，創始工程師可能會像創始人一樣努力工作，並承擔著整個公司倒閉的風險。<p>因此，我並不是說這句話過於消極，但作為一個創始工程師似乎是一個相當糟糕的交易。如果公司成功了，你所付出的努力幾乎和創始人一樣多，但你所獲得的股權可能會少10倍。如果公司失敗了，你就失去了工作，但在其他方面與創始人的處境相似。我想我的總體觀點是，如果你考慮成為一名 \"創始工程師\"，為什麼不直接成為一名創始人？例如，Nathan Blecharczyk是AirBnB的首席技術官和基本的原始工程師，他是一個真正的聯合創始人，現在身價數十億美元。如果他是一名創始工程師，他可能會投入幾乎同樣多的工作，但回報卻少了10倍甚至更多。<p>我希望有更多經驗的人能夠真正評論經濟學和關於風險/回報的想法。也許我只是對&quot;創始工程師&quot;這個短語有反應，因為它似乎試圖將創始人的角色與更少的利益混為一談。\n"
}