{
  "@type": "NewsArticle",
  "identifier": "2022--07--16--en--askhn--HackerNews--NewsArticle--32115631",
  "url": "https://news.ycombinator.com/item?id=32115631",
  "headline": "Ask HN: Why doesn't Android have standard apps? USB Webcam? Settings? Calc?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "In 2022 it frustrates the hell out of me that on any Android phone I /may/ get apps I expect to be on the phone from the manufacturer, not as part of &quot;stock Android&quot;.  I love my Galaxy Z Fold 2, but I hate that walking through instructions with family members my &quot;Settings&quot; app looks different from theirs.  Even the Calculator is different.  It surprises me that in 2022, during this pandemic, I can't plug in my EXPENSIVE Android phone and use it as a high quality webcam for the computer.<p>Is there a reason Google avoids setting a baseline and having stock apps in Android?  Most of their apps are just portals to their services.  I feel as though the experience of Android is diminished because it's missing these bare necessities.<p>When I try to look for a forum to request a feature, it says to go navigate into Settings to About phone and then Submit feedback.  Catch-22:  My Settings on this Samsung phone looks different, and there is no Submit feedback.<p>Does Google have some kind of non-compete with app developers and avoids creating these basic apps?  I am nonplussed.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "thrwawy74",
    "url": "https://news.ycombinator.com/user?id=thrwawy74"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32115631",
  "sameAs": "https://news.ycombinator.com/item?id=32115631",
  "dateCreated": "2022-07-16T06:30:37.090Z",
  "datePublished": "2022-07-16T06:07:04.000Z",
  "dateModified": "2022-07-16T06:30:37.090Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么安卓没有标准的应用程序？USB网络摄像头？设置？计算？\n",
  "headline_zh-Hant": "Ask HN: 為什麼安卓沒有標準的應用程序？USB網絡攝像頭？設置？計算？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "2022年，在任何安卓手机上，我/可能/会得到我期望在手机上的应用，而不是作为&quot;原生安卓&quot;的一部分，这让我感到很沮丧。 我喜欢我的Galaxy Z Fold 2，但我讨厌和家人一起看说明书时，我的&quot;设置&quot;应用程序看起来与他们的不同。 甚至计算器也不一样。 让我感到惊讶的是，在2022年，在这场大流行中，我不能插入我昂贵的安卓手机，并将其用作电脑的高质量网络摄像头。<p>谷歌避免在安卓系统中设置一个基准线并拥有股票应用程序，这是否有什么原因？ 他们的大多数应用程序只是他们服务的门户。 我觉得安卓系统的体验被削弱了，因为它缺少这些最基本的必需品。<p>当我试图寻找一个论坛来请求一个功能时，它说要进入设置到关于手机的导航，然后提交反馈。 <p>谷歌是否与应用程序开发人员有某种不竞争关系，并避免创建这些基本应用程序？ 我感到很困惑。\n",
  "description_zh-Hant": "2022年，在任何安卓手機上，我/可能/會得到我期望在手機上的應用，而不是作為&quot;原生安卓&quot;的一部分，這讓我感到很沮喪。 我喜歡我的Galaxy Z Fold 2，但我討厭和家人一起看說明書時，我的&quot;設置&quot;應用程序看起來與他們的不同。 甚至計算器也不一樣。 讓我感到驚訝的是，在2022年，在這場大流行中，我不能插入我昂貴的安卓手機，並將其用作電腦的高質量網絡攝像頭。<p>谷歌避免在安卓系統中設置一個基準線並擁有股票應用程序，這是否有什麼原因？ 他們的大多數應用程序只是他們服務的門戶。 我覺得安卓系統的體驗被削弱了，因為它缺少這些最基本的必需品。<p>當我試圖尋找一個論壇來請求一個功能時，它說要進入設置到關於手機的導航，然後提交反饋。 <p>谷歌是否與應用程序開發人員有某種不競爭關係，並避免創建這些基本應用程序？ 我感到很困惑。\n"
}