{
  "@type": "NewsArticle",
  "identifier": "2022--07--15--en--askhn--HackerNews--NewsArticle--32106419",
  "url": "https://news.ycombinator.com/item?id=32106419",
  "headline": "Ask HN: How do I raise money for a nonprofit? Internationally on top of that?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm just a random dude from a poor African country. I'm currently living in France, working in management, and attempting to switch career, going into the tech world. Since then, my news feed is bloated with different offers of teachings and courses form everywhere, including my own country. The thing is, most of it sucks, just randoms thinking they can teach, bootcamp that gets nowhere and so on ... (they can market well though). There are also dev agencies that hire people for $200 a month while asking for $1000 to foreign employer and they get the difference, plainly exploitation. I don't really mind dev agencies, but I think money should be split fairly.<p>The problem: free resources don't have a marketing team behind them, so thousands of poor people get scammed everyday into buying a bad course that won't get them anywhere.<p>The plan: rent a local, put in fiber internet, and open it to the public for free so people can come in and learn (I will block anything not related to learning through a firewall or something). Maybe buy some computers if money allows it. The only prerequisites being to be able to speak/write English. There people can discuss, and more importantly, only use vetted resources to learn. I'm not a teacher and I won't pretend to be one, I'll just serve as a guide.<p>What lead me to this idea is that I personally use free resources online to learn as I try to become a data engineer. I'm following courses from UCB that are free to audit online, I will just compile or find a compilation of such courses into a curriculum and be done with it. I'm aware that this could be turned into a business, an outsourcing agency of sorts, but later maybe, if things goes well, for now its merely an idea. Any input would be appreciated. Thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tanganian",
    "url": "https://news.ycombinator.com/user?id=tanganian"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32106419",
  "sameAs": "https://news.ycombinator.com/item?id=32106419",
  "dateCreated": "2022-07-15T09:59:45.400Z",
  "datePublished": "2022-07-15T09:47:50.000Z",
  "dateModified": "2022-07-15T09:59:45.400Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我如何为一个非营利组织筹集资金？在此基础上的国际筹资？\n",
  "headline_zh-Hant": "Ask HN: 我如何為一個非營利組織籌集資金？在此基礎上的國際籌資？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我只是一个来自非洲穷国的普通人。我目前住在法国，从事管理工作，并试图转换职业，进入科技界。从那时起，我的新闻馈送中充斥着各地不同的教学和课程，包括我自己的国家。问题是，大部分课程都很糟糕，只是一些自以为能教书的人，一些毫无进展的训练营，等等......（不过他们能很好地推销）。也有一些开发机构以每月200美元的价格雇人，而向外国雇主索要1000美元，他们得到了其中的差额，显然是在剥削。我并不介意开发机构，但我认为钱应该公平分配。<p>问题是：免费资源背后没有一个营销团队，所以每天有成千上万的穷人被骗，买了一个糟糕的课程，但不会让他们有任何收获。<p>计划：租一个地方，装上光纤网络，并免费向公众开放，让人们可以进来学习（我会通过防火墙或其他东西阻止与学习无关的东西）。如果资金允许的话，也许可以买一些电脑。唯一的先决条件是要能说/写英语。在那里人们可以讨论，更重要的是，只使用经过审查的资源来学习。我不是老师，我也不会假装是老师，我只是作为一个向导。<p>导致我产生这个想法的原因是，我个人在努力成为一名数据工程师的过程中使用了网上的免费资源来学习。我正在关注UCB的课程，这些课程在网上是可以免费审核的，我只要把这些课程汇编或找到汇编成一个课程就可以了。我知道这可以变成一项业务，一个类似于外包的机构，但以后也许，如果事情进展顺利，现在它只是一个想法。如果有任何意见，我们将不胜感激。谢谢。\n",
  "description_zh-Hant": "我只是一個來自非洲窮國的普通人。我目前住在法國，從事管理工作，並試圖轉換職業，進入科技界。從那時起，我的新聞饋送中充斥著各地不同的教學和課程，包括我自己的國家。問題是，大部分課程都很糟糕，只是一些自以為能教書的人，一些毫無進展的訓練營，等等......（不過他們能很好地推銷）。也有一些開發機構以每月200美元的價格僱人，而向外國僱主索要1000美元，他們得到了其中的差額，顯然是在剝削。我並不介意開發機構，但我認為錢應該公平分配。<p>問題是：免費資源背後沒有一個營銷團隊，所以每天有成千上萬的窮人被騙，買了一個糟糕的課程，但不會讓他們有任何收穫。<p>計劃：租一個地方，裝上光纖網絡，並免費向公眾開放，讓人們可以進來學習（我會通過防火牆或其他東西阻止與學習無關的東西）。如果資金允許的話，也許可以買一些電腦。唯一的先決條件是要能說/寫英語。在那裡人們可以討論，更重要的是，只使用經過審查的資源來學習。我不是老師，我也不會假裝是老師，我只是作為一個嚮導。<p>導致我產生這個想法的原因是，我個人在努力成為一名數據工程師的過程中使用了網上的免費資源來學習。我正在關注UCB的課程，這些課程在網上是可以免費審核的，我只要把這些課程彙編或找到彙編成一個課程就可以了。我知道這可以變成一項業務，一個類似於外包的機構，但以後也許，如果事情進展順利，現在它只是一個想法。如果有任何意見，我們將不勝感激。謝謝。\n"
}