{
  "@type": "NewsArticle",
  "identifier": "2022--06--26--en--askhn--HackerNews--NewsArticle--31886161",
  "url": "https://news.ycombinator.com/item?id=31886161",
  "headline": "Ask HN: How to Delete an HBOMax Account?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have an HBOMax account that was previously associated with my Gmail account. I stopped using my Gmail account several years ago and thought I had switched all of my services over to the new account. Going through my password manager, I realized that because of the name change from HBO Go to HBOMax I missed it and had never switched over my HBO account.<p>So I logged in with my old info and changed my address to my new one. I suddenly started receiving emails about new shows that I have no interest in. The emails have no unsubscribe link in them. I went back to the site to turn off all emails, and it turns out you can't turn off emails from HBOMax, only from their &quot;partners&quot; (which I have done). I further discovered that the account for that email isn't actually how I get HBOMax. I get it through my cable provider. When I log in with my (formerly) Gmail account, it tells me I don't have a subscription. So now I'd just like to delete the account since I don't want emails from them and it's not associated with my actual ability to watch their shows. Searching their FAQs, there appears to be no way to delete your account and no way to turn off emails from them.<p>I've found various &quot;How To Delete Your HBOMax Account&quot; articles online (all of them terrible) [0], but the links they say to click on don't exist anywhere on the web site anymore (at least coming from Safari on my Mac). Furthermore, they talk about first cancelling your subscription, but as mentioned, this account doesn't actually have a subscription, so I can't even perform that step. They also mention emailing your username <i>and password</i> to the help email, but that sounds like a terrible idea. There's a phone number to call, but I don't want to have to deal with a &quot;retention specialist&quot;, though maybe the fact that I'm not currently subscribed through that email and am not canceling my other subscription would help?<p>Has anyone successfully canceled their HBOMax account, and if so, what did it take?<p>[0]https://donotpay.com/learn/how-to-delete-hbo-max-account/",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "thewebcount",
    "url": "https://news.ycombinator.com/user?id=thewebcount"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31886161",
  "sameAs": "https://news.ycombinator.com/item?id=31886161",
  "dateCreated": "2022-06-26T22:35:18.700Z",
  "datePublished": "2022-06-26T17:53:34.000Z",
  "dateModified": "2022-06-26T22:35:18.700Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何删除一个HBOMax账户？\n",
  "headline_zh-Hant": "Ask HN: 如何刪除一個HBOMax賬戶？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我有一个HBOMax账户，以前与我的Gmail账户有关。几年前我就不再使用我的Gmail账户了，我以为我已经把所有的服务都切换到了新账户上。通过我的密码管理器，我意识到，由于HBO Go更名为HBOMax，我错过了，而且从未将我的HBO账户转换过来。<p>所以我用我的旧信息登录，并将我的地址改为新的。我突然开始收到有关我不感兴趣的新节目的电子邮件。这些邮件中没有取消订阅的链接。我回到网站上关闭所有的电子邮件，结果发现你不能关闭来自HBOMax的电子邮件，只能关闭来自他们的&quot;合作伙伴&quot;（我已经这样做了）。我进一步发现，该电子邮件的账户实际上并不是我获得HBOMax的方式。我是通过我的有线电视供应商得到它的。当我用我的（以前的）Gmail账户登录时，它告诉我我没有订阅。所以现在我只想删除这个账户，因为我不希望收到他们的电子邮件，而且它与我观看他们节目的实际能力无关。<p>我在网上找到了各种&quot;如何删除你的HBOMax账户&quot;的文章（都很糟糕）[0]，但是他们说要点击的链接在网站上已经不存在了（至少从我的Mac上的Safari浏览器中可以看到）。Furthermore, they talk about first cancelling your subscription, but as mentioned, this account doesn't actually have a subscription, so I can't even perform that step. They also mention emailing your username <i>and password</i> to the help email, but that sounds like a terrible idea. There's a phone number to call, but I don't want to have to deal with a &quot;retention specialist&quot;, though maybe the fact that I'm not currently subscribed through that email and am not canceling my other subscription would help?<p>Has anyone successfully canceled their HBOMax account, and if so, what did it take?<p>[0]https://donotpay.com/learn/how-to-delete-hbo-max-account/\n",
  "description_zh-Hant": "我有一個HBOMax賬戶，以前與我的Gmail賬戶有關。幾年前我就不再使用我的Gmail賬戶了，我以為我已經把所有的服務都切換到了新賬戶上。通過我的密碼管理器，我意識到，由於HBO Go更名為HBOMax，我錯過了，而且從未將我的HBO賬戶轉換過來。<p>所以我用我的舊信息登錄，並將我的地址改為新的。我突然開始收到有關我不感興趣的新節目的電子郵件。這些郵件中沒有取消訂閱的鏈接。我回到網站上關閉所有的電子郵件，結果發現你不能關閉來自HBOMax的電子郵件，只能關閉來自他們的&quot;合作伙伴&quot;（我已經這樣做了）。我進一步發現，該電子郵件的賬戶實際上並不是我獲得HBOMax的方式。我是通過我的有線電視供應商得到它的。當我用我的（以前的）Gmail賬戶登錄時，它告訴我我沒有訂閱。所以現在我只想刪除這個賬戶，因為我不希望收到他們的電子郵件，而且它與我觀看他們節目的實際能力無關。<p>我在網上找到了各種&quot;如何刪除你的HBOMax賬戶&quot;的文章（都很糟糕）[0]，但是他們說要點擊的鏈接在網站上已經不存在了（至少從我的Mac上的Safari瀏覽器中可以看到）。Furthermore, they talk about first cancelling your subscription, but as mentioned, this account doesn't actually have a subscription, so I can't even perform that step. They also mention emailing your username <i>and password</i> to the help email, but that sounds like a terrible idea. There's a phone number to call, but I don't want to have to deal with a &quot;retention specialist&quot;, though maybe the fact that I'm not currently subscribed through that email and am not canceling my other subscription would help?<p>Has anyone successfully canceled their HBOMax account, and if so, what did it take?<p>[0]https://donotpay.com/learn/how-to-delete-hbo-max-account/\n"
}