{
  "@type": "NewsArticle",
  "identifier": "2022--06--15--en--askhn--HackerNews--NewsArticle--31753917",
  "url": "https://news.ycombinator.com/item?id=31753917",
  "headline": "Ask HN: Any insight on oddly tenacious and repetitive hacking attempts?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello HN! I am the owner of a long-lived WordPress site. I've seen a new and confusing attack pattern from would-be exploiters, and I seek opinions regarding the attackers' motives.<p>For as long as my site has been online (since 2005), it has been targeted by apparent &quot;script kiddies,&quot; whose automated tools crawl the web hitting up WordPress sites like mine with prepared lists of known vulnerabilities in WordPress core, plugins, and themes. Apart from a breach ca. 2008 (my fault, I fell behind on my WordPress updates), none have gotten through, each attacker would just test all the vulnerabilities on their list, and move on.<p>In mid-2021, my tools alerted me that a new and much more relentless person/organization had started probing for vulnerabilities. What struck me as odd is that they were hitting the server a few times a day, from various IPs, trying the same list of 5-6 vulnerabilities over and over. That struck me as a waste of resources, they'd need to be extremely lucky for me to happen to install one of those vulnerable plugins after their attacks began. After this went on for a few months I did some whois queries on their IPs and found that all came from Digital Ocean. So I sent all of my evidence to their abuse department, and they shortly terminated the client's account. That halted the attacks...but only briefly.<p>Within days the attacks resumed, but this time originating from a vast array of international IPs that were not from any single organization--proxy servers and Tor exit nodes and such. And the attack frequency increased significantly; rather than a few times per day, it has increased to several times per hour. But they are still using the same short list of vulnerabilities that has failed them so many times before.<p>I've captured the PHP files they are trying to deposit on the server, it is a typical H@x0r dashboard that allow the attacker to upload more files, execute arbitrary code, etc. Basic stuff.<p>Any ideas why an attacker would use this pattern of retrying a short list of failed exploits over and over? Why go to such lengths and expend such resources? Am I that juicy of a target, or are they just a bit thick-headed? Is there some underlying ingenuity that I am failing to appreciate? Has some sprawling automated hacking apparatus merely run amok? I welcome any insight. It's not really a problem, my defenses are holding, I just find the behavior a bit baffling.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "DamnInteresting",
    "url": "https://news.ycombinator.com/user?id=DamnInteresting"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31753917",
  "sameAs": "https://news.ycombinator.com/item?id=31753917",
  "dateCreated": "2022-06-15T15:29:03.107Z",
  "datePublished": "2022-06-15T14:57:52.000Z",
  "dateModified": "2022-06-15T15:29:03.107Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 对奇怪的顽强和重复的黑客攻击尝试有什么见解？\n",
  "headline_zh-Hant": "Ask HN: 對奇怪的頑強和重複的黑客攻擊嘗試有什麼見解？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，HN! 我是一个长寿的WordPress网站的所有者。<p>自从我的网站上线以来（从2005年开始），它一直是明显的 \"脚本小子 \"的目标，他们的自动工具在网络上爬行，用准备好的WordPress核心、插件和主题的已知漏洞清单来攻击我这样的WordPress网站。除了2008年的一次漏洞外（我的错，我的WordPress更新落后了），没有人通过，每个攻击者只是测试了他们名单上的所有漏洞，然后继续前进。<p>在2021年中期，我的工具提醒我，一个新的和更无情的人/组织已经开始探测漏洞。让我感到奇怪的是，他们每天都会从不同的IP上对服务器进行几次攻击，一遍又一遍地尝试相同的5-6个漏洞的列表。这让我觉得是在浪费资源，他们需要非常幸运，在他们的攻击开始后，我碰巧安装了一个有漏洞的插件。在这种情况持续了几个月之后，我对他们的IP进行了一些whois查询，发现所有的IP都来自Digital Ocean。所以我把所有的证据发给他们的滥用部门，他们很快就终止了客户的账户。<p>几天后，攻击又开始了，但这次的攻击来自大量的国际IP，而这些IP并不是来自任何一个组织--代理服务器和Tor出口节点等等。而且，攻击频率明显增加；不是每天几次，而是增加到每小时几次。但他们仍在使用之前多次失败的那份简短的漏洞清单。<p>我已经捕获了他们试图存入服务器的PHP文件，这是一个典型的H@x0r仪表盘，允许攻击者上传更多文件，执行任意代码，等等。基本的东西。<p>有什么想法吗，为什么攻击者会使用这种模式，一次又一次地重试一小部分失败的漏洞？为什么要花这么大的力气，耗费这么多的资源？我是一个多汁的目标，还是他们只是有点粗心大意？是否有一些潜在的独创性，而我却没有意识到？是否有一些庞大的自动黑客设备仅仅是乱来了？我欢迎任何洞察力。这并不是一个真正的问题，我的防御系统还在，我只是觉得这种行为有点令人费解。\n",
  "description_zh-Hant": "你好，HN! 我是一個長壽的WordPress網站的所有者。<p>自從我的網站上線以來（從2005年開始），它一直是明顯的 \"腳本小子 \"的目標，他們的自動工具在網絡上爬行，用準備好的WordPress核心、插件和主題的已知漏洞清單來攻擊我這樣的WordPress網站。除了2008年的一次漏洞外（我的錯，我的WordPress更新落後了），沒有人通過，每個攻擊者只是測試了他們名單上的所有漏洞，然後繼續前進。<p>在2021年中期，我的工具提醒我，一個新的和更無情的人/組織已經開始探測漏洞。讓我感到奇怪的是，他們每天都會從不同的IP上對服務器進行幾次攻擊，一遍又一遍地嘗試相同的5-6個漏洞的列表。這讓我覺得是在浪費資源，他們需要非常幸運，在他們的攻擊開始後，我碰巧安裝了一個有漏洞的插件。在這種情況持續了幾個月之後，我對他們的IP進行了一些whois查詢，發現所有的IP都來自Digital Ocean。所以我把所有的證據發給他們的濫用部門，他們很快就終止了客戶的賬戶。<p>幾天後，攻擊又開始了，但這次的攻擊來自大量的國際IP，而這些IP並不是來自任何一個組織--代理服務器和Tor出口節點等等。而且，攻擊頻率明顯增加；不是每天幾次，而是增加到每小時幾次。但他們仍在使用之前多次失敗的那份簡短的漏洞清單。<p>我已經捕獲了他們試圖存入服務器的PHP文件，這是一個典型的H@x0r儀表盤，允許攻擊者上傳更多文件，執行任意代碼，等等。基本的東西。<p>有什麼想法嗎，為什麼攻擊者會使用這種模式，一次又一次地重試一小部分失敗的漏洞？為什麼要花這麼大的力氣，耗費這麼多的資源？我是一個多汁的目標，還是他們只是有點粗心大意？是否有一些潛在的獨創性，而我卻沒有意識到？是否有一些龐大的自動黑客設備僅僅是亂來了？我歡迎任何洞察力。這並不是一個真正的問題，我的防禦系統還在，我只是覺得這種行為有點令人費解。\n"
}