{
  "@type": "NewsArticle",
  "identifier": "2022--06--10--en--askhn--HackerNews--NewsArticle--31696798",
  "url": "https://news.ycombinator.com/item?id=31696798",
  "headline": "Ask HN: Startups You Want to See?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "What are some startup ideas that you can't or don't want to pursue for some reason but honestly think might have legs and/or that you would like to see exist in the world? And that anyone who likes them is free to grab and run with?<p>For me:\n* Shamery: a bug hall of shame; anyone can submit bugs they've found in web, mobile, and desktop apps and vote on the worst to publicly shame companies into fixing them. The business model might be that it doubles as a job marketplace that connects high quality QA pros with the companies that need them. But really I think this would just be a funny website that would improve average product quality AND produce fun drama<p>* Router: input a list of job descriptions that interest you and your current experience and qualificatoins; the output is a custom curriculum for you to pursue, built from a curated collection of high quality resources available online, like MOOCs, blogs, learning projects, book PDFs, online playgrounds, etc. Not just a bunch of resource links but a learning path, with a specific ordering, specific assignments, etc<p>* Rivals - find leaderboard rivals for single player games like Geometry Wars and Slay The Spire. Join up into leagues, run customized competitions, compete across platforms",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "wly_cdgr",
    "url": "https://news.ycombinator.com/user?id=wly_cdgr"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31696798",
  "sameAs": "https://news.ycombinator.com/item?id=31696798",
  "dateCreated": "2022-06-10T17:06:40.045Z",
  "datePublished": "2022-06-10T17:05:27.000Z",
  "dateModified": "2022-06-10T17:06:40.045Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你想看的初创企业？\n",
  "headline_zh-Hant": "Ask HN: 你想看的初創企業？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "有哪些创业想法是你由于某种原因不能或不想去追求的，但说实话，你认为可能有腿和/或你希望看到在世界上存在的？而且，任何喜欢它们的人都可以自由地抓住并运行它们？<p>对我来说。\n* Shamery：一个错误的耻辱馆；任何人都可以提交他们在网络、移动和桌面应用程序中发现的错误，并投票选出最差的错误，以公开羞辱公司来修复它们。其商业模式可能是，它可以作为一个工作市场，将高质量的QA专家与需要他们的公司联系起来。但实际上，我认为这只是一个有趣的网站，可以提高产品的平均质量，并产生有趣的戏剧<p>* Router：输入一个你感兴趣的工作描述清单，以及你目前的经验和资格；输出是一个定制的课程，供你追求，建立在一个精心策划的高质量的在线资源集合，如MOOCs，博客，学习项目，书籍PDF，在线操场，等等。不仅仅是一堆资源链接，而是一条学习路径，有特定的顺序，特定的作业等<p>* 竞争对手--为《几何战争》和《杀戮尖塔》等单人游戏找到排行榜上的对手。加入联盟，举办定制比赛，跨平台竞争。\n",
  "description_zh-Hant": "有哪些創業想法是你由於某種原因不能或不想去追求的，但說實話，你認為可能有腿和/或你希望看到在世界上存在的？而且，任何喜歡它們的人都可以自由地抓住並運行它們？<p>對我來說。\n* Shamery：一個錯誤的恥辱館；任何人都可以提交他們在網絡、移動和桌面應用程序中發現的錯誤，並投票選出最差的錯誤，以公開羞辱公司來修復它們。其商業模式可能是，它可以作為一個工作市場，將高質量的QA專家與需要他們的公司聯繫起來。但實際上，我認為這只是一個有趣的網站，可以提高產品的平均質量，併產生有趣的戲劇<p>* Router：輸入一個你感興趣的工作描述清單，以及你目前的經驗和資格；輸出是一個定製的課程，供你追求，建立在一個精心策劃的高質量的在線資源集合，如MOOCs，博客，學習項目，書籍PDF，在線操場，等等。不僅僅是一堆資源鏈接，而是一條學習路徑，有特定的順序，特定的作業等<p>* 競爭對手--為《幾何戰爭》和《殺戮尖塔》等單人遊戲找到排行榜上的對手。加入聯盟，舉辦定製比賽，跨平臺競爭。\n"
}