{
  "@type": "NewsArticle",
  "identifier": "2022--06--07--en--askhn--HackerNews--NewsArticle--31653233",
  "url": "https://news.ycombinator.com/item?id=31653233",
  "headline": "Ask HN: Should I move to California or Germany as a SWE with 2 small kids?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm at a crossroads in my life. My wife and I are trying to figure out if we should move back to California or move to Germany to be closer to her parents.<p>A bit of background: We're in our mid-30s. Both in tech. I'm a software engineer. She's a product manager. I'm American and she's German. We met in SF in 2014 and left together in 2017. We traveled for a while, then moved to Amsterdam where we live now. We have a 1 year old daughter with another on the way in October. We don't plan on having more kids after that. We'd like to leave the Netherlands soon, but haven't decided yet if we should move back to California or move close to her parents in Germany.<p>There's tons of variables to consider, but the 2 main ones I'm focused on right now is the tradeoff between family support vs career prospects. In short: if we move to Bavaria, my wife's parents would be a huge help with our kids. They're natural and eager grandparents and they're great with our daughter. But, they live in a small village in Bavaria. If we moved to Germany, I assume we'd want to be close to them, so we'd end up in a similarly small village near them.<p>My family is scattered around CA and NY and, while it'd be nice to be closer to them, I don't think we'd get nearly the same kind of natural support network from them. If we did move to CA though, I assume we'd move closer to either my Dad (down in San Diego) or my Mom (around Sacramento).<p>On the career side, I'm assuming our career options and pay would be a lot higher in CA. I work as a senior eng at a large tech company and based on levels.fyi, it looks like my SF colleagues make somewhere between 2 and 4 times what I do. I know money isn't everything, but I've experienced the pain and stress that not having enough causes. I see it with all my family members now. Since moving to the Netherlands, I haven't been able to save or invest nearly as much as I could back in CA. Maybe it's the American in me, or a vestige from my childhood, but I feel uneasy not building more wealth. Money smooths everything over - from relationships, to the options you have available, to the time you can buy with it. But, that additional pay would come at the expense of being more on our own raising our kids, which adds another set of stressors and difficulties. Additionally, for the sake of our kids, we think it'd be good for them to have more involved relatives.<p>Any SWE parents out there who have insights? How hard is it raising kids in CA if you have limited family support? What's your quality of life in CA as a parent? Does cost of living eat up all the additional money I assume we could make? We'd eventually like to buy a house, but the markets seem so crazy that even with the pay raises I wonder if we could swing it.<p>What about quality of life and career prospects in Germany? Anyone living there have any insights? Since we'd be looking at being closer to my wife's parents, I think we'd need to find remote work, so that would also be a limiting factor. I'm assuming we couldn't build as much individual wealth, but perhaps the services of the state compensate enough for that and I should let go of that obsession?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "de_or_ca",
    "url": "https://news.ycombinator.com/user?id=de_or_ca"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31653233",
  "sameAs": "https://news.ycombinator.com/item?id=31653233",
  "dateCreated": "2022-06-07T12:51:02.953Z",
  "datePublished": "2022-06-07T12:31:33.000Z",
  "dateModified": "2022-06-07T12:51:02.953Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 作为一个有两个小孩的SWE，我应该搬到加州还是德国？\n",
  "headline_zh-Hant": "Ask HN: 作為一個有兩個小孩的SWE，我應該搬到加州還是德國？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我正处于人生的一个十字路口。我的妻子和我正试图弄清楚，我们是应该搬回加州，还是搬到德国去，以便更接近她的父母。我们都是30多岁的人。我们都从事技术工作。我是一名软件工程师。她是一个产品经理。我是美国人，她是德国人。我们2014年在旧金山认识，2017年一起离开。我们旅行了一段时间，然后搬到了现在居住的阿姆斯特丹。我们有一个1岁的女儿，另一个即将在10月出生。我们不打算在那之后再要孩子。我们想尽快离开荷兰，但还没有决定是搬回加州还是搬到她父母在德国的附近。<p>有大量的变量需要考虑，但我现在关注的两个主要变量是家庭支持与职业前景之间的权衡。简而言之：如果我们搬到巴伐利亚，我妻子的父母会对我们的孩子有很大帮助。他们是自然的、热心的祖父母，他们对我们的女儿很好。但是，他们住在巴伐利亚的一个小村庄里。如果我们搬到德国，我想我们会想靠近他们，所以我们最终会在他们附近的一个类似的小村庄。<p>我的家人分散在加州和纽约，虽然离他们近一点会很好，但我不认为我们会从他们那里得到几乎相同的自然支持网络。如果我们真的搬到加州，我想我们会搬到离我爸爸（在圣地亚哥）或我妈妈（在萨克拉门托附近）更近的地方。<p>在职业方面，我想我们的职业选择和薪酬在加州会高很多。我在一家大型科技公司担任高级工程师，根据级别.fyi，看起来我在旧金山的同事的收入是我的2到4倍之间。我知道钱不是万能的，但我经历过没有足够的钱所带来的痛苦和压力。我现在在我所有的家庭成员身上看到了这一点。自从搬到荷兰后，我一直无法像在加州时那样进行储蓄或投资。也许这是我的美国情结，或者是我童年的遗留问题，但我觉得不积累更多的财富是不舒服的。金钱使一切都变得顺利--从关系，到你可以选择的东西，到你可以用它购买的时间。但是，额外的工资将以我们更多地独自抚养孩子为代价，这又增加了一系列的压力和困难。此外，为了我们的孩子，我们认为有更多的亲戚参与对他们有好处。<p>有任何SWE父母有见解吗？如果你的家庭支持有限，在加州抚养孩子有多难？作为父母，你在加州的生活质量如何？生活成本是否会吞噬掉我认为我们可以赚到的所有额外资金？我们最终想买房子，但市场似乎太疯狂了，即使加薪，我不知道我们是否能摆平。<p>德国的生活质量和职业前景如何？有谁住在那里的人有什么见解？由于我们想离我妻子的父母更近一些，我想我们需要找到远程工作，所以这也将是一个限制因素。我假设我们不能建立那么多的个人财富，但也许国家的服务足以弥补这一点，我应该放下这个执念？\n",
  "description_zh-Hant": "我正處於人生的一個十字路口。我的妻子和我正試圖弄清楚，我們是應該搬回加州，還是搬到德國去，以便更接近她的父母。我們都是30多歲的人。我們都從事技術工作。我是一名軟件工程師。她是一個產品經理。我是美國人，她是德國人。我們2014年在舊金山認識，2017年一起離開。我們旅行了一段時間，然後搬到了現在居住的阿姆斯特丹。我們有一個1歲的女兒，另一個即將在10月出生。我們不打算在那之後再要孩子。我們想盡快離開荷蘭，但還沒有決定是搬回加州還是搬到她父母在德國的附近。<p>有大量的變量需要考慮，但我現在關注的兩個主要變量是家庭支持與職業前景之間的權衡。簡而言之：如果我們搬到巴伐利亞，我妻子的父母會對我們的孩子有很大幫助。他們是自然的、熱心的祖父母，他們對我們的女兒很好。但是，他們住在巴伐利亞的一個小村莊裡。如果我們搬到德國，我想我們會想靠近他們，所以我們最終會在他們附近的一個類似的小村莊。<p>我的家人分散在加州和紐約，雖然離他們近一點會很好，但我不認為我們會從他們那裡得到幾乎相同的自然支持網絡。如果我們真的搬到加州，我想我們會搬到離我爸爸（在聖地亞哥）或我媽媽（在薩克拉門託附近）更近的地方。<p>在職業方面，我想我們的職業選擇和薪酬在加州會高很多。我在一家大型科技公司擔任高級工程師，根據級別.fyi，看起來我在舊金山的同事的收入是我的2到4倍之間。我知道錢不是萬能的，但我經歷過沒有足夠的錢所帶來的痛苦和壓力。我現在在我所有的家庭成員身上看到了這一點。自從搬到荷蘭後，我一直無法像在加州時那樣進行儲蓄或投資。也許這是我的美國情結，或者是我童年的遺留問題，但我覺得不積累更多的財富是不舒服的。金錢使一切都變得順利--從關係，到你可以選擇的東西，到你可以用它購買的時間。但是，額外的工資將以我們更多地獨自撫養孩子為代價，這又增加了一系列的壓力和困難。此外，為了我們的孩子，我們認為有更多的親戚參與對他們有好處。<p>有任何SWE父母有見解嗎？如果你的家庭支持有限，在加州撫養孩子有多難？作為父母，你在加州的生活質量如何？生活成本是否會吞噬掉我認為我們可以賺到的所有額外資金？我們最終想買房子，但市場似乎太瘋狂了，即使加薪，我不知道我們是否能擺平。<p>德國的生活質量和職業前景如何？有誰住在那裡的人有什麼見解？由於我們想離我妻子的父母更近一些，我想我們需要找到遠程工作，所以這也將是一個限制因素。我假設我們不能建立那麼多的個人財富，但也許國家的服務足以彌補這一點，我應該放下這個執念？\n"
}