{
  "@type": "NewsArticle",
  "identifier": "2022--04--16--en--askhn--HackerNews--NewsArticle--31051955",
  "url": "https://news.ycombinator.com/item?id=31051955",
  "headline": "Ask HN: Would you choose good pay or more interesting job?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am an ML engineer from eastern europe. About 8 years in the industry in total, 4 in ML. I am torn between two offers.<p>The first is full remote, flexible, $120k+ a year total comp, and involves being the main and only DS guy for a small startup. Great pay (4x my current totalcomp) and perks. The ML I am going to do is kind of boring. This role will probably give me good business experience.<p>The second one is an office job with relocation to Portugal, making ML/CV for cutting edge industrial robotics, working under a very strong professor. But only $45k total comp. Maybe they can give me $80k a year tops (still negotiating).<p>Most of you will probably want to jump in and yell: &quot;Over 2 times more money? That's a no-brainer!&quot; The problem is that I basically never cared so much about a job as I care about this second offer. It's literally the first time in my life when I heard about a mission and didn't consider it BS. Usually, I nod along to missions and visions, treating them as kind of a pretense game we play, where companies try to imitate early Google or something, and we pretend we are not seeing it. But this time it really hit me: a job where I am needed, the product is important, the business is selling something real, the people seem so cool we spent most of the interviews joking.<p>I have never had such a hard choice between jobs in my life. Usually I choose based on long term returns. But here long term returns are good for both options, but in different aspects. For my financials the first one is way better, for my skills the second one is way better.<p>What would you choose? Have you had experience choosing money over opportunity or vise versa, and regretting it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "euphetar",
    "url": "https://news.ycombinator.com/user?id=euphetar"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31051955",
  "sameAs": "https://news.ycombinator.com/item?id=31051955",
  "dateCreated": "2022-04-16T13:19:09.062Z",
  "datePublished": "2022-04-16T12:59:09.000Z",
  "dateModified": "2022-04-16T13:19:09.062Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你会选择高薪还是更有趣的工作？",
  "headline_zh-Hant": "Ask HN: 你會選擇高薪還是更有趣的工作？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个来自东欧的ML工程师。我在这个行业总共工作了8年，其中4年是ML。我在两份工作中纠结不已。<p>第一份工作是完全远程的，灵活的，年薪12万以上，涉及成为一家小型创业公司的主要和唯一的DS人员。薪水很高（是我目前总薪酬的4倍），福利也很好。我将要做的工作是有点无聊的。这个角色可能会给我带来很好的商业经验。<p>第二份工作是一份办公室工作，要搬到葡萄牙，为尖端的工业机器人做ML/CV，在一个非常强大的教授手下工作。但总薪酬只有4.5万美元。也许他们最多能给我8万美元的年薪（还在谈判中）。<p>你们中的大多数人可能会想跳出来大喊：&quot;超过2倍的钱？问题是，我基本上从来没有像现在这样对一份工作如此关心过。这简直是我一生中第一次听到一个任务而不去考虑它是什么。通常，我对任务和愿景点头称是，把它们当作我们玩的一种假装游戏，公司试图模仿早期的谷歌或什么，而我们假装没有看到。但是这一次，我真的被击中了：一份需要我的工作，产品很重要，企业在销售真实的东西，人们看起来很酷，我们在面试中大部分时间都在开玩笑。<p>在我的生活中，我从来没有在工作之间做出如此艰难的选择。通常我都是根据长期回报来选择。但在这里，两个选项的长期回报都不错，但在不同方面。对于我的财务状况来说，第一个选项要好得多，而对于我的技能来说，第二个选项要好得多。你是否有过选择金钱而不是机会的经历，或者反过来说，选择金钱而不是机会而后悔的经历？",
  "description_zh-Hant": "我是一個來自東歐的ML工程師。我在這個行業總共工作了8年，其中4年是ML。我在兩份工作中糾結不已。<p>第一份工作是完全遠程的，靈活的，年薪12萬以上，涉及成為一家小型創業公司的主要和唯一的DS人員。薪水很高（是我目前總薪酬的4倍），福利也很好。我將要做的工作是有點無聊的。這個角色可能會給我帶來很好的商業經驗。<p>第二份工作是一份辦公室工作，要搬到葡萄牙，為尖端的工業機器人做ML/CV，在一個非常強大的教授手下工作。但總薪酬只有4.5萬美元。也許他們最多能給我8萬美元的年薪（還在談判中）。<p>你們中的大多數人可能會想跳出來大喊：&quot;超過2倍的錢？問題是，我基本上從來沒有像現在這樣對一份工作如此關心過。這簡直是我一生中第一次聽到一個任務而不去考慮它是什麼。通常，我對任務和願景點頭稱是，把它們當作我們玩的一種假裝遊戲，公司試圖模仿早期的谷歌或什麼，而我們假裝沒有看到。但是這一次，我真的被擊中了：一份需要我的工作，產品很重要，企業在銷售真實的東西，人們看起來很酷，我們在面試中大部分時間都在開玩笑。<p>在我的生活中，我從來沒有在工作之間做出如此艱難的選擇。通常我都是根據長期回報來選擇。但在這裡，兩個選項的長期回報都不錯，但在不同方面。對於我的財務狀況來說，第一個選項要好得多，而對於我的技能來說，第二個選項要好得多。你是否有過選擇金錢而不是機會的經歷，或者反過來說，選擇金錢而不是機會而後悔的經歷？"
}