{
  "@type": "NewsArticle",
  "identifier": "2022--06--20--en--askhn--HackerNews--NewsArticle--31816377",
  "url": "https://news.ycombinator.com/item?id=31816377",
  "headline": "Ask HN: BeReal Shows Who Takes Screenshots with No Notice to Users",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been enjoying BeReal recently, the new social media app that promises to not waste your time and encourages authentic expression.  Most of human life is boring, ugly, and unfiltered, which is exactly what I see in my BeReal feed.<p>However, I think it is pretty sketchy of BeReal to not tell people about screenshot notifications. It turns out that if you take screenshots of BeReal photos, that person can see that you did it. It can be embarrassing to save someone's photo, on purpose or accidentally, and not realize that they will find out. There's no warning or confirmation process, so you might take a screenshot without realizing that someone else will know. The developers haven't written a blog post on this topic, don't mention this in their &quot;Warnings&quot; in the app store, and haven't answered open Reddit threads even though they clearly included this feature as a growth hack.<p>I think that BeReal should tell users explicitly that if you take screenshots, the person will know and see who you are. I believe this because I think your behavior in an app should be considered private unless explicitly stated otherwise. What do you think?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jenthoven",
    "url": "https://news.ycombinator.com/user?id=jenthoven"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31816377",
  "sameAs": "https://news.ycombinator.com/item?id=31816377",
  "dateCreated": "2022-06-20T22:44:06.904Z",
  "datePublished": "2022-06-20T21:39:10.000Z",
  "dateModified": "2022-06-20T22:44:06.904Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: BeReal显示谁在不通知用户的情况下进行截图\n",
  "headline_zh-Hant": "Ask HN: BeReal顯示誰在不通知用戶的情況下進行截圖\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我最近很喜欢BeReal，这个新的社交媒体应用程序承诺不浪费你的时间，并鼓励真实表达。 人类生活的大部分都是无聊、丑陋和未经过滤的，这正是我在BeReal feed中看到的。<p>然而，我认为BeReal不告诉人们关于截图通知的做法是相当粗略的。事实证明，如果你对BeReal的照片进行截图，那个人就可以看到你做了什么。故意或意外地保存某人的照片，而没有意识到他们会发现，这可能是很尴尬的。没有警告或确认过程，所以你可能在没有意识到别人会知道的情况下进行了截图。开发者没有就这个话题写过一篇博文，在应用商店的&quot;警告&quot;中也没有提到这一点，也没有回答公开的Reddit线程，尽管他们明确将这个功能作为一个增长黑客。<p>我认为，BeReal应该明确告诉用户，如果你截图，对方会知道并看到你是谁。我相信这一点，因为我认为你在一个应用程序中的行为应该被视为隐私，除非有明确的规定。你怎么看？\n",
  "description_zh-Hant": "我最近很喜歡BeReal，這個新的社交媒體應用程序承諾不浪費你的時間，並鼓勵真實表達。 人類生活的大部分都是無聊、醜陋和未經過濾的，這正是我在BeReal feed中看到的。<p>然而，我認為BeReal不告訴人們關於截圖通知的做法是相當粗略的。事實證明，如果你對BeReal的照片進行截圖，那個人就可以看到你做了什麼。故意或意外地保存某人的照片，而沒有意識到他們會發現，這可能是很尷尬的。沒有警告或確認過程，所以你可能在沒有意識到別人會知道的情況下進行了截圖。開發者沒有就這個話題寫過一篇博文，在應用商店的&quot;警告&quot;中也沒有提到這一點，也沒有回答公開的Reddit線程，儘管他們明確將這個功能作為一個增長黑客。<p>我認為，BeReal應該明確告訴用戶，如果你截圖，對方會知道並看到你是誰。我相信這一點，因為我認為你在一個應用程序中的行為應該被視為隱私，除非有明確的規定。你怎麼看？\n"
}