{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--askhn--HackerNews--NewsArticle--32293446",
  "url": "https://news.ycombinator.com/item?id=32293446",
  "headline": "Ask HN: Books or courses to learn computer programming?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Please guide me towards good resources that will really pay off in the future in my skill building. Currently I am a high school graduate. I am interested in learning computer programming and computer science.<p>I have searched online for self study resources. I have searched university public course webpages. Almost all introductory programming materials I have seen seem to be just teaching the syntax of a favourite hot programming language and asking students to do exercises using the newest taught syntactical feature of the language. I doubt they teach how to actually solve problems or design solutions in a language agnostic way. I want to learn programming in such a way like you learn touch typing. Like it becoming a second nature. All I am saying is I want transferrable skills (foundational principles?) that once learnt can be applied to any new programming language I pick up.<p>My ultimate aim is to be able to program complex systems in any programming language (that the project demands) in a well structured manner. Rather than worrying about the syntax, my worry should lie how I should utilise the system resources at hand, and model my problem and solution in that manner that the system is most efficient.<p>I prefer books, but if there are online courses that can help me I am more than happy to look into those.<p>Can you please suggest some resources along these lines?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "curious16",
    "url": "https://news.ycombinator.com/user?id=curious16"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32293446",
  "sameAs": "https://news.ycombinator.com/item?id=32293446",
  "dateCreated": "2022-07-31T08:49:10.019Z",
  "datePublished": "2022-07-31T05:32:07.000Z",
  "dateModified": "2022-07-31T08:49:10.019Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 学习计算机编程的书籍或课程？\n",
  "headline_zh-Hant": "Ask HN: 學習計算機編程的書籍或課程？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "请指导我寻找好的资源，这些资源将在未来的技能建设中真正得到回报。目前我是一名高中毕业生。我对学习计算机编程和计算机科学感兴趣。<p>我在网上搜索了自学资源。我搜索了大学公共课程的网页。我所看到的几乎所有的编程入门材料似乎都只是在教授一种最受欢迎的热门编程语言的语法，并要求学生使用该语言最新教授的语法特征做练习。我怀疑他们教的是如何真正地解决问题，或者以一种与语言无关的方式设计解决方案。我想以这种方式学习编程，就像你学习触摸打字一样。就像它成为第二天性一样。我想说的是，我想要可转移的技能（基础原则？），一旦学会了就可以应用于任何新的编程语言。<p>我的最终目标是能够以良好的结构化方式用任何编程语言（项目需要）对复杂系统进行编程。比起担心语法，我担心的应该是如何利用手头的系统资源，并以系统最有效的方式对我的问题和解决方案进行建模。<p>我更喜欢书本，但如果有在线课程可以帮助我，我也非常乐意去研究。\n",
  "description_zh-Hant": "請指導我尋找好的資源，這些資源將在未來的技能建設中真正得到回報。目前我是一名高中畢業生。我對學習計算機編程和計算機科學感興趣。<p>我在網上搜索了自學資源。我搜索了大學公共課程的網頁。我所看到的幾乎所有的編程入門材料似乎都只是在教授一種最受歡迎的熱門編程語言的語法，並要求學生使用該語言最新教授的語法特徵做練習。我懷疑他們教的是如何真正地解決問題，或者以一種與語言無關的方式設計解決方案。我想以這種方式學習編程，就像你學習觸摸打字一樣。就像它成為第二天性一樣。我想說的是，我想要可轉移的技能（基礎原則？），一旦學會了就可以應用於任何新的編程語言。<p>我的最終目標是能夠以良好的結構化方式用任何編程語言（項目需要）對複雜系統進行編程。比起擔心語法，我擔心的應該是如何利用手頭的系統資源，並以系統最有效的方式對我的問題和解決方案進行建模。<p>我更喜歡書本，但如果有在線課程可以幫助我，我也非常樂意去研究。\n"
}