{
  "@type": "NewsArticle",
  "identifier": "2022--06--10--en--askhn--HackerNews--NewsArticle--31698060",
  "url": "https://news.ycombinator.com/item?id=31698060",
  "headline": "Ask HN: Need advice about co-founding a startup with a VC and equity",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "In the last few months I've been working as an Entrepreneur in Resident with a VC in New York that incubates companies.\nThe deal was that we'll co-found a startup together, they will lead our seed round ($2.8M) and help me build the company. I'll be the main person working full-time on the company and the VC partners will take the CEO role but will work part time on the startup. Both VC partners have extensive experience as successful startup co-founders and CEOs.<p>At the beginning it seems like a great deal. I'll get to work closely with three serial entrepreneurs and build a startup with them. They will bring a clear playbook and help with the Go To Market (I'm an engineer so that's my weakness)<p>But after a few months, it's very clear that I'll be doing everything in the startup. Initially I thought they'll manage the entire go to market and sales, but up until now I had to do everything. Their contribution is providing advice when needed and having a 2 hour meeting with me every week to discuss everything.<p>While the time with them is very helpful, I can't shake the feeling that if I'm doing 99% of the work + came up with the idea, I'm better of finding a co-founder and start my own company. Right now I get only 10% equity. What do you think?<p>Here are the pros:<p>* Salary from the first day ($150k/year while I was making $300k/year before that)<p>* Raise funding easily ($2.85M at day 1) and they seem to be able to raise future rounds with ease (after all they are VC)<p>* Get to do my dream role - found a startup - with lower risk (salary + help)<p>* Work with 3 incredible guys that I trust and that co-founded several successful companies (as founders not investors).<p>* Their advice is very helpful and I get a lot of freedom. They do not try to tell me what to do, but rather support my journey.<p>* I get 10% equity post the Seed dilution<p>* I attain very valuable experience and learn a lot<p>Cons:<p>* Only 10% while I'm doing most of the work.<p>* Not the CEO even though I'm doing the CEO job.<p>* No control over the company (they can fire me at any time).<p>* Their investment time-wise is not huge.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "torynoter2832",
    "url": "https://news.ycombinator.com/user?id=torynoter2832"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31698060",
  "sameAs": "https://news.ycombinator.com/item?id=31698060",
  "dateCreated": "2022-06-10T19:21:16.484Z",
  "datePublished": "2022-06-10T18:57:05.000Z",
  "dateModified": "2022-06-10T19:21:16.484Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 需要关于与VC和股权共同创办创业公司的建议\n",
  "headline_zh-Hant": "Ask HN: 需要關於與VC和股權共同創辦創業公司的建議\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在过去的几个月里，我一直作为驻场企业家与纽约一家孵化公司的风险投资公司合作。\n交易的内容是，我们将共同创办一家创业公司，他们将领导我们的种子轮（280万美元），并帮助我建立公司。我将是公司全职工作的主要人员，而风险投资合伙人将担任首席执行官的角色，但将兼职从事创业公司的工作。两位风险投资合伙人都有作为成功的创业公司联合创始人和首席执行官的丰富经验。<p>一开始，这似乎是一笔不错的交易。我将与三位连续创业者紧密合作，并与他们一起建立一个创业公司。他们将带来一个清晰的游戏手册，并帮助进入市场（我是一名工程师，所以这是我的弱点）<p>但几个月后，很明显，我将在创业公司中做所有事情。最初我以为他们会管理整个市场和销售，但直到现在我还得做所有事情。他们的贡献是在需要的时候提供建议，并且每周和我开2个小时的会议讨论所有事情。<p>虽然和他们在一起的时间很有帮助，但我无法摆脱这样的感觉：如果我做了99%的工作+提出了这个想法，我最好找一个联合创始人，自己开一个公司。现在，我只得到10%的股权。你怎么看？<p>以下是优点：<p>* 从第一天开始就有工资（15万美元/年，而我之前的工资是30万美元/年）<p>* 很容易筹集到资金（2美元。 85万美元），而且他们似乎能够轻松地筹集到未来的资金（毕竟他们是VC）<p>* 能够以较低的风险（工资+帮助）从事我梦想的工作--创办一家创业公司）<p>* 与三个我信任的、共同创办了几家成功公司（作为创始人而不是投资者）的不可思议的家伙一起工作<p>* 他们的建议非常有用，我得到了很多自由。他们并不试图告诉我该怎么做，而是支持我的旅程。<p>* 我在种子稀释后得到10%的股权<p>* 我获得了非常宝贵的经验，学到了很多东西<p>缺点：<p>* 只有10%，而我做了大部分工作。<p>* 不是CEO，尽管我在做CEO的工作。<p>* 对公司没有控制权（他们可以在任何时候解雇我）。\n",
  "description_zh-Hant": "在過去的幾個月裡，我一直作為駐場企業家與紐約一家孵化公司的風險投資公司合作。\n交易的內容是，我們將共同創辦一家創業公司，他們將領導我們的種子輪（280萬美元），並幫助我建立公司。我將是公司全職工作的主要人員，而風險投資合夥人將擔任首席執行官的角色，但將兼職從事創業公司的工作。兩位風險投資合夥人都有作為成功的創業公司聯合創始人和首席執行官的豐富經驗。<p>一開始，這似乎是一筆不錯的交易。我將與三位連續創業者緊密合作，並與他們一起建立一個創業公司。他們將帶來一個清晰的遊戲手冊，並幫助進入市場（我是一名工程師，所以這是我的弱點）<p>但幾個月後，很明顯，我將在創業公司中做所有事情。最初我以為他們會管理整個市場和銷售，但直到現在我還得做所有事情。他們的貢獻是在需要的時候提供建議，並且每週和我開2個小時的會議討論所有事情。<p>雖然和他們在一起的時間很有幫助，但我無法擺脫這樣的感覺：如果我做了99%的工作+提出了這個想法，我最好找一個聯合創始人，自己開一個公司。現在，我只得到10%的股權。你怎麼看？<p>以下是優點：<p>* 從第一天開始就有工資（15萬美元/年，而我之前的工資是30萬美元/年）<p>* 很容易籌集到資金（2美元。 85萬美元），而且他們似乎能夠輕鬆地籌集到未來的資金（畢竟他們是VC）<p>* 能夠以較低的風險（工資+幫助）從事我夢想的工作--創辦一家創業公司）<p>* 與三個我信任的、共同創辦了幾家成功公司（作為創始人而不是投資者）的不可思議的傢伙一起工作<p>* 他們的建議非常有用，我得到了很多自由。他們並不試圖告訴我該怎麼做，而是支持我的旅程。<p>* 我在種子稀釋後得到10%的股權<p>* 我獲得了非常寶貴的經驗，學到了很多東西<p>缺點：<p>* 只有10%，而我做了大部分工作。<p>* 不是CEO，儘管我在做CEO的工作。<p>* 對公司沒有控制權（他們可以在任何時候解僱我）。\n"
}