{
  "@type": "NewsArticle",
  "identifier": "2022--07--07--en--askhn--HackerNews--NewsArticle--32016172",
  "url": "https://news.ycombinator.com/item?id=32016172",
  "headline": "Ask HN: Implication of Craigslist Scammer Having My Selfie ID Photo?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I listed one of my car for sale on craigslist and had someone contact me outside my city. The conversation started off very natural with the &quot;buyer&quot; asking very relevant used car questions. Then he said he is out of town and is willing to send me a deposit to hold the car. He said: &quot;Before I send you a deposit, please send me a selfie of you, with your drivers license with a piece of paper with todays date July 5 2022. also include a copy of the vehicle registration &amp; insurance.&quot;<p>I got caught off-guard as I sold my last car also to someone remotely sight unseen. So I sent him what he asked. The next morning I woke up and had a sudden realization that I probably got scammed. I went back to the email and realized the phone number and personal email he provided were both fake. He used a generic common Chinese name of &quot;Charles Lau&quot;.<p>I googled selfie ID and it looks like a lot of crypto site (including Coinbase) is using selfie + id + hand written text for biometric verification. Some banks since covid also implemented selfie ID verification.<p>I filed a local police report and contacted my driver licensing and insurance, which they said theres not much they can do.<p>My question to HN is what are some of the risks to me as this scammer now has my Selfie + ID + vehicle registration + address. Knowing that crypto sites uses this for verification, can the scammer create a bunch of crypto exchange accounts under my name and start laundering dirty crypto money? or take out a crypto/regular loan under my name? What can I do to protect my self going forward?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ricksta",
    "url": "https://news.ycombinator.com/user?id=ricksta"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32016172",
  "sameAs": "https://news.ycombinator.com/item?id=32016172",
  "dateCreated": "2022-07-07T16:42:14.282Z",
  "datePublished": "2022-07-07T16:36:54.000Z",
  "dateModified": "2022-07-07T16:42:14.282Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: Craigslist骗子拥有我的自拍身份证照片的影响？\n",
  "headline_zh-Hant": "Ask HN: Craigslist騙子擁有我的自拍身份證照片的影響？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在Craigslist上列出了我的一辆车的销售，有人在我所在的城市之外与我联系。谈话开始时非常自然，买家问了非常相关的二手车问题。然后，他说他不在城里，愿意给我寄定金以保留汽车。他说：&quot;在我给你寄定金之前，请给我发一张你的自拍照，并附上你的驾驶执照和一张写有2022年7月5日这一天的纸，还包括一份车辆登记证&amp; 保险。所以我把他要求的东西发给了他。第二天早上，我醒来时突然意识到，我可能被骗了。我回过头去看那封邮件，发现他提供的电话号码和个人邮箱都是假的。他用了一个通用的普通中文名字&quot;Charles Lau&quot;。<p>我在谷歌上搜索了自拍身份证，看起来很多加密货币网站（包括Coinbase）正在使用自拍+身份证+手写文字的生物识别验证。<p>我向当地警方报案，并联系了我的驾驶执照和保险，他们说他们能做的不多。<p>我问HN的问题是，这个骗子现在有我的自拍+身份证+车辆登记证+地址，对我来说有什么风险？知道加密货币网站使用这个进行验证，骗子是否可以用我的名字创建一堆加密货币交易所账户，并开始清洗肮脏的加密货币？ 或者用我的名字进行加密货币/普通贷款？我可以做什么来保护我自己的未来？\n",
  "description_zh-Hant": "我在Craigslist上列出了我的一輛車的銷售，有人在我所在的城市之外與我聯繫。談話開始時非常自然，買家問了非常相關的二手車問題。然後，他說他不在城裡，願意給我寄定金以保留汽車。他說：&quot;在我給你寄定金之前，請給我發一張你的自拍照，並附上你的駕駛執照和一張寫有2022年7月5日這一天的紙，還包括一份車輛登記證&amp; 保險。所以我把他要求的東西發給了他。第二天早上，我醒來時突然意識到，我可能被騙了。我回過頭去看那封郵件，發現他提供的電話號碼和個人郵箱都是假的。他用了一個通用的普通中文名字&quot;Charles Lau&quot;。<p>我在谷歌上搜索了自拍身份證，看起來很多加密貨幣網站（包括Coinbase）正在使用自拍+身份證+手寫文字的生物識別驗證。<p>我向當地警方報案，並聯繫了我的駕駛執照和保險，他們說他們能做的不多。<p>我問HN的問題是，這個騙子現在有我的自拍+身份證+車輛登記證+地址，對我來說有什麼風險？知道加密貨幣網站使用這個進行驗證，騙子是否可以用我的名字創建一堆加密貨幣交易所賬戶，並開始清洗骯髒的加密貨幣？ 或者用我的名字進行加密貨幣/普通貸款？我可以做什麼來保護我自己的未來？\n"
}