{
  "@type": "NewsArticle",
  "identifier": "2022--07--13--en--askhn--HackerNews--NewsArticle--32085840",
  "url": "https://news.ycombinator.com/item?id=32085840",
  "headline": "Ask HN: How do you store photos and videos?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm curious how others store their photos. Right now:<p>- I use Arq to back up to an AWS Glacier instance\n- I use CarbonCopyCloner to clone to two external drives\n- I also back up to Shutterfly... though Shutterfly just shut down their desktop uploader so now I need a new solution<p>Problems:<p>0. I'm using a ton of local HD space to store them. I want to free up a bunch of space.<p>1. If I delete photos from my computer, Arq will eventually delete the backups that contained them. Could be months or years but if they're not local, they'll be gone when the cost to store them exceeds the monthly budget I've set with Arq.<p>I think this is what a good storage situation looks like:<p>1. Photos are retained forever in the cloud even if they're deleted from my devices. I have to go to cloud storage to explicitly delete something.  Deleting something accidentally should never ever happen.<p>2. Photos and videos are automatically backed up to the cloud from my iphone and desktop<p>3. The UI for browsing cloud photos is fast and nice<p>4. I don't want to use a company with a poor history of user privacy e.g. Google/Amazon/FB.  I'm happy to pay for the service.<p>5. Bonus if my wife can connect her phone to the same cloud account as mine<p>6. Very nice to have: photos are encrypted locally before getting sent to the cloud like with Arq.<p>What do you use? Have you solved any of the problems I've laid out above?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kareemm",
    "url": "https://news.ycombinator.com/user?id=kareemm"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32085840",
  "sameAs": "https://news.ycombinator.com/item?id=32085840",
  "dateCreated": "2022-07-13T17:42:07.133Z",
  "datePublished": "2022-07-13T17:23:07.000Z",
  "dateModified": "2022-07-13T17:42:07.133Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何存储照片和视频？\n",
  "headline_zh-Hant": "Ask HN: 你如何存儲照片和視頻？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我很好奇其他人是如何存储他们的照片的。现在：<p>- 我使用Arq备份到AWS的Glacier实例。\n- 我使用CarbonCopyCloner来克隆到两个外部驱动器上\n- 我还备份到Shutterfly......尽管Shutterfly刚刚关闭了他们的桌面上传程序，所以现在我需要一个新的解决方案<p>问题：<p>0.我正在使用大量的本地硬盘空间来存储它们。我想释放出大量的空间。<p>1. 如果我从我的电脑上删除照片，Arq最终会删除包含这些照片的备份。可能是几个月或几年，但如果它们不是本地的，当存储它们的成本超过我与Arq设定的每月预算时，它们就会消失。<p>我认为这就是一个好的存储情况的样子：<p>1. 即使照片从我的设备上被删除，也会永远保留在云中。我必须到云存储中去明确地删除一些东西。 <p>2.照片和视频会自动从我的iPhone和桌面上备份到云端<p>3.浏览云端照片的用户界面快速而漂亮<p>4.我不想使用一个在用户隐私方面有不良记录的公司，例如谷歌/亚马逊/FB。 我很乐意为这项服务付费。<p>5. 如果我的妻子能把她的手机和我的手机连接到同一个云账户，那就更好了<p>6.非常好的一点是：照片在被发送到云端之前，会像Arq一样在本地进行加密。你是否解决了我上面提出的任何问题？\n",
  "description_zh-Hant": "我很好奇其他人是如何存儲他們的照片的。現在：<p>- 我使用Arq備份到AWS的Glacier實例。\n- 我使用CarbonCopyCloner來克隆到兩個外部驅動器上\n- 我還備份到Shutterfly......儘管Shutterfly剛剛關閉了他們的桌面上傳程序，所以現在我需要一個新的解決方案<p>問題：<p>0.我正在使用大量的本地硬盤空間來存儲它們。我想釋放出大量的空間。<p>1. 如果我從我的電腦上刪除照片，Arq最終會刪除包含這些照片的備份。可能是幾個月或幾年，但如果它們不是本地的，當存儲它們的成本超過我與Arq設定的每月預算時，它們就會消失。<p>我認為這就是一個好的存儲情況的樣子：<p>1. 即使照片從我的設備上被刪除，也會永遠保留在雲中。我必須到雲存儲中去明確地刪除一些東西。 <p>2.照片和視頻會自動從我的iPhone和桌面上備份到雲端<p>3.瀏覽雲端照片的用戶界面快速而漂亮<p>4.我不想使用一個在用戶隱私方面有不良記錄的公司，例如谷歌/亞馬遜/FB。 我很樂意為這項服務付費。<p>5. 如果我的妻子能把她的手機和我的手機連接到同一個雲賬戶，那就更好了<p>6.非常好的一點是：照片在被髮送到雲端之前，會像Arq一樣在本地進行加密。你是否解決了我上面提出的任何問題？\n"
}