{
  "@type": "NewsArticle",
  "identifier": "2022--04--27--en--askhn--HackerNews--NewsArticle--31177331",
  "url": "https://news.ycombinator.com/item?id=31177331",
  "headline": "Ask HN: Is blockchain tech already everything we need it to be?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "A recent post asked a question similar to 'Am I going insane or is there no value in blockchain tech'. I have been thinking more about the idea that perhaps blockchain tech has reached maturity, and that we are instead waiting on the remainder of 'Web3' to mature.<p>I may be oversimplifying, but if I look at Web3 as the existing internet, but without central intermediaries; then most applications can be built this way today. If we want a Clubhouse, or Zoom clone, these could be built atop existing WebRTC infrastructure. A Whatsapp clone can be built atop libp2p messaging (again I oversimplify). From the internet infrastructure view, the part that was missing has always been mechanisms of identity, ownership, and payment (trust mechanics in general). Today, blockchains handle these in a variety of formats, such that a project can just pick the chain that fits best with the application architecture. In 'Web 2.0', if I want auth, payments, file storage, etc - I would simply stitch together one or more infrastructure providers such as AWS. This feels very natural today.<p>Is it possible that blockchain has already reached maturity for the value it brings to the decentralized web? Are there any popular applications today that could not be built peer-2-peer in this context?<p>The big gap I still see in this view is who pays for services that are free in Web 2.0 (such as Facebook). But even in this case, blockchains provide a variety of incentive mechanics where increasing usage could appreciate a digital token, which in turn gives incentive for people to run the underlying infrastructures.<p>I also feel crazy in that there seems to be consensus that blockchain is suppose to do everything, or should be doing more than it does. In all of this, I am viewing the problem space from the domain of infrastructure, agnostic of application. Is blockchain tech already everything we need it to be?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "telecomsteve",
    "url": "https://news.ycombinator.com/user?id=telecomsteve"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31177331",
  "sameAs": "https://news.ycombinator.com/item?id=31177331",
  "dateCreated": "2022-04-27T07:43:16.989Z",
  "datePublished": "2022-04-27T07:36:31.000Z",
  "dateModified": "2022-04-27T07:43:16.989Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 区块链技术已经是我们需要的一切了吗？",
  "headline_zh-Hant": "Ask HN: 區塊鏈技術已經是我們需要的一切了嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "最近有一个帖子问了一个类似于'我是不是要疯了，还是区块链技术没有价值'的问题。我一直在思考这样一个问题：也许区块链技术已经成熟，而我们正在等待'Web3'的剩余部分成熟。<p>我可能过于简化了，但如果我把Web3看成是现有的互联网，但没有中央中介机构；那么大多数应用程序今天可以以这种方式构建。如果我们想要一个Clubhouse或Zoom的克隆，这些都可以建立在现有的WebRTC基础设施之上。Whatsapp的克隆可以建立在libp2p的信息传递之上（我又一次过度简化了）。从互联网基础设施来看，缺少的部分一直是身份、所有权和支付机制（一般的信任机制）。今天，区块链以各种形式处理这些问题，这样，一个项目就可以选择最适合应用架构的链。在'Web 2.0'中，如果我想要认证、支付、文件存储等--我会简单地将一个或多个基础设施供应商（如AWS）拼接起来。<p>区块链给去中心化网络带来的价值是否已经达到成熟？今天是否有任何流行的应用程序不能在这种情况下建立点对点？<p>在这种观点中，我仍然看到的最大差距是谁为Web 2.0中的免费服务付费（如Facebook）。但即使在这种情况下，区块链也提供了各种激励机制，不断增加的使用量可以使数字代币升值，这反过来又激励人们运行底层基础设施。<p>我也觉得很疯狂，因为人们似乎一致认为区块链应该做所有事情，或者应该比它做得更多。在所有这些方面，我都是从基础设施领域来看待问题空间的，与应用无关。区块链技术已经是我们需要的一切吗？",
  "description_zh-Hant": "最近有一個帖子問了一個類似於'我是不是要瘋了，還是區塊鏈技術沒有價值'的問題。我一直在思考這樣一個問題：也許區塊鏈技術已經成熟，而我們正在等待'Web3'的剩餘部分成熟。<p>我可能過於簡化了，但如果我把Web3看成是現有的互聯網，但沒有中央中介機構；那麼大多數應用程序今天可以以這種方式構建。如果我們想要一個Clubhouse或Zoom的克隆，這些都可以建立在現有的WebRTC基礎設施之上。Whatsapp的克隆可以建立在libp2p的信息傳遞之上（我又一次過度簡化了）。從互聯網基礎設施來看，缺少的部分一直是身份、所有權和支付機制（一般的信任機制）。今天，區塊鏈以各種形式處理這些問題，這樣，一個項目就可以選擇最適合應用架構的鏈。在'Web 2.0'中，如果我想要認證、支付、文件存儲等--我會簡單地將一個或多個基礎設施供應商（如AWS）拼接起來。<p>區塊鏈給去中心化網絡帶來的價值是否已經達到成熟？今天是否有任何流行的應用程序不能在這種情況下建立點對點？<p>在這種觀點中，我仍然看到的最大差距是誰為Web 2.0中的免費服務付費（如Facebook）。但即使在這種情況下，區塊鏈也提供了各種激勵機制，不斷增加的使用量可以使數字代幣升值，這反過來又激勵人們運行底層基礎設施。<p>我也覺得很瘋狂，因為人們似乎一致認為區塊鏈應該做所有事情，或者應該比它做得更多。在所有這些方面，我都是從基礎設施領域來看待問題空間的，與應用無關。區塊鏈技術已經是我們需要的一切嗎？"
}