{
  "@type": "NewsArticle",
  "identifier": "2022--07--01--en--askhn--HackerNews--NewsArticle--31950825",
  "url": "https://news.ycombinator.com/item?id=31950825",
  "headline": "Ask HN: Data for Downturns?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The sky is falling. Every Twitter thread, every message from investors, every conversation around San Francisco (our HQ) seems the same — alert everyone to the reality that the exuberance of 2021 is over.  There is no one-size-fits-all advice.  I'm the co-founder of Mozart Data, a twenty person data infrastructure SaaS company that has recently raised a Series A.<p>Y Combinator, our incubator, told us that the safe move is to set a goal to be “Default Alive.” Namely, if we continue at the current growth, we technically wouldn’t need to fundraise again. If the market heats up, we can always invest more in growth. David Sacks of Craft Ventures, who led our Series A, argues that companies need to be “Default Investable” and they provided a definition, which is a slightly relaxed version of Default Alive. A Default Investable company is excellent on a variety of classic metrics and would be able to remain alive as a result of funding (though it’s also a high bar, not quite as difficult for an early stage company as Default Alive).<p>Regardless, the message is — get better. It sort of reminds me of my constant efforts to lose weight — it’s important to have a scale, and Craft does a useful thing of providing a scale. I’d also like a playbook where one doesn’t exist beyond eat less (spend less), exercise more (grow efficiently) because it’s very segment dependent.<p>I’ll focus on lucky companies like ours that have runway. YC’s advice is that “If you are post Series A and pre-product market fit, don’t expect another round to happen at all until you have obviously hit product market fit.” So then we need to get to product market fit. Typically this means engineering spend &gt; GTM spend (sales + marketing). By shrinking the growth of your GTM team, you grow less quickly than modeled but more efficiently (the strongest leads are spread like peanut butter over fewer GTM heads and the highest performers are more efficient). If your GTM team is not acquiring revenue extremely efficiently due to a change in market conditions (harder to sell in tough times), investing in experimenting on unproven growth approaches, or past standards due to exuberance (with incredibly high multiples, even inefficient growth could be justified in company building).<p>Hypothesize, build, test and learn, iterate. The best way to do this is to have a technical team capable of rapid iteration. A best practice is not to do these steps in a vacuum, talk to customers and prospects (and this is where a sufficient GTM team is necessary —think of them as the best user research). Make something people want.<p>What is true today that wasn’t 6 months ago. Nothing. Turning back time, you could advocate for a similar disciplined growth strategy. Get product market fit, then scale efficiently, then extend that scaling. Alternatively a lot of “successful” companies played the game of increasing valuation on inefficient growth; this is a bit like a game of musical chairs that can end well if your timing is impeccable but often does not. My belief is that the likelihood of landing in one of the magical chairs, where efficiency doesn’t matter, is now miniscule.<p>Summing up all of this advice, we’re abandoning some of our loftiest (short-term) growth goals in favor of efficiency and communicating that with our board. We plan to exclusively hire in ProdDataEng. We’ll squirrel the rest of the modeled money into a longer runway and hope to deploy it at a more opportunistic time (either from a hiring or sales motion standpoint).<p>We’re not going into hiding, but we are exclusively investing into building (and we’ll reassess growth goals frequently). Beyond layoffs what are other companies doing to weather the storm? What metrics are you tracking to know if the new course is working? When do you want to be greedy when others are fearful?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pfduke02",
    "url": "https://news.ycombinator.com/user?id=pfduke02"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31950825",
  "sameAs": "https://news.ycombinator.com/item?id=31950825",
  "dateCreated": "2022-07-01T18:58:04.289Z",
  "datePublished": "2022-07-01T18:37:52.000Z",
  "dateModified": "2022-07-01T18:58:04.289Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 下滑期的数据？\n",
  "headline_zh-Hant": "Ask HN: 下滑期的數據？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1
    }
  ]
}