{
  "@type": "NewsArticle",
  "identifier": "2022--07--07--en--askhn--HackerNews--NewsArticle--32010440",
  "url": "https://news.ycombinator.com/item?id=32010440",
  "headline": "Ask HN: What is the scope of a staff+ engineer role for you?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I’ve been mulling over this one for months now so I thought I’d try and tap into the HN hive-mind.<p>I’m a senior backend SWE at Wolt (so not FAANG-size but sizeable, I think our product team consists of about 600 peeps though the figure increased dramatically since I joined 14mos ago) and I’m slowly moving to a staff-engineer role cause after 8yrs in the industry it felt like it was time to transition to a more abstract role and new set of challenges.<p>As staff+ roles (borrowing terminology from the StaffEng book [0]) are generally ill-defined in our industry and heavily dependent on the org, part of the process requires that I compose a list of what I perceive or would want my responsibilities to be in this new role as a preliminary setting of expectations.<p>I’ve read the book [0] and listened to the podcast [1] and been ruminating about this topic for a few months now but I worry that any definition I compile will be heavily biased by my experience thus far and not account for the nuances and changes that come with the transition.<p>So this is a question to the SWE peeps in the crowd that have already made or are in the process of making the transition to technical leadership. What do you see your responsibilities as a staff+ engineer being? What do you consider the right ratios between coding, mentoring/coaching/sponsoring, establishing best-practices, liaising between teams, translating strategy to engineering initiatives, etc, to be? What do you wish you had considered/known before making the transition?<p>[0]: https://staffeng.com/book\n[1]: https://podcast.staffeng.com/",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "somada141",
    "url": "https://news.ycombinator.com/user?id=somada141"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32010440",
  "sameAs": "https://news.ycombinator.com/item?id=32010440",
  "dateCreated": "2022-07-07T06:33:39.069Z",
  "datePublished": "2022-07-07T06:03:10.000Z",
  "dateModified": "2022-07-07T06:33:39.069Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 对你来说，员工+工程师的角色范围是什么？\n",
  "headline_zh-Hant": "Ask HN: 對你來說，員工+工程師的角色範圍是什麼？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>我是Wolt公司的一名高级后台SWE（虽然不是FAANG公司的规模，但也是相当大的，我想我们的产品团队由大约600人组成，不过自从我在14年前加入后，这个数字急剧增加），我正在慢慢转向员工工程师的角色，因为在这个行业工作了8年后，我觉得是时候过渡到一个更抽象的角色和一系列新的挑战。 <p>由于工作人员+角色（借用StaffEng书中的术语[0]）在我们的行业中通常定义不清，而且严重依赖于组织，因此，这个过程的一部分要求我编制一份清单，列出我认为或希望我在这个新角色中的职责，作为初步的期望设置。 <p>我读过书[0]，听过播客[1]，几个月来一直在思考这个问题，但我担心我编制的任何定义都会严重偏向于我迄今为止的经验，而没有考虑到转型过程中的细微差别和变化。<p>因此，这是向人群中已经或正在向技术领导转型的SWE小伙伴们提出的问题。你认为你作为一名员工+工程师的责任是什么？你认为编码、指导/辅导/赞助、建立最佳实践、团队之间的联络、将战略转化为工程倡议等之间的正确比例是什么？你希望你在转型前考虑过/知道过什么？<p>[0]: https://staffeng.com/book\n[1]: https://podcast.staffeng.com/\n",
  "description_zh-Hant": "<p>我是Wolt公司的一名高級後臺SWE（雖然不是FAANG公司的規模，但也是相當大的，我想我們的產品團隊由大約600人組成，不過自從我在14年前加入後，這個數字急劇增加），我正在慢慢轉向員工工程師的角色，因為在這個行業工作了8年後，我覺得是時候過渡到一個更抽象的角色和一系列新的挑戰。 <p>由於工作人員+角色（借用StaffEng書中的術語[0]）在我們的行業中通常定義不清，而且嚴重依賴於組織，因此，這個過程的一部分要求我編制一份清單，列出我認為或希望我在這個新角色中的職責，作為初步的期望設置。 <p>我讀過書[0]，聽過播客[1]，幾個月來一直在思考這個問題，但我擔心我編制的任何定義都會嚴重偏向於我迄今為止的經驗，而沒有考慮到轉型過程中的細微差別和變化。<p>因此，這是向人群中已經或正在向技術領導轉型的SWE小夥伴們提出的問題。你認為你作為一名員工+工程師的責任是什麼？你認為編碼、指導/輔導/贊助、建立最佳實踐、團隊之間的聯絡、將戰略轉化為工程倡議等之間的正確比例是什麼？你希望你在轉型前考慮過/知道過什麼？<p>[0]: https://staffeng.com/book\n[1]: https://podcast.staffeng.com/\n"
}