{
  "@type": "NewsArticle",
  "identifier": "2022--06--27--en--askhn--HackerNews--NewsArticle--31890206",
  "url": "https://news.ycombinator.com/item?id=31890206",
  "headline": "Ask HN: Who is coordinating a plan to make small towns hipster?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Doesn't it seem fairly possible for a large company, or a DAO for that matter, to establish a foothold in a small town somewhere in a small state and create massive incentives for hipster coastals to move there?<p>Think of Marfa, TX, or Los Alamos, CA, or to take an older one, Yountville, CA.<p>It seems both potentially HUGELY profitable and politically meaningful to make it palatable for young coastal workers to congregate in a small town and revitalize it with urban tastes.<p>Things going for this strategy:<p>1. Work from anywhere policies not likely going anywhere.<p>2. Young families likely want more space, and many of these rural states have it in spades. What's lacking is schooling, housing and entertainment, and much of this could likely be developed.<p>3. Small, rural towns have cheap real estate because of lack of opportunity. AL and WV are dirt cheap compared to the coasts, but if you’re honest with yourself, you probably haven’t bought there because there’s nothing enticing about it. No jobs, nowhere great to eat, nothing really to do. The land itself could be gorgeous, magestic even -- there's very little difference between the landscape in Hudson Valley and the landscape in Appalachia. You just don't want to be the first or only coastal elite to settle there (neither do I, and I grew up in rural GA).<p>4. Creatives love to congregate. If you could seed the town with hipster chefs, maybe a graphic designer-focused coworking facility, etc, then you'd have a good start. I’m thinking of how Richard Branson had that mansion in the English countryside where musicians preferred to record because they could spread out. Or how Francis Mallman has his isolated island where young, ambitious chefs apprentice under him to learn hyper-local cooking. If you had that initial draw, you could entice more builders who create restaurants, coffee houses, galleries and music venues. Money follows hipsters. Folks from places like LA, SF, NYC would LOVE the idea of spreading out. My guess is they'd swarm the open houses if you show them modern pre-fabs on 1+ acres with total privacy and a Blue Bottle and 10/10 preschool down the street for under $1000/sf.<p>5. First movers would stand to profit the most here. But you'd need a lot of capital and sufficient influence to bring a lot of people with you. If you had those, you could literally buy a few hundred acres around a town and then start to parcel it out to folks as they arrive. Massive profit incentive. I’m oversimplifying just about everything here, but this does seem like a good fit for a DAO…<p>My personal read, as an LA resident, is that a lot of young families would LOVE for this to happen. Leaving politics aside, what keeps most people I know from moving to, say, Montana is &quot;what kind of schools are there&quot; and “won’t we get bored after a few months?”<p>People live in cities for other people, for the entertainment, the restaurants, the vibe. But a lot of that can be developed. And some small towns have it despite not being big. Austin in the 90s, for example.<p>And, again, leaving the politics aside, this seems like a win-win — small towns don’t want to be left behind, but there also don’t seem to be a lot of developers stepping in and trying to give them a shot at the modern economy.<p>I would love to know who is doing this in small town America. Not just rebuilding or developing a slightly-less-shitty strip mall, but doing it with a deliberate strategy of making the town the next “it” destination for young families in America.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "wallacrw",
    "url": "https://news.ycombinator.com/user?id=wallacrw"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31890206",
  "sameAs": "https://news.ycombinator.com/item?id=31890206",
  "dateCreated": "2022-06-27T10:00:12.409Z",
  "datePublished": "2022-06-27T03:11:17.000Z",
  "dateModified": "2022-06-27T10:00:12.409Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 10
    }
  ],
  "headline_zh-Hans": "Ask HN: 谁在协调一项计划，使小城镇变得时髦？\n",
  "headline_zh-Hant": "Ask HN: 誰在協調一項計劃，使小城鎮變得時髦？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "对于一家大公司，或一个DAO来说，在一个小州的某个小镇上建立一个立足点，并为时髦的沿海人搬到那里创造大量的激励措施，这难道不是相当有可能的吗？<p>想想德克萨斯州的玛法，或加利福尼亚州的洛斯阿拉莫斯，或拿一个较老的例子来说，加利福尼亚州的扬特维尔。 <p>让年轻的沿海工人聚集在一个小镇上，并以城市的口味来振兴它，这似乎既具有潜在的巨大利润，又具有政治意义。年轻的家庭可能需要更多的空间，而这些农村地区的许多州都有足够的空间。缺乏的是学校教育、住房和娱乐，而这些都有可能被开发出来。<p>3.由于缺乏机会，农村小城镇的房地产很便宜。与沿海地区相比，亚利桑那州和西弗吉尼亚州的房地产很便宜，但如果你对自己诚实的话，你可能还没有在那里买房，因为那里没有什么诱人的地方。没有工作，没有地方可以吃，没有真正的事情可做。土地本身可能是华丽的，甚至是神奇的 -- 哈德逊谷的景观和阿巴拉契亚的景观之间没有什么区别。你只是不想成为第一个或唯一一个在那里定居的沿海精英（我也不想，我是在佐治亚州的农村长大的）。如果你能在镇上种上一些时髦的厨师，也许还有一个以平面设计师为中心的协同工作设施，等等，那么你就有了一个好的开始。我在想，理查德-布兰森在英国乡村有一座豪宅，音乐家们喜欢在那里录音，因为他们可以分散开来。或者弗朗西斯-马尔曼有一个与世隔绝的小岛，年轻的、有抱负的厨师在那里做学徒，学习超本地的烹饪。如果你有这种最初的吸引力，你可以吸引更多的建设者，他们创建餐馆、咖啡馆、画廊和音乐场所。钱是跟着潮人走的。来自洛杉矶、三藩市、纽约市等地的人们会喜欢这种分散的想法。我猜想，如果你向他们展示1英亩以上的现代预制房屋，并且有完全的隐私，街边有蓝瓶和10/10的学前班，价格低于1000美元/平方英尺，他们就会蜂拥而至的开放房屋。第一个搬家的人在这里将获得最大的利益。但你需要大量的资金和足够的影响力，以使许多人与你一起。如果你有这些条件，你可以在一个镇子周围买下几百英亩的土地，然后在人们到达时开始将其分发给他们。大规模的利润激励。我把所有的事情都过于简单化了，但这似乎很适合DAO......<p>作为一个洛杉矶居民，我个人的看法是，很多年轻的家庭都很希望发生这种情况。抛开政治不谈，我认识的大多数人不愿意搬到蒙大拿州的原因是，那里有什么样的学校，以及 \"几个月后我们不会感到无聊吗？\"<p>人们在城市生活是为了其他人，为了娱乐、餐馆和氛围。但很多东西是可以发展的。而一些小城镇尽管不大，但也有这样的特点。例如，90年代的奥斯汀。<p>而且，再次撇开政治不谈，这似乎是一个双赢--小城镇不想被抛在后面，但似乎也没有很多开发商介入并试图给他们一个现代经济的机会。不仅仅是重建或开发一个稍微不那么糟糕的带状购物中心，而是带着一种刻意的战略，使该镇成为美国年轻家庭的下一个 \"它 \"的目的地。\n",
  "description_zh-Hant": "對於一家大公司，或一個DAO來說，在一個小州的某個小鎮上建立一個立足點，併為時髦的沿海人搬到那裡創造大量的激勵措施，這難道不是相當有可能的嗎？<p>想想德克薩斯州的瑪法，或加利福尼亞州的洛斯阿拉莫斯，或拿一個較老的例子來說，加利福尼亞州的揚特維爾。 <p>讓年輕的沿海工人聚集在一個小鎮上，並以城市的口味來振興它，這似乎既具有潛在的巨大利潤，又具有政治意義。年輕的家庭可能需要更多的空間，而這些農村地區的許多州都有足夠的空間。缺乏的是學校教育、住房和娛樂，而這些都有可能被開發出來。<p>3.由於缺乏機會，農村小城鎮的房地產很便宜。與沿海地區相比，亞利桑那州和西弗吉尼亞州的房地產很便宜，但如果你對自己誠實的話，你可能還沒有在那裡買房，因為那裡沒有什麼誘人的地方。沒有工作，沒有地方可以吃，沒有真正的事情可做。土地本身可能是華麗的，甚至是神奇的 -- 哈德遜谷的景觀和阿巴拉契亞的景觀之間沒有什麼區別。你只是不想成為第一個或唯一一個在那裡定居的沿海精英（我也不想，我是在佐治亞州的農村長大的）。如果你能在鎮上種上一些時髦的廚師，也許還有一個以平面設計師為中心的協同工作設施，等等，那麼你就有了一個好的開始。我在想，理查德-布蘭森在英國鄉村有一座豪宅，音樂家們喜歡在那裡錄音，因為他們可以分散開來。或者弗朗西斯-馬爾曼有一個與世隔絕的小島，年輕的、有抱負的廚師在那裡做學徒，學習超本地的烹飪。如果你有這種最初的吸引力，你可以吸引更多的建設者，他們創建餐館、咖啡館、畫廊和音樂場所。錢是跟著潮人走的。來自洛杉磯、三藩市、紐約市等地的人們會喜歡這種分散的想法。我猜想，如果你向他們展示1英畝以上的現代預製房屋，並且有完全的隱私，街邊有藍瓶和10/10的學前班，價格低於1000美元/平方英尺，他們就會蜂擁而至的開放房屋。第一個搬家的人在這裡將獲得最大的利益。但你需要大量的資金和足夠的影響力，以使許多人與你一起。如果你有這些條件，你可以在一個鎮子周圍買下幾百英畝的土地，然後在人們到達時開始將其分發給他們。大規模的利潤激勵。我把所有的事情都過於簡單化了，但這似乎很適合DAO......<p>作為一個洛杉磯居民，我個人的看法是，很多年輕的家庭都很希望發生這種情況。拋開政治不談，我認識的大多數人不願意搬到蒙大拿州的原因是，那裡有什麼樣的學校，以及 \"幾個月後我們不會感到無聊嗎？\"<p>人們在城市生活是為了其他人，為了娛樂、餐館和氛圍。但很多東西是可以發展的。而一些小城鎮儘管不大，但也有這樣的特點。例如，90年代的奧斯汀。<p>而且，再次撇開政治不談，這似乎是一個雙贏--小城鎮不想被拋在後面，但似乎也沒有很多開發商介入並試圖給他們一個現代經濟的機會。不僅僅是重建或開發一個稍微不那麼糟糕的帶狀購物中心，而是帶著一種刻意的戰略，使該鎮成為美國年輕家庭的下一個 \"它 \"的目的地。\n"
}