{
  "@type": "NewsArticle",
  "identifier": "2022--07--13--en--askhn--HackerNews--NewsArticle--32080762",
  "url": "https://news.ycombinator.com/item?id=32080762",
  "headline": "Ask HN: Encouraging generic drug makers to produce off-patent rare-disease drugs",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN,<p>There is a medication for a rare disease, which typically costs more than 6 figures, that I know is having its patent expiring soon.<p>I would love for generic drug makers (ones in India for example) to come in and start making the drug for cheaper so it is more affordable for families.<p>However, because it is a rare disease, I don't know if a drug maker would normally be incentivized to do this. But given the sky high costs of the drug pre patent expiration, I think there might be enough demand there for makers to make decent profit.<p>Say I wanted to give them a nudge, or maybe I get some people who I know are ready to pay for it if they make them, showing to the generic makers the demand is there. Does anyone know how I should go about this or if it's possible? Aside from the obvious, e.g. start emailing around and asking the manufacturers, does anyone have experience with this and know what to look out for?<p>And also I'm aware that regulations and things are a whole different issue but I'm currently just asking around hypothetically.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ackbar03",
    "url": "https://news.ycombinator.com/user?id=ackbar03"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32080762",
  "sameAs": "https://news.ycombinator.com/item?id=32080762",
  "dateCreated": "2022-07-13T10:33:28.440Z",
  "datePublished": "2022-07-13T10:15:52.000Z",
  "dateModified": "2022-07-13T10:33:28.440Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 鼓励非专利药生产商生产已获专利的罕见疾病药物\n",
  "headline_zh-Hant": "Ask HN: 鼓勵非專利藥生產商生產已獲專利的罕見疾病藥物\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，<p>有一种治疗罕见疾病的药物，其价格通常超过6位数，我知道它的专利即将到期。<p>我希望非专利药物制造商（例如印度的制造商）能够进来，并开始以更低的价格制造这种药物，使家庭能够负担得起。<p>然而，由于它是一种罕见疾病，我不知道药物制造商通常是否会被激励这样做。但是，考虑到专利到期前药物的天价，我认为那里可能有足够的需求，制造商可以赚取体面的利润。<p>假设我想给他们一个提示，或者我得到一些我知道准备支付的人，如果他们制造这些药物，向仿制药制造商展示需求是存在的。有谁知道我应该如何去做，或者是否有可能？除了显而易见的，例如开始发电子邮件并询问制造商之外，有没有人有这方面的经验，并知道要注意什么？<p>我也知道法规和事情是一个完全不同的问题，但我目前只是假设性地询问。\n",
  "description_zh-Hant": "嗨，HN，<p>有一種治療罕見疾病的藥物，其價格通常超過6位數，我知道它的專利即將到期。<p>我希望非專利藥物製造商（例如印度的製造商）能夠進來，並開始以更低的價格製造這種藥物，使家庭能夠負擔得起。<p>然而，由於它是一種罕見疾病，我不知道藥物製造商通常是否會被激勵這樣做。但是，考慮到專利到期前藥物的天價，我認為那裡可能有足夠的需求，製造商可以賺取體面的利潤。<p>假設我想給他們一個提示，或者我得到一些我知道準備支付的人，如果他們製造這些藥物，向仿製藥製造商展示需求是存在的。有誰知道我應該如何去做，或者是否有可能？除了顯而易見的，例如開始發電子郵件並詢問製造商之外，有沒有人有這方面的經驗，並知道要注意什麼？<p>我也知道法規和事情是一個完全不同的問題，但我目前只是假設性地詢問。\n"
}