{
  "@type": "NewsArticle",
  "identifier": "2022--06--16--en--askhn--HackerNews--NewsArticle--31763451",
  "url": "https://news.ycombinator.com/item?id=31763451",
  "headline": "Ask HN: Is it still conceivable to remain an anonymous developer nowadays?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "HN has been my morning coffee favourite read for years now but it's my very first post. I'm an old man, so please bare with me.<p>I am a seasoned systems architect and developer, now retired. While I was tempted in the first few weeks of my retirement to just turn the page and let it go, I remembered how much I used to enjoy writing small utilities for my own daily workflows. A year ago, I asked my fellow forum members (a Mac-dedicated one) if they would like to beta test some of my applications (and oh, they did). I got high quality feedback I would not have gotten elsewhere. I kept striving to answer their feature requests and today many of my first beta testers are insisting that my applications have outgrown the private beta.<p>I was caught completely off guard by FinderFix (https://synappser.github.io/apps/finderfix/), the first application I'm opening to public beta, making the top row on Reddit a couple of weeks ago. This sudden limelight is both an opportunity and a challenge.<p>I am not complaining. Any publicity is good publicity and I got this kind of genuine enthusiastic feedback: &quot;OH MY GOD! Bro you’re a god sent. Thanks man I love this app. Also that Cmd + X for cut/paste. Oof so good!&quot;.<p>I however cherish anonymity and I laud the Internet for allowing me to enforce it. I am thus publishing my software under a pseudonym (a pen name, if you prefer) with a free Apple Developer Certificate. How long will I be able, with Apple's current Gatekeeper policy, to preserve my anonymity if I were to turn this hobby into a real business, albeit a small one?<p>For more context, please refer to a couple posts of mine (a manifesto of my core ethos):<p>http://synappser.github.io/blog/<p>I guess this is a tough question to answer, unless you're an Apple insider, but I'd really appreciate any guidance you could give me.<p>Thank you",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "synappser",
    "url": "https://news.ycombinator.com/user?id=synappser"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31763451",
  "sameAs": "https://news.ycombinator.com/item?id=31763451",
  "dateCreated": "2022-06-16T07:48:08.962Z",
  "datePublished": "2022-06-16T07:40:52.000Z",
  "dateModified": "2022-06-16T07:48:08.962Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如今，保持匿名开发者的身份仍然是可以想象的吗？\n",
  "headline_zh-Hant": "Ask HN: 如今，保持匿名開發者的身份仍然是可以想象的嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "多年来，HN一直是我早上喝咖啡时最喜欢的读物，但这是我的第一篇文章。我是一个老人，所以请原谅我。<p>我是一个经验丰富的系统架构师和开发人员，现在退休了。在我退休的前几周，我很想翻过这一页，让它过去，但我想起了我曾经多么喜欢为自己的日常工作流程编写小型实用程序。一年前，我问我的论坛成员（一个Mac专用的论坛），他们是否愿意测试我的一些应用程序（哦，他们做到了）。我得到了在其他地方无法得到的高质量的反馈。我一直在努力满足他们的功能要求，今天我的许多首批测试者都坚持认为我的应用程序已经超越了私人测试版。<p>几周前，我开放给公众测试的第一个应用程序FinderFix（https://synappser.github.io/apps/finderfix/）登上了Reddit的首页，这让我完全措手不及。这突如其来的风头既是一个机会，也是一个挑战。<p>我并不抱怨。任何宣传都是好的宣传，我得到了这种真诚热情的反馈：&quot;OH MY GOD! 兄弟，你是上帝派来的。谢谢你，我喜欢这个应用程序。还有那个Cmd+X的剪切/粘贴。<p>然而，我珍视匿名性，我赞扬互联网允许我执行它。因此，我以一个假名（如果你愿意，可以用笔名）发布我的软件，并获得免费的苹果开发者证书。在苹果目前的 \"守门员 \"政策下，如果我把这个爱好变成一个真正的生意，尽管是一个小生意，我还能保留多久？<p>关于更多的背景，请参考我的几个帖子（我的核心精神的宣言）：<p>http://synappser.github.io/blog/<p>我想这是一个很难回答的问题，除非你是一个苹果内部人士，但我真的很感谢你能给我任何指导。<p>谢谢你\n",
  "description_zh-Hant": "多年來，HN一直是我早上喝咖啡時最喜歡的讀物，但這是我的第一篇文章。我是一個老人，所以請原諒我。<p>我是一個經驗豐富的系統架構師和開發人員，現在退休了。在我退休的前幾周，我很想翻過這一頁，讓它過去，但我想起了我曾經多麼喜歡為自己的日常工作流程編寫小型實用程序。一年前，我問我的論壇成員（一個Mac專用的論壇），他們是否願意測試我的一些應用程序（哦，他們做到了）。我得到了在其他地方無法得到的高質量的反饋。我一直在努力滿足他們的功能要求，今天我的許多首批測試者都堅持認為我的應用程序已經超越了私人測試版。<p>幾周前，我開放給公眾測試的第一個應用程序FinderFix（https://synappser.github.io/apps/finderfix/）登上了Reddit的首頁，這讓我完全措手不及。這突如其來的風頭既是一個機會，也是一個挑戰。<p>我並不抱怨。任何宣傳都是好的宣傳，我得到了這種真誠熱情的反饋：&quot;OH MY GOD! 兄弟，你是上帝派來的。謝謝你，我喜歡這個應用程序。還有那個Cmd+X的剪切/粘貼。<p>然而，我珍視匿名性，我讚揚互聯網允許我執行它。因此，我以一個假名（如果你願意，可以用筆名）發佈我的軟件，並獲得免費的蘋果開發者證書。在蘋果目前的 \"守門員 \"政策下，如果我把這個愛好變成一個真正的生意，儘管是一個小生意，我還能保留多久？<p>關於更多的背景，請參考我的幾個帖子（我的核心精神的宣言）：<p>http://synappser.github.io/blog/<p>我想這是一個很難回答的問題，除非你是一個蘋果內部人士，但我真的很感謝你能給我任何指導。<p>謝謝你\n"
}