{
  "@type": "NewsArticle",
  "identifier": "2022--08--01--en--askhn--HackerNews--NewsArticle--32311607",
  "url": "https://news.ycombinator.com/item?id=32311607",
  "headline": "Ask HN: Assuming any barrier could be overcome, what API do you wish existed?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Assuming ANY barrier could be overcome, I have a few ideas.<p>1. API for accessing apps in a smartphone:<p>I wish I could pull all the new messages from every walled garden chat app and view it in one place. I wish I could set a reminder to respond or follow up in every app. I wish I could have all my late night messages held and only sent in the morning. I could even have my phone automatically dial to different friends and family on a schedule.<p>2. API for confirming charges on physical credit cards:<p>I wish I could have it check code I wrote. I could have it only charge within a daily budget, at certain stores, at specific times, maybe even for specific items. I could hand out charity cards to those in need that only allow $100 a day for cell phone plans and fast food chains for instance. The bonus to this is fraud would go way down.<p>3. API for where people are physically gathered in a city:<p>Is this bar popular right? What will the wait be for the that restaurant next door? You could plan a whole day based on this. Even better if it breaks it all down by demographics. Is there an event in the park with people around my age?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jimhi",
    "url": "https://news.ycombinator.com/user?id=jimhi"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32311607",
  "sameAs": "https://news.ycombinator.com/item?id=32311607",
  "dateCreated": "2022-08-01T20:31:00.136Z",
  "datePublished": "2022-08-01T20:26:48.000Z",
  "dateModified": "2022-08-01T20:31:00.136Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 假设任何障碍都能被克服，你希望有什么API存在？\n",
  "headline_zh-Hant": "Ask HN: 假設任何障礙都能被克服，你希望有什麼API存在？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "假设可以克服任何障碍，我有几个想法。<p>1. 在智能手机中访问应用程序的API：<p>我希望我可以从每个围墙花园的聊天应用程序中提取所有的新消息，并在一个地方查看。我希望我可以在每个应用程序中设置回复或跟进的提醒。我希望我可以保留所有深夜的信息，只在早上发送。我甚至可以让我的手机按时间表自动拨号给不同的朋友和家人。<p>2.用于确认实体信用卡收费的API：<p>我希望我可以让它检查我写的代码。我可以让它只在每天的预算范围内，在特定的商店，在特定的时间，甚至为特定的项目收费。我可以向有需要的人发放慈善卡，例如，每天只允许在手机计划和快餐连锁店消费100美元。这样做的好处是欺诈行为会大大减少。<p>3.关于一个城市中人们实际聚集的地方的API：<p>这个酒吧很受欢迎吧？隔壁那家餐厅的等待时间会是多少？你可以在此基础上计划一整天。如果它能按人口统计学进行分类，那就更好了。公园里有与我年龄相仿的人的活动吗？\n",
  "description_zh-Hant": "假設可以克服任何障礙，我有幾個想法。<p>1. 在智能手機中訪問應用程序的API：<p>我希望我可以從每個圍牆花園的聊天應用程序中提取所有的新消息，並在一個地方查看。我希望我可以在每個應用程序中設置回覆或跟進的提醒。我希望我可以保留所有深夜的信息，只在早上發送。我甚至可以讓我的手機按時間表自動撥號給不同的朋友和家人。<p>2.用於確認實體信用卡收費的API：<p>我希望我可以讓它檢查我寫的代碼。我可以讓它只在每天的預算範圍內，在特定的商店，在特定的時間，甚至為特定的項目收費。我可以向有需要的人發放慈善卡，例如，每天只允許在手機計劃和快餐連鎖店消費100美元。這樣做的好處是欺詐行為會大大減少。<p>3.關於一個城市中人們實際聚集的地方的API：<p>這個酒吧很受歡迎吧？隔壁那家餐廳的等待時間會是多少？你可以在此基礎上計劃一整天。如果它能按人口統計學進行分類，那就更好了。公園裡有與我年齡相仿的人的活動嗎？\n"
}