{
  "@type": "NewsArticle",
  "identifier": "2022--07--28--en--askhn--HackerNews--NewsArticle--32262563",
  "url": "https://news.ycombinator.com/item?id=32262563",
  "headline": "Ask HN: As a dev manager, how do you deal with a prima donna?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm about to take over a small team of developers.  Over the past few days I've been sitting in on their daily standups and attending various project meetings, getting a feel for the group and the status of ongoing work.<p>It's become apparent to me that one of the developers is a prima donna.  He's been with the team for about a year, and during that time he's virtually rewritten every project he's worked on (because the old codebase was trash, of course), he resists learning anything about the other technologies in his projects' tech stacks, and his views on customer feature requests are utterly binary (&quot;easy&quot; or &quot;stupid&quot;).<p>The developer really is talented, for those technologies in his wheelhouse.  He is probably the best developer in that group and I can see why his current manager hired him.  However, the friction is ... considerable.<p>I've read many articles and blogs about handling prima donnas on a dev team.  Some of those were good, some less so.<p>HN, what is your experience?  Have you had success turning a dev like this around?  What did you do?  I would love to hear from non-managers as well:  How is it, working on a team with a prima donna?  Was it a problem, and was it resolved well?<p>Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "LordGrey",
    "url": "https://news.ycombinator.com/user?id=LordGrey"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32262563",
  "sameAs": "https://news.ycombinator.com/item?id=32262563",
  "dateCreated": "2022-07-28T10:32:52.796Z",
  "datePublished": "2022-07-28T10:24:32.000Z",
  "dateModified": "2022-07-28T10:32:52.796Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 作为一名开发经理，你是如何处理骁勇善战的人的？\n",
  "headline_zh-Hant": "Ask HN: 作為一名開發經理，你是如何處理驍勇善戰的人的？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我即将接管一个由开发人员组成的小团队。 在过去的几天里，我参加了他们的日常会议，并参加了各种项目会议，对这个团队和正在进行的工作状态有了一定的了解。 他已经在团队中工作了大约一年，在这段时间里，他几乎重写了他所工作的每一个项目（当然，因为旧的代码库是垃圾），他拒绝学习任何关于他的项目技术栈中的其他技术，而且他对客户功能要求的看法完全是二元的（&quot;容易&quot;或&quot;愚蠢&quot;）。<p>对于他所负责的那些技术，这位开发者确实很有天赋。 他可能是该组中最好的开发人员，我知道为什么他的现任经理会雇用他。 <p>我读过很多关于如何处理开发团队中原始人的文章和博客。 有些文章很好，有些则不然。<p>HN，你的经验是什么？ 你有没有成功地将这样的开发人员转过来？ 你是怎么做的？ 我也想听听非经理人的意见。 你在一个有 \"骁将 \"的团队中工作，感觉如何？ 这是否是一个问题，它是否得到了很好的解决？\n",
  "description_zh-Hant": "我即將接管一個由開發人員組成的小團隊。 在過去的幾天裡，我參加了他們的日常會議，並參加了各種項目會議，對這個團隊和正在進行的工作狀態有了一定的瞭解。 他已經在團隊中工作了大約一年，在這段時間裡，他幾乎重寫了他所工作的每一個項目（當然，因為舊的代碼庫是垃圾），他拒絕學習任何關於他的項目技術棧中的其他技術，而且他對客戶功能要求的看法完全是二元的（&quot;容易&quot;或&quot;愚蠢&quot;）。<p>對於他所負責的那些技術，這位開發者確實很有天賦。 他可能是該組中最好的開發人員，我知道為什麼他的現任經理會僱用他。 <p>我讀過很多關於如何處理開發團隊中原始人的文章和博客。 有些文章很好，有些則不然。<p>HN，你的經驗是什麼？ 你有沒有成功地將這樣的開發人員轉過來？ 你是怎麼做的？ 我也想聽聽非經理人的意見。 你在一個有 \"驍將 \"的團隊中工作，感覺如何？ 這是否是一個問題，它是否得到了很好的解決？\n"
}