{
  "@type": "NewsArticle",
  "identifier": "2022--08--01--en--askhn--HackerNews--NewsArticle--32301201",
  "url": "https://news.ycombinator.com/item?id=32301201",
  "headline": "Ask HN: Transitioning from research to industry, how should I prep?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN! Looking for some advice as I transition away from a largely academic environment to industry.<p>I work in robotics. I am currently enrolled in a top ~3 robotics program in the US, working on robot learning. Previously I worked on different robotics problems including: heuristic based path-planning, multi-robot systems, UAVs, SLAM etc. Through my research, I've gained experience in Python and to a lesser extent in C++ as well. Prior to joining the grad program I worked as a Research Intern in a US semiconductor company's research division, on developing algorithms for SLAM (I developed kalman filters, keypoint extraction and map storage/retrieval). Most of these projects were &quot;systems projects&quot;, implying that the primary innovation was combining exisiting algorithms/methods into a complete end-to-end-system, rather than novel research contributions, but hey I'm not complaining! I really enjoy systems work turns out, which brings me to my point...<p>This brief stint showed me the stark contrast between academia and industry. It has me wondering if I'm much better for industry, since I feel my short and long-term incentives are much more aligned in industry rather than academia.<p>So I want to ask HN: How do I prepare for similar robotics/deep learning/computer-vision/machine learning jobs in industry? There seem to be a ton of advice for people venturing into SWE/SDE roles but not that much for &quot;Research Engineer&quot; positions.<p>Do I hit LeetCode? Do I improve my webpage? Do I start a blog? If I need to grind at LeetCode, what kind of challenges should I be focusing on? The keywords that I'd use to describe my skillset would include: Python/C++/TensorFlow2/Pytorch/OpenCV/ROS<p>Any and all advice is highly appreciated!<p>PS: If you think I would fit well with your organization, please let me know! I often feel like organizations wouldn't want &quot;generalists&quot; and instead prefer &quot;specialists&quot;.<p>-transitionAcad",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "transitionAcad",
    "url": "https://news.ycombinator.com/user?id=transitionAcad"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32301201",
  "sameAs": "https://news.ycombinator.com/item?id=32301201",
  "dateCreated": "2022-08-01T02:35:39.141Z",
  "datePublished": "2022-08-01T02:20:56.000Z",
  "dateModified": "2022-08-01T02:35:39.141Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 从研究领域过渡到工业领域，我应该如何准备？\n",
  "headline_zh-Hant": "Ask HN: 從研究領域過渡到工業領域，我應該如何準備？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN! 当我从一个基本的学术环境过渡到工业界时，我想征求一些建议。我目前就读于美国一个顶尖的~3个机器人项目，从事机器人学习工作。在此之前，我曾研究过不同的机器人问题，包括：基于启发式的路径规划、多机器人系统、无人机、SLAM等。通过研究，我获得了Python的经验，在较小程度上也获得了C++的经验。在加入研究生项目之前，我在一家美国半导体公司的研究部门担任研究实习生，负责开发SLAM的算法（我开发了卡尔曼滤波器、关键点提取和地图存储/检索）。这些项目大多是 \"系统项目\"，意味着主要的创新是将现有的算法/方法组合成一个完整的端到端系统，而不是新的研究贡献。我真的很喜欢系统工作，这让我想到了我的观点......<p>这段短暂的经历让我看到了学术界和工业界的鲜明对比。这让我想知道我是否更适合在工业界工作，因为我觉得我的短期和长期激励措施在工业界比在学术界更一致。<p>所以我想问HN：我如何为工业界的类似机器人/深度学习/计算机视觉/机器学习工作做准备？对于进入SWE/SDE职位的人来说，似乎有很多建议，但对于&quot;研究工程师&quot;职位来说，却没有那么多建议。<p>我是否要冲击LeetCode？我应该改进我的网页吗？我是否要开一个博客？如果我需要在LeetCode上磨练，我应该关注什么样的挑战？我用来描述我的技能组合的关键词包括。Python/C++/TensorFlow2/Pytorch/OpenCV/ROS<p>高度赞赏任何和所有的建议！<p>PS：如果你认为我很适合你的组织，请让我知道！我经常感觉到组织不适合我。我经常觉得组织不会想要&quot;通才&quot;，而是更喜欢&quot;专家&quot;。<p>-transitionAcad\n",
  "description_zh-Hant": "嗨，HN! 當我從一個基本的學術環境過渡到工業界時，我想徵求一些建議。我目前就讀於美國一個頂尖的~3個機器人項目，從事機器人學習工作。在此之前，我曾研究過不同的機器人問題，包括：基於啟發式的路徑規劃、多機器人系統、無人機、SLAM等。通過研究，我獲得了Python的經驗，在較小程度上也獲得了C++的經驗。在加入研究生項目之前，我在一家美國半導體公司的研究部門擔任研究實習生，負責開發SLAM的算法（我開發了卡爾曼濾波器、關鍵點提取和地圖存儲/檢索）。這些項目大多是 \"系統項目\"，意味著主要的創新是將現有的算法/方法組合成一個完整的端到端系統，而不是新的研究貢獻。我真的很喜歡系統工作，這讓我想到了我的觀點......<p>這段短暫的經歷讓我看到了學術界和工業界的鮮明對比。這讓我想知道我是否更適合在工業界工作，因為我覺得我的短期和長期激勵措施在工業界比在學術界更一致。<p>所以我想問HN：我如何為工業界的類似機器人/深度學習/計算機視覺/機器學習工作做準備？對於進入SWE/SDE職位的人來說，似乎有很多建議，但對於&quot;研究工程師&quot;職位來說，卻沒有那麼多建議。<p>我是否要衝擊LeetCode？我應該改進我的網頁嗎？我是否要開一個博客？如果我需要在LeetCode上磨練，我應該關注什麼樣的挑戰？我用來描述我的技能組合的關鍵詞包括。Python/C++/TensorFlow2/Pytorch/OpenCV/ROS<p>高度讚賞任何和所有的建議！<p>PS：如果你認為我很適合你的組織，請讓我知道！我經常感覺到組織不適合我。我經常覺得組織不會想要&quot;通才&quot;，而是更喜歡&quot;專家&quot;。<p>-transitionAcad\n"
}