{
  "@type": "NewsArticle",
  "identifier": "2022--07--14--en--askhn--HackerNews--NewsArticle--32100630",
  "url": "https://news.ycombinator.com/item?id=32100630",
  "headline": "Ask HN: Why is the visa process stuck in the “Catch me if you can” days?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have had family members go through the visa process, for both EU (Schengen) and the US and UK.<p>Why is the visa process so archaic? First of all, appointments are submitted via a third-party firm who doesn't have any information during or about the process, as in how long will it take or if there are any problems in general.<p>Secondly, you have to submit your passport and have them hold it for the duration of the process.<p>Thirdly, if you want your passport back it is a stressful experience and could sometimes only be if you want to cancel the entire visa process, losing the visa fees.<p>And lastly, it takes way too long during the best of times. Currently it is closer to the worst of times. See #1, where the entire process is very opaque and you don't know when you may get your passport back, with or without the visa.<p>Why isn't it an electronic process where you submit your documents and credentials online and get called in to an interview if necessary, and why does there need to be an actual physical visa stamp or sticker on the passport rather than an entry in their database so that you can be given entry and stamped on arrival?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "llampx",
    "url": "https://news.ycombinator.com/user?id=llampx"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32100630",
  "sameAs": "https://news.ycombinator.com/item?id=32100630",
  "dateCreated": "2022-07-14T19:56:25.156Z",
  "datePublished": "2022-07-14T19:42:46.000Z",
  "dateModified": "2022-07-14T19:56:25.156Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么签证程序停留在 \"有本事就抓我 \"的时代？\n",
  "headline_zh-Hant": "Ask HN: 為什麼簽證程序停留在 \"有本事就抓我 \"的時代？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我有家人经历过签证过程，无论是欧盟（申根）还是美国和英国。<p>为什么签证过程如此古老？首先，预约是通过第三方公司提交的，他们在这个过程中没有任何信息，如需要多长时间或是否有任何问题。<p>其次，你必须提交你的护照，并让他们在这个过程中保管它。<p>第三，如果你想要回你的护照，这是一个紧张的经历，有时可能只有当你想取消整个签证过程，失去签证费用。<p>最后，在最好的时候需要太长时间。目前，它更接近于最坏的时候。见#1，整个过程是非常不透明的，你不知道什么时候你可能会得到你的护照，不管有没有签证。<p>为什么它不是一个电子过程，你在网上提交你的文件和证书，并在必要时被叫去面试，为什么需要在护照上有一个实际的签证印章或贴纸，而不是在他们的数据库中输入，以便你可以得到入境和抵达时的印章？\n",
  "description_zh-Hant": "我有家人經歷過簽證過程，無論是歐盟（申根）還是美國和英國。<p>為什麼簽證過程如此古老？首先，預約是通過第三方公司提交的，他們在這個過程中沒有任何信息，如需要多長時間或是否有任何問題。<p>其次，你必須提交你的護照，並讓他們在這個過程中保管它。<p>第三，如果你想要回你的護照，這是一個緊張的經歷，有時可能只有當你想取消整個簽證過程，失去簽證費用。<p>最後，在最好的時候需要太長時間。目前，它更接近於最壞的時候。見#1，整個過程是非常不透明的，你不知道什麼時候你可能會得到你的護照，不管有沒有簽證。<p>為什麼它不是一個電子過程，你在網上提交你的文件和證書，並在必要時被叫去面試，為什麼需要在護照上有一個實際的簽證印章或貼紙，而不是在他們的數據庫中輸入，以便你可以得到入境和抵達時的印章？\n"
}