{
  "@type": "NewsArticle",
  "identifier": "2022--04--18--en--askhn--HackerNews--NewsArticle--31071562",
  "url": "https://news.ycombinator.com/item?id=31071562",
  "headline": "Ask HN: What's a good platform for engaging with an audience/community?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "With all the constructive feedback I've been getting from you folks lately, I'm starting to build some confidence in my own abilities while learning about the things that I may not be so good at [1]. Specifically, other than the writing that I will be posting on my personal website, I think I will very much enjoy building a community around my work, where I will get to engage regularly with like-minded people, exchange advice and perspectives, maybe do some AMAs etc.<p>So the question is, what's a good platform for engaging with an audience/community?<p>Right now I'm thinking Discord as my primary choice, as it's very low-barrier and super chill, and it doesn't place too much pressure on me to have to continually produce content (I work slowly). I can just take in people's comments and stories and rants etc etc and offer my take on it all. It'll also be nice to see the whole community in one place! (In fact I've already set one up if anyone's interested! [2]).<p>I'm also curious about using Twitch for live-streams. The people I know in real life seem to like my positive-presence, so maybe this is a good place to show my face and be more friendly and personal. But I've never used Twitch ever (aside from seeing them on youtube), so I'm completely unfamiliar with how to set things up there, how much learning curve there is (eg do I need to edit videos?), whether the audience expect regular content, what types of features are available, etc.. If anyone's familiar with this I'd love to hear all about it!<p>Other options include Substack/newsletters, but these aren't so interactive, and definitely puts pressure on me having to produce often. Then there's Youtube in general, which is an interesting place to upload more cleaned up material (eg a video essay), but I'm also worried about it taking more work as I'm not a video-maker.<p>Anyway, would love to get some feedback from you awesome smart people!!<p>Thank you so much in advance!<p>Sam<p>[1]: Just last night I posted a thread about giving people advice (https://news.ycombinator.com/item?id=31065876), but after trying to help several people, I realized I'm not very good at giving people <i>specific</i> advice tailored to their unique situations (even though I would love to!). I'm much better at sharing general/philosophical advice or insights from observing general phenomena -- hence why I have enjoyed writing so far. Sorry folks!<p>[2]: Discord invite link! https://discord.gg/ZZN3v7Usdx",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31071562",
  "sameAs": "https://news.ycombinator.com/item?id=31071562",
  "dateCreated": "2022-04-18T15:10:31.825Z",
  "datePublished": "2022-04-18T14:59:27.000Z",
  "dateModified": "2022-04-18T15:10:31.825Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 什么是与观众/社区接触的好平台？",
  "headline_zh-Hant": "Ask HN: 什麼是與觀眾/社區接觸的好平臺？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "最近，我从各位朋友那里得到了很多建设性的反馈，我开始对自己的能力建立一些信心，同时了解到我可能不那么擅长的事情[1]。具体来说，除了我将在我的个人网站上发表的文章之外，我认为我将非常喜欢围绕我的工作建立一个社区，在那里我将定期与志同道合的人接触，交流建议和观点，也许会做一些AMA等等。 <p>那么问题来了，什么是与受众/社区互动的好平台呢？<p>现在我认为Discord是我的主要选择，因为它的门槛很低，而且超级冷酷，而且它不会给我带来太多压力，让我必须不断地生产内容（我工作得很慢）。我可以接受人们的评论、故事和咆哮等等，并提供我对这一切的看法。能在一个地方看到整个社区也很好！（事实上，我已经把它当成了我的工作。(事实上，我已经建立了一个，如果有人感兴趣的话！[2]）<p>我也对使用Twitch进行直播感到好奇。我在现实生活中认识的人似乎喜欢我的积极存在，所以也许这是一个展示我的面孔、更加友好和个性化的好地方。但是我从来没有使用过Twitch（除了在youtube上看到过），所以我完全不熟悉如何在那里设置东西，有多少学习曲线（例如我需要编辑视频吗），观众是否期待定期内容，有哪些类型的功能，等等。如果有人熟悉这个，我很想听听所有的情况！<p>其他的选择包括Substack/newsletters，但这些不是那么互动，而且肯定会给我带来压力，因为我必须经常制作。然后还有Youtube，这是一个有趣的地方，可以上传更多经过清理的材料（例如视频文章），但我也担心这需要更多的工作，因为我不是一个视频制作者。<p>无论如何，我很想从你们这些了不起的聪明人那里得到一些反馈！<p>事先非常感谢你们！<p>Sam<p>[1]: 就在昨天晚上，我发了一个关于给人建议的帖子（https://news.ycombinator.com/item?id=31065876），但在尝试帮助了几个人之后，我意识到我不太擅长给人提供针对他们独特情况的<i>具体</i>建议（尽管我很想这样做！）。我更擅长于分享一般/哲学建议或观察一般现象的见解--因此我至今都喜欢写作。对不起，伙计们！<p>[2]: Discord邀请链接！https://discord.gg/ZZN3v7Usdx",
  "description_zh-Hant": "最近，我從各位朋友那裡得到了很多建設性的反饋，我開始對自己的能力建立一些信心，同時瞭解到我可能不那麼擅長的事情[1]。具體來說，除了我將在我的個人網站上發表的文章之外，我認為我將非常喜歡圍繞我的工作建立一個社區，在那裡我將定期與志同道合的人接觸，交流建議和觀點，也許會做一些AMA等等。 <p>那麼問題來了，什麼是與受眾/社區互動的好平臺呢？<p>現在我認為Discord是我的主要選擇，因為它的門檻很低，而且超級冷酷，而且它不會給我帶來太多壓力，讓我必須不斷地生產內容（我工作得很慢）。我可以接受人們的評論、故事和咆哮等等，並提供我對這一切的看法。能在一個地方看到整個社區也很好！（事實上，我已經把它當成了我的工作。(事實上，我已經建立了一個，如果有人感興趣的話！[2]）<p>我也對使用Twitch進行直播感到好奇。我在現實生活中認識的人似乎喜歡我的積極存在，所以也許這是一個展示我的面孔、更加友好和個性化的好地方。但是我從來沒有使用過Twitch（除了在youtube上看到過），所以我完全不熟悉如何在那裡設置東西，有多少學習曲線（例如我需要編輯視頻嗎），觀眾是否期待定期內容，有哪些類型的功能，等等。如果有人熟悉這個，我很想聽聽所有的情況！<p>其他的選擇包括Substack/newsletters，但這些不是那麼互動，而且肯定會給我帶來壓力，因為我必須經常製作。然後還有Youtube，這是一個有趣的地方，可以上傳更多經過清理的材料（例如視頻文章），但我也擔心這需要更多的工作，因為我不是一個視頻製作者。<p>無論如何，我很想從你們這些了不起的聰明人那裡得到一些反饋！<p>事先非常感謝你們！<p>Sam<p>[1]: 就在昨天晚上，我發了一個關於給人建議的帖子（https://news.ycombinator.com/item?id=31065876），但在嘗試幫助了幾個人之後，我意識到我不太擅長給人提供針對他們獨特情況的<i>具體</i>建議（儘管我很想這樣做！）。我更擅長於分享一般/哲學建議或觀察一般現象的見解--因此我至今都喜歡寫作。對不起，夥計們！<p>[2]: Discord邀請鏈接！https://discord.gg/ZZN3v7Usdx"
}