{
  "@type": "NewsArticle",
  "identifier": "2022--08--06--en--askhn--HackerNews--NewsArticle--32363593",
  "url": "https://news.ycombinator.com/item?id=32363593",
  "headline": "Ask HN: Why does this spammer keep calling me when he loses money each time?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I use my phone for a small software business so I can't just block any unknown number. A call from a customer or potential customer could come from anywhere. I must get a dozen cold calls a day from spammers/scammers.<p>I automatically just hang up if the other end is a recording, but if it is a live person I will let them give their sales pitch. Even if they are just paying slave wages to some outfit in India, it still costs them something to have a live person speak to me. Every minute I keep them on the line is one less minute they could be scamming someone's grandmother. So if I am not too busy, I think it is a public service to waste a few minutes of their time. If everyone did this then these shops would have to change their business model or go bankrupt.<p>There is a certain outfit selling insurance for 'final expenses'. I have no doubt that it is way overpriced and if I died then if by some miracle they were still in business; then my heirs would probably have to fight them for any money they owe.<p>I have tried everything. Politely telling them no (after making them repeat everything a few times). Telling them to get lost. Telling them I am way too young. Telling them they are scammers and I will never fall for their scam. Nothing makes them take me off their list. They must have called me 100+ times. Every time is a complete waste for them, but they keep doing it.<p>As Butch Cassidy would say, that is bad for business. But they keep doing it.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "didgetmaster",
    "url": "https://news.ycombinator.com/user?id=didgetmaster"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32363593",
  "sameAs": "https://news.ycombinator.com/item?id=32363593",
  "dateCreated": "2022-08-06T02:18:41.243Z",
  "datePublished": "2022-08-06T00:32:39.000Z",
  "dateModified": "2022-08-06T02:18:41.243Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么这个垃圾邮件发送者每次都输钱，却一直给我打电话？\n",
  "headline_zh-Hant": "Ask HN: 為什麼這個垃圾郵件發送者每次都輸錢，卻一直給我打電話？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的手机用于小型软件业务，所以我不能只屏蔽任何未知号码。一个来自客户或潜在客户的电话可能来自任何地方。<p>如果另一端是录音，我就自动挂断，但如果是真人，我就会让他们进行销售宣传。即使他们只是向印度的一些机构支付奴隶工资，他们还是要花钱让一个活人和我说话。我每让他们在线上待一分钟，他们就可能少骗一分钟的钱给别人的祖母。因此，如果我不是太忙，我认为浪费他们几分钟的时间是一种公共服务。如果每个人都这样做，那么这些商店就必须改变他们的商业模式，否则就会破产。<p>有一家公司出售 \"最后费用 \"保险。我毫不怀疑，它的价格过高，如果我死了，那么如果他们奇迹般地还在营业，那么我的继承人可能不得不与他们争夺他们所欠的任何钱。礼貌地告诉他们不要（在让他们重复了几遍之后）。告诉他们，让他们滚蛋。告诉他们我太年轻了。告诉他们，他们是骗子，我绝不会上他们的当。没有什么能让他们把我从他们的名单中删除。他们肯定已经给我打了100多次电话。每一次对他们来说都是完全的浪费，但他们一直在做。<p>正如Butch Cassidy所说，这对生意是不利的。但他们继续这样做。\n",
  "description_zh-Hant": "我的手機用於小型軟件業務，所以我不能只屏蔽任何未知號碼。一個來自客戶或潛在客戶的電話可能來自任何地方。<p>如果另一端是錄音，我就自動掛斷，但如果是真人，我就會讓他們進行銷售宣傳。即使他們只是向印度的一些機構支付奴隸工資，他們還是要花錢讓一個活人和我說話。我每讓他們在線上待一分鐘，他們就可能少騙一分鐘的錢給別人的祖母。因此，如果我不是太忙，我認為浪費他們幾分鐘的時間是一種公共服務。如果每個人都這樣做，那麼這些商店就必須改變他們的商業模式，否則就會破產。<p>有一家公司出售 \"最後費用 \"保險。我毫不懷疑，它的價格過高，如果我死了，那麼如果他們奇蹟般地還在營業，那麼我的繼承人可能不得不與他們爭奪他們所欠的任何錢。禮貌地告訴他們不要（在讓他們重複了幾遍之後）。告訴他們，讓他們滾蛋。告訴他們我太年輕了。告訴他們，他們是騙子，我絕不會上他們的當。沒有什麼能讓他們把我從他們的名單中刪除。他們肯定已經給我打了100多次電話。每一次對他們來說都是完全的浪費，但他們一直在做。<p>正如Butch Cassidy所說，這對生意是不利的。但他們繼續這樣做。\n"
}