{
  "@type": "NewsArticle",
  "identifier": "2022--06--03--en--askhn--HackerNews--NewsArticle--31608418",
  "url": "https://news.ycombinator.com/item?id=31608418",
  "headline": "Ask HN: How much negative testing is done by Tesla and other self-driving teams?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "In software testing, there's positive testing to check that software will perform desired behavior, and negative testing to ensure that the software will avoid undesired behaviors.<p>We know that self-driving cars have many thousands of hours of positive testing done. But what I'm wondering is how much adversarial testing is done?<p>For example, to test that the car doesn't get misled by old lane markers when a road is under construction, wouldn't you at least do millions of simulated tests with randomly placed painted lines overlaid on the virtual road?<p>And to test that the car doesn't run into stopped emergency vehicles or tractor trailers crossing its path, wouldn't you at least do thousands of tests on a road containing stopped vehicles?<p>Not to mention if someone accidentally guns the accelerator while approaching a sharp curve. Shouldn't the car know that it's approaching the curve and issue a warning?<p>Does anyone attempt to do the driving equivalent of fuzzing to self-driving cars?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tompark",
    "url": "https://news.ycombinator.com/user?id=tompark"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31608418",
  "sameAs": "https://news.ycombinator.com/item?id=31608418",
  "dateCreated": "2022-06-03T14:22:37.415Z",
  "datePublished": "2022-06-03T14:02:26.000Z",
  "dateModified": "2022-06-03T14:22:37.415Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 特斯拉和其他自动驾驶团队做了多少负面测试？\n",
  "headline_zh-Hant": "Ask HN: 特斯拉和其他自動駕駛團隊做了多少負面測試？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在软件测试中，有积极的测试，以检查软件将执行所需的行为，以及消极的测试，以确保软件将避免不受欢迎的行为。<p>我们知道，自动驾驶汽车已经完成了成千上万小时的积极测试。但我想知道的是，到底做了多少对抗性测试？<p>例如，为了测试汽车在道路施工时不会被旧的车道标记所误导，你不是至少要做数百万次的模拟测试，在虚拟道路上随机放置油漆线？ <p>而为了测试汽车不会撞上停在路边的紧急车辆或拖拉机拖车，你难道不会在包含停在路边的车辆的道路上至少做几千次测试吗？ <p>更不用说如果有人在接近急弯时不小心踩了油门。难道汽车不应该知道它正在接近弯道并发出警告吗？<p>是否有人试图对自驾车做相当于模糊处理的驾驶测试？\n",
  "description_zh-Hant": "在軟件測試中，有積極的測試，以檢查軟件將執行所需的行為，以及消極的測試，以確保軟件將避免不受歡迎的行為。<p>我們知道，自動駕駛汽車已經完成了成千上萬小時的積極測試。但我想知道的是，到底做了多少對抗性測試？<p>例如，為了測試汽車在道路施工時不會被舊的車道標記所誤導，你不是至少要做數百萬次的模擬測試，在虛擬道路上隨機放置油漆線？ <p>而為了測試汽車不會撞上停在路邊的緊急車輛或拖拉機拖車，你難道不會在包含停在路邊的車輛的道路上至少做幾千次測試嗎？ <p>更不用說如果有人在接近急彎時不小心踩了油門。難道汽車不應該知道它正在接近彎道併發出警告嗎？<p>是否有人試圖對自駕車做相當於模糊處理的駕駛測試？\n"
}