{
  "@type": "NewsArticle",
  "identifier": "2022--07--05--en--askhn--HackerNews--NewsArticle--31993788",
  "url": "https://news.ycombinator.com/item?id=31993788",
  "headline": "Ask HN: Rat in My Network",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN,<p>For the last couple of months a few distinct parties have gained access into my home network. They're also tracking sound through landlines in my house. It's a really long story but the gist of it is that I got into some back-and-forth on social media, and then things kind of erupted.<p>They have remote access into multiple Macs on my network, they're key logging devices, and have backdoor access into many web accounts (Google, Facebook, Twitter to name a few). I don't think I can do anything about the last one, but I'm hoping for assistance in getting them out of my network. They've referenced private data from those services (like Google Photos, YouTube history, Discord conversations, etc) and have referenced conversations I'm having in my home. They're running intricate botnets and have been controlling my feeds on Twitter, Mastodon, Facebook, YouTube, and maybe more.<p>I've contacted a lawyer, but they were unable to help. I'm fairly sure they don't want anything other than to annoy me, so at this point I'm not particularly keen on taking legal action, but I'm hoping for sophisticated resources, contacts, or anecdotes for getting them out of my network.<p>Thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kashav",
    "url": "https://news.ycombinator.com/user?id=kashav"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31993788",
  "sameAs": "https://news.ycombinator.com/item?id=31993788",
  "dateCreated": "2022-07-05T21:24:27.846Z",
  "datePublished": "2022-07-05T21:15:28.000Z",
  "dateModified": "2022-07-05T21:24:27.846Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 我的网络中的老鼠\n",
  "headline_zh-Hant": "Ask HN: 我的網絡中的老鼠\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hi HN,<p>在过去的几个月里，一些不同的方面已经获得了进入我的家庭网络的权限。他们还通过我家的固定电话追踪声音。这真是一个很长的故事，但大意是，我在社交媒体上进行了一些来回讨论，然后事情就爆发了。<p>他们可以远程访问我网络上的多台苹果电脑，他们是关键的记录设备，并且可以通过后门访问许多网络账户（谷歌、Facebook、Twitter等等）。我不认为我可以对最后一项做些什么，但我希望得到帮助，把他们从我的网络中赶出去。他们参考了这些服务的私人数据（如谷歌照片、YouTube历史、Discord对话等），并参考了我在家里的对话。他们正在运行复杂的僵尸网络，并一直在控制我在Twitter、Mastodon、Facebook、YouTube上的信息，也许还有更多。<p>我已经联系了一名律师，但他们无法提供帮助。我相当肯定，他们除了烦扰我之外，并没有其他目的，所以在这一点上，我并不特别热衷于采取法律行动，但我希望有成熟的资源、联系人，或让他们离开我的网络的轶事。\n",
  "description_zh-Hant": "Hi HN,<p>在過去的幾個月裡，一些不同的方面已經獲得了進入我的家庭網絡的權限。他們還通過我家的固定電話追蹤聲音。這真是一個很長的故事，但大意是，我在社交媒體上進行了一些來回討論，然後事情就爆發了。<p>他們可以遠程訪問我網絡上的多臺蘋果電腦，他們是關鍵的記錄設備，並且可以通過後門訪問許多網絡賬戶（谷歌、Facebook、Twitter等等）。我不認為我可以對最後一項做些什麼，但我希望得到幫助，把他們從我的網絡中趕出去。他們參考了這些服務的私人數據（如谷歌照片、YouTube歷史、Discord對話等），並參考了我在家裡的對話。他們正在運行復雜的殭屍網絡，並一直在控制我在Twitter、Mastodon、Facebook、YouTube上的信息，也許還有更多。<p>我已經聯繫了一名律師，但他們無法提供幫助。我相當肯定，他們除了煩擾我之外，並沒有其他目的，所以在這一點上，我並不特別熱衷於採取法律行動，但我希望有成熟的資源、聯繫人，或讓他們離開我的網絡的軼事。\n"
}