{
  "@type": "NewsArticle",
  "identifier": "2022--07--17--en--askhn--HackerNews--NewsArticle--32124809",
  "url": "https://news.ycombinator.com/item?id=32124809",
  "headline": "Ask HN: How to deal with children's online habits?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Or, more generally, how to give children freedom and privacy, yet also be there to help them understand the lessons the world is about to teach them?<p>I have this preconceived notion that I don't want to violate my children's privacy. It's very tempting, of course, to passively monitor e.g. their spending or online habits, but I don't want to.<p>(As a concrete example, I know a some people get very detailed reports from the daycare about what their children have been up to. I'm not interested in that -- when I want to know what the daycare experience is like, I personally spend a day at the daycare.<p>This gives me much more nuance than a report ever would, but it also feels more respectful toward my child that they're allowed a part of their life outside of my supervision. But the reason I can do that is because there are other helpful adults at the daycare. That won't be the case everywhere, unfortunately.)<p>So I want them to have privacy, but I would also want to pick up on problems early -- either their own bad behaviour, or if they're victim's of someone else's bad behaviour.<p>Some more concrete questions in the same vein:<p>- What fraction of their online time should I sit with them?<p>- Do I play all video games with them or should they have some of &quot;their own&quot;?<p>- Do I give them the ability to do online purchases?<p>- Do I allow them to use up all of their money even as a mistake, or do I set up a limit?<p>- Do I limit their &quot;screen time&quot; (hate that term) or will that prevent them from interacting with their friends in the way they would want to?<p>This depends on maturity levels, of course, but I'm looking for generalisations. My children are 2 and 0.2 years old now, so this won't be relevant in a while but I like to be prepared and if you have thoughts regarding any maturity level, please share.<p>The reason I ask you HN folks is (a) that you are likely to understand my concern for privacy and personal integrity, and (b) that I've received very useful and thought-out child-related advice here before.<p>----<p>I'm also skipping a bunch of privilege-related questions like &quot;who the hell can take a day off to spend it at the daycare?&quot; Or, perhaps more importantly, &quot;what determines how much time you spend online with your children may not be what's appropriate, but how much time you can spare for it?&quot;<p>And yeah, both of those are problems for myself as well -- I'm interested in all creative solutions here, also that help work around such problems.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kqr",
    "url": "https://news.ycombinator.com/user?id=kqr"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32124809",
  "sameAs": "https://news.ycombinator.com/item?id=32124809",
  "dateCreated": "2022-07-17T06:30:45.216Z",
  "datePublished": "2022-07-17T05:57:49.000Z",
  "dateModified": "2022-07-17T06:30:45.216Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何处理儿童的网络习惯？\n",
  "headline_zh-Hant": "Ask HN: 如何處理兒童的網絡習慣？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "或者，更广泛地说，如何给孩子们自由和隐私，同时又能帮助他们理解这个世界将要教给他们的课程？<p>我有这样一种先入为主的观念，即我不想侵犯我孩子的隐私。当然，被动地监控他们的消费或在线习惯是非常诱人的，但我不想这样做。<p>（作为一个具体的例子，我知道有些人从托儿所得到非常详细的报告，了解他们的孩子都在做什么。我对这些不感兴趣--当我想知道日托所的经验是什么样的时候，我会亲自在日托所呆上一天。<p>这给我带来的细微差别比报告要大得多，但这也让我感觉到对孩子的尊重，他们被允许在我的监督之外有自己生活的一部分。但我之所以能做到这一点，是因为幼儿园里还有其他有用的成年人。<p>因此，我希望他们有隐私，但我也希望尽早发现问题--要么是他们自己的不良行为，要么是他们成为别人不良行为的受害者。<p>同样的，还有一些更具体的问题：<p>-他们上网的时间，我应该陪他们坐多久？<p>-我是和他们一起玩所有视频游戏，还是他们应该有一些自己的游戏？ <p>- 我是否让他们有能力进行网上购物？<p>- 我是否允许他们用完所有的钱，即使是一个错误，还是要设置一个限制？<p>- 我是否限制他们的&quot;屏幕时间&quot;（讨厌这个词），还是会阻止他们以他们想要的方式与朋友互动？<p> 当然，这取决于成熟度，但我正在寻找一般性的东西。我的孩子现在分别是2岁和0.2岁，所以这在一段时间内不会有什么影响，但我想做好准备，如果你有关于任何成熟度的想法，请分享。<p>我之所以问你们HN的人，是因为（a）你们可能理解我对隐私和个人完整性的关注，（b）我以前在这里收到过非常有用和深思熟虑的与孩子有关的建议。 <p>----<p>我也跳过了一堆与特权有关的问题，比如&quot;到底谁能请一天假去幼儿园？&quot;或者，也许更重要的是，&quot;决定你花多少时间和你的孩子一起上网的可能不是什么合适的，而是你能抽出多少时间？&quot;<p>而且，对我来说，这两个问题也是我的问题--我对这里所有创造性的解决方案感兴趣，也有助于解决此类问题。\n",
  "description_zh-Hant": "或者，更廣泛地說，如何給孩子們自由和隱私，同時又能幫助他們理解這個世界將要教給他們的課程？<p>我有這樣一種先入為主的觀念，即我不想侵犯我孩子的隱私。當然，被動地監控他們的消費或在線習慣是非常誘人的，但我不想這樣做。<p>（作為一個具體的例子，我知道有些人從託兒所得到非常詳細的報告，瞭解他們的孩子都在做什麼。我對這些不感興趣--當我想知道日託所的經驗是什麼樣的時候，我會親自在日託所呆上一天。<p>這給我帶來的細微差別比報告要大得多，但這也讓我感覺到對孩子的尊重，他們被允許在我的監督之外有自己生活的一部分。但我之所以能做到這一點，是因為幼兒園裡還有其他有用的成年人。<p>因此，我希望他們有隱私，但我也希望儘早發現問題--要麼是他們自己的不良行為，要麼是他們成為別人不良行為的受害者。<p>同樣的，還有一些更具體的問題：<p>-他們上網的時間，我應該陪他們坐多久？<p>-我是和他們一起玩所有視頻遊戲，還是他們應該有一些自己的遊戲？ <p>- 我是否讓他們有能力進行網上購物？<p>- 我是否允許他們用完所有的錢，即使是一個錯誤，還是要設置一個限制？<p>- 我是否限制他們的&quot;屏幕時間&quot;（討厭這個詞），還是會阻止他們以他們想要的方式與朋友互動？<p> 當然，這取決於成熟度，但我正在尋找一般性的東西。我的孩子現在分別是2歲和0.2歲，所以這在一段時間內不會有什麼影響，但我想做好準備，如果你有關於任何成熟度的想法，請分享。<p>我之所以問你們HN的人，是因為（a）你們可能理解我對隱私和個人完整性的關注，（b）我以前在這裡收到過非常有用和深思熟慮的與孩子有關的建議。 <p>----<p>我也跳過了一堆與特權有關的問題，比如&quot;到底誰能請一天假去幼兒園？&quot;或者，也許更重要的是，&quot;決定你花多少時間和你的孩子一起上網的可能不是什麼合適的，而是你能抽出多少時間？&quot;<p>而且，對我來說，這兩個問題也是我的問題--我對這裡所有創造性的解決方案感興趣，也有助於解決此類問題。\n"
}