{
  "@type": "NewsArticle",
  "identifier": "2022--07--24--en--askhn--HackerNews--NewsArticle--32211787",
  "url": "https://news.ycombinator.com/item?id=32211787",
  "headline": "Ask HN: Is there any real value in applying ML to process time series data?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi,<p>I work a lot on images processing and extracting insights from it. There seems to be demand for this kind of service.\nMy university background is closer to time series data, i.e. digital signals processing and modelling, I was wondering if same methods can be applied here. In industrial processes it makes sense to try to model various parts of the process to be able to predict possible fault. This is cool and complicated, and also there are no industrial plants in my environment to go and explore real life data to work with.<p>The other application of modelling based on time series is within financial markets speculation (forex, stock exchange etc.), though I am not partucularly interested in this area, it appears to me a bit like gambling and as such not something I would like to be involved in.<p>So I wonder what other use cases for time series modelling are. I have two ideas to build something that may turn out to be useful.<p>1. I was reading it is possible to find correlations between time series streams, and this could maybe lead to a model that suggests to turn some equipment off because it is not required (based on availability of electrical consumption data)<p>2. Processing of audio streams and building generative model to create some interesting sound effects (not necessarily music); or the other way around, to detect some events based on sound (i.e. car accident)<p>Do you know interesting projects that apply machine learning methods to process time series data to do something useful with it? Or maybe you wish a project existed for some particular problem you feel is worth solving?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "gwnywg",
    "url": "https://news.ycombinator.com/user?id=gwnywg"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32211787",
  "sameAs": "https://news.ycombinator.com/item?id=32211787",
  "dateCreated": "2022-07-24T09:46:37.025Z",
  "datePublished": "2022-07-24T09:41:11.000Z",
  "dateModified": "2022-07-24T09:46:37.025Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 应用ML来处理时间序列数据是否有真正的价值？\n",
  "headline_zh-Hant": "Ask HN: 應用ML來處理時間序列數據是否有真正的價值？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，<p>我在图像处理和从中提取洞察力方面做了很多工作。似乎对这种服务有需求。\n我的大学背景更接近于时间序列数据，即数字信号处理和建模，我想知道同样的方法是否可以应用于此。在工业过程中，试图对过程的各个部分进行建模，以便能够预测可能的故障是有意义的。<p>基于时间序列的建模的另一个应用是在金融市场投机（外汇、证券交易所等），尽管我对这个领域不感兴趣，在我看来有点像赌博，因此我不愿意参与其中。我有两个想法，希望能建立一些可能会有用的东西。我读到有可能找到时间序列流之间的相关性，这可能导致一个模型，建议关闭一些设备，因为它是不需要的（基于可用的电力消耗数据）<p>2.处理音频流并建立生成模型，以创建一些有趣的声音效果（不一定是音乐）；或者反过来，根据声音检测一些事件（如汽车事故）<p>你是否知道有趣的项目，应用机器学习方法来处理时间序列数据，并利用它做一些有用的东西？或者，你希望有一个项目存在，用于解决你认为值得解决的某些特定问题？\n",
  "description_zh-Hant": "嗨，<p>我在圖像處理和從中提取洞察力方面做了很多工作。似乎對這種服務有需求。\n我的大學背景更接近於時間序列數據，即數字信號處理和建模，我想知道同樣的方法是否可以應用於此。在工業過程中，試圖對過程的各個部分進行建模，以便能夠預測可能的故障是有意義的。<p>基於時間序列的建模的另一個應用是在金融市場投機（外匯、證券交易所等），儘管我對這個領域不感興趣，在我看來有點像賭博，因此我不願意參與其中。我有兩個想法，希望能建立一些可能會有用的東西。我讀到有可能找到時間序列流之間的相關性，這可能導致一個模型，建議關閉一些設備，因為它是不需要的（基於可用的電力消耗數據）<p>2.處理音頻流並建立生成模型，以創建一些有趣的聲音效果（不一定是音樂）；或者反過來，根據聲音檢測一些事件（如汽車事故）<p>你是否知道有趣的項目，應用機器學習方法來處理時間序列數據，並利用它做一些有用的東西？或者，你希望有一個項目存在，用於解決你認為值得解決的某些特定問題？\n"
}