{
  "@type": "NewsArticle",
  "identifier": "2022--08--04--en--askhn--HackerNews--NewsArticle--32344123",
  "url": "https://news.ycombinator.com/item?id=32344123",
  "headline": "Ask HN: What are your novel random ideas to help tackle climate change?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I believe many people have had weird idea's on improving energy efficiency, material resource consumption, etc.<p>I believe most of these out of the box ideas are self-censored because others aren't seen voicing the same idea, resulting in the autonomous conclusion its probably a dumb idea. Most probably are. An unknown fraction are probably prematurely rejected ideas. A community that is openminded to considering these might weed out the good unexplored ideas from the nonsensical unexplored ideas.<p>I will give an example:<p>A large majority of humanity lives relatively close to the sea. Thermal energy generation (both nuclear as well as fuel based) requires a hot temperature bath (from fuel, fission or perhaps someday fusion) as well as cold temperature bath to drive a thermal engine. When the colder thermal bath is hotter than usual the efficiency of fuel to electricity is lower, when the colder thermal bath is colder then usual the energy conversion efficiency is higher.<p>Why don't governments build out &quot;national heat pipes to the sea&quot; ? The pipes themselves don't need to be copper. The working fluid could be benign distilled water in a vacuum. Usage could be metered by thermal gradient at supplier/user interface. The pressure (a slight vacuum in case of distilled water) could be adapted as a function of ocean temperature, for optimal fluid/gas ratio for optimal heat flow and coolant feedback.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "DoctorOetker",
    "url": "https://news.ycombinator.com/user?id=DoctorOetker"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32344123",
  "sameAs": "https://news.ycombinator.com/item?id=32344123",
  "dateCreated": "2022-08-04T15:31:11.201Z",
  "datePublished": "2022-08-04T15:23:13.000Z",
  "dateModified": "2022-08-04T15:31:11.201Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你有什么新颖的随机想法来帮助应对气候变化？\n",
  "headline_zh-Hant": "Ask HN: 你有什麼新穎的隨機想法來幫助應對氣候變化？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我相信很多人都有过关于提高能源效率、材料资源消耗等方面的奇怪想法。<p>我相信大多数这些出格的想法都是自我审查的，因为别人没有看到他们表达同样的想法，结果是自主的结论，它可能是一个愚蠢的想法。大多数可能是这样。还有一小部分可能是被过早拒绝的想法。一个对这些问题持开放态度的社区可能会从无意义的未开发的想法中剔除好的未开发的想法。<p>我将举一个例子：<p>大部分人类生活在相对靠近大海的地方。热能发电（包括核电以及基于燃料的发电）需要热浴（来自燃料、裂变或也许有一天的核聚变）以及冷浴来驱动热能发动机。当较冷的温度浴比平时更热时，燃料转化为电能的效率较低，当较冷的温度浴比平时更冷时，能量转换效率较高。<p>为什么政府不建造通往大海的国家热力管道？管道本身不需要是铜的。工作流体可以是真空中的无害蒸馏水。使用量可以通过供应商/用户界面的热梯度来计量。压力（在蒸馏水的情况下是轻微的真空）可以作为海洋温度的一个函数来调整，以获得最佳的流体/气体比例，从而获得最佳的热流和冷却剂反馈。\n",
  "description_zh-Hant": "我相信很多人都有過關於提高能源效率、材料資源消耗等方面的奇怪想法。<p>我相信大多數這些出格的想法都是自我審查的，因為別人沒有看到他們表達同樣的想法，結果是自主的結論，它可能是一個愚蠢的想法。大多數可能是這樣。還有一小部分可能是被過早拒絕的想法。一個對這些問題持開放態度的社區可能會從無意義的未開發的想法中剔除好的未開發的想法。<p>我將舉一個例子：<p>大部分人類生活在相對靠近大海的地方。熱能發電（包括核電以及基於燃料的發電）需要熱浴（來自燃料、裂變或也許有一天的核聚變）以及冷浴來驅動熱能發動機。當較冷的溫度浴比平時更熱時，燃料轉化為電能的效率較低，當較冷的溫度浴比平時更冷時，能量轉換效率較高。<p>為什麼政府不建造通往大海的國家熱力管道？管道本身不需要是銅的。工作流體可以是真空中的無害蒸餾水。使用量可以通過供應商/用戶界面的熱梯度來計量。壓力（在蒸餾水的情況下是輕微的真空）可以作為海洋溫度的一個函數來調整，以獲得最佳的流體/氣體比例，從而獲得最佳的熱流和冷卻劑反饋。\n"
}