{
  "@type": "NewsArticle",
  "identifier": "2022--07--27--en--askhn--HackerNews--NewsArticle--32253860",
  "url": "https://news.ycombinator.com/item?id=32253860",
  "headline": "Ask HN: I'm burnt out: frustrated, distracted, pessimistic. How do I fix this?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Background: I'm a sole founder of a startup with about 10 people.<p>I find it difficult to maintain an optimistic state-of-mind. I often slip into pessimism.<p>I have times where I feel very optimistic, I know I’m in the right mindset and ready to be productive, charismatic, effective etc.. Sometimes that can be in a social work situation, it could be while giving a talk, it could be while meeting someone new, or it could be feeling good about some new piece of work, and focussed to make progress with it. The feeling is optimistic, focussed, driven, confident and clear minded. Like I can dive into any tricky problem and solve it, or roll up my sleeves and get a certain piece of work done in a phenomenal way. That’s the best version of me, I’m happy in those moments, and I’d like to be like that at all times, from the moment I wake up.<p>However, I frequently am not in that state. I feel distracted, un-motivated, pessimistic. I ruminate, I feel stressed and frustrated with situations. Sometimes, I have a meeting coming up which I know it’s important to be optimistic and effective, to be in that state of mind. But sitting there, feeling pessimistic, it feels like it’d be impossible to switch to feeling optimistic. The meeting can go, and I end feeling unsatisfied with how I was - not warm, not projecting energy or focus, but actually un-focussed and potentially de-railing the conversation.<p>In other words, I spend most of my time in a pessimistic state of mind, and I can’t easily change that. Googling all of this, the most typical result is &quot;burn out&quot;, which may be the case. I haven't taken a _really long_ break, but I have taken breaks, holidays, disconnected etc.. for up to 2 weeks. I feel refreshed, but quite quickly I'm back to the same place.<p>Advice for dealing with this?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "AnonyFoundr",
    "url": "https://news.ycombinator.com/user?id=AnonyFoundr"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32253860",
  "sameAs": "https://news.ycombinator.com/item?id=32253860",
  "dateCreated": "2022-07-27T17:57:43.883Z",
  "datePublished": "2022-07-27T17:49:58.000Z",
  "dateModified": "2022-07-27T17:57:43.883Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我已经焦头烂额了：沮丧、分心、悲观。我怎样才能解决这个问题？\n",
  "headline_zh-Hant": "Ask HN: 我已經焦頭爛額了：沮喪、分心、悲觀。我怎樣才能解決這個問題？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "背景。我是一家创业公司的唯一创始人，公司有大约10人。<p>我发现很难保持乐观的心态。<p>我也有感到非常乐观的时候，我知道我的心态是正确的，并且已经准备好成为一个有成效的、有魅力的、有效的等等。有时，这可能是在社会工作中，可能是在发表演讲时，可能是在会见新朋友时，也可能是对某项新工作感到满意，并集中精力取得进展。这种感觉是乐观的、专注的、有动力的、自信的和头脑清晰的。就像我可以潜入任何棘手的问题并解决它，或者卷起袖子，以惊人的方式完成某项工作。那是最好的我，在那些时刻我很快乐，我希望从我醒来的那一刻起，一直都是这样。<p>然而，我经常不在那种状态。我感到心烦意乱、没有动力、悲观。我反刍，我感到压力，对情况感到沮丧。有时，我有一个会议要开，我知道保持乐观和有效是很重要的，要有这种精神状态。但坐在那里，感觉很悲观，感觉不可能转换到乐观的状态。会议可能会进行，而我最后对自己的表现感到不满意--不热情，没有投射出能量或焦点，但实际上没有焦点，并有可能使谈话陷入困境。<p>换句话说，我的大部分时间都是在悲观的心态下度过的，而我不能轻易改变这种状态。在谷歌上搜索这一切，最典型的结果是&quot;倦怠&quot;，这可能是事实。我没有休息过很长时间，但我曾休息过，放过假，断过线等等，时间长达两个星期。我感到神清气爽，但很快又回到了原地。<p>处理这种情况的建议？\n",
  "description_zh-Hant": "背景。我是一家創業公司的唯一創始人，公司有大約10人。<p>我發現很難保持樂觀的心態。<p>我也有感到非常樂觀的時候，我知道我的心態是正確的，並且已經準備好成為一個有成效的、有魅力的、有效的等等。有時，這可能是在社會工作中，可能是在發表演講時，可能是在會見新朋友時，也可能是對某項新工作感到滿意，並集中精力取得進展。這種感覺是樂觀的、專注的、有動力的、自信的和頭腦清晰的。就像我可以潛入任何棘手的問題並解決它，或者捲起袖子，以驚人的方式完成某項工作。那是最好的我，在那些時刻我很快樂，我希望從我醒來的那一刻起，一直都是這樣。<p>然而，我經常不在那種狀態。我感到心煩意亂、沒有動力、悲觀。我反芻，我感到壓力，對情況感到沮喪。有時，我有一個會議要開，我知道保持樂觀和有效是很重要的，要有這種精神狀態。但坐在那裡，感覺很悲觀，感覺不可能轉換到樂觀的狀態。會議可能會進行，而我最後對自己的表現感到不滿意--不熱情，沒有投射出能量或焦點，但實際上沒有焦點，並有可能使談話陷入困境。<p>換句話說，我的大部分時間都是在悲觀的心態下度過的，而我不能輕易改變這種狀態。在谷歌上搜索這一切，最典型的結果是&quot;倦怠&quot;，這可能是事實。我沒有休息過很長時間，但我曾休息過，放過假，斷過線等等，時間長達兩個星期。我感到神清氣爽，但很快又回到了原地。<p>處理這種情況的建議？\n"
}