{
  "@type": "NewsArticle",
  "identifier": "2022--04--20--en--askhn--HackerNews--NewsArticle--31094443",
  "url": "https://news.ycombinator.com/item?id=31094443",
  "headline": "Ask HN: Nobody versions their work files?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi everyone,<p>Just wondering what's your experience with people (colleagues or clients) sending you files at work; I've noticed no ones ever versions their files ever and keep the same filename over and over. For example for video task A they'll keep sending you A.mp4 forever, expecting you to never try to organize the files sent.<p>Versioning is a pretty simple organization rule though. Keep the same filename beginning, add some variations and end with vX. vX &gt; xY means X was created after Y. It doesn't matter if X grows to 100, at least it'll only be increasing in time. Do not ever send a &quot;vFINAL&quot; it is NEVER final !<p>&quot;A fixed mistake v5.mp4&quot; is always going to be more recent than &quot;A new blue background v2.mp4&quot;. I can tell you exactly &quot;please fix that text at timecode 00:00:12:24 in A v9.mp4&quot; and &quot;I liked what you did in the previous version A v6.mp4 let's bring it back&quot; instead of spending half an hour scrambling through old files and taking screenshots.<p>Those are pretty basic rules, which no ones follows, no ones knows about, even creative workers who deal with media file every day don't think about doing that. But I've seen this done in big teams of video editors who come up with common rules to work together though, they simply wouldn't do this by themselves if the other person doesn't ask for it.<p>From my experience, even in my personal work (not sending anything to any client), doing versioning is super helpful. So even before having any client it seems like basic workflow hygiene. But working with more and more people I find that no ones does that. Any idea why ?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ttoinou",
    "url": "https://news.ycombinator.com/user?id=ttoinou"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31094443",
  "sameAs": "https://news.ycombinator.com/item?id=31094443",
  "dateCreated": "2022-04-20T09:31:49.500Z",
  "datePublished": "2022-04-20T09:16:33.000Z",
  "dateModified": "2022-04-20T09:31:49.500Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 没有人给他们的工作文件提供版本？",
  "headline_zh-Hant": "Ask HN: 沒有人給他們的工作文件提供版本？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>我想知道你们在工作中遇到别人（同事或客户）给你们发送文件时有什么经验；我注意到没有人对他们的文件进行过改版，并不断地保持相同的文件名。例如，对于视频任务A，他们会永远给你发送A.mp4，希望你不要试图整理发送的文件。<p>版本管理是一个非常简单的组织规则。保持相同的文件名开头，增加一些变化，以vX结尾。vX &gt; xY表示X是在Y之后创建的。即使X增长到100也没关系，至少它只会在时间上增加。永远不要发送&quot;vFINAL&quot;它永远是最终的！<p>&quot;一个固定的错误v5.mp4&quot;总是要比&quot;一个新的蓝色背景v2.mp4&quot;更近。我可以准确地告诉你&quot;请修复A v9.mp4中时间码00:00:12:24的文字&quot;和&quot;我喜欢你在前一个版本A v6.mp4中的做法，让我们把它带回来&quot;而不是花半个小时在旧文件中争论和截图。<p>这些是非常基本的规则，没有人遵守，没有人知道，甚至每天处理媒体文件的创意工作者都不会想到这样做。但我曾在视频编辑的大团队中见过这样做，虽然他们制定了共同的工作规则，但如果对方不要求，他们根本不会自己这样做。<p>根据我的经验，即使在我的个人工作中（不向任何客户发送任何东西），做版本管理是超级有用的。因此，即使在有任何客户之前，这似乎是基本的工作流程卫生。但与越来越多的人一起工作时，我发现没有人这样做。知道为什么吗？",
  "description_zh-Hant": "大家好，<p>我想知道你們在工作中遇到別人（同事或客戶）給你們發送文件時有什麼經驗；我注意到沒有人對他們的文件進行過改版，並不斷地保持相同的文件名。例如，對於視頻任務A，他們會永遠給你發送A.mp4，希望你不要試圖整理發送的文件。<p>版本管理是一個非常簡單的組織規則。保持相同的文件名開頭，增加一些變化，以vX結尾。vX &gt; xY表示X是在Y之後創建的。即使X增長到100也沒關係，至少它只會在時間上增加。永遠不要發送&quot;vFINAL&quot;它永遠是最終的！<p>&quot;一個固定的錯誤v5.mp4&quot;總是要比&quot;一個新的藍色背景v2.mp4&quot;更近。我可以準確地告訴你&quot;請修復A v9.mp4中時間碼00:00:12:24的文字&quot;和&quot;我喜歡你在前一個版本A v6.mp4中的做法，讓我們把它帶回來&quot;而不是花半個小時在舊文件中爭論和截圖。<p>這些是非常基本的規則，沒有人遵守，沒有人知道，甚至每天處理媒體文件的創意工作者都不會想到這樣做。但我曾在視頻編輯的大團隊中見過這樣做，雖然他們制定了共同的工作規則，但如果對方不要求，他們根本不會自己這樣做。<p>根據我的經驗，即使在我的個人工作中（不向任何客戶發送任何東西），做版本管理是超級有用的。因此，即使在有任何客戶之前，這似乎是基本的工作流程衛生。但與越來越多的人一起工作時，我發現沒有人這樣做。知道為什麼嗎？"
}