{
  "@type": "NewsArticle",
  "identifier": "2022--04--15--en--askhn--HackerNews--NewsArticle--31038863",
  "url": "https://news.ycombinator.com/item?id=31038863",
  "headline": "Ask HN: How would you keep in touch with a group of people for 10 years?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I graduate high school this year, and I'd like to keep in touch with my classmates. Since just 15 of us spent almost every class together because of the program we took, we're very tight-knit and I'd like to think we want to keep in touch with each other in the next few years, even if we don't communicate regularly.<p>There is a convenient 5-letter .com domain that aptly describes the program at our school specifically, so it would cost maybe $100 to register it for the next 10 years and toss a comment section and photo album onto it. I don't want to have to teach everyone how to make an account, etc on another service (plus I can't guarantee everyone will remember their password, or that it will still be running) so a comment section might be ideal.<p>If I don't act quickly, someone's gonna make a Facebook group..<p>Can you think of a better way to allow a group of people to stay in contact with each other, planning for the long-term future?<p>Other things I've considered: Social media group (not long term), email thread (push notification style might stop people from updating it), group chat (ditto).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "sodality2",
    "url": "https://news.ycombinator.com/user?id=sodality2"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31038863",
  "sameAs": "https://news.ycombinator.com/item?id=31038863",
  "dateCreated": "2022-04-15T11:28:10.055Z",
  "datePublished": "2022-04-15T11:16:56.000Z",
  "dateModified": "2022-04-15T11:28:10.055Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 你会如何与一群人保持10年的联系？",
  "headline_zh-Hant": "Ask HN: 你會如何與一群人保持10年的聯繫？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我今年高中毕业，我想和我的同学们保持联系。因为我们中只有15个人因为参加了这个项目而几乎每节课都在一起，所以我们的关系非常紧密，我想我们希望在接下来的几年里保持联系，即使我们不经常交流。<p>有一个方便的5个字母的.com域名，恰好可以具体描述我们学校的项目，所以可能需要花费100美元来注册未来10年，并在上面扔一个评论区和照片集。我不想教每个人如何在另一个服务上建立账户等（另外我不能保证每个人都能记住他们的密码，也不能保证它仍在运行），所以评论区可能是理想的选择。<p>如果我不赶快行动，有人会建立一个Facebook小组。<p>你能想到一个更好的方法，让一群人彼此保持联系，为长期的未来做打算吗？社会媒体组（不是长期的），电子邮件线程（推送通知方式可能会阻止人们更新它），小组聊天（同上）。",
  "description_zh-Hant": "我今年高中畢業，我想和我的同學們保持聯繫。因為我們中只有15個人因為參加了這個項目而幾乎每節課都在一起，所以我們的關係非常緊密，我想我們希望在接下來的幾年裡保持聯繫，即使我們不經常交流。<p>有一個方便的5個字母的.com域名，恰好可以具體描述我們學校的項目，所以可能需要花費100美元來註冊未來10年，並在上面扔一個評論區和照片集。我不想教每個人如何在另一個服務上建立賬戶等（另外我不能保證每個人都能記住他們的密碼，也不能保證它仍在運行），所以評論區可能是理想的選擇。<p>如果我不趕快行動，有人會建立一個Facebook小組。<p>你能想到一個更好的方法，讓一群人彼此保持聯繫，為長期的未來做打算嗎？社會媒體組（不是長期的），電子郵件線程（推送通知方式可能會阻止人們更新它），小組聊天（同上）。"
}