{
  "@type": "NewsArticle",
  "identifier": "2022--07--15--en--askhn--HackerNews--NewsArticle--32110248",
  "url": "https://news.ycombinator.com/item?id=32110248",
  "headline": "Ask HN: How can you convince companies to open up to you about pain points?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "As a junior, I had one job years ago where I had an opportunity to see a small business's work process. I immediately saw things that could be automated and so-called &quot;pain points&quot; that could be improved with software. I opened up Balsamiq, sketched up a sample of software that would solve their problems and presented it to them. They loved my ideas and paid my employer to have me make them. They were thrilled with the result and I even heard through the grapevine how much it had helped them long after I had left that company.<p>Years later, I'm now a senior developer. Except for that one job, my whole career has been developing a carefully refined backlog of features that are handed to me. I get to use creativity and problem-solving for technical problems, but I keep thinking wistfully back to that one junior job where I got to come up with ideas for the software and features themselves.<p>I don't know how to get an opportunity like that again. How would I convince a small business to let me come in and spy on their work processes so I can pitch them ideas to let me build something that would improve them? Has anyone successfully found their way in to do this?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "unknownsky",
    "url": "https://news.ycombinator.com/user?id=unknownsky"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32110248",
  "sameAs": "https://news.ycombinator.com/item?id=32110248",
  "dateCreated": "2022-07-15T17:14:41.079Z",
  "datePublished": "2022-07-15T16:59:38.000Z",
  "dateModified": "2022-07-15T17:14:41.079Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何说服公司向你敞开痛点？\n",
  "headline_zh-Hant": "Ask HN: 你如何說服公司向你敞開痛點？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "作为一个年轻人，多年前我有一份工作，我有机会看到一个小企业的工作流程。我立即看到了可以自动化的东西和可以用软件改进的所谓痛点。我打开了Balsamiq，画出了一个可以解决他们问题的软件样本，并把它介绍给他们。他们喜欢我的想法，并付钱给我的雇主让我制作这些软件。他们对这个结果感到很兴奋，我甚至在离开那家公司很久之后，还通过小道消息听说这个软件对他们有多大帮助。<p>几年后，我现在是一名高级开发人员。除了那份工作之外，我的整个职业生涯都是在开发精心提炼的积压功能，并将其交给我。我可以利用创造力和问题解决来解决技术问题，但我一直在怀念那份初级工作，在那里我可以为软件和功能本身出谋划策。<p>我不知道如何再次获得这样的机会。我怎样才能说服一个小企业让我进去窥探他们的工作流程，从而向他们提出想法，让我建立一些可以改善他们的东西？有没有人成功地找到他们的方法来做这件事？\n",
  "description_zh-Hant": "作為一個年輕人，多年前我有一份工作，我有機會看到一個小企業的工作流程。我立即看到了可以自動化的東西和可以用軟件改進的所謂痛點。我打開了Balsamiq，畫出了一個可以解決他們問題的軟件樣本，並把它介紹給他們。他們喜歡我的想法，並付錢給我的僱主讓我製作這些軟件。他們對這個結果感到很興奮，我甚至在離開那家公司很久之後，還通過小道消息聽說這個軟件對他們有多大幫助。<p>幾年後，我現在是一名高級開發人員。除了那份工作之外，我的整個職業生涯都是在開發精心提煉的積壓功能，並將其交給我。我可以利用創造力和問題解決來解決技術問題，但我一直在懷念那份初級工作，在那裡我可以為軟件和功能本身出謀劃策。<p>我不知道如何再次獲得這樣的機會。我怎樣才能說服一個小企業讓我進去窺探他們的工作流程，從而向他們提出想法，讓我建立一些可以改善他們的東西？有沒有人成功地找到他們的方法來做這件事？\n"
}