{
  "@type": "NewsArticle",
  "identifier": "2022--07--04--en--askhn--HackerNews--NewsArticle--31979983",
  "url": "https://news.ycombinator.com/item?id=31979983",
  "headline": "Ask HN: Advice on camera for black and white only photography?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I was very much into black and white SLR photography many years back, shooting manual with b&amp;w film (sometimes developing film myself, but never really enjoyed that side of it so much).<p>I'm looking to get back into it, and was looking advice on modern digital cameras and software/workflows for b&amp;w only photography.<p>I've seen there are now some dedicated monochrome cameras, but they seem hideously expensive for the features, and quite a few years old now (so not sure whether they never caught on, were overpriced, or are so great they didn't need improving).<p>Some posts I've read suggest using Fujifilm cameras due to some different sensor filter pattern. Others suggest shooting in color then converting to b&amp;w in software to make working with color channels easier.<p>SLRs seem to be declining a bit in favour of mirrorless cameras, but I don't really have any experience with these to know whether they're now good enough to fully replace SLRs.<p>It's proving a bit tough to search for, so many search results just get me blogs/sites filled with ads or affiliate links, so hard to know who/what to trust. A lot of focus also seems to be on color performance, video, and autofocus, none of which I care about much (interchangeable lenses are a must though).<p>Any advice or pointers to trusted blogs/videos/sites etc. would be welcome - I've barely used any digital cameras other than my phone for quite some time.<p>FWIW part of the appeal of b&amp;w to me is its limitations, rather than just an effect to be applied to color photos I'd taken.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "nlnn",
    "url": "https://news.ycombinator.com/user?id=nlnn"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31979983",
  "sameAs": "https://news.ycombinator.com/item?id=31979983",
  "dateCreated": "2022-07-04T18:31:51.386Z",
  "datePublished": "2022-07-04T17:57:34.000Z",
  "dateModified": "2022-07-04T18:31:51.386Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 对只进行黑白摄影的相机的建议？\n",
  "headline_zh-Hant": "Ask HN: 對只進行黑白攝影的相機的建議？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "</p> <p>我想重新回到黑白单反摄影中去，并希望得到有关现代数码相机和软件/工作流程的建议，以便只进行黑白摄影。 <p>我看到现在有一些专门的单色相机，但它们的价格对于这些功能来说似乎太贵了，而且已经有好几年的历史了（所以不确定它们是否从未流行过，价格过高，或者是非常棒，不需要改进）。<p>我读过的一些帖子建议使用富士相机，因为有一些不同的传感器过滤模式。<p>单反相机似乎在一点点衰落，而无反光镜相机则更受欢迎，但我对这些相机没有任何经验，不知道它们现在是否足以完全取代单反相机。<p>事实证明，搜索有点困难，许多搜索结果只是让我看到充满广告或联盟链接的博客/网站，所以很难知道该相信谁/什么。<p>很多焦点似乎都集中在色彩表现、视频和自动对焦上，而这些都不是我所关心的（不过可更换的镜头是必须的）。<p>欢迎提供任何建议或指向可信赖的博客/视频/网站等--我除了手机之外几乎没有使用过任何数码相机，已经有相当长的一段时间了。\n",
  "description_zh-Hant": "</p> <p>我想重新回到黑白單反攝影中去，並希望得到有關現代數碼相機和軟件/工作流程的建議，以便只進行黑白攝影。 <p>我看到現在有一些專門的單色相機，但它們的價格對於這些功能來說似乎太貴了，而且已經有好幾年的歷史了（所以不確定它們是否從未流行過，價格過高，或者是非常棒，不需要改進）。<p>我讀過的一些帖子建議使用富士相機，因為有一些不同的傳感器過濾模式。<p>單反相機似乎在一點點衰落，而無反光鏡相機則更受歡迎，但我對這些相機沒有任何經驗，不知道它們現在是否足以完全取代單反相機。<p>事實證明，搜索有點困難，許多搜索結果只是讓我看到充滿廣告或聯盟鏈接的博客/網站，所以很難知道該相信誰/什麼。<p>很多焦點似乎都集中在色彩表現、視頻和自動對焦上，而這些都不是我所關心的（不過可更換的鏡頭是必須的）。<p>歡迎提供任何建議或指向可信賴的博客/視頻/網站等--我除了手機之外幾乎沒有使用過任何數碼相機，已經有相當長的一段時間了。\n"
}