{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--askhn--HackerNews--NewsArticle--32291660",
  "url": "https://news.ycombinator.com/item?id=32291660",
  "headline": "Ask HN: Career advice for junior, do I wait for perfect job to job hop?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello all,<p>Currently debating my first job hop as a software engineer.  Through some different pacing of job interviews (and the hiring freezes), I am in a situation and I am not sure whats the best path forward.<p>I have an offer that I really like.  Great pay increase, hiring manager seems great, in a city I really want to move to.  The only downside is its a generic Java Backend role (which is what my first job it).  Its not bad, because I do enjoy backend work, but I have been really interested in moving into low level programming.  I've wanted to try getting a job working in C/C++/Rust and on OS stuff or low level cloud stuff.<p>I currently have a chill job and I could turn this offer down and keep applying to jobs in hopes of getting everything I want + also the low level aspect, but I don't know if I am gonna regret turning down an offer that basically has everything just because I want to keep searching.<p>It is not like I am unemployed so I have no real reason to jump ship, but I am not payed well now and live in the middle of no where.  I can tolerate it in the short term, but I don't want to spend another 6+ months here.  I want a new job relatively soon.<p>EDIT: I guess my question is, is it a good idea to try and wait?  I am a bit inexperienced (1.5 YOE) and I work at a bank not an actual tech company, while the offer is a tech company.  So should I go there first as a stepping stone? Then go for the ideal job once I have more experience?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "3a2d29",
    "url": "https://news.ycombinator.com/user?id=3a2d29"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32291660",
  "sameAs": "https://news.ycombinator.com/item?id=32291660",
  "dateCreated": "2022-07-31T02:37:09.161Z",
  "datePublished": "2022-07-31T00:04:19.000Z",
  "dateModified": "2022-07-31T02:37:09.161Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 大三学生的职业建议，我是否要等待完美的工作来跳槽？\n",
  "headline_zh-Hant": "Ask HN: 大三學生的職業建議，我是否要等待完美的工作來跳槽？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好！<p>目前，我正在辩论我的第一份软件工程师的工作。 通过一些不同节奏的工作面试（和招聘冻结），我现在处于一种状况，我不确定什么是最好的发展道路。 加薪幅度很大，招聘经理看起来也很好，在一个我非常想去的城市。 唯一的缺点是它是一个普通的Java后端角色（我的第一份工作就是这样）。 这并不坏，因为我确实喜欢后端工作，但我一直对进入低级别的编程感兴趣。 我想尝试用C/C++/Rust和操作系统或低级别的云计算工作。<p>我目前有一份令人心动的工作，我可以拒绝这份工作，继续申请工作，希望能得到我想要的一切+低级别的工作，但我不知道我是否会后悔拒绝一份基本上拥有一切的工作，只是因为我想继续寻找。<p>我不是失业，所以我没有真正的理由跳槽，但我现在工资不高，住在中间的地方。 我可以在短期内容忍它，但我不想在这里再花6个多月的时间。 我想要一份相对较快的新工作。<p>编辑：我想我的问题是，尝试和等待是个好主意吗？ 我有点缺乏经验（1.5YOE），而且我在一家银行工作，不是真正的科技公司，而报价是一家科技公司。 那么，我是否应该先去那里作为一个垫脚石？一旦我有了更多的经验，再去找理想的工作？\n",
  "description_zh-Hant": "大家好！<p>目前，我正在辯論我的第一份軟件工程師的工作。 通過一些不同節奏的工作面試（和招聘凍結），我現在處於一種狀況，我不確定什麼是最好的發展道路。 加薪幅度很大，招聘經理看起來也很好，在一個我非常想去的城市。 唯一的缺點是它是一個普通的Java後端角色（我的第一份工作就是這樣）。 這並不壞，因為我確實喜歡後端工作，但我一直對進入低級別的編程感興趣。 我想嘗試用C/C++/Rust和操作系統或低級別的雲計算工作。<p>我目前有一份令人心動的工作，我可以拒絕這份工作，繼續申請工作，希望能得到我想要的一切+低級別的工作，但我不知道我是否會後悔拒絕一份基本上擁有一切的工作，只是因為我想繼續尋找。<p>我不是失業，所以我沒有真正的理由跳槽，但我現在工資不高，住在中間的地方。 我可以在短期內容忍它，但我不想在這裡再花6個多月的時間。 我想要一份相對較快的新工作。<p>編輯：我想我的問題是，嘗試和等待是個好主意嗎？ 我有點缺乏經驗（1.5YOE），而且我在一家銀行工作，不是真正的科技公司，而報價是一家科技公司。 那麼，我是否應該先去那裡作為一個墊腳石？一旦我有了更多的經驗，再去找理想的工作？\n"
}