{
  "@type": "NewsArticle",
  "identifier": "2022--07--26--en--askhn--HackerNews--NewsArticle--32244670",
  "url": "https://news.ycombinator.com/item?id=32244670",
  "headline": "Ask HN: First client, how not to undersell myself?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So as it turns I am about to get my first client as a freelancer. Nothing too big, it's a small but successful business who want a new website (their current one looks like your average 90s family business site). My family and I have been long-term customers of theirs so that's how this came about.<p>Now it seems like a very, very common theme among freelancers - I've read this over and over again in many different places and from people of various fields - that thinking back to their first customer they believe they massively undersold their services.<p>The naive fool that I am I would like to try and avoid that &quot;mistake&quot; while also not wanting to appear like I'm only out for the money (which I'm not). My focus is obviously first and foremost to deliver a top-notch service but I would also like to get the pricing right. So how do I go about doing that? I am in Germany if it matters.<p>My own idea so far is to say my work is worth 40€/hour and it will take me maybe 40 hours to do the job so 40€*40 = 1600€. Then I'd give like a 25% discount as a gesture of friendship and make it 1200€ but doesn't that still seem ... like a bit too much? Or am I falling for that trap... ? I wish I knew.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "yscodes",
    "url": "https://news.ycombinator.com/user?id=yscodes"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32244670",
  "sameAs": "https://news.ycombinator.com/item?id=32244670",
  "dateCreated": "2022-07-26T22:28:10.489Z",
  "datePublished": "2022-07-26T22:04:16.000Z",
  "dateModified": "2022-07-26T22:28:10.489Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 第一个客户，如何不贬低自己？\n",
  "headline_zh-Hant": "Ask HN: 第一個客戶，如何不貶低自己？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "因此，我即将得到我作为自由职业者的第一个客户。没有什么太大的问题，这是一个小型但成功的企业，他们想要一个新的网站（他们目前的网站看起来就像你平均90年代的家庭企业网站）。我和我的家人一直是他们的长期客户，所以才会有这样的结果。<p>现在看来，这在自由职业者中是一个非常、非常普遍的主题--我在许多不同的地方，从不同领域的人那里反复读到这一点--回想他们的第一个客户，他们认为他们大大低估了自己的服务。<p>我是一个天真的傻瓜，我想尝试并避免这个&quot;错误&quot; 同时也不想显得我只是为了钱（其实我不是）。我的重点显然是首先要提供一流的服务，但我也希望能得到正确的定价。那么，我怎样才能做到这一点呢？<p>到目前为止，我自己的想法是，我的工作价值为40欧元/小时，我可能需要40小时来完成这项工作，所以40欧元*40=1600欧元。然后我给你打七五折，以示友好，这样就是1200欧元，但这不还是显得......有点太多？还是说我落入了这个陷阱...？我希望我知道。\n",
  "description_zh-Hant": "因此，我即將得到我作為自由職業者的第一個客戶。沒有什麼太大的問題，這是一個小型但成功的企業，他們想要一個新的網站（他們目前的網站看起來就像你平均90年代的家庭企業網站）。我和我的家人一直是他們的長期客戶，所以才會有這樣的結果。<p>現在看來，這在自由職業者中是一個非常、非常普遍的主題--我在許多不同的地方，從不同領域的人那裡反覆讀到這一點--回想他們的第一個客戶，他們認為他們大大低估了自己的服務。<p>我是一個天真的傻瓜，我想嘗試並避免這個&quot;錯誤&quot; 同時也不想顯得我只是為了錢（其實我不是）。我的重點顯然是首先要提供一流的服務，但我也希望能得到正確的定價。那麼，我怎樣才能做到這一點呢？<p>到目前為止，我自己的想法是，我的工作價值為40歐元/小時，我可能需要40小時來完成這項工作，所以40歐元*40=1600歐元。然後我給你打七五折，以示友好，這樣就是1200歐元，但這不還是顯得......有點太多？還是說我落入了這個陷阱...？我希望我知道。\n"
}