{
  "@type": "NewsArticle",
  "identifier": "2022--06--04--en--askhn--HackerNews--NewsArticle--31617949",
  "url": "https://news.ycombinator.com/item?id=31617949",
  "headline": "Ask HN: Is there anything I can do about a terrible recruiter?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Is there any point trying to escalate to someone else at a company about a bad recruiter? I feel like if I say anything to anyone else it might jeopardize my candidacy.<p>Ever since I was passed off to a second recruiter for the onsite interviews things have been a nightmare. I passed the interviews and moved on to team selection but the process has now been dragging on for over a month and a half. For instance I had matched with a team but the recruiter took so long to reach out to the legal team about immigration that the team moved forward with another candidate. The recruiter is now taking days to reply to emails and has taken weeks to get feedback from other teams I've had intro calls with.<p>I'd love to work for this company but this is past the point of absurdity. Any advice would be greatly appreciated. I've considered sending an email to the initial recruiter asking if he can take a look at what is going on.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "AdvicePlz",
    "url": "https://news.ycombinator.com/user?id=AdvicePlz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31617949",
  "sameAs": "https://news.ycombinator.com/item?id=31617949",
  "dateCreated": "2022-06-04T07:41:03.255Z",
  "datePublished": "2022-06-04T07:34:05.000Z",
  "dateModified": "2022-06-04T07:41:03.255Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 对于一个糟糕的招聘人员，我有什么办法吗？\n",
  "headline_zh-Hant": "Ask HN: 對於一個糟糕的招聘人員，我有什麼辦法嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "试图向公司的其他人反映不良招聘人员的情况有什么意义吗？我觉得如果我对其他人说了什么，可能会危及我的候选资格。<p>自从我被转给第二个招聘人员进行现场面试后，事情就成了一场噩梦。我通过了面试，进入了团队选拔，但这个过程现在已经拖了一个半月了。例如，我曾与一个团队匹配，但招聘人员花了这么长时间与法律团队联系移民事宜，以至于该团队转而选择另一位候选人。招聘人员现在要花好几天的时间来回复邮件，并且花了好几周的时间才从与我有过介绍的其他团队那里得到反馈。<p>我很想为这家公司工作，但这已经到了荒谬的地步。如果有任何建议，我将不胜感激。我已经考虑给最初的招聘人员发一封邮件，问他是否可以看看发生了什么。\n",
  "description_zh-Hant": "試圖向公司的其他人反映不良招聘人員的情況有什麼意義嗎？我覺得如果我對其他人說了什麼，可能會危及我的候選資格。<p>自從我被轉給第二個招聘人員進行現場面試後，事情就成了一場噩夢。我通過了面試，進入了團隊選拔，但這個過程現在已經拖了一個半月了。例如，我曾與一個團隊匹配，但招聘人員花了這麼長時間與法律團隊聯繫移民事宜，以至於該團隊轉而選擇另一位候選人。招聘人員現在要花好幾天的時間來回復郵件，並且花了好幾周的時間才從與我有過介紹的其他團隊那裡得到反饋。<p>我很想為這家公司工作，但這已經到了荒謬的地步。如果有任何建議，我將不勝感激。我已經考慮給最初的招聘人員發一封郵件，問他是否可以看看發生了什麼。\n"
}