{
  "@type": "NewsArticle",
  "identifier": "2022--06--30--en--askhn--HackerNews--NewsArticle--31938225",
  "url": "https://news.ycombinator.com/item?id=31938225",
  "headline": "Ask HN: Are longer pitch-letters sometimes better than short ones?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN!<p>I'm trying to help my wife secure some funding for her Ph.D. research. Right now she is splitting time between her funded project, and the project she came here to work on, (one is cell bio/tissue growth, the other is space medicine/space physiology). They are both interesting, but very different, and she ends up losing a lot of energy shifting gears between the two.<p>The space research is what she is trying to fund, and I suggested that she try the Musk Foundation, as she spent some time working at SpaceX before coming here. Her research is also very relevant to their long term goals, and ticks quite a few of Musk's philosophical boxes.<p>After about a year of waiting for her to find the time, I decided to go ahead and draft a proposal for her, haha. It went well and she and her advisor both like it, but we can't decide on length. We have a single-page version and a four-page version. They both read like letters, but the four page version looks more like a research paper and includes some figures and tables.<p>The single page is very good for the length, but it's a complex topic, and we have no idea what the readers background might be...not much info out there on the Musk Foundation. For that reason, I think the four pager is much stronger, and the first page of it is compelling, but will anyone read it at that length? I don't have much experience pitching like this, and would greatly appreciate any advice from the community.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "eluctari",
    "url": "https://news.ycombinator.com/user?id=eluctari"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31938225",
  "sameAs": "https://news.ycombinator.com/item?id=31938225",
  "dateCreated": "2022-06-30T20:46:12.201Z",
  "datePublished": "2022-06-30T20:34:45.000Z",
  "dateModified": "2022-06-30T20:46:12.201Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 长的推销信有时比短的好吗？\n",
  "headline_zh-Hant": "Ask HN: 長的推銷信有時比短的好嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN！<p>我正试图帮助我妻子为她的博士研究争取一些资金。现在，她在她的资助项目和她来这里工作的项目之间分配时间，（一个是细胞生物/组织生长，另一个是空间医学/空间生理学）。这两个项目都很有趣，但又非常不同，她最终在这两个项目之间转换了很多精力。<p>太空研究是她试图资助的项目，我建议她试试马斯克基金会，因为她来这里之前在SpaceX工作过一段时间。她的研究也与他们的长期目标非常相关，并且符合马斯克的一些哲学观点。<p>在等待她找到时间的大约一年后，我决定去为她起草一份提案，哈哈。它很顺利，她和她的顾问都喜欢它，但我们无法决定长度。我们有一个单页的版本和一个四页的版本。两者读起来都像信件，但四页版看起来更像研究论文，还包括一些数字和表格。<p>单页版的长度非常好，但这是一个复杂的话题，我们不知道读者的背景可能是什么......外面关于马斯克基金会的信息不多。出于这个原因，我认为四页纸更有说服力，它的第一页就很有说服力，但这么长的文章会有人看吗？我没有很多这样的投稿经验，因此非常感谢社区的任何建议。\n",
  "description_zh-Hant": "嗨，HN！<p>我正試圖幫助我妻子為她的博士研究爭取一些資金。現在，她在她的資助項目和她來這裡工作的項目之間分配時間，（一個是細胞生物/組織生長，另一個是空間醫學/空間生理學）。這兩個項目都很有趣，但又非常不同，她最終在這兩個項目之間轉換了很多精力。<p>太空研究是她試圖資助的項目，我建議她試試馬斯克基金會，因為她來這裡之前在SpaceX工作過一段時間。她的研究也與他們的長期目標非常相關，並且符合馬斯克的一些哲學觀點。<p>在等待她找到時間的大約一年後，我決定去為她起草一份提案，哈哈。它很順利，她和她的顧問都喜歡它，但我們無法決定長度。我們有一個單頁的版本和一個四頁的版本。兩者讀起來都像信件，但四頁版看起來更像研究論文，還包括一些數字和表格。<p>單頁版的長度非常好，但這是一個複雜的話題，我們不知道讀者的背景可能是什麼......外面關於馬斯克基金會的信息不多。出於這個原因，我認為四頁紙更有說服力，它的第一頁就很有說服力，但這麼長的文章會有人看嗎？我沒有很多這樣的投稿經驗，因此非常感謝社區的任何建議。\n"
}