{
  "@type": "NewsArticle",
  "identifier": "2022--04--26--en--askhn--HackerNews--NewsArticle--31166622",
  "url": "https://news.ycombinator.com/item?id=31166622",
  "headline": "Ask HN: Low confidence in tech discussions, or impostor syndrome?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Participation in technical discussion can be hard, and frankly I feel that I've lost my confidence over the last year.  (Possibly a covid/remote effect, but not my main aim with this question.)  Depending on the topic or scope, such discourse can cover a lot of a tech stack and/or functional ground.  I feel as if I've lost a large degree of confidence in simply participating in discussion, and for myself approaching mid-career it's both troubling and humbling.  I hope to ASK-HN a discussion or hear people's perspectives.<p>In the moment: during discussions of late I've become severely hesitant to chime in, either through uncertainty or general lack of confidence about how my three cents (inflation) will fit within the discourse.  I have observed and generalized a few (of my own) causes:<p>- The need to be precise+accurate with any statement.  (A dysfunctional workplace will not leave room for self-effacing behavior.  But there's still a self check of &quot;is what I'm about to say correct or additive ... enough?&quot;)\n- Missing half a sentence and suddenly I'm permanently behind the topic track.\n- Or it seems that everyone else is speaking with such confidence that everyone already commands an extra layer/depth of understanding on the subject matter, and I'm a fish out of water.\n- And I've noticed a follow-on effect after someone has added to the conversation, because that addition to the discourse may seem &quot;obvious&quot; to me, that I'll either enter a self-bullying spiral of &quot;why couldn't you have said that because you already knew it&quot; or &quot;well this discussion is full of people stating the obvious, you are allowed to mentally check out now.&quot;<p>Did you know that Holden Caufield is actually a JS developer in the year 2022?!  I would like to opine that this is appreciably different from impostor syndrome.  (Though I do believe it's real and enjoy any related posts, recently [1].)  And it's because there's always code to 'retreat' to, because it's the 'real' work and because code is altogether a product/craft/skill/ground-truth/machine and related discussion will always feel subordinate.  Or it seems easier to effect the team with a confluence/wiki page (which can contain code snippets).  In no way do I think this is correct or healthy, but it's so easy to slip into a mode of 'retreat to the code', and it can be speciously validated that it's &quot;going back to where things matter.&quot;<p>Just as beer is the social lubricant, I'm looking for my 'professional beer'.  Obviously not a cure-all pill, but how to ease some accumulated inhibitions, and participate in technical discussion without having to worry about the act of participating.  I'm curious to hear anyone's experience or journey especially in the realm of technology and software jobs and roles.<p>[1] https://news.ycombinator.com/item?id=31129716",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "yamoriyamori",
    "url": "https://news.ycombinator.com/user?id=yamoriyamori"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31166622",
  "sameAs": "https://news.ycombinator.com/item?id=31166622",
  "dateCreated": "2022-04-26T13:05:24.928Z",
  "datePublished": "2022-04-26T12:27:16.000Z",
  "dateModified": "2022-04-26T13:05:24.928Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在技术讨论中信心不足，还是冒名顶替者综合症？",
  "headline_zh-Hant": "Ask HN: 在技術討論中信心不足，還是冒名頂替者綜合症？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "参与技术讨论可能很困难，坦率地说，我觉得在过去一年中我已经失去了信心。 (可能是covid/remote的影响，但不是我提出这个问题的主要目的。)根据不同的主题或范围，这种讨论可以涵盖很多技术栈和/或功能地面。 我觉得我已经失去了很大程度上参与讨论的信心，对于即将进入职业生涯中期的我来说，这既令人不安又令人惭愧。 我希望能在讨论中听取人们的观点。<p>当下：在最近的讨论中，我变得非常犹豫不决，要么是由于不确定，要么是对我的三分钱（通货膨胀）如何融入讨论中缺乏信心。 我观察并归纳了一些（我自己的）原因：<p>- 任何陈述都需要精确+准确。 (一个功能失调的工作场所不会为自我放松的行为留下空间。 但还是要自我检查一下&quot;我要说的是正确的还是补充的......够不够？&quot;)\n- 错过了半句话，突然间我就永久地落后于主题轨道了。\n- 或者，似乎其他人都说得很有信心，每个人都已经对这个主题有了额外的一层/深入的理解，而我就像一条离水的鱼。\n- 我注意到，在有人对谈话进行补充后，会产生一种后续效应，因为对话语的补充对我来说可能是显而易见的，我要么进入一个自我欺凌的漩涡：&quot;你为什么不说，因为你已经知道了&quot;或者&quot;好吧，这个讨论充满了人们对显而易见问题的陈述，你现在可以在精神上退场了。 我想说的是，这与冒名顶替者综合症有明显的不同。 (尽管我相信它是真实的，并喜欢任何相关的帖子，最近[1]。)而这是因为总是有代码可以 \"撤退\"，因为它是 \"真正的 \"工作，因为代码完全是一个产品/工艺/技能/基础真理/机器，相关的讨论总是会感到从属的。 或者说，用一个汇流/维基页面（可以包含代码片段）来影响团队似乎更容易。 我不认为这是正确或健康的，但它很容易陷入 \"退回到代码中 \"的模式，而且可以似是而非地验证它是&quot;回到重要的地方。<p>就像啤酒是社交润滑剂一样，我正在寻找我的 \"专业啤酒\"。 显然，这不是万能药，但如何缓解一些积累的禁忌，并参与技术讨论而不必担心参与的行为。 我很想听听大家的经验或历程，特别是在技术和软件工作和角色领域。<p>[1] https://news.ycombinator.com/item?id=31129716",
  "description_zh-Hant": "參與技術討論可能很困難，坦率地說，我覺得在過去一年中我已經失去了信心。 (可能是covid/remote的影響，但不是我提出這個問題的主要目的。)根據不同的主題或範圍，這種討論可以涵蓋很多技術棧和/或功能地面。 我覺得我已經失去了很大程度上參與討論的信心，對於即將進入職業生涯中期的我來說，這既令人不安又令人慚愧。 我希望能在討論中聽取人們的觀點。<p>當下：在最近的討論中，我變得非常猶豫不決，要麼是由於不確定，要麼是對我的三分錢（通貨膨脹）如何融入討論中缺乏信心。 我觀察並歸納了一些（我自己的）原因：<p>- 任何陳述都需要精確+準確。 (一個功能失調的工作場所不會為自我放鬆的行為留下空間。 但還是要自我檢查一下&quot;我要說的是正確的還是補充的......夠不夠？&quot;)\n- 錯過了半句話，突然間我就永久地落後於主題軌道了。\n- 或者，似乎其他人都說得很有信心，每個人都已經對這個主題有了額外的一層/深入的理解，而我就像一條離水的魚。\n- 我注意到，在有人對談話進行補充後，會產生一種後續效應，因為對話語的補充對我來說可能是顯而易見的，我要麼進入一個自我欺凌的漩渦：&quot;你為什麼不說，因為你已經知道了&quot;或者&quot;好吧，這個討論充滿了人們對顯而易見問題的陳述，你現在可以在精神上退場了。 我想說的是，這與冒名頂替者綜合症有明顯的不同。 (儘管我相信它是真實的，並喜歡任何相關的帖子，最近[1]。)而這是因為總是有代碼可以 \"撤退\"，因為它是 \"真正的 \"工作，因為代碼完全是一個產品/工藝/技能/基礎真理/機器，相關的討論總是會感到從屬的。 或者說，用一個匯流/維基頁面（可以包含代碼片段）來影響團隊似乎更容易。 我不認為這是正確或健康的，但它很容易陷入 \"退回到代碼中 \"的模式，而且可以似是而非地驗證它是&quot;回到重要的地方。<p>就像啤酒是社交潤滑劑一樣，我正在尋找我的 \"專業啤酒\"。 顯然，這不是萬能藥，但如何緩解一些積累的禁忌，並參與技術討論而不必擔心參與的行為。 我很想聽聽大家的經驗或歷程，特別是在技術和軟件工作和角色領域。<p>[1] https://news.ycombinator.com/item?id=31129716"
}