{
  "@type": "NewsArticle",
  "identifier": "2022--04--27--en--askhn--HackerNews--NewsArticle--31180440",
  "url": "https://news.ycombinator.com/item?id=31180440",
  "headline": "Ask HN: Can We Improve Video Conference Audio",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Video conference audio is terrible when half the team is in the same room watching on their laptops.  Can we improve this by getting all the devices working together on audio?<p>Proposal:\n1.  Discover other meeting participants in the room using audio signals:  Every laptop pings for other laptops in the room using a brief audio signal or short musical charm.  (I imagine this is similar to balancing a new surround sound system at home, but faster and less intrusive)<p>2. Determine potential audio interaction from each participant machine.  Using these audio pings, each device is spatially located and the relative impact for feedback to other local devices is determined.<p>3. Automatically manage microphone and speaker volumes for individual participation and reduced feedback in the conference room.  Individual laptop microphones activate when a room participant talks while nearby microphones and speakers automatically mute.<p>4. Use audio input local to the conference room participant for improved audio quality.  The best microphone is the one closest to the participant and it should be used whenever possible.<p>What other specs and features are necessary?<p>How do we get Teams, Zoom, WebEx, etc… to invest and adopt this technology?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "el_don_almighty",
    "url": "https://news.ycombinator.com/user?id=el_don_almighty"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31180440",
  "sameAs": "https://news.ycombinator.com/item?id=31180440",
  "dateCreated": "2022-04-27T14:49:56.253Z",
  "datePublished": "2022-04-27T14:38:21.000Z",
  "dateModified": "2022-04-27T14:49:56.253Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们能否改进视频会议音频",
  "headline_zh-Hant": "Ask HN: 我們能否改進視頻會議音頻",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "当一半的团队在同一个房间里用笔记本电脑观看时，视频会议的音频很糟糕。 我们能不能通过让所有设备一起进行音频工作来改善这个问题？<p>建议。\n1.  使用音频信号发现房间里的其他会议参与者。 每台笔记本电脑使用一个简短的音频信号或简短的音乐魅力，为房间里的其他笔记本电脑打招呼。 (我想象这类似于在家里平衡一个新的环绕声系统，但速度更快，干扰性更小）<p>2.确定每个与会者机器的潜在音频互动。 使用这些音频ping，每个设备的空间定位，并确定对其他本地设备反馈的相对影响。 <p>3.自动管理麦克风和扬声器音量，以便个人参与并减少会议室的反馈。 当会议室参与者交谈时，个别笔记本电脑麦克风会启动，而附近的麦克风和扬声器会自动静音。 <p>4.使用会议室参与者的本地音频输入，以提高音频质量。 最好的麦克风是离与会者最近的麦克风，应尽可能使用它。<p>还有哪些规格和功能是必要的？<p>我们如何让Teams、Zoom、WebEx等公司投资并采用这种技术？",
  "description_zh-Hant": "當一半的團隊在同一個房間裡用筆記本電腦觀看時，視頻會議的音頻很糟糕。 我們能不能通過讓所有設備一起進行音頻工作來改善這個問題？<p>建議。\n1.  使用音頻信號發現房間裡的其他會議參與者。 每檯筆記本電腦使用一個簡短的音頻信號或簡短的音樂魅力，為房間裡的其他筆記本電腦打招呼。 (我想象這類似於在家裡平衡一個新的環繞聲系統，但速度更快，干擾性更小）<p>2.確定每個與會者機器的潛在音頻互動。 使用這些音頻ping，每個設備的空間定位，並確定對其他本地設備反饋的相對影響。 <p>3.自動管理麥克風和揚聲器音量，以便個人參與並減少會議室的反饋。 當會議室參與者交談時，個別筆記本電腦麥克風會啟動，而附近的麥克風和揚聲器會自動靜音。 <p>4.使用會議室參與者的本地音頻輸入，以提高音頻質量。 最好的麥克風是離與會者最近的麥克風，應儘可能使用它。<p>還有哪些規格和功能是必要的？<p>我們如何讓Teams、Zoom、WebEx等公司投資並採用這種技術？"
}