{
  "@type": "NewsArticle",
  "identifier": "2022--07--06--en--askhn--HackerNews--NewsArticle--32004629",
  "url": "https://news.ycombinator.com/item?id=32004629",
  "headline": "Ask HN: Have you noticed an increase of spam evading Gmail's filters recently?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've had a Gmail account since the service was in its early beta and you could get one by invitation only.<p>That was nearly 20 years ago. Over the years, the number of messages in my Spam folder grew constantly - last year, for example, there were some 1,000 messages there, waiting for auto-deletion. I didn't care, as I very seldom saw one in my inbox.<p>Something must have changed in the past months. Now I'm getting 3-4 messages per day and those messages are very obvious spams, that even a primitive mid-Nineties filter would have caught. I keep reporting them as spam, but nothing changes - I get the same messages the next day. Even more infuriating, they seem to be emanating from the same bot, as they arrive in my inbox between at ~10am PDT, ~12pm PDT and ~3pm PDT each and every day.<p>How is is possible for Google's excellent (until now) spam fighting system to miss out on those ones?! I'm reluctant to copy'n'paste some fragments here, as they're so spammy that HN's own filter would be triggered and my message would go straight to HN's purgatory - but, please, believe me when I say they're in the spammiest format one can imagine.<p>Any explanation?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "supermatou",
    "url": "https://news.ycombinator.com/user?id=supermatou"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32004629",
  "sameAs": "https://news.ycombinator.com/item?id=32004629",
  "dateCreated": "2022-07-06T18:31:55.836Z",
  "datePublished": "2022-07-06T18:06:30.000Z",
  "dateModified": "2022-07-06T18:31:55.836Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 你是否注意到最近躲避Gmail过滤器的垃圾邮件有所增加？\n",
  "headline_zh-Hant": "Ask HN: 你是否注意到最近躲避Gmail過濾器的垃圾郵件有所增加？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我有一个Gmail账户，因为该服务处于早期测试阶段，你只能通过邀请获得一个账户。<p>那是近20年前。多年来，我的垃圾邮件文件夹中的邮件数量不断增加--例如，去年，那里有大约1,000封邮件，等待自动删除。我并不在意，因为我很少在收件箱中看到邮件。<p>在过去的几个月中，一定发生了一些变化。现在我每天收到3-4条信息，这些信息都是非常明显的垃圾邮件，即使是九十年代中期的原始过滤器也会发现。我一直把它们报告为垃圾邮件，但没有变化--第二天我又收到同样的信息。更令人气愤的是，它们似乎来自同一个机器人，因为它们每天都在太平洋时间上午10点、下午12点和下午3点之间到达我的收件箱。<p>谷歌优秀的（直到现在）垃圾邮件防治系统怎么可能漏掉这些邮件？我不愿意在这里复制'n'paste一些片段，因为它们是如此的垃圾，以至于HN自己的过滤器会被触发，我的信息会直接进入HN的炼狱--但是，请相信我，当我说它们是最垃圾的格式，你可以想象。\n",
  "description_zh-Hant": "我有一個Gmail賬戶，因為該服務處於早期測試階段，你只能通過邀請獲得一個賬戶。<p>那是近20年前。多年來，我的垃圾郵件文件夾中的郵件數量不斷增加--例如，去年，那裡有大約1,000封郵件，等待自動刪除。我並不在意，因為我很少在收件箱中看到郵件。<p>在過去的幾個月中，一定發生了一些變化。現在我每天收到3-4條信息，這些信息都是非常明顯的垃圾郵件，即使是九十年代中期的原始過濾器也會發現。我一直把它們報告為垃圾郵件，但沒有變化--第二天我又收到同樣的信息。更令人氣憤的是，它們似乎來自同一個機器人，因為它們每天都在太平洋時間上午10點、下午12點和下午3點之間到達我的收件箱。<p>谷歌優秀的（直到現在）垃圾郵件防治系統怎麼可能漏掉這些郵件？我不願意在這裡複製'n'paste一些片段，因為它們是如此的垃圾，以至於HN自己的過濾器會被觸發，我的信息會直接進入HN的煉獄--但是，請相信我，當我說它們是最垃圾的格式，你可以想象。\n"
}