{
  "@type": "NewsArticle",
  "identifier": "2022--07--29--en--askhn--HackerNews--NewsArticle--32276844",
  "url": "https://news.ycombinator.com/item?id=32276844",
  "headline": "Ask HN: Possible to work in “managerial” roles part time?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi all,<p>I'm currently deciding between doing my PhD in an unrelated field or starting a career in software engineering (currently interviewing with 2 large European startups that seem to have a great work culture.)<p>One of the biggest advantages of working in software for me would be the possibility to work 4 day weeks (32 hours) and still make a decent living. I'm not super passionate about it so I would see a career in the field more as a means to an end. After a few years, I would like to work in a more people-oriented position.<p>1. Are those goals (working 4 day weeks and working in a &quot;managerial&quot; position) mutually exclusive? Wouldn't a company expect it's &quot;higher ups&quot; to commit full time to their work? I.e. is there a glass ceiling in terms of salary/title for people who don't work at least full time?<p>2. I like going to the office regularly but I also LOVE the idea of working remotely for a long period, say 1-2 months every summer (currently doing it and it's amazing.) I'm sure it would be possible for a dev role, but does the same apply to a position like engineering manager?<p>3. I would also be interested in taking extended sabbaticals now and then (like unpaid time off.) I would imagine that would not be possible once you have a lot of responsibility at a company, except inbetween jobs?<p>I understand that a lot of these are absolute first-world problems. I'm just trying to weigh the pros and cons between tech and academia as accurately as possible. Thank you for any input!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mahathu",
    "url": "https://news.ycombinator.com/user?id=mahathu"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32276844",
  "sameAs": "https://news.ycombinator.com/item?id=32276844",
  "dateCreated": "2022-07-29T14:26:36.657Z",
  "datePublished": "2022-07-29T13:50:06.000Z",
  "dateModified": "2022-07-29T14:26:36.657Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 是否有可能从事 \"管理 \"角色的兼职工作？\n",
  "headline_zh-Hant": "Ask HN: 是否有可能從事 \"管理 \"角色的兼職工作？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>我目前正在决定是在一个不相关的领域攻读博士学位，还是在软件工程领域开始职业生涯（目前正在面试两家大型欧洲初创公司，它们似乎有很好的工作文化。）<p>对我来说，从事软件工作的最大优势之一是可以每周工作4天（32小时），但仍然可以获得体面的收入。我对这个行业并不热衷，所以我把这个领域的职业更多的看作是一种手段。几年后，我希望能在一个更加以人为本的岗位上工作。这些目标（每周工作4天和在管理岗位上工作）是否相互排斥？难道公司不希望它的高层人员全身心地投入到工作中吗？<p>2.我喜欢定期去办公室，但我也喜欢长期远程工作的想法，比如每年夏天工作1-2个月（目前正在做，非常棒）。 我相信这对开发角色来说是可行的，但这同样适用于工程经理这样的职位吗？ <p>3.我还想偶尔延长休假时间（比如无薪休假）。我想，一旦你在公司承担了很多责任，这就不可能了，除非是在工作的间隙？我只是想尽可能准确地权衡科技界和学术界的利与弊。谢谢你的任何意见!\n",
  "description_zh-Hant": "大家好，<p>我目前正在決定是在一個不相關的領域攻讀博士學位，還是在軟件工程領域開始職業生涯（目前正在面試兩家大型歐洲初創公司，它們似乎有很好的工作文化。）<p>對我來說，從事軟件工作的最大優勢之一是可以每週工作4天（32小時），但仍然可以獲得體面的收入。我對這個行業並不熱衷，所以我把這個領域的職業更多的看作是一種手段。幾年後，我希望能在一個更加以人為本的崗位上工作。這些目標（每週工作4天和在管理崗位上工作）是否相互排斥？難道公司不希望它的高層人員全身心地投入到工作中嗎？<p>2.我喜歡定期去辦公室，但我也喜歡長期遠程工作的想法，比如每年夏天工作1-2個月（目前正在做，非常棒）。 我相信這對開發角色來說是可行的，但這同樣適用於工程經理這樣的職位嗎？ <p>3.我還想偶爾延長休假時間（比如無薪休假）。我想，一旦你在公司承擔了很多責任，這就不可能了，除非是在工作的間隙？我只是想盡可能準確地權衡科技界和學術界的利與弊。謝謝你的任何意見!\n"
}