{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--askhn--HackerNews--NewsArticle--32292371",
  "url": "https://news.ycombinator.com/item?id=32292371",
  "headline": "Ask HN: Perspectives for Ukrainian programmer coming to US as a war refugee?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello,<p>I'm from Ukraine and my town Mariupol has been destroyed. I escaped to Russia and now I'm looking for a place to live and rebuild my life. A good friend agreed to sponsor me and my parents via a Uniting for Ukraine program, so that we can come and stay in US for 2 years that the program covers.<p>Considering that USA has huge tech market, it seems like a great proposition career wise, plus I know English already. But I worry about perspectives of such move. Will companies want to hire me knowing that my status is temporary and quite short at that (2 years)? Even if company likes me and is ready to propose a work visa it looks like there is a high chance that I don't get the visa. Then what, the end? I go home (to the ruins of it) at the end of 2 years? Is there a path towards longer-term US residence?<p>Plus, I worry about EAD work authorization with wait times around 6-9 months, which will make it difficult to sustain ourselves during that time. I'm not very clear about possible government assistance and the extend of it. Some of my friends say that going to US is not worth it in my circumstances, and some say that it's easier to figure things out being there and that 'you'll find the way', like build a case for different immigration status or marry, heh. I'm pretty sad and overwhelmed due to the war and my circumstances, I'm looking everywhere, so I wanted to ask HN opinion about perspectives of going to US to try and build new life there.<p>Michael",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "arifmeticus",
    "url": "https://news.ycombinator.com/user?id=arifmeticus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32292371",
  "sameAs": "https://news.ycombinator.com/item?id=32292371",
  "dateCreated": "2022-07-31T02:37:09.179Z",
  "datePublished": "2022-07-31T01:47:29.000Z",
  "dateModified": "2022-07-31T02:37:09.179Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 作为战争难民来到美国的乌克兰程序员的前景如何？\n",
  "headline_zh-Hant": "Ask HN: 作為戰爭難民來到美國的烏克蘭程序員的前景如何？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，<p>我来自乌克兰，我的城市马里乌波尔已被摧毁。我逃到了俄罗斯，现在我正在寻找一个可以居住和重建生活的地方。一个好朋友同意通过 \"团结为乌克兰 \"项目资助我和我的父母，这样我们就可以来美国呆两年，该项目涵盖的时间。<p>考虑到美国有巨大的科技市场，从职业角度来看，这似乎是一个很好的提议，再加上我已经懂得英语。但我担心这样做的前景。公司是否愿意雇用我，因为我的身份是临时的，而且时间很短（2年）？即使公司喜欢我并准备提出工作签证，看起来我也有很大的可能得不到签证。然后呢，结束了吗？我在两年结束时回家（到废墟中）？是否有一条通往长期美国居留的道路？<p>此外，我担心EAD工作许可的等待时间约为6-9个月，这将使我们在这段时间内难以维持生计。我不太清楚可能的政府援助和它的范围。我的一些朋友说，在我这样的情况下，去美国不值得，有些人说，在那里更容易想出办法，\"你会找到办法的\"，比如建立一个不同的移民身份或结婚，呵呵。由于战争和我的处境，我非常伤心和不知所措，我到处寻找，所以我想问问HN对去美国尝试在那里建立新生活的看法。\n",
  "description_zh-Hant": "你好，<p>我來自烏克蘭，我的城市馬裡烏波爾已被摧毀。我逃到了俄羅斯，現在我正在尋找一個可以居住和重建生活的地方。一個好朋友同意通過 \"團結為烏克蘭 \"項目資助我和我的父母，這樣我們就可以來美國呆兩年，該項目涵蓋的時間。<p>考慮到美國有巨大的科技市場，從職業角度來看，這似乎是一個很好的提議，再加上我已經懂得英語。但我擔心這樣做的前景。公司是否願意僱用我，因為我的身份是臨時的，而且時間很短（2年）？即使公司喜歡我並準備提出工作簽證，看起來我也有很大的可能得不到簽證。然後呢，結束了嗎？我在兩年結束時回家（到廢墟中）？是否有一條通往長期美國居留的道路？<p>此外，我擔心EAD工作許可的等待時間約為6-9個月，這將使我們在這段時間內難以維持生計。我不太清楚可能的政府援助和它的範圍。我的一些朋友說，在我這樣的情況下，去美國不值得，有些人說，在那裡更容易想出辦法，\"你會找到辦法的\"，比如建立一個不同的移民身份或結婚，呵呵。由於戰爭和我的處境，我非常傷心和不知所措，我到處尋找，所以我想問問HN對去美國嘗試在那裡建立新生活的看法。\n"
}