{
  "@type": "NewsArticle",
  "identifier": "2022--07--06--en--askhn--HackerNews--NewsArticle--31995921",
  "url": "https://news.ycombinator.com/item?id=31995921",
  "headline": "Ask HN: What alternatives are there to Reddit? Mods have ruined the site",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So, I am trying to find a good alternative to reddit. Reddit used to be good, but it is clear that the admins and mods have ruined the website.<p>Mods regularly abuse their modding powers by deleting posts they don't like (regardless of what the rules say) or ban those they disagree with. It is so common that it is practically a meme at this point.<p>Automod is also abused and is overused and has restrictions often set too high. See subs like unpopularopinion for an example like that. Practically every post onto that sub is removed automatically.<p>I've also even seen automods ban users who dare post on a sub that some mod doesn't like. Completely childish.<p>Admins are part of the problem as well. As they seem to both encourage this behavior from the mods and also make it impossible for users to have any recourse against an abusive mod.<p>All this leads to what I would call an unusable site for any meaningful discussion. It simply turns into a website that is an echo chamber for the mods of that sub.<p>With that said, I think reddit COULD be good if the mods weren't such an issue.<p>Are their any good alternatives to reddit at this point? That provide the same sizable community where you can discuss and share ideas on different topics without abusive mods, groupthink downvoting, or other issues?<p>It just seems like on the one side, you have reddit. On the other extreme side, you have sites like 4chan. It would be nice to have some site where you can have meaningful discussions without openly being called the &quot;N-word&quot; (4chan) every other post, but at the same time not banned or censored every second you disagree with the mods or admins (reddit).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "abcdjdjd",
    "url": "https://news.ycombinator.com/user?id=abcdjdjd"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31995921",
  "sameAs": "https://news.ycombinator.com/item?id=31995921",
  "dateCreated": "2022-07-06T02:35:34.388Z",
  "datePublished": "2022-07-06T01:54:24.000Z",
  "dateModified": "2022-07-06T02:35:34.388Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: Reddit有什么替代品？版主们已经毁了这个网站\n",
  "headline_zh-Hant": "Ask HN: Reddit有什麼替代品？版主們已經毀了這個網站\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "因此，我正试图找到一个替代Reddit的好办法。Reddit曾经很好，但很明显，管理员和mods已经毁了这个网站。<p>mods经常滥用他们的modd权力，删除他们不喜欢的帖子（不管规则怎么说）或禁止他们不同意的人。这是很常见的，在这一点上，它实际上是一个备忘录。<p>自动模式也被滥用，被过度使用，而且限制往往设置得太高。请看像unpopularopinion这样的子目录，就是这样的例子。<p>我甚至看到自动模式禁止那些敢于在某个模式不喜欢的子版块上发帖的用户。完全幼稚。<p>管理员也是问题的一部分。因为他们似乎既鼓励模版的这种行为，也使用户无法对滥用模版的人进行任何追索。<p>所有这些导致了我称之为一个无法使用的网站，无法进行任何有意义的讨论。<p>说到这里，我认为如果mods不是这样的问题，reddit可能会很好。<p>在这一点上，reddit有什么好的替代品吗？在这里，你可以讨论和分享关于不同主题的想法，而不会出现滥用模版、群体思维和降级投票或其他问题。在另一个极端的方面，你有像4chan这样的网站。如果有这样一个网站，你可以进行有意义的讨论，而不至于每隔一个帖子就被公开叫作&quot;N-word&quot;（4chan），但同时又不会在你不同意版主或管理员的意见时被禁止或审查（reddit），那就更好了。\n",
  "description_zh-Hant": "因此，我正試圖找到一個替代Reddit的好辦法。Reddit曾經很好，但很明顯，管理員和mods已經毀了這個網站。<p>mods經常濫用他們的modd權力，刪除他們不喜歡的帖子（不管規則怎麼說）或禁止他們不同意的人。這是很常見的，在這一點上，它實際上是一個備忘錄。<p>自動模式也被濫用，被過度使用，而且限制往往設置得太高。請看像unpopularopinion這樣的子目錄，就是這樣的例子。<p>我甚至看到自動模式禁止那些敢於在某個模式不喜歡的子版塊上發帖的用戶。完全幼稚。<p>管理員也是問題的一部分。因為他們似乎既鼓勵模版的這種行為，也使用戶無法對濫用模版的人進行任何追索。<p>所有這些導致了我稱之為一個無法使用的網站，無法進行任何有意義的討論。<p>說到這裡，我認為如果mods不是這樣的問題，reddit可能會很好。<p>在這一點上，reddit有什麼好的替代品嗎？在這裡，你可以討論和分享關於不同主題的想法，而不會出現濫用模版、群體思維和降級投票或其他問題。在另一個極端的方面，你有像4chan這樣的網站。如果有這樣一個網站，你可以進行有意義的討論，而不至於每隔一個帖子就被公開叫作&quot;N-word&quot;（4chan），但同時又不會在你不同意版主或管理員的意見時被禁止或審查（reddit），那就更好了。\n"
}