{
  "@type": "NewsArticle",
  "identifier": "2022--06--24--en--askhn--HackerNews--NewsArticle--31869760",
  "url": "https://news.ycombinator.com/item?id=31869760",
  "headline": "Ask HN: How can we lay people off without cruelty?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, it’s bad out here and I need advice on the most humane way to lay people off. It’s more than half of the company, the company itself is small (less than 50 people) and very close. I’m the head of engineering, so I have a large share of those kind folks to let go. Literally I have to lay off friends.<p>I know we’re gonna do the basics as best we can of course: more than 2 months’ redundancy package, try and find roles for people as best we can, do the paperwork right so they can claim anything they need to.<p>I want to know your advice for the human element; how to tell people and not be cruel. How to balance that against honestly trying to save what we can.<p>Eg. I hate that when I read stories about layoffs it always comes as this awful surprise and then you have to immediately leave, it’s so abrupt how can you say goodbye properly? But that seems to be some protection against someone acting in a way they normally wouldn’t and doing something destructive in the heat of the moment. How can we possibly preserve both properties?<p>We want to tell people one-at-a-time and in-person. Is this best? Why do companies even mass-tell people? But then I don’t know how anyone can keep their composure going back to their desk to pick things up though... Quickly word would get out, diminishing the point of telling people one-at-a-time. Where to have these conversations is also an issue, the office is pretty small. And we need to have a lot of them in just a short time too.<p>It’s going to be awful regardless, but I would like any advice on how to make it the least awful. The least-awful, that is, for those who have to leave; since if I get the dubious privilege of riding the death spiral a bit longer then we can leave my own feelings out of this.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway345826",
    "url": "https://news.ycombinator.com/user?id=throwaway345826"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31869760",
  "sameAs": "https://news.ycombinator.com/item?id=31869760",
  "dateCreated": "2022-06-24T22:24:42.114Z",
  "datePublished": "2022-06-24T21:42:37.000Z",
  "dateModified": "2022-06-24T22:24:42.114Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们如何才能不残忍地裁员？\n",
  "headline_zh-Hant": "Ask HN: 我們如何才能不殘忍地裁員？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，这里的情况很糟糕，我需要咨询一下最人性化的裁员方式。这是公司一半以上的人，公司本身很小（不到50人），而且关系很密切。我是工程部的负责人，所以我有很大一部分要让那些善良的人离开。<p>我知道我们会尽可能地做一些基本的工作：超过2个月的裁员计划，尽可能地为人们找到工作，做好文书工作，这样他们就可以申请任何他们需要的东西。我讨厌当我读到关于裁员的故事时，它总是作为一个可怕的惊喜出现，然后你必须立即离开，这太突然了，你怎么能正确地说再见？但这似乎是对某人以他们通常不会采取的方式行事，并在紧急情况下做一些破坏性的事情的某种保护。我们怎么可能保留这两种属性呢？<p>我们想一次一次地、当面地告诉人们。这样做最好吗？为什么公司还要大规模地告诉人们？但是，我不知道谁能在回到自己的办公桌前取东西时保持镇定...... 消息很快就会传出去，这就削弱了一次一次告诉人们的意义。在哪里进行这些谈话也是一个问题，办公室非常小。我们也需要在短时间内进行大量的谈话。<p>无论如何，这都会很糟糕，但我希望得到任何关于如何让它变得最不糟糕的建议。对于那些不得不离开的人来说，就是最不可怕的；因为如果我有机会在死亡漩涡中多呆一会儿，那么我们就可以把我自己的感受排除在外。\n",
  "description_zh-Hant": "嗨，HN，這裡的情況很糟糕，我需要諮詢一下最人性化的裁員方式。這是公司一半以上的人，公司本身很小（不到50人），而且關係很密切。我是工程部的負責人，所以我有很大一部分要讓那些善良的人離開。<p>我知道我們會盡可能地做一些基本的工作：超過2個月的裁員計劃，儘可能地為人們找到工作，做好文書工作，這樣他們就可以申請任何他們需要的東西。我討厭當我讀到關於裁員的故事時，它總是作為一個可怕的驚喜出現，然後你必須立即離開，這太突然了，你怎麼能正確地說再見？但這似乎是對某人以他們通常不會採取的方式行事，並在緊急情況下做一些破壞性的事情的某種保護。我們怎麼可能保留這兩種屬性呢？<p>我們想一次一次地、當面地告訴人們。這樣做最好嗎？為什麼公司還要大規模地告訴人們？但是，我不知道誰能在回到自己的辦公桌前取東西時保持鎮定...... 消息很快就會傳出去，這就削弱了一次一次告訴人們的意義。在哪裡進行這些談話也是一個問題，辦公室非常小。我們也需要在短時間內進行大量的談話。<p>無論如何，這都會很糟糕，但我希望得到任何關於如何讓它變得最不糟糕的建議。對於那些不得不離開的人來說，就是最不可怕的；因為如果我有機會在死亡漩渦中多呆一會兒，那麼我們就可以把我自己的感受排除在外。\n"
}