{
  "@type": "NewsArticle",
  "identifier": "2022--07--26--en--askhn--HackerNews--NewsArticle--32240484",
  "url": "https://news.ycombinator.com/item?id=32240484",
  "headline": "Ask HN: Share your ISP horror stories. Here's mine",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This is a story about how I learned that free doesn't really mean free, and routers that aren't yours are exactly that. Not yours.<p>I'm not looking to drag my ISP through the dirt, as they're universally acclaimed to be bad service providers. I'm sharing my experience here to hear what others think, and to add to the dime of a dozen of other precautionary tales on the internet that maybe, just maybe, you don't need an app for that.<p>My ISP has an exclusivity contract with the company I rent a property from. The property comes with a preinstalled router. Upon moving into the property and attempting to transfer service, I was told that the preinstalled router was no longer supported. To resolve this, they provided the same model router that other customers rent in lieu of providing their own, free of charge. I was unbothered by this proposition, because my personal router was not compatible either. The replacement worked, had capabilities for local administration, and all the other typical features a router should have. Several months later, the ISP pushed a firmware update to the device that visually put a coat of paint on the admin portal. After some digging, I realized the remote administration page had been removed. I didn't see this as a problem at the time, as it was a feature I always had off, but found the ability to administrate the router remotely on their website. At first, it was simply the ability to reboot the device, but with time, more and more functionality was added to their website. This pattern continued for several more months until a tipping point was reached. Another firmware update was pushed that lobotomized the router's admin portal to nothing more than a way to look at data. The only functionality that remained was the ability to reboot the device. Changing WiFi passwords, port forwarding, disallowing clients, etc. It was all only available via their website. I was perturbed by this change, but it was their router, not mine. Thankfully, I still had all the capabilities the router originally provided (foreshadowing).<p>In this day and age, every company and their grandparents have an app. I'm no stranger to this concept, myself, having done lots of software development for mobile, web, and general computing environments. It came to no surprise when my ISP released an app that boasted the ability to do all the same operations the web interface provided. What would, however, was when the web portal was shut down, only displaying a splash page for the iOS and android apps. The app is now the only way to administrate the router.<p>That's when it struck me. My ISP expects their customers to have an internet connection to administrate the router. Customers setting up a new router or experiencing an outage are expected to have cellular data to do something as simple as change the WiFi password. I understand how ubiquitous cellphones and data plans are these days, but I personally see it as a failure for an ISP to require something like that.<p>I was now forced to migrate over to the app. I have an iPhone 6s with the most recent version of iOS. Perhaps some of you can correct me in the comments, but I do not consider that prehistoric. I sucked it up, downloaded the app, but the situation went from bad to abysmal. The app uses an integrated in app browser to authenticate, but the login portal it navigates to requires cookies to function. In short, I'm unable to use the app, so to me, the router was effectively turned into a modem. I purchased a new router, got it setup, and thus ends my tale.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ramity",
    "url": "https://news.ycombinator.com/user?id=ramity"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32240484",
  "sameAs": "https://news.ycombinator.com/item?id=32240484",
  "dateCreated": "2022-07-26T16:37:26.655Z",
  "datePublished": "2022-07-26T16:32:26.000Z",
  "dateModified": "2022-07-26T16:37:26.655Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 分享你的ISP恐怖故事。这是我的\n",
  "headline_zh-Hant": "Ask HN: 分享你的ISP恐怖故事。這是我的\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这是一个关于我如何了解免费并不真正意味着免费的故事，而不属于你的路由器正是如此。不是你的。<p>我不是想把我的ISP拖入泥潭，因为他们被普遍认为是糟糕的服务提供商。我在这里分享我的经验，是想听听别人的看法，并在互联网上其他一打的预防故事中补充说，也许，只是也许，你不需要一个应用程序。<p>我的ISP与我租的房子的公司有一个独家合同。该物业配有一个预装的路由器。当我搬进该房产并试图转移服务时，我被告知预装的路由器已不再支持。为了解决这个问题，他们提供了其他客户租用的相同型号的路由器，以代替提供自己的路由器，而且是免费的。我对这一提议并不感到困扰，因为我的个人路由器也不兼容。替换的路由器可以工作，具有本地管理的功能，以及一个路由器应该具有的所有其他典型功能。几个月后，ISP向该设备推送了一个固件更新，在管理门户上涂了一层油漆。经过一番调查，我发现远程管理页面已被删除。当时我不认为这是一个问题，因为这是我一直关闭的功能，但在他们的网站上发现了远程管理路由器的能力。起初，这只是重新启动设备的能力，但随着时间的推移，越来越多的功能被添加到他们的网站上。这种模式又持续了几个月，直到达到一个临界点。另一个固件更新被推送，使路由器的管理门户被切除，只剩下查看数据的方法。唯一保留的功能是重新启动设备的能力。改变WiFi密码、端口转发、禁止客户端等。这一切都只能通过他们的网站来实现。我对这种变化感到不安，但这是他们的路由器，不是我的。值得庆幸的是，我仍然拥有路由器最初提供的所有功能（预示）。<p>在这个时代，每个公司和他们的祖父母都有一个应用程序。我对这个概念并不陌生，我曾为移动、网络和一般的计算环境做过很多软件开发。当我的互联网公司发布了一个应用程序，吹嘘能够完成网络界面提供的所有相同操作时，这并不令人惊讶。然而，当网络门户被关闭，只显示一个iOS和android应用程序的闪亮页面时，就会出现这种情况。该应用程序现在是管理路由器的唯一途径。<p>这时我突然想到。我的 ISP 希望他们的客户有一个互联网连接来管理路由器。客户在设置新的路由器或遇到故障时，希望有手机数据来做一些像改变WiFi密码这样简单的事情。我理解如今手机和数据计划无处不在，但我个人认为，ISP要求这样做是一种失败。我有一部iPhone 6s，使用的是最新版本的iOS。也许你们中的一些人可以在评论中纠正我，但我不认为这是史前的。我吸了一口气，下载了这个应用程序，但情况却从糟糕到糟糕。该应用使用一个集成的应用内浏览器来验证，但它导航到的登录门户需要cookies才能发挥作用。简而言之，我无法使用该应用程序，所以对我来说，路由器实际上变成了一个调制解调器。我购买了一个新的路由器，把它设置好，我的故事就此结束。\n",
  "description_zh-Hant": "這是一個關於我如何瞭解免費並不真正意味著免費的故事，而不屬於你的路由器正是如此。不是你的。<p>我不是想把我的ISP拖入泥潭，因為他們被普遍認為是糟糕的服務提供商。我在這裡分享我的經驗，是想聽聽別人的看法，並在互聯網上其他一打的預防故事中補充說，也許，只是也許，你不需要一個應用程序。<p>我的ISP與我租的房子的公司有一個獨家合同。該物業配有一個預裝的路由器。當我搬進該房產並試圖轉移服務時，我被告知預裝的路由器已不再支持。為了解決這個問題，他們提供了其他客戶租用的相同型號的路由器，以代替提供自己的路由器，而且是免費的。我對這一提議並不感到困擾，因為我的個人路由器也不兼容。替換的路由器可以工作，具有本地管理的功能，以及一個路由器應該具有的所有其他典型功能。幾個月後，ISP向該設備推送了一個固件更新，在管理門戶上塗了一層油漆。經過一番調查，我發現遠程管理頁面已被刪除。當時我不認為這是一個問題，因為這是我一直關閉的功能，但在他們的網站上發現了遠程管理路由器的能力。起初，這只是重新啟動設備的能力，但隨著時間的推移，越來越多的功能被添加到他們的網站上。這種模式又持續了幾個月，直到達到一個臨界點。另一個固件更新被推送，使路由器的管理門戶被切除，只剩下查看數據的方法。唯一保留的功能是重新啟動設備的能力。改變WiFi密碼、端口轉發、禁止客戶端等。這一切都只能通過他們的網站來實現。我對這種變化感到不安，但這是他們的路由器，不是我的。值得慶幸的是，我仍然擁有路由器最初提供的所有功能（預示）。<p>在這個時代，每個公司和他們的祖父母都有一個應用程序。我對這個概念並不陌生，我曾為移動、網絡和一般的計算環境做過很多軟件開發。當我的互聯網公司發佈了一個應用程序，吹噓能夠完成網絡界面提供的所有相同操作時，這並不令人驚訝。然而，當網絡門戶被關閉，只顯示一個iOS和android應用程序的閃亮頁面時，就會出現這種情況。該應用程序現在是管理路由器的唯一途徑。<p>這時我突然想到。我的 ISP 希望他們的客戶有一個互聯網連接來管理路由器。客戶在設置新的路由器或遇到故障時，希望有手機數據來做一些像改變WiFi密碼這樣簡單的事情。我理解如今手機和數據計劃無處不在，但我個人認為，ISP要求這樣做是一種失敗。我有一部iPhone 6s，使用的是最新版本的iOS。也許你們中的一些人可以在評論中糾正我，但我不認為這是史前的。我吸了一口氣，下載了這個應用程序，但情況卻從糟糕到糟糕。該應用使用一個集成的應用內瀏覽器來驗證，但它導航到的登錄門戶需要cookies才能發揮作用。簡而言之，我無法使用該應用程序，所以對我來說，路由器實際上變成了一個調制解調器。我購買了一個新的路由器，把它設置好，我的故事就此結束。\n"
}