{
  "@type": "NewsArticle",
  "identifier": "2022--04--28--en--askhn--HackerNews--NewsArticle--31187447",
  "url": "https://news.ycombinator.com/item?id=31187447",
  "headline": "Ask HN: Is anyone else experiencing 'AI dread'?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "With the prospect of a 100T parameter GPT-4 looming on the horizon, likely happening this year, I've started to reflect on how we appear to be arriving at something of an endgame in technology and perhaps even societally. Given what GPT-3 was already capable of doing, GPT-4 can probably be expected to take things uncomfortably close to the asymptotic limit. And that foundation model will then feed into all kinds of other applications (e.g. Copilot on steroids).<p>Several of the people involved in developing transformers at Google Brain and others from Open AI + DeepMind have now migrated to a new company called Adept (https://www.adept.ai/), which is aiming to push as close as possible to AGI for essentially any computer use (RPA taken to its natural conclusion).<p>The robotics space is now saturated with competitors racing against one another. Some of them, such as Miso Robotics, have already reached meaningful adoption.<p>I find it odd that people are so worried about nuclear devastation, climate change, etc when what we really should be concerned about is impending societal collapse. It feels like the upper bound on time to functional obsolescence of the vast majority of humans is 10-15 years.<p>Does anyone else feel scared about the future? Does anyone even care? I can barely wrap my head around the moral implications here in deciding whether or not to have children, let alone all the things about our society that are liable to descend even further into chaos.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "rebelos",
    "url": "https://news.ycombinator.com/user?id=rebelos"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31187447",
  "sameAs": "https://news.ycombinator.com/item?id=31187447",
  "dateCreated": "2022-04-28T03:36:27.995Z",
  "datePublished": "2022-04-28T00:24:44.000Z",
  "dateModified": "2022-04-28T03:36:27.995Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 6
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 8
    }
  ],
  "headline_zh-Hans": "Ask HN: 还有人经历过 \"AI恐惧症 \"吗？",
  "headline_zh-Hant": "Ask HN: 還有人經歷過 \"AI恐懼症 \"嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "随着100吨参数的GPT-4的前景迫在眉睫，很可能在今年发生，我已经开始反思我们如何在技术上甚至在社会上似乎到达了某种终局。鉴于GPT-3已经能够做到的事情，GPT-4可能会使事情不自觉地接近渐近极限。<p>在谷歌大脑参与开发变压器的几个人和来自开放人工智能+DeepMind的其他人现在已经迁移到一家名为Adept的新公司（https://www.adept.ai/），该公司的目标是在任何计算机使用方面尽可能地接近AGI（RPA达到其自然结论）。<p>机器人领域现在已经饱和，竞争者相互竞争。其中一些，如Miso Robotics，已经达到了有意义的采用。<p>我觉得奇怪的是，人们如此担心核破坏、气候变化等问题，而我们真正应该关注的是即将到来的社会崩溃。感觉上，绝大多数人的功能被淘汰的时间上限是10-15年。<p>还有人对未来感到害怕吗？有没有人关心？我几乎无法理解在决定是否生孩子时的道德含义，更不用说我们社会中所有可能进一步陷入混乱的事情了。",
  "description_zh-Hant": "隨著100噸參數的GPT-4的前景迫在眉睫，很可能在今年發生，我已經開始反思我們如何在技術上甚至在社會上似乎到達了某種終局。鑑於GPT-3已經能夠做到的事情，GPT-4可能會使事情不自覺地接近漸近極限。<p>在谷歌大腦參與開發變壓器的幾個人和來自開放人工智能+DeepMind的其他人現在已經遷移到一家名為Adept的新公司（https://www.adept.ai/），該公司的目標是在任何計算機使用方面儘可能地接近AGI（RPA達到其自然結論）。<p>機器人領域現在已經飽和，競爭者相互競爭。其中一些，如Miso Robotics，已經達到了有意義的採用。<p>我覺得奇怪的是，人們如此擔心核破壞、氣候變化等問題，而我們真正應該關注的是即將到來的社會崩潰。感覺上，絕大多數人的功能被淘汰的時間上限是10-15年。<p>還有人對未來感到害怕嗎？有沒有人關心？我幾乎無法理解在決定是否生孩子時的道德含義，更不用說我們社會中所有可能進一步陷入混亂的事情了。"
}