{
  "@type": "NewsArticle",
  "identifier": "2022--07--12--en--askhn--HackerNews--NewsArticle--32076677",
  "url": "https://news.ycombinator.com/item?id=32076677",
  "headline": "Ask HN: Has anyone here worked on the Windows kernel?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Or any other kernel, professionally?<p>I've been offered a position at Microsoft to do kernel development work. This would be a big transition to me, coming from a services background (backend only).<p>The job's main draw to me is doing low-level work. I did some in my very first job, but for the past 10+ years, due to a number of circumstances, I've been in the services world. I really liked being a C programmer and I've kept an eye on things over the years, and did some hobby projects (on x86 and some embedded stuff as well).<p>There's a lot about my current job that I treasure, despite the work itself not being interesting to me about 99% of the time. It's a remote job, the work-life balance is stellar, and I get 25 days of vacation a year (this is in the US), which allows me to spend a lot of quality time with my wife.<p>However, I'm considering leaving because I've been having significant motivation and performance[0] issues for the last two years. Through a lot of soul searching and even help from a therapist, I've identified that the source of my issues is the nature of the work itself. Building services is just something that doesn't give me a sense of accomplishment, and I'm not attracted to the stuff at all. Some issues I've identified are:<p>1. Infrastructure complexity, especially since moving to Kubernetes. I refuse to touch it at this point.<p>2. Debugging exclusively via metrics and logs, since I can't just attach a debugger to a running server.<p>3. Designing systems in general. Some people love the challenge of distributed transactions, eventual consistency and all that jazz, but it just rubs my brain the wrong way. I'm not interested at all in that problem space [1].<p>4. The insane amount of work required to stand up even the smallest microservice: infrastructure provisioning, certificates, security reviews, GDPR compliance, etc.<p>5. Anything I build will end up paging some poor soul at 3am some day when something is down or under heavy traffic.<p>So, what I'm wondering is: what are the things that would make me say &quot;ugh&quot; on the day-to-day as a kernel developer? Is there a chance I'll be happier, or would I just be trading one miserable set of problems for other equally miserable problems?<p>I tried asking that to every person who interviewed me, but I only got somewhat vague answers like &quot;the build can take a long time depending on what you're doing&quot;, etc. Someone complained about windbg.<p>[0] Even though my reviews have been good, I know deep inside I'm not doing even 10% of the good work I could do before.<p>[1] Ironically, I've acquired a ton of knowledge about it and I'm one of the &quot;go to&quot; people within my org.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "maybekerneldev",
    "url": "https://news.ycombinator.com/user?id=maybekerneldev"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32076677",
  "sameAs": "https://news.ycombinator.com/item?id=32076677",
  "dateCreated": "2022-07-12T22:45:15.332Z",
  "datePublished": "2022-07-12T22:40:10.000Z",
  "dateModified": "2022-07-12T22:45:15.332Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 这里有人从事过Windows内核的工作吗？\n",
  "headline_zh-Hant": "Ask HN: 這裡有人從事過Windows內核的工作嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>我已经得到了微软的一个职位，从事内核开发工作。这对来自服务背景（仅有后端）的我来说将是一个很大的转变。<p>这份工作对我的主要吸引力是做低级别的工作。在我的第一份工作中，我做了一些工作，但在过去的10多年里，由于一些情况，我一直在服务领域工作。我真的很喜欢做C语言程序员，这些年来我一直在关注一些事情，并做了一些业余项目（在X86和一些嵌入式的东西上）。<p>尽管工作本身对我来说99%的时间都不感兴趣，但我现在的工作有很多地方是我所珍惜的。这是一份远程工作，工作与生活的平衡非常好，而且我每年有25天的假期（这是在美国），这使我能够与我的妻子度过很多高质量的时间。<p>然而，我正在考虑离开，因为在过去的两年里，我一直有重大的动机和绩效[0]问题。通过大量的反思，甚至在治疗师的帮助下，我发现我的问题的来源是工作本身的性质。建设服务只是一件不能给我带来成就感的事情，我对这些东西一点也不感兴趣。我发现的一些问题是：<p>1. 基础设施的复杂性，尤其是在转移到 Kubernetes 之后。<p>2.完全通过指标和日志进行调试，因为我不能将调试器连接到正在运行的服务器上。<p>3.设计一般的系统。有些人喜欢分布式事务的挑战，最终的一致性和所有这些爵士乐，但它只是让我的大脑感到不适。我对这个问题领域完全不感兴趣[1]。<p>4.即使是最小的微服务，也需要大量的工作：基础设施配置、证书、安全审查、GDPR合规等。<p>因此，我想知道的是：作为一名内核开发人员，有哪些事情会让我在日常工作中说 \"唉\"？<p>我试着向每个面试我的人询问这个问题，但我只得到了一些模糊的答案，比如说&quot;根据你正在做的事情，构建可能需要很长的时间&quot;等等。<p>[0] 尽管我的评论一直很好，但我知道在内心深处，我所做的工作甚至没有以前的10%好。<p>[1] 具有讽刺意味的是，我已经获得了大量的相关知识，而且我是我的组织中的&quot;go to&quot;人之一。\n",
  "description_zh-Hant": "<p>我已經得到了微軟的一個職位，從事內核開發工作。這對來自服務背景（僅有後端）的我來說將是一個很大的轉變。<p>這份工作對我的主要吸引力是做低級別的工作。在我的第一份工作中，我做了一些工作，但在過去的10多年裡，由於一些情況，我一直在服務領域工作。我真的很喜歡做C語言程序員，這些年來我一直在關注一些事情，並做了一些業餘項目（在X86和一些嵌入式的東西上）。<p>儘管工作本身對我來說99%的時間都不感興趣，但我現在的工作有很多地方是我所珍惜的。這是一份遠程工作，工作與生活的平衡非常好，而且我每年有25天的假期（這是在美國），這使我能夠與我的妻子度過很多高質量的時間。<p>然而，我正在考慮離開，因為在過去的兩年裡，我一直有重大的動機和績效[0]問題。通過大量的反思，甚至在治療師的幫助下，我發現我的問題的來源是工作本身的性質。建設服務只是一件不能給我帶來成就感的事情，我對這些東西一點也不感興趣。我發現的一些問題是：<p>1. 基礎設施的複雜性，尤其是在轉移到 Kubernetes 之後。<p>2.完全通過指標和日誌進行調試，因為我不能將調試器連接到正在運行的服務器上。<p>3.設計一般的系統。有些人喜歡分佈式事務的挑戰，最終的一致性和所有這些爵士樂，但它只是讓我的大腦感到不適。我對這個問題領域完全不感興趣[1]。<p>4.即使是最小的微服務，也需要大量的工作：基礎設施配置、證書、安全審查、GDPR合規等。<p>因此，我想知道的是：作為一名內核開發人員，有哪些事情會讓我在日常工作中說 \"唉\"？<p>我試著向每個面試我的人詢問這個問題，但我只得到了一些模糊的答案，比如說&quot;根據你正在做的事情，構建可能需要很長的時間&quot;等等。<p>[0] 儘管我的評論一直很好，但我知道在內心深處，我所做的工作甚至沒有以前的10%好。<p>[1] 具有諷刺意味的是，我已經獲得了大量的相關知識，而且我是我的組織中的&quot;go to&quot;人之一。\n"
}