{
  "@type": "NewsArticle",
  "identifier": "2022--06--27--en--askhn--HackerNews--NewsArticle--31892146",
  "url": "https://news.ycombinator.com/item?id=31892146",
  "headline": "Ask HN: Donating to FLOSS Projects?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I depend <i>a lot</i> on FLOSS for my work (and personal life) and I am doing my tiny bit to contribute and I am doing some financial donations too.  Especially for the work part I'm more and more starting to feel it's my duty to help out financially, we've all seen too many stories of underfunded FLOSS projects not having the capacity to fix crucial bugs causing severe security problems, or projects throwing in the towel leaving downstream projects stranded.  Most (all?) of the companies I've worked with in my career depend heavily (completely?) on FLOSS to do their heavy lifting.  A typical business application build upon FLOSS covers less that 1‰ of the entire deployed code base so some compensation for those hard working maintainers and developers would seem helpful.<p>Doing ad hoc donations as I do now doesn't feel very constructive to me so I'm considering to do (automatically) reoccurring donations to my favorite organisations and tools, which doesn't seem fair to the stuff I do depend on but don't have warm feelings for, but I gotta start some where, right?  What projects and organisations are you and/or the company you work for supporting?  Any tips?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "remvee",
    "url": "https://news.ycombinator.com/user?id=remvee"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31892146",
  "sameAs": "https://news.ycombinator.com/item?id=31892146",
  "dateCreated": "2022-06-27T10:00:12.441Z",
  "datePublished": "2022-06-27T09:04:53.000Z",
  "dateModified": "2022-06-27T10:00:12.441Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 捐赠给FLOSS项目？\n",
  "headline_zh-Hant": "Ask HN: 捐贈給FLOSS項目？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的工作（和个人生活）非常依赖FLOSS，我正在尽我的微薄之力做出贡献，我也在做一些财政捐助。 特别是对于工作部分，我越来越开始觉得在经济上提供帮助是我的责任，我们都看到了太多的故事，资金不足的FLOSS项目没有能力修复关键的bug，导致严重的安全问题，或者项目放弃了，导致下游项目搁浅。 在我的职业生涯中，大多数（所有）与我合作过的公司都严重依赖FLOSS来完成他们的重任。 一个典型的建立在FLOSS基础上的商业应用只占整个部署代码库的1‰，所以对那些辛勤工作的维护者和开发者给予一些补偿似乎是有帮助的。<p>像我现在这样做临时性的捐赠对我来说没有什么建设性，所以我正在考虑对我喜欢的组织和工具进行（自动）重复性的捐赠，这对我依赖的东西似乎并不公平，但我必须从某处开始，对吗？ 你和/或你工作的公司正在支持哪些项目和组织？ 有什么建议吗？\n",
  "description_zh-Hant": "我的工作（和個人生活）非常依賴FLOSS，我正在盡我的微薄之力做出貢獻，我也在做一些財政捐助。 特別是對於工作部分，我越來越開始覺得在經濟上提供幫助是我的責任，我們都看到了太多的故事，資金不足的FLOSS項目沒有能力修復關鍵的bug，導致嚴重的安全問題，或者項目放棄了，導致下游項目擱淺。 在我的職業生涯中，大多數（所有）與我合作過的公司都嚴重依賴FLOSS來完成他們的重任。 一個典型的建立在FLOSS基礎上的商業應用只佔整個部署代碼庫的1‰，所以對那些辛勤工作的維護者和開發者給予一些補償似乎是有幫助的。<p>像我現在這樣做臨時性的捐贈對我來說沒有什麼建設性，所以我正在考慮對我喜歡的組織和工具進行（自動）重複性的捐贈，這對我依賴的東西似乎並不公平，但我必須從某處開始，對嗎？ 你和/或你工作的公司正在支持哪些項目和組織？ 有什麼建議嗎？\n"
}