{
  "@type": "NewsArticle",
  "identifier": "2022--07--09--en--askhn--HackerNews--NewsArticle--32037813",
  "url": "https://news.ycombinator.com/item?id=32037813",
  "headline": "Ask HN: Stuck and Depressed – Need Guidance",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "- I started my programming journey in 2012, by creating small scripts for a SA-MP (A Mod for GTA SA).<p>- In 2016, I started college, studying towards my Computer Science degree. I loved all programming lectures, and was constantly among the best students in these lectures.<p>- In 2020, I graduated with a GPA of 2.9/4.0 (73.9%/100%), I was among the top 10 students of my class.<p>- Shortly afterwards in 2020, I started working as a freelance trainer at a coding school in my city, but the pay was not good, and since I was doing as a freelancer, I had months with no students at all, so no pay.<p>- I liked training, but I thought it's not for me, since I have to re-explain the same concepts over and over again, it gets boring pretty quickly.<p>- At the same time, I built a website for a client using Django.<p>And that's almost all I have! Now you might be wondering what's the deal here, why did I just post all of the above?<p>I am currently stuck in Tutorial Hell! I have no idea whether I should be after Mobile Development or Web or something else entirely!<p>I am not even sure whether my current knowledge is sufficient for a job or not.<p>I know that I need to work on projects and a portfolio, but I have no idea of projects! And even if I did, I just can't finish the project and I leave it halfway.<p>Is it possible to evaluate my current knowledge and get customized guidance on what I should do? Because I really need someone to help me out. I can't just research on my own anymore.<p>PS: I live in a city with almost no tech jobs.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "OulaX",
    "url": "https://news.ycombinator.com/user?id=OulaX"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32037813",
  "sameAs": "https://news.ycombinator.com/item?id=32037813",
  "dateCreated": "2022-07-09T18:30:14.562Z",
  "datePublished": "2022-07-09T18:13:43.000Z",
  "dateModified": "2022-07-09T18:30:14.562Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 困惑和沮丧--需要指导\n",
  "headline_zh-Hant": "Ask HN: 困惑和沮喪--需要指導\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "- 我在2012年开始了我的编程之旅，为一个SA-MP（GTA SA的一个Mod）创建小脚本。<p>- 2016年，我开始上大学，攻读计算机科学学位。<p>- 2020年，我以2.9/4.0（73.9%/100%）的GPA成绩毕业，我是班上前10名的学生。<p>- 2020年后不久，我开始在我所在城市的一所编码学校担任自由职业培训师，但工资不高，而且由于我是自由职业者，我有几个月根本没有学生，所以没有工资。  现在你可能想知道这里的情况，为什么我只是把上述所有的东西都贴了出来？<p>我目前陷入了教程地狱！我不知道我是否应该去做。我不知道我是应该从事移动开发还是网络开发，或者完全是其他的东西！<p>我甚至不确定我目前的知识是否足以胜任工作。<p>我知道我需要在项目和作品集上下功夫，但我对项目毫无概念！即使我有，我也只是想知道我是否能够胜任。而且即使我有，我就是无法完成项目，半途而废。<p>是否有可能评估我目前的知识，并得到定制的指导，告诉我应该怎么做？因为我真的需要有人来帮助我。我不能再自己研究了。<p>PS：我住在一个几乎没有技术工作的城市。\n",
  "description_zh-Hant": "- 我在2012年開始了我的編程之旅，為一個SA-MP（GTA SA的一個Mod）創建小腳本。<p>- 2016年，我開始上大學，攻讀計算機科學學位。<p>- 2020年，我以2.9/4.0（73.9%/100%）的GPA成績畢業，我是班上前10名的學生。<p>- 2020年後不久，我開始在我所在城市的一所編碼學校擔任自由職業培訓師，但工資不高，而且由於我是自由職業者，我有幾個月根本沒有學生，所以沒有工資。  現在你可能想知道這裡的情況，為什麼我只是把上述所有的東西都貼了出來？<p>我目前陷入了教程地獄！我不知道我是否應該去做。我不知道我是應該從事移動開發還是網絡開發，或者完全是其他的東西！<p>我甚至不確定我目前的知識是否足以勝任工作。<p>我知道我需要在項目和作品集上下功夫，但我對項目毫無概念！即使我有，我也只是想知道我是否能夠勝任。而且即使我有，我就是無法完成項目，半途而廢。<p>是否有可能評估我目前的知識，並得到定製的指導，告訴我應該怎麼做？因為我真的需要有人來幫助我。我不能再自己研究了。<p>PS：我住在一個幾乎沒有技術工作的城市。\n"
}