{
  "@type": "NewsArticle",
  "identifier": "2022--06--21--en--askhn--HackerNews--NewsArticle--31827449",
  "url": "https://news.ycombinator.com/item?id=31827449",
  "headline": "Ask HN: I struggle to hire a UI/UX designer, can anyone help?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "For the past 2 months I've been struggling to hire a web designer to create a website for me. I wrote the entire product specification, all screens and app flows, and I want a designer to take that spec and turn it into a real product design.<p>Attempt #1: Direct hire<p>Posted a local job and hired a person based on their portfolio. We signed the contract, and they started the project. 2 weeks later I check in and all they have done is the color palette and fonts. I don't think I'm unreasonable when I say this is way too little work for 2 weeks booked at 8 hours / day. I closed the contract afterwards and I consider I simply got scammed. Am I being unreasonable here?<p>Attempt #2: Upwork<p>I posted my project on Upwork for a fixed price, estimated at 300 hours and with a price per hour that matches what Upwork says is their &quot;top freelancers&quot;. I received more than 100 applications in the first 3 hours. Looking at their past work and portfolio, I notice a lot of them have linked the same projects, with the same screenshots and project description. I closed the project after I saw that, fearing another scam.<p>Attempt #3: LinkedIn<p>Posted a job for a contract-based short term project. I received less than 20 applicants in a week, and most of them sent me 5 page CVs without a portfolio. The portfolios that I got from the rest of them were very slim, presenting 1-2 project mockups which could barely be called projects, even though they called themselves experienced professionals.<p>I'm currently out of ideas on what to try next. I'm willing to pay top money for top work, and I mentioned this in every job ad, but for some reason all I get is scam attempts or homework projects.<p>Do you have some advice on how to hire high quality designers? Is there something wrong that I'm doing here?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "s1k3s",
    "url": "https://news.ycombinator.com/user?id=s1k3s"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31827449",
  "sameAs": "https://news.ycombinator.com/item?id=31827449",
  "dateCreated": "2022-06-21T18:52:47.811Z",
  "datePublished": "2022-06-21T18:39:59.000Z",
  "dateModified": "2022-06-21T18:52:47.811Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我正在努力聘请一名UI/UX设计师，谁能帮帮我？\n",
  "headline_zh-Hant": "Ask HN: 我正在努力聘請一名UI/UX設計師，誰能幫幫我？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在过去的2个月里，我一直在努力聘请一位网页设计师为我创建一个网站。我写了整个产品规格，所有的屏幕和应用流程，我想让一个设计师把这个规格变成一个真正的产品设计。<p>尝试一：直接雇用<p>在当地发布了一个工作，根据他们的作品集雇用了一个人。我们签署了合同，然后他们开始了项目。2周后，我去检查，他们所做的只是调色板和字体。我不认为我说这是不合理的，因为以8小时/天的时间预订2周的工作太少了。事后我关闭了合同，我认为我只是被骗了。<p>尝试二：Upwork<p>我在Upwork上发布了一个固定价格的项目，估计为300小时，每小时的价格符合Upwork所说的顶级自由职业者的价格。在最初的3小时内，我收到了100多份申请。看看他们过去的工作和作品集，我发现很多人都链接了相同的项目，有相同的截图和项目描述。我看到后关闭了这个项目，担心又是一个骗局。<p>尝试三：LinkedIn<p>发布了一个合同制短期项目的工作。我在一周内收到了不到20名申请者，其中大多数人给我发了5页的简历，没有作品集。我从其余的人那里得到的作品集也非常少，只展示了1-2个项目模拟，几乎不能称之为项目，尽管他们自称是经验丰富的专业人士。<p>我目前对下一步的尝试没有想法。我愿意为顶级的工作支付最高的报酬，我在每一个招聘广告中都提到了这一点，但由于某些原因，我得到的都是骗人的尝试或家庭作业项目。<p>你对如何雇用高质量的设计师有一些建议吗？我在这里做错了什么吗？\n",
  "description_zh-Hant": "在過去的2個月裡，我一直在努力聘請一位網頁設計師為我創建一個網站。我寫了整個產品規格，所有的屏幕和應用流程，我想讓一個設計師把這個規格變成一個真正的產品設計。<p>嘗試一：直接僱用<p>在當地發佈了一個工作，根據他們的作品集僱用了一個人。我們簽署了合同，然後他們開始了項目。2周後，我去檢查，他們所做的只是調色板和字體。我不認為我說這是不合理的，因為以8小時/天的時間預訂2周的工作太少了。事後我關閉了合同，我認為我只是被騙了。<p>嘗試二：Upwork<p>我在Upwork上發佈了一個固定價格的項目，估計為300小時，每小時的價格符合Upwork所說的頂級自由職業者的價格。在最初的3小時內，我收到了100多份申請。看看他們過去的工作和作品集，我發現很多人都鏈接了相同的項目，有相同的截圖和項目描述。我看到後關閉了這個項目，擔心又是一個騙局。<p>嘗試三：LinkedIn<p>發佈了一個合同制短期項目的工作。我在一週內收到了不到20名申請者，其中大多數人給我發了5頁的簡歷，沒有作品集。我從其餘的人那裡得到的作品集也非常少，只展示了1-2個項目模擬，幾乎不能稱之為項目，儘管他們自稱是經驗豐富的專業人士。<p>我目前對下一步的嘗試沒有想法。我願意為頂級的工作支付最高的報酬，我在每一個招聘廣告中都提到了這一點，但由於某些原因，我得到的都是騙人的嘗試或家庭作業項目。<p>你對如何僱用高質量的設計師有一些建議嗎？我在這裡做錯了什麼嗎？\n"
}