{
  "@type": "NewsArticle",
  "identifier": "2022--07--29--en--askhn--HackerNews--NewsArticle--32269905",
  "url": "https://news.ycombinator.com/item?id=32269905",
  "headline": "Ask HN: Non-technical founders, would you buy a course on building a SaaS MVP?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello,<p>Recently I've been thinking about writing a book or recording a video course on building an MVP with Ruby on Rails framework. It would be specifically targeted at non-technical founders with no prior programming experience.<p>Ruby on Rails happens to be among the most popular programming frameworks for building web apps in startups because of its extensive ecosystem and the tooling out of the box.<p>Typical beginner books on programming — and programming with Ruby and Ruby on Rails specifically — are oriented at a general audience. But building an MVP or a PoC is a completely different story: you've got to be extremely pragmatic in your choice of tools, libraries and their use. You must know the easiest, scalable way of running your SaaS on the Internet. You don't have to know or understand a lot of things which are only useful to a general programmer: like performance or writing &quot;beautiful&quot; code. All you need is to know just enough and in just the right combination to be able to deliver the first versions of the product. If it shows a promise - you can find a technical co-founder, or hire a freelancer to develop it further properly.<p>A little bit about me: I have 12+ years of working as a software engineer in startups of various sizes, most of which were built using Ruby on Rails.<p>I was part of small teams getting an MVP ready, mid-sized teams within successful startups with multiple rounds of investments behind, as well as a company of 1000+ engineers running some of the biggest Ruby on Rails apps out there.<p>Recently, I've also guided a (non-technical) friend in building an MVP, and it was quite illuminating for both of us. That's how I got the idea to scale it out in form of a course, or a book.<p>That said, I am not sure if there would be a demand for such a course. Maybe I am overestimating the need for it, and non-technical founders prefer spending their time somewhere else, instead.<p>What are your thoughts?<p>Thank you.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "poushkar",
    "url": "https://news.ycombinator.com/user?id=poushkar"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32269905",
  "sameAs": "https://news.ycombinator.com/item?id=32269905",
  "dateCreated": "2022-07-29T09:26:38.220Z",
  "datePublished": "2022-07-28T20:46:45.000Z",
  "dateModified": "2022-07-29T09:26:38.220Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 非技术性的创始人，你会买一个关于建立SaaS MVP的课程吗？\n",
  "headline_zh-Hant": "Ask HN: 非技術性的創始人，你會買一個關於建立SaaS MVP的課程嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，<p>最近我一直在考虑编写一本关于使用Ruby on Rails框架构建MVP的书或录制一个视频课程。<p>Ruby on Rails恰好是初创企业中最受欢迎的用于构建网络应用的编程框架之一，因为它拥有广泛的生态系统和开箱即用的工具。<p>典型的编程初学者书籍--特别是用Ruby和Ruby on Rails编程--是面向普通读者的。但是建立一个MVP或PoC是一个完全不同的故事：你必须在选择工具、库和它们的使用方面非常务实。你必须知道在互联网上运行你的SaaS的最简单、可扩展的方法。你不需要知道或了解很多只对一般程序员有用的东西：比如性能或编写漂亮的代码。你所需要的只是知道足够多的东西，并以正确的组合方式，能够提供产品的第一个版本。如果它显示出前景--你可以找到一个技术联合创始人，或者雇用一个自由职业者来进一步适当地开发它。<p>我曾在各种规模的初创企业中担任软件工程师12年以上，其中大部分都是使用Ruby on Rails构建的。<p>我曾是准备好MVP的小型团队的一员，也曾是成功的初创企业中拥有多轮投资的中型团队的一员，还曾在一家拥有1000多名工程师的公司中运行一些最大的Ruby on Rails应用程序。<p>最近，我还指导一位（非技术性）朋友构建MVP，这对我们两个人都很有启发。因此，我才有了以课程或书籍的形式将其推广开来的想法。<p>话虽如此，我并不确定这样的课程是否有需求。也许我高估了对它的需求，而非技术性的创始人更愿意把他们的时间花在其他地方。<p>你有什么想法？\n",
  "description_zh-Hant": "你好，<p>最近我一直在考慮編寫一本關於使用Ruby on Rails框架構建MVP的書或錄製一個視頻課程。<p>Ruby on Rails恰好是初創企業中最受歡迎的用於構建網絡應用的編程框架之一，因為它擁有廣泛的生態系統和開箱即用的工具。<p>典型的編程初學者書籍--特別是用Ruby和Ruby on Rails編程--是面向普通讀者的。但是建立一個MVP或PoC是一個完全不同的故事：你必須在選擇工具、庫和它們的使用方面非常務實。你必須知道在互聯網上運行你的SaaS的最簡單、可擴展的方法。你不需要知道或瞭解很多隻對一般程序員有用的東西：比如性能或編寫漂亮的代碼。你所需要的只是知道足夠多的東西，並以正確的組合方式，能夠提供產品的第一個版本。如果它顯示出前景--你可以找到一個技術聯合創始人，或者僱用一個自由職業者來進一步適當地開發它。<p>我曾在各種規模的初創企業中擔任軟件工程師12年以上，其中大部分都是使用Ruby on Rails構建的。<p>我曾是準備好MVP的小型團隊的一員，也曾是成功的初創企業中擁有多輪投資的中型團隊的一員，還曾在一家擁有1000多名工程師的公司中運行一些最大的Ruby on Rails應用程序。<p>最近，我還指導一位（非技術性）朋友構建MVP，這對我們兩個人都很有啟發。因此，我才有了以課程或書籍的形式將其推廣開來的想法。<p>話雖如此，我並不確定這樣的課程是否有需求。也許我高估了對它的需求，而非技術性的創始人更願意把他們的時間花在其他地方。<p>你有什麼想法？\n"
}