{
  "@type": "NewsArticle",
  "identifier": "2022--06--22--en--askhn--HackerNews--NewsArticle--31837122",
  "url": "https://news.ycombinator.com/item?id=31837122",
  "headline": "Ask HN: Company promised equity, still no plan. What can I do?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I started a new role at a company about six months ago. At the time that I joined the company, an equity/stock option plan was not in place, but was told it would be imminent. I didn't accept less salary in exchange for a vague promise of equity, but still fully expected that the details would be worked out soon and felt confident that the details of the equity grant, once it became available, would be satisfactory.<p>It has now been six months and due to various factors that have to do with the structure of the company (not a typical VC-backed co), the equity plan still hasn't been rolled out, and the exec team is unable to give me any timeline on when it will go into effect...other than to assure me that they're doing everything they can to make it happen as soon as possible.<p>I don't think I have any legal recourse since this was effectively a handshake deal upon joining, but wondering what you'd do if you were in my shoes? What are my options here? Do I go to the CEO and threaten to leave if an equity plan isn't in place within the next 30 days? Ask for more base compensation since there effectively isn't an equity plan in place which was part of the full package we initially agreed upon?<p>Appreciate any advice/feedback you might have. Thanks in advance.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "fromwhence",
    "url": "https://news.ycombinator.com/user?id=fromwhence"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31837122",
  "sameAs": "https://news.ycombinator.com/item?id=31837122",
  "dateCreated": "2022-06-22T15:27:24.519Z",
  "datePublished": "2022-06-22T15:14:55.000Z",
  "dateModified": "2022-06-22T15:27:24.519Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 公司承诺的股权，仍然没有计划。我可以做什么？\n",
  "headline_zh-Hant": "Ask HN: 公司承諾的股權，仍然沒有計劃。我可以做什麼？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大约六个月前，我在一家公司开始了一个新角色。在我加入该公司的时候，股权/股票期权计划还没有出台，但被告知即将出台。<p>现在已经过去六个月了，由于与公司结构有关的各种因素（不是典型的由风险投资支持的公司），股权计划仍未推出，执行团队也无法给我任何关于何时生效的时间表。 <p>我不认为我有任何法律追索权，因为这实际上是加入时的握手交易，但想知道如果你是我，你会怎么做？我在这里有什么选择？我是否要去找首席执行官，威胁说如果在未来30天内没有股权计划，我就离开？要求更多的基本报酬，因为实际上没有股权计划，而股权计划是我们最初同意的全部方案的一部分？谢谢。\n",
  "description_zh-Hant": "大約六個月前，我在一家公司開始了一個新角色。在我加入該公司的時候，股權/股票期權計劃還沒有出臺，但被告知即將出臺。<p>現在已經過去六個月了，由於與公司結構有關的各種因素（不是典型的由風險投資支持的公司），股權計劃仍未推出，執行團隊也無法給我任何關於何時生效的時間表。 <p>我不認為我有任何法律追索權，因為這實際上是加入時的握手交易，但想知道如果你是我，你會怎麼做？我在這裡有什麼選擇？我是否要去找首席執行官，威脅說如果在未來30天內沒有股權計劃，我就離開？要求更多的基本報酬，因為實際上沒有股權計劃，而股權計劃是我們最初同意的全部方案的一部分？謝謝。\n"
}