{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--askhn--HackerNews--NewsArticle--31593183",
  "url": "https://news.ycombinator.com/item?id=31593183",
  "headline": "Ask HN: Ideas for useful uses of excess electricity?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm trying to think up ideas of what I could do with an intermittent &quot;excess&quot; of electricity - only at certain hours of the day up to a certain (fixed) amount. Let's say around 10kW hours a day between 12pm and 3pm (I've described my case below, but other people would have different scenarios).<p>Ideally the extra energy would be used to help reduce environmental impact rather than making money, so crypto mining (for example) is not an option.<p>Here are some of my thoughts:<p>- heat water for home usage (heat pump); this solution is already deployed, but there is only so much hot water one needs\n- charge an EV; I don't own one presently, but it an option for the future\n- fight the current 70% rule in Germany (this is the cause of my excess, see below)\n- generate H2 via electrolysis; not sure what to do with H2 then. What would be interesting would be to be able to &quot;charge&quot; fuel cells and store them for use in winter, or compress H2 into cylinders? Not sure what can fit into my garage / would be affordable.\n- pumped water storage; I suspect the energies involved at home are insignificant vs industrial hydro solutions\n- convert to microwave and beam into space\n- run an industrial press to compress my lawn cuttings / garden waste into pellets and dump them into a deep lake\n- a magical machine that extracts Co2 from the air and produces a fine black powder which I could compress and dump into a deep lake\n- ...<p>Some background:<p>In Germany, excess domestic solar panel production can be pushed into the grid for a small (cash) refund, but there is a strange rule : only 70% of the maximum panel output is allowed to be pushed. So if the panels could generate 10kW at midday, without anything turned on at home, a maximum of 7kW can be pushed. This effect is only for a few &quot;peak sun&quot; hours (say 12pm to 3pm), but means that roughly 10kW hours of electricity is &quot;lost&quot; (the system is throttled back via the charge controller, so the energy isn't lost or wasted, it just isn't produced)",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mogoman",
    "url": "https://news.ycombinator.com/user?id=mogoman"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31593183",
  "sameAs": "https://news.ycombinator.com/item?id=31593183",
  "dateCreated": "2022-06-02T13:54:07.397Z",
  "datePublished": "2022-06-02T10:08:09.000Z",
  "dateModified": "2022-06-02T13:54:07.397Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 6
    }
  ],
  "headline_zh-Hans": "Ask HN: 对多余电力的有用用途有什么想法？\n",
  "headline_zh-Hant": "Ask HN: 對多餘電力的有用用途有什麼想法？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在想，我可以用间歇性的&quot;过剩&quot;的电力做什么--只在一天中的某些时段，达到一定（固定）的数量。比如说，每天中午12点到下午3点之间的10千瓦左右的时间（我在下面描述了我的情况，但其他人会有不同的方案）。<p>事实上，额外的能源将被用于帮助减少环境影响，而不是赚钱，所以加密货币开采（例如）不是一个选项。\n- 为电动车充电；我现在没有电动车，但这是未来的一个选择。\n- 与德国目前的70%的规定作斗争（这是我超额使用的原因，见下文）。\n- 通过电解产生H2；不确定如何处理H2。有意思的是能够给燃料电池充电，并将其储存起来以便在冬季使用，或者将H2压缩到气缸里？不知道什么东西能装进我的车库/能买得起。\n- 抽水蓄能；我怀疑在家里涉及的能量与工业水力解决方案相比是微不足道的。\n- 转化为微波并传送到太空\n- 运行一个工业压机，将我的剪下的草坪/花园垃圾压缩成颗粒，并将其倾倒在一个深湖中。\n- 一台神奇的机器，从空气中提取二氧化碳，并产生细小的黑色粉末，我可以将其压缩并倾倒在深湖中。\n- ...<p>一些背景：<p>在德国，多余的家用太阳能电池板产量可以被推入电网，以获得小额（现金）退款，但有一个奇怪的规则：只允许推入最大电池板产量的70%。因此，如果太阳能电池板在中午时分可以产生10kW，而家里没有任何东西打开，那么最多只能推送7kW。这种影响只发生在几个太阳高峰期（比如中午12点到下午3点），但这意味着大约有10kW小时的电力被 \"损失 \"了（系统通过充电控制器节流，所以能量并没有损失或浪费，只是没有产生）。\n",
  "description_zh-Hant": "我在想，我可以用間歇性的&quot;過剩&quot;的電力做什麼--只在一天中的某些時段，達到一定（固定）的數量。比如說，每天中午12點到下午3點之間的10千瓦左右的時間（我在下面描述了我的情況，但其他人會有不同的方案）。<p>事實上，額外的能源將被用於幫助減少環境影響，而不是賺錢，所以加密貨幣開採（例如）不是一個選項。\n- 為電動車充電；我現在沒有電動車，但這是未來的一個選擇。\n- 與德國目前的70%的規定作鬥爭（這是我超額使用的原因，見下文）。\n- 通過電解產生H2；不確定如何處理H2。有意思的是能夠給燃料電池充電，並將其儲存起來以便在冬季使用，或者將H2壓縮到氣缸裡？不知道什麼東西能裝進我的車庫/能買得起。\n- 抽水蓄能；我懷疑在家裡涉及的能量與工業水力解決方案相比是微不足道的。\n- 轉化為微波並傳送到太空\n- 運行一個工業壓機，將我的剪下的草坪/花園垃圾壓縮成顆粒，並將其傾倒在一個深湖中。\n- 一臺神奇的機器，從空氣中提取二氧化碳，併產生細小的黑色粉末，我可以將其壓縮並傾倒在深湖中。\n- ...<p>一些背景：<p>在德國，多餘的家用太陽能電池板產量可以被推入電網，以獲得小額（現金）退款，但有一個奇怪的規則：只允許推入最大電池板產量的70%。因此，如果太陽能電池板在中午時分可以產生10kW，而家裡沒有任何東西打開，那麼最多隻能推送7kW。這種影響只發生在幾個太陽高峰期（比如中午12點到下午3點），但這意味著大約有10kW小時的電力被 \"損失 \"了（系統通過充電控制器節流，所以能量並沒有損失或浪費，只是沒有產生）。\n"
}