{
  "@type": "NewsArticle",
  "identifier": "2022--07--18--en--askhn--HackerNews--NewsArticle--32133709",
  "url": "https://news.ycombinator.com/item?id=32133709",
  "headline": "Ask HN: Is Anonymity Possible in 2022?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "There is no bulletproof way to be anonymous online. Though we’re here to help protect you from the malicious websites, data collection and exploitation that exist in our online world, the fact that you’re using the internet means that you can’t be safe from everything.<p>How can you become anonymous in the Internet?<p>1. Use an encrypted messaging app<p>Instead of sending a text message to a friend on your Android, use an encrypted messaging app like Signal.<p>2. Use an encrypted browser<p>Instead of using Chrome or another browser from a large tech, use safe google alternatives and protect your data.<p>3. Use a VPN<p>VPNs hide your browsing history so your internet service provider (ISP) can’t see any of your online activity.<p>4. Use secure email services<p>Since we’re so used at Google ecosystem, that we use Gmail as our personal email provider. Google keeps all of our private emails on its servers. Better watch out for better alternatives.<p>5. Use a temporary email<p>Use a temporary email address or use a safe email services like Fastmail, Zoho mail, and Tutanota.<p>6. Use encrypted storage<p>We store all of our documents, photos, and files in Google Drive, which certainly isn’t a good choice in terms of privacy. There are definitely plenty of trustworthy cloud storage services like Internxt, Box, and SyncThing.<p>7. Check app permissions<p>We’re all guilty of mindlessly accepting an app’s terms and conditions, but before you do, see what permissions the app has.<p>8. Read privacy policies<p>Check what data a website or app collects, shares, and/or sells before you use it. Many companies sell users’ personal information to third parties for marketing and advertising purposes, which is not conducive to privacy, let alone anonymity.<p>9. Use ad blockers<p>Adware is the software that places ads across your computer, phone, or tablet, but even if you don’t have adware, most websites and apps have some form of advertising, which can get annoying.<p>10. Don’t use voice assistants<p>Amazon employees have admitted to listening to Alexa recordings, and there was a hidden, undisclosed microphone in the Google Assistant-compatible Nest Secure security system4. Your best action is to manage devices and its feature manually.<p>11. Stay off social media<p>Although this is essential to socialize and connect with our friends. Social media is a platform that can collect your information and may use it against you.<p>12. Use a proxy<p>Unlike VPNs, proxy servers encrypt only your device’s IP address, not your web traffic, making them less secure.<p>13. Check for HTTPS<p>Only go on websites whose URLs start with “HTTPS” rather than “HTTP.” HTTPS, which stands for “hypertext transfer protocol secure,” uses a secure sockets layer (SSL) to encrypt all of the communication between your browser and the websites you visit, while HTTP does not.<p>14. Disable cookies<p>Cookies are the data about your online activities that shape targeted ads; sometimes they’re anonymized and aggregated, but sometimes they’re not. It is important to disable it to avoid these data farmers.<p>15. Don’t use Google<p>Google tracks everything you search online, which can be very personal information. Use search engine like DuckDuckGo, Startpage, and Neeva which doesn’t harvest your personal information to create targeted ads.<p>16. Use a password manager<p>Create a unique and secure password for all of your online accounts. You may also use Roboform to safely encrypt your password.<p>17. Avoid spam<p>Avoid clicking on any unfamiliar messages, emails, or websites.<p>18. Use private instances<p>Private instances can be used by a select group of people that you are close with.<p>The internet was created to be a place where people could search for information freely, without fear of repercussions. However, with the monetization of our attention comes a total lack of privacy, as we’re surveilled online constantly.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "internxt",
    "url": "https://news.ycombinator.com/user?id=internxt"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32133709",
  "sameAs": "https://news.ycombinator.com/item?id=32133709",
  "dateCreated": "2022-07-18T02:26:31.476Z",
  "datePublished": "2022-07-18T02:01:36.000Z",
  "dateModified": "2022-07-18T02:26:31.476Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 在2022年，匿名是可能的吗？\n",
  "headline_zh-Hant": "Ask HN: 在2022年，匿名是可能的嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "要想在网上匿名，没有防弹的方法。尽管我们在这里帮助你保护你免受存在于我们网络世界中的恶意网站、数据收集和剥削，但你使用互联网的事实意味着你不可能在所有事情上都是安全的。<p>你如何才能在互联网上变得匿名？<p>1. 使用加密的消息应用程序<p>不要在你的安卓系统上向朋友发送短信，而是使用像Signal这样的加密消息应用程序。 <p>2.使用加密的浏览器<p>不要使用Chrome或其他大型科技公司的浏览器，使用安全的谷歌替代品并保护你的数据。 <p>3.使用VPN<p>VPN隐藏你的浏览历史，这样你的互联网服务提供商（ISP）就不能看到你的任何在线活动。<p>4.使用安全的电子邮件服务<p>由于我们在谷歌生态系统中非常习惯，所以我们使用Gmail作为我们的个人电子邮件提供商。谷歌将我们所有的私人电子邮件保存在其服务器上。最好留意更好的替代方案。<p>5. 使用临时电子邮件<p>使用临时电子邮件地址或使用安全的电子邮件服务，如Fastmail、Zoho mail和Tutanota。<p>6.使用加密存储<p>我们将所有的文件、照片和文件存储在Google Drive，这在隐私方面肯定不是一个好的选择。绝对有很多值得信赖的云存储服务，如Internxt、Box和SyncThing。<p>7.检查应用程序的权限<p>我们都犯了无意识地接受一个应用程序的条款和条件的错误，但在这之前，看看该应用程序有哪些权限。<p>8.阅读隐私政策<p>在你使用一个网站或应用程序之前，检查它收集、分享和/或出售哪些数据。许多公司出于营销和广告目的，将用户的个人信息卖给第三方，这不利于隐私，更不用说匿名了。<p>9. 使用广告拦截器<p>广告软件是在你的电脑、手机或平板电脑上放置广告的软件，但即使你没有广告软件，大多数网站和应用程序都有某种形式的广告，这可能会令人讨厌。不要使用语音助手<p>亚马逊的员工已经承认听了Alexa的录音，在与谷歌助手兼容的Nest Secure安全系统中也有一个隐藏的、未公开的麦克风4。你最好的行动是手动管理设备和其功能。<p>11. 远离社交媒体<p>尽管这对于社交和与朋友联系是必不可少的。社交媒体是一个可以收集你的信息的平台，并可能利用它来对付你。<p>12. 使用代理服务器<p>与VPN不同，代理服务器只对你的设备的IP地址进行加密，而不是对你的网络流量进行加密，因此安全性较低。检查HTTPS<p>只访问那些URL以 \"HTTPS \"开头的网站，而不是 \"HTTP\"。HTTPS是 \"超文本传输协议安全 \"的缩写，它使用安全套接字层（SSL）来加密您的浏览器和您访问的网站之间的所有通信，而HTTP则没有。禁用cookies<p>Cookies是关于你的在线活动的数据，这些数据形成了有针对性的广告；有时它们被匿名和汇总，但有时它们不是。重要的是要禁用它，以避免这些数据农民。<p>15. 不要使用谷歌<p>谷歌会跟踪你在网上搜索的一切，这可能是非常个人的信息。使用像DuckDuckGo、Startpage和Neeva这样的搜索引擎，它们不会收集你的个人信息来创建目标广告。<p>16. 使用密码管理器<p>为您的所有在线账户创建一个独特而安全的密码。你也可以使用Roboform安全地加密你的密码。<p>17. 避免垃圾邮件<p>避免点击任何不熟悉的信息、电子邮件或网站。<p>18. 使用私人实例<p>私人实例可由与你关系密切的一组人使用。<p>互联网被创建为一个人们可以自由搜索信息的地方，而不必担心受到影响。然而，随着我们注意力的货币化，我们完全缺乏隐私，因为我们在网上不断受到监视。\n",
  "description_zh-Hant": "要想在網上匿名，沒有防彈的方法。儘管我們在這裡幫助你保護你免受存在於我們網絡世界中的惡意網站、數據收集和剝削，但你使用互聯網的事實意味著你不可能在所有事情上都是安全的。<p>你如何才能在互聯網上變得匿名？<p>1. 使用加密的消息應用程序<p>不要在你的安卓系統上向朋友發送短信，而是使用像Signal這樣的加密消息應用程序。 <p>2.使用加密的瀏覽器<p>不要使用Chrome或其他大型科技公司的瀏覽器，使用安全的谷歌替代品並保護你的數據。 <p>3.使用VPN<p>VPN隱藏你的瀏覽歷史，這樣你的互聯網服務提供商（ISP）就不能看到你的任何在線活動。<p>4.使用安全的電子郵件服務<p>由於我們在谷歌生態系統中非常習慣，所以我們使用Gmail作為我們的個人電子郵件提供商。谷歌將我們所有的私人電子郵件保存在其服務器上。最好留意更好的替代方案。<p>5. 使用臨時電子郵件<p>使用臨時電子郵件地址或使用安全的電子郵件服務，如Fastmail、Zoho mail和Tutanota。<p>6.使用加密存儲<p>我們將所有的文件、照片和文件存儲在Google Drive，這在隱私方面肯定不是一個好的選擇。絕對有很多值得信賴的雲存儲服務，如Internxt、Box和SyncThing。<p>7.檢查應用程序的權限<p>我們都犯了無意識地接受一個應用程序的條款和條件的錯誤，但在這之前，看看該應用程序有哪些權限。<p>8.閱讀隱私政策<p>在你使用一個網站或應用程序之前，檢查它收集、分享和/或出售哪些數據。許多公司出於營銷和廣告目的，將用戶的個人信息賣給第三方，這不利於隱私，更不用說匿名了。<p>9. 使用廣告攔截器<p>廣告軟件是在你的電腦、手機或平板電腦上放置廣告的軟件，但即使你沒有廣告軟件，大多數網站和應用程序都有某種形式的廣告，這可能會令人討厭。不要使用語音助手<p>亞馬遜的員工已經承認聽了Alexa的錄音，在與谷歌助手兼容的Nest Secure安全系統中也有一個隱藏的、未公開的麥克風4。你最好的行動是手動管理設備和其功能。<p>11. 遠離社交媒體<p>儘管這對於社交和與朋友聯繫是必不可少的。社交媒體是一個可以收集你的信息的平臺，並可能利用它來對付你。<p>12. 使用代理服務器<p>與VPN不同，代理服務器只對你的設備的IP地址進行加密，而不是對你的網絡流量進行加密，因此安全性較低。檢查HTTPS<p>只訪問那些URL以 \"HTTPS \"開頭的網站，而不是 \"HTTP\"。HTTPS是 \"超文本傳輸協議安全 \"的縮寫，它使用安全套接字層（SSL）來加密您的瀏覽器和您訪問的網站之間的所有通信，而HTTP則沒有。禁用cookies<p>Cookies是關於你的在線活動的數據，這些數據形成了有針對性的廣告；有時它們被匿名和彙總，但有時它們不是。重要的是要禁用它，以避免這些數據農民。<p>15. 不要使用谷歌<p>谷歌會跟蹤你在網上搜索的一切，這可能是非常個人的信息。使用像DuckDuckGo、Startpage和Neeva這樣的搜索引擎，它們不會收集你的個人信息來創建目標廣告。<p>16. 使用密碼管理器<p>為您的所有在線賬戶創建一個獨特而安全的密碼。你也可以使用Roboform安全地加密你的密碼。<p>17. 避免垃圾郵件<p>避免點擊任何不熟悉的信息、電子郵件或網站。<p>18. 使用私人實例<p>私人實例可由與你關係密切的一組人使用。<p>互聯網被創建為一個人們可以自由搜索信息的地方，而不必擔心受到影響。然而，隨著我們注意力的貨幣化，我們完全缺乏隱私，因為我們在網上不斷受到監視。\n"
}