{
  "@type": "NewsArticle",
  "identifier": "2022--04--24--en--askhn--HackerNews--NewsArticle--31146324",
  "url": "https://news.ycombinator.com/item?id=31146324",
  "headline": "Ask HN: What are you using for 4 axis CNC and laser?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi all,<p>I am working on a nano (pico, really) brewery project and need a bunch of custom aluminum and wood pieces for our tiny brewhouse and barroom build.<p>I have a large workspace and am considering a range of CNC machine and laser engravers. I would like a the option (or as a separate purchase) of a 4-axis tabletop rotary option to experiment with small scale laser-etching of cans as well.<p>I find my self in the modern internet dilemma of google search being almost unusable due to pages of SEO spam, while reddit is also relatively gamified in this product category as well. Youtube has a ton of content here, but it's also now mostly a proxy for sponsor-creator view battles, and it's tough to wade through the many, many hours of semi-honest use/reviews when I have the day job and fam. Hackaday is great...for hacks, but not really expert reviews, and Make magazine seems to have minimal coverage here as well.<p>Where should I go to figure out how to get what I need in this space? Are there any HN users with enough experience in this domain that you can offer recommendations, search terms, or major product pitfalls to avoid? I am willing to go into the mid 4 figures for a good product(s) that can help me with both bar furniture trim, aluminum fittings, and laser engraving. Would love to learn as efficiently as I can what may suit my use cases. Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "levinb",
    "url": "https://news.ycombinator.com/user?id=levinb"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31146324",
  "sameAs": "https://news.ycombinator.com/item?id=31146324",
  "dateCreated": "2022-04-24T17:49:47.754Z",
  "datePublished": "2022-04-24T17:44:01.000Z",
  "dateModified": "2022-04-24T17:49:47.754Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你用什么来做四轴数控和激光？",
  "headline_zh-Hant": "Ask HN: 你用什麼來做四軸數控和激光？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>我正在做一个纳米（皮克，真的）啤酒厂项目，需要为我们的小啤酒厂和酒吧间的建设定制一批铝和木制品。<p>我有一个大的工作空间，正在考虑一系列的数控机床和激光雕刻机。我希望能有一个四轴台式旋转选项（或作为一个单独的购买），以尝试小规模的激光蚀刻罐头。<p>我发现自己处于现代互联网的困境，谷歌搜索几乎无法使用，因为页面的SEO垃圾，而reddit也是相对游戏化在这个产品类别以及。Youtube在这里有大量的内容，但它现在也主要是赞助商和创造者观点之争的代理，当我有白天的工作和家庭的时候，要从许多许多小时的半诚实的使用/评论中涉猎是很困难的。Hackaday很好......对于黑客来说，但不是真正的专家评论，而Make杂志在这里的覆盖面似乎也很小。<p>我应该去哪里弄清楚如何在这个领域获得我需要的东西？是否有任何在这个领域有足够经验的HN用户，可以提供建议、搜索条件或需要避免的主要产品陷阱？我愿意用4位数来购买一个好的产品，它可以帮助我处理酒吧家具装饰、铝制配件和激光雕刻。我希望能尽可能有效地了解哪些产品适合我的使用情况。谢谢!",
  "description_zh-Hant": "大家好，<p>我正在做一個納米（皮克，真的）啤酒廠項目，需要為我們的小啤酒廠和酒吧間的建設定製一批鋁和木製品。<p>我有一個大的工作空間，正在考慮一系列的數控機床和激光雕刻機。我希望能有一個四軸臺式旋轉選項（或作為一個單獨的購買），以嘗試小規模的激光蝕刻罐頭。<p>我發現自己處於現代互聯網的困境，谷歌搜索幾乎無法使用，因為頁面的SEO垃圾，而reddit也是相對遊戲化在這個產品類別以及。Youtube在這裡有大量的內容，但它現在也主要是贊助商和創造者觀點之爭的代理，當我有白天的工作和家庭的時候，要從許多許多小時的半誠實的使用/評論中涉獵是很困難的。Hackaday很好......對於黑客來說，但不是真正的專家評論，而Make雜誌在這裡的覆蓋面似乎也很小。<p>我應該去哪裡弄清楚如何在這個領域獲得我需要的東西？是否有任何在這個領域有足夠經驗的HN用戶，可以提供建議、搜索條件或需要避免的主要產品陷阱？我願意用4位數來購買一個好的產品，它可以幫助我處理酒吧傢俱裝飾、鋁製配件和激光雕刻。我希望能儘可能有效地瞭解哪些產品適合我的使用情況。謝謝!"
}