{
  "@type": "NewsArticle",
  "identifier": "2022--04--27--en--askhn--HackerNews--NewsArticle--31177890",
  "url": "https://news.ycombinator.com/item?id=31177890",
  "headline": "Ask HN: Can I force Big Email Company to not mark my emails as spam?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We are running a business where people buy a product in a webshop and receive an email &quot;Thank you for purchasing the product. Here is your licence key&quot;.<p>Now Big Email Provider are marking those emails as spam. Even though<p>- every single email we send is an important email that our users really want to read \n- our email is following all known to us good practices\n- our domain has never been used to send any unsolicited emails ever\n- they are simple plain-text emails without links\n- we usually send not more than 3-5 emails a day to Big Email Provider\n- we ask our customers to mark them as &quot;Not Spam&quot; and they claim they do so.<p>Big email providers refuse to not mark our emails as a spam. &quot;We know it's not a spam, but we are still going to mark them as spam to our customers and we won't tell you why.&quot;<p>It's hard to calculate the exact damages but it does damage our reputation because frequently pepole don't check spam and send us angry emails or publicly complain that they haven't received an email for a week. (Our replies to these emails aren't sent to spam).<p>Is there any precedence where someone has succesfully managed to force Big Email Provider to not mark legit emails as spam or have there been any lawsuits anywhere around this topic?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kuboble",
    "url": "https://news.ycombinator.com/user?id=kuboble"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31177890",
  "sameAs": "https://news.ycombinator.com/item?id=31177890",
  "dateCreated": "2022-04-27T09:11:17.461Z",
  "datePublished": "2022-04-27T09:09:56.000Z",
  "dateModified": "2022-04-27T09:11:17.461Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我可以强迫大邮件公司不把我的邮件标记为垃圾邮件吗？",
  "headline_zh-Hant": "Ask HN: 我可以強迫大郵件公司不把我的郵件標記為垃圾郵件嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们正在经营一项业务，人们在网上商店购买产品，并收到一封电子邮件&quot;感谢您购买该产品。<p>现在大的电子邮件提供商将这些电子邮件标记为垃圾邮件。尽管<p>- 我们发送的每一封邮件都是我们的用户真正想要阅读的重要邮件 \n- 我们的电子邮件遵循所有我们已知的良好做法\n- 我们的域名从来没有被用来发送任何未经请求的电子邮件\n- 它们是简单的纯文本电子邮件，没有链接\n- 我们通常每天向大的电子邮件供应商发送不超过3-5封电子邮件\n- 我们要求我们的客户将它们标记为&quot;非垃圾邮件&quot;，他们声称他们这样做了。 <p>大的电子邮件供应商拒绝不将我们的电子邮件标记为垃圾邮件。 &quot;我们知道这不是垃圾邮件，但我们仍然要将它们标记为垃圾邮件给我们的客户，我们不会告诉你为什么。 &quot;<p>很难计算确切的损失，但它确实损害了我们的声誉，因为经常有人不检查垃圾邮件，并给我们发送愤怒的电子邮件，或公开抱怨他们已经一周没有收到电子邮件。(我们对这些邮件的回复并没有被发送到垃圾邮件中）。<p>是否有任何先例，有人成功地迫使大的电子邮件提供商不把合法的电子邮件标记为垃圾邮件，或者围绕这个话题有任何诉讼？",
  "description_zh-Hant": "我們正在經營一項業務，人們在網上商店購買產品，並收到一封電子郵件&quot;感謝您購買該產品。<p>現在大的電子郵件提供商將這些電子郵件標記為垃圾郵件。儘管<p>- 我們發送的每一封郵件都是我們的用戶真正想要閱讀的重要郵件 \n- 我們的電子郵件遵循所有我們已知的良好做法\n- 我們的域名從來沒有被用來發送任何未經請求的電子郵件\n- 它們是簡單的純文本電子郵件，沒有鏈接\n- 我們通常每天向大的電子郵件供應商發送不超過3-5封電子郵件\n- 我們要求我們的客戶將它們標記為&quot;非垃圾郵件&quot;，他們聲稱他們這樣做了。 <p>大的電子郵件供應商拒絕不將我們的電子郵件標記為垃圾郵件。 &quot;我們知道這不是垃圾郵件，但我們仍然要將它們標記為垃圾郵件給我們的客戶，我們不會告訴你為什麼。 &quot;<p>很難計算確切的損失，但它確實損害了我們的聲譽，因為經常有人不檢查垃圾郵件，並給我們發送憤怒的電子郵件，或公開抱怨他們已經一週沒有收到電子郵件。(我們對這些郵件的回覆並沒有被髮送到垃圾郵件中）。<p>是否有任何先例，有人成功地迫使大的電子郵件提供商不把合法的電子郵件標記為垃圾郵件，或者圍繞這個話題有任何訴訟？"
}