{
  "@type": "NewsArticle",
  "identifier": "2022--07--06--en--askhn--HackerNews--NewsArticle--32002685",
  "url": "https://news.ycombinator.com/item?id=32002685",
  "headline": "Ask HN: How to protect against non competes?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN community! Again thanks everyone for your help back at https://news.ycombinator.com/item?id=31683412 Much appreciated!\nSo sorry I haven't been able to respond to everyone's messages - thanks again though!<p>For context, I've been doing some engineering consulting and other work for people. With the help from HN, I've been armed in negotation, and everyone's advice was super good! I can know easily and swiftly tell people what we're worth per hour! It was super hard at first, but it really helped!<p>So recently a startup with no cash, no funding came up to me to ask me to create an AI product. I managed to create a mini demo, in which they showcased this to investors and they were very impressed.<p>However we chatted about a contract between us. I came to understand that they're offering 15% to me, with the 3 founders taking 85%. I was trying to negotitate a higher equity portion, since I believed the work I did was worth much more than 15%. They don't seem to want to budge.<p>They then mentioned a non-compete clause, in which I declined. I run a consulting arm, so it's nearly impossible for me to sign a non-compete clause. That's essentially locking us out of future roles.<p>They then mentioned on time committment, however, it's near impossible if they're asking me to be a cofounder to determine &quot;how many&quot; hours. I told them I have other consulting roles, and so time commitment will be random. However, I've already spent 40 hours or more working on the product.<p>I mentioned another alternative solution which was contracting or freelance. I charged them the market rate * the hours we offered, but they seem to not want that either.<p>I told them very clearly it's extremely difficult to find an engineer to do any software work, yet they feel like the components I'm doing aren't valuable. I assume they're trying to undervalue the work.<p>I'm in an extremely confused and depressed position. I'm not too sure what to do anymore! I suggested if nothing works out, then the code is protected since no contract was written.<p>What should I do in this situation? Thanks again to the wise HN community! It feels like I'm been used again. I tried this time - I guess a mistake is I should have at the start wrote a contract, and not 40 hours of work later.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "flying_colours",
    "url": "https://news.ycombinator.com/user?id=flying_colours"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32002685",
  "sameAs": "https://news.ycombinator.com/item?id=32002685",
  "dateCreated": "2022-07-06T15:53:13.208Z",
  "datePublished": "2022-07-06T15:47:47.000Z",
  "dateModified": "2022-07-06T15:53:13.208Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何防止非竞争者？\n",
  "headline_zh-Hant": "Ask HN: 如何防止非競爭者？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，HN社区! 再次感谢大家的帮助，https://news.ycombinator.com/item?id=31683412，非常感谢!\n很抱歉我没能回复大家的留言--不过还是要感谢大家！<p>关于背景，我一直在为人们做一些工程咨询和其他工作。在HN的帮助下，我已经在谈判中得到了武装，每个人的建议都是超级好的！我可以很容易和迅速地知道，在谈判中，我可以很容易地知道。我可以很容易和迅速地告诉人们我们每小时的价值是多少! 一开始超级难，但真的很有帮助！<p>最近，一家没有现金、没有资金的初创公司来找我，要我创造一个人工智能产品。我成功地创建了一个小型演示，他们在演示中向投资者展示了这一点，他们对此印象深刻。<p>然而，我们聊到了我们之间的合同。我了解到，他们给了我15%的股份，而3位创始人则拿走了85%。我试图协商一个更高的股权部分，因为我相信我所做的工作的价值远远超过15%。他们似乎不想让步。<p>然后他们提到了一个非竞争条款，我拒绝了。我经营一个咨询部门，所以我几乎不可能签署非竞争条款。<p>他们随后提到了时间承诺，然而，如果他们要求我成为联合创始人，几乎不可能确定&quot;多少&quot; 小时。我告诉他们，我有其他的咨询角色，所以时间承诺将是随机的。但是，我已经花了40个小时或更多的时间在产品上。<p>我提到了另一个替代解决方案，即承包或自由职业者。我向他们收取了市场价格*我们提供的小时数，但他们似乎也不希望这样做。<p>我非常清楚地告诉他们，要找到一个工程师来做任何软件工作是非常困难的，但他们却觉得我所做的组件没有价值。我想他们是想低估工作的价值。<p>我现在处于一个极其困惑和沮丧的境地。我不太清楚该怎么做了! 我建议如果没有什么结果，那么这些代码就会受到保护，因为没有写合同。<p>在这种情况下，我应该怎么做？再次感谢睿智的HN社区! 感觉我又被人利用了。这次我试过了--我想一个错误是我应该在一开始就写一份合同，而不是后来的40个小时的工作。\n",
  "description_zh-Hant": "嘿，HN社區! 再次感謝大家的幫助，https://news.ycombinator.com/item?id=31683412，非常感謝!\n很抱歉我沒能回覆大家的留言--不過還是要感謝大家！<p>關於背景，我一直在為人們做一些工程諮詢和其他工作。在HN的幫助下，我已經在談判中得到了武裝，每個人的建議都是超級好的！我可以很容易和迅速地知道，在談判中，我可以很容易地知道。我可以很容易和迅速地告訴人們我們每小時的價值是多少! 一開始超級難，但真的很有幫助！<p>最近，一家沒有現金、沒有資金的初創公司來找我，要我創造一個人工智能產品。我成功地創建了一個小型演示，他們在演示中向投資者展示了這一點，他們對此印象深刻。<p>然而，我們聊到了我們之間的合同。我瞭解到，他們給了我15%的股份，而3位創始人則拿走了85%。我試圖協商一個更高的股權部分，因為我相信我所做的工作的價值遠遠超過15%。他們似乎不想讓步。<p>然後他們提到了一個非競爭條款，我拒絕了。我經營一個諮詢部門，所以我幾乎不可能簽署非競爭條款。<p>他們隨後提到了時間承諾，然而，如果他們要求我成為聯合創始人，幾乎不可能確定&quot;多少&quot; 小時。我告訴他們，我有其他的諮詢角色，所以時間承諾將是隨機的。但是，我已經花了40個小時或更多的時間在產品上。<p>我提到了另一個替代解決方案，即承包或自由職業者。我向他們收取了市場價格*我們提供的小時數，但他們似乎也不希望這樣做。<p>我非常清楚地告訴他們，要找到一個工程師來做任何軟件工作是非常困難的，但他們卻覺得我所做的組件沒有價值。我想他們是想低估工作的價值。<p>我現在處於一個極其困惑和沮喪的境地。我不太清楚該怎麼做了! 我建議如果沒有什麼結果，那麼這些代碼就會受到保護，因為沒有寫合同。<p>在這種情況下，我應該怎麼做？再次感謝睿智的HN社區! 感覺我又被人利用了。這次我試過了--我想一個錯誤是我應該在一開始就寫一份合同，而不是後來的40個小時的工作。\n"
}