{
  "@type": "NewsArticle",
  "identifier": "2022--07--01--en--askhn--HackerNews--NewsArticle--31943253",
  "url": "https://news.ycombinator.com/item?id=31943253",
  "headline": "Ask HN: How do you make decisions with high opportunity costs?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Dear HN, I'm pathologically terrible at making important decisions, and I can't step away from them to the point it's making me physically nauseous.<p>Right now, I'm deciding between a master's in the biomedical field that I long dreamed of, and working as a SWE. I used to be certain I'd want to become a researcher, but in recent months I have either lost my idealism or became more pragmatic. I'm very close to receiving an offer as a SWE at a company that looks like a super nice company, remote options, interesting work, with a lot of opportunities to grow. The recruiter and developers I interviewed with seemed extremely nice and happy to talk about the company.\nThere are two offices in two European cities I like and that employees apparently can choose pretty flexibly to work in, which is cool.<p>The master's program involves about a year of (unpaid) lab work, so I started to ask myself what's the point of putting myself through this if I'm not planning on doing a PhD afterwards (it's in Europe, tuition is cheap.) At the same time, I have always been a scientifically minded/interested person, and getting more actual research experience and training in scientific working might be rewarding in itself, and except for the last months I was always more passionate about science than working in software development and chasing a big paycheck. Plus, I think I would prefer seeing myself as a scientist who ended up in SWE due to the better working conditions, and somehow prove to myself that I can do it by doing the masters.<p>Clearly this is a very emotionally loaded decision for me, so I'd like to ask for guidance and hear about how anyone who's been in a similar situation came to make a decision.<p>Also, would doing a masters in an unrelated field make me a less attractive candidate when later applying for junior SWE roles and I already graduated 2 years ago?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Probiotic6081",
    "url": "https://news.ycombinator.com/user?id=Probiotic6081"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31943253",
  "sameAs": "https://news.ycombinator.com/item?id=31943253",
  "dateCreated": "2022-07-01T06:59:46.519Z",
  "datePublished": "2022-07-01T06:56:46.000Z",
  "dateModified": "2022-07-01T06:59:46.519Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何做出机会成本高的决策？\n",
  "headline_zh-Hant": "Ask HN: 你如何做出機會成本高的決策？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "亲爱的HN，我在病态上很不擅长做重要的决定，我无法从这些决定中抽身出来，以至于让我生理上感到恶心。<p>现在，我正在决定在我长期梦想的生物医学领域的硕士课程和作为一个SWE的工作之间做出选择。我曾经确定我想成为一名研究员，但最近几个月，我要么失去了我的理想主义，要么变得更加务实。我非常接近于收到一家公司的SWE邀请，这家公司看起来是一家超级好的公司，有远程选择，工作有趣，有很多发展机会。与我面试的招聘人员和开发人员看起来都非常好，很乐意谈论公司的情况。\n在我喜欢的两个欧洲城市有两个办公室，而且员工显然可以很灵活地选择工作地点，这很酷。<p>硕士课程涉及大约一年的（无偿）实验室工作，所以我开始问自己，如果我不打算在之后读博士，让自己经历这些有什么意义（它在欧洲，学费很便宜。 同时，我一直是一个有科学头脑/兴趣的人，获得更多的实际研究经验和科学工作培训本身可能就很有意义，除了最后几个月，我对科学的热情一直高于从事软件开发和追逐高薪的工作。另外，我想我更愿意把自己看作是一个科学家，由于工作条件较好而最终进入SWE，并通过读硕士向自己证明我可以做到这一点。<p>显然，这对我来说是一个非常情绪化的决定，所以我想请教一下，听听有类似情况的人是如何做出决定的。<p>另外，在不相关的领域读硕士，会不会让我在以后申请SWE初级职位时变得没有吸引力，而我两年前已经毕业？\n",
  "description_zh-Hant": "親愛的HN，我在病態上很不擅長做重要的決定，我無法從這些決定中抽身出來，以至於讓我生理上感到噁心。<p>現在，我正在決定在我長期夢想的生物醫學領域的碩士課程和作為一個SWE的工作之間做出選擇。我曾經確定我想成為一名研究員，但最近幾個月，我要麼失去了我的理想主義，要麼變得更加務實。我非常接近於收到一家公司的SWE邀請，這家公司看起來是一家超級好的公司，有遠程選擇，工作有趣，有很多發展機會。與我面試的招聘人員和開發人員看起來都非常好，很樂意談論公司的情況。\n在我喜歡的兩個歐洲城市有兩個辦公室，而且員工顯然可以很靈活地選擇工作地點，這很酷。<p>碩士課程涉及大約一年的（無償）實驗室工作，所以我開始問自己，如果我不打算在之後讀博士，讓自己經歷這些有什麼意義（它在歐洲，學費很便宜。 同時，我一直是一個有科學頭腦/興趣的人，獲得更多的實際研究經驗和科學工作培訓本身可能就很有意義，除了最後幾個月，我對科學的熱情一直高於從事軟件開發和追逐高薪的工作。另外，我想我更願意把自己看作是一個科學家，由於工作條件較好而最終進入SWE，並通過讀碩士向自己證明我可以做到這一點。<p>顯然，這對我來說是一個非常情緒化的決定，所以我想請教一下，聽聽有類似情況的人是如何做出決定的。<p>另外，在不相關的領域讀碩士，會不會讓我在以後申請SWE初級職位時變得沒有吸引力，而我兩年前已經畢業？\n"
}