{
  "@type": "NewsArticle",
  "identifier": "2022--06--05--en--askhn--HackerNews--NewsArticle--31632155",
  "url": "https://news.ycombinator.com/item?id=31632155",
  "headline": "Ask HN: Past examples of new multi-applicable software (AI, Blockchain)?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm looking for examples of new software from the past (contemporarily: AI, Blockchain) upon which entire companies (and a new category) were going to be built, but ended up absorbed by real companies in real sectors?<p>We currently have a &quot;Blockchain sector&quot; in tech, with &quot;Blockchain companies&quot; . But that's not a real sector. The Blockchain itself not a platform, it's a tool.( Ditto AI).<p>What will exist will be cloud storage/database companies specializing in using the Blockchain in specific existing categories: Fintech (global remittance), Permanent digital archiving etc. It's like how Telegram isn't a &quot;Mobile Apps&quot; company, it's an information transfer (aka communication) company which competes with SMS, newspapers, physical human going to a place to deliver the message by word of mouth etc.<p>So yeah, what are examples of this happening in the past? &quot;New software&quot; at first births &quot;new software&quot; companies in the &quot;new software&quot; sector, until, eventually, &quot;new software&quot; becomes just a normal tool, not with its own companies in its own sector, but which enables companies in existing sectors.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pHollda",
    "url": "https://news.ycombinator.com/user?id=pHollda"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31632155",
  "sameAs": "https://news.ycombinator.com/item?id=31632155",
  "dateCreated": "2022-06-05T16:33:43.641Z",
  "datePublished": "2022-06-05T16:01:46.000Z",
  "dateModified": "2022-06-05T16:33:43.641Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 过去新的多应用软件（AI、区块链）的例子？\n",
  "headline_zh-Hant": "Ask HN: 過去新的多應用軟件（AI、區塊鏈）的例子？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在寻找过去的新软件（暂时是：人工智能、区块链）的例子，整个公司（和一个新的类别）都将在此基础上建立，但最终被真实部门的真实公司吸收？ <p>我们目前在科技领域有一个&quot;区块链部门&quot;，有&quot;区块链公司&quot;。但这并不是一个真正的部门。区块链本身不是一个平台，它是一个工具。（同上，人工智能）。<p>将存在的是云存储/数据库公司，专门在现有的特定类别中使用区块链。金融技术（全球汇款）、永久数字存档等。这就像Telegram不是一家&quot;移动应用程序&quot;公司，它是一家信息传输（又称通信）公司，它与短信、报纸、物理人类去一个地方通过口碑传递信息等竞争。<p>所以，是的，过去有什么例子发生？在&quot;新软件&quot;领域，起初诞生了&quot;新软件&quot;公司，直到最后，&quot;新软件&quot;成为一个普通的工具，不是在自己的领域有自己的公司，而是使现有领域的公司得以发展。\n",
  "description_zh-Hant": "我在尋找過去的新軟件（暫時是：人工智能、區塊鏈）的例子，整個公司（和一個新的類別）都將在此基礎上建立，但最終被真實部門的真實公司吸收？ <p>我們目前在科技領域有一個&quot;區塊鏈部門&quot;，有&quot;區塊鏈公司&quot;。但這並不是一個真正的部門。區塊鏈本身不是一個平臺，它是一個工具。（同上，人工智能）。<p>將存在的是雲存儲/數據庫公司，專門在現有的特定類別中使用區塊鏈。金融技術（全球匯款）、永久數字存檔等。這就像Telegram不是一家&quot;移動應用程序&quot;公司，它是一家信息傳輸（又稱通信）公司，它與短信、報紙、物理人類去一個地方通過口碑傳遞信息等競爭。<p>所以，是的，過去有什麼例子發生？在&quot;新軟件&quot;領域，起初誕生了&quot;新軟件&quot;公司，直到最後，&quot;新軟件&quot;成為一個普通的工具，不是在自己的領域有自己的公司，而是使現有領域的公司得以發展。\n"
}