{
  "@type": "NewsArticle",
  "identifier": "2022--06--27--en--askhn--HackerNews--NewsArticle--31898146",
  "url": "https://news.ycombinator.com/item?id=31898146",
  "headline": "Ask HN: Suggestions for dealing with overwhelm?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have a little over 3YOE and am being forced into a full-stack role from FE development with backend and devops responsibilities with a lot of engineers leaving. Right now I'm overwhelmed by the number of things that needs to be handled and learn and don't really have many seniors I can lean on for help and guidance.<p>I'd like to look for a new role and a more suitable workload but even then I am overwhelmed by the interview preparation grind. I'd like to be able to resign and take time off to focus solely on finding a new role with a more manageable workload but I have bills and loans to pay and a family to support (though this is perhaps adding to my feeling of stress and overwhelm) and would like to burn my savings only as matter of last resort. (but how do I know if I'm at that point?)<p>Things I have tried or am currently doing:\n- prioritizing sleep and exercise and eating well\n- meditation, maintaining my mental health with biweekly visits to a therapist\n- delegating tasks to juniors (which doesn't end as well as I'd hope)<p>Things I am working on:\n- prioritizing. everything feels so important yet at the end of the day it just feels like I'm spinning my wheels without making much progress on anything<p>Any tips or suggestions?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jackkkk",
    "url": "https://news.ycombinator.com/user?id=jackkkk"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31898146",
  "sameAs": "https://news.ycombinator.com/item?id=31898146",
  "dateCreated": "2022-06-27T17:56:07.987Z",
  "datePublished": "2022-06-27T17:54:01.000Z",
  "dateModified": "2022-06-27T17:56:07.987Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 对处理压倒性问题的建议？\n",
  "headline_zh-Hant": "Ask HN: 對處理壓倒性問題的建議？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我有3年多的工作经验，随着很多工程师的离开，我被迫从FE开发转为全栈角色，负责后端和devops。现在，我对需要处理和学习的事情太多了，而且没有很多前辈可以让我依靠，以获得帮助和指导。<p>我想寻找一个新的角色和更合适的工作量，但即使这样，我也被面试准备的磨难压得喘不过气来。我希望能够辞职并休假，只专注于寻找一个工作量更容易管理的新角色，但我要支付账单和贷款，还要养家糊口（尽管这也许会增加我的压力和不知所措的感觉），而且只想在万不得已的情况下燃烧我的储蓄。(但我怎么知道我是否已经到了那个地步？\n- 优先考虑睡眠、运动和饮食\n- 冥想，通过每两周去看一次治疗师来保持我的心理健康\n- 将任务下放给后辈（这并不像我希望的那样结束）<p>我正在努力的事情。\n- 每件事都感觉很重要，但到了最后，我却感觉自己在原地打转，没有取得什么进展<p>有什么提示或建议？\n",
  "description_zh-Hant": "我有3年多的工作經驗，隨著很多工程師的離開，我被迫從FE開發轉為全棧角色，負責後端和devops。現在，我對需要處理和學習的事情太多了，而且沒有很多前輩可以讓我依靠，以獲得幫助和指導。<p>我想尋找一個新的角色和更合適的工作量，但即使這樣，我也被面試準備的磨難壓得喘不過氣來。我希望能夠辭職並休假，只專注於尋找一個工作量更容易管理的新角色，但我要支付賬單和貸款，還要養家餬口（儘管這也許會增加我的壓力和不知所措的感覺），而且只想在萬不得已的情況下燃燒我的儲蓄。(但我怎麼知道我是否已經到了那個地步？\n- 優先考慮睡眠、運動和飲食\n- 冥想，通過每兩週去看一次治療師來保持我的心理健康\n- 將任務下放給後輩（這並不像我希望的那樣結束）<p>我正在努力的事情。\n- 每件事都感覺很重要，但到了最後，我卻感覺自己在原地打轉，沒有取得什麼進展<p>有什麼提示或建議？\n"
}