{
  "@type": "NewsArticle",
  "identifier": "2022--04--28--en--askhn--HackerNews--NewsArticle--31192084",
  "url": "https://news.ycombinator.com/item?id=31192084",
  "headline": "Ask HN: How do you find what you're good at?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm not really good at anything. Aside from just trying things out and getting feedback from managers/coworkers, how does one identify things that they could be good at?<p>I've been a dev for 10 years and have a masters degree. I am just a midlevel dev. I spent most of that time working on obscure stuff the company needed, like Filenet and Neoxam. I'm now working with stuff like ECS batch, Lambdas, and some front end written in Java, Python, and Angular. I'm not seeing much progress. I think this mostly because I feel like this knowledge will just end up as throw away. The concepts and the bulk of the development are easy to grasp. Occasionally I'll get stuck with some implementation detail and just let it drag out.<p>I also realize that promotions are no longer a possibility for me. People are starting to wonder why I'm still a midlevel after 10 years. Recently I was told that I need to be more upbeat and improve team morale. Basically I'm being told to change my opinions, insights, and even personality. Kind of shocking when they make a big deal about DEI, including diversity of thought. This caused me to realize that all the managers are oddly happy and upbeat, so this must be a requirement. So they won't ever move me into any leadership position like manager, or even senior developer.<p>I think I'm tired of being a dev. The pay isn't even that good &lt;$100k. I think some sort of an analyst position would be good. I tried checking put corporate strategy analyst positions, but it turns out they are more of a project/stakeholder manager, and they use these positions as feeders for executive positions (the rest of the team had degrees from places like Harvard and Wharton).<p>Any suggestions of tactics or positions to try?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "giantg2",
    "url": "https://news.ycombinator.com/user?id=giantg2"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31192084",
  "sameAs": "https://news.ycombinator.com/item?id=31192084",
  "dateCreated": "2022-04-28T13:38:28.485Z",
  "datePublished": "2022-04-28T13:17:19.000Z",
  "dateModified": "2022-04-28T13:38:28.485Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何找到自己擅长的东西？",
  "headline_zh-Hant": "Ask HN: 你如何找到自己擅長的東西？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我其实并不擅长什么。除了尝试一些事情并从经理/同事那里得到反馈之外，如何确定他们可能擅长的事情呢？<p>我已经做了10年的开发工作，有一个硕士学位。我只是一个中级开发人员。在那段时间里，我大部分时间都在研究公司需要的不知名的东西，比如Filenet和Neoxam。我现在正在研究ECS批处理、Lambdas和一些用Java、Python和Angular编写的前端等东西。我没有看到什么进展。我认为这主要是因为我觉得这些知识最终会被扔掉。这些概念和大部分的开发都很容易掌握。偶尔我也会被一些实现细节卡住，让它拖着走。<p>我还意识到，对我来说，晋升已经不再是一种可能。人们开始怀疑为什么我在10年后仍然是一个中层。最近有人告诉我，我需要更加乐观，提高团队士气。基本上我被告知要改变我的观点、见解，甚至个性。当他们对DEI（包括思想的多样性）大做文章时，有点令人震惊。这使我意识到，所有的经理都是奇怪的快乐和乐观的，所以这一定是一个要求。所以他们永远不会把我调到任何领导岗位，如经理，甚至高级开发人员。<p>我想我已经厌倦了做一个开发人员。薪酬甚至没有那么高&lt;10万美元。我认为某种分析员的职位会很好。我试着查了一下企业战略分析师的职位，但结果发现他们更像是项目/利益相关者经理，而且他们把这些职位作为高管职位的支线（团队的其他成员都有哈佛和沃顿等地的学位）。<p>有什么建议可以尝试的策略或职位？",
  "description_zh-Hant": "我其實並不擅長什麼。除了嘗試一些事情並從經理/同事那裡得到反饋之外，如何確定他們可能擅長的事情呢？<p>我已經做了10年的開發工作，有一個碩士學位。我只是一箇中級開發人員。在那段時間裡，我大部分時間都在研究公司需要的不知名的東西，比如Filenet和Neoxam。我現在正在研究ECS批處理、Lambdas和一些用Java、Python和Angular編寫的前端等東西。我沒有看到什麼進展。我認為這主要是因為我覺得這些知識最終會被扔掉。這些概念和大部分的開發都很容易掌握。偶爾我也會被一些實現細節卡住，讓它拖著走。<p>我還意識到，對我來說，晉升已經不再是一種可能。人們開始懷疑為什麼我在10年後仍然是一箇中層。最近有人告訴我，我需要更加樂觀，提高團隊士氣。基本上我被告知要改變我的觀點、見解，甚至個性。當他們對DEI（包括思想的多樣性）大做文章時，有點令人震驚。這使我意識到，所有的經理都是奇怪的快樂和樂觀的，所以這一定是一個要求。所以他們永遠不會把我調到任何領導崗位，如經理，甚至高級開發人員。<p>我想我已經厭倦了做一個開發人員。薪酬甚至沒有那麼高&lt;10萬美元。我認為某種分析員的職位會很好。我試著查了一下企業戰略分析師的職位，但結果發現他們更像是項目/利益相關者經理，而且他們把這些職位作為高管職位的支線（團隊的其他成員都有哈佛和沃頓等地的學位）。<p>有什麼建議可以嘗試的策略或職位？"
}