{
  "@type": "NewsArticle",
  "identifier": "2022--06--07--en--askhn--HackerNews--NewsArticle--31650459",
  "url": "https://news.ycombinator.com/item?id=31650459",
  "headline": "Ask HN: Math and CS books that teach both the how and the why of the subject?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Calculus was developed by Newton and Leibniz as a way to tackle problems in physics. Later Real analysis was developed which gave a strong and mathematically rigorous foundation to the theory of Calculus. During its infancy Calculus was all about the &quot;how&quot;; after real analysis the &quot;why&quot; was added.<p>I believe learning only one side of the subject doesn't open up the entire capacity of the subject to your mind. You need to learn both the how and the why.<p>Mathematicians often fight over pure vs applied. Due to that books are also written like that. The how books are aimed at &quot;engineers&quot; and the &quot;why&quot; books are abstract and seldom contain the &quot;hows&quot;.<p>Example: Strang's Linear Algebra is all about &quot;how&quot;. Axler's Linear Algebra Done Right is all about the abstract treatment of the subject.<p>I only talked about math books above. I am not much aware about how CS books fair in this aspect.<p>I want to know about books in both CS and Mathematics that teach both the how and the why of the subject. It shows how to practice the material in reality and why the material is true by showing a rigorous theory behind it, if there is a theory. Otherwise it says that this is yet to be proven.<p>If you know no such comprehensive book on a topic, you may suggest some online course (if that is available) or a set of books that seperately teach the how and why and complement each other very well.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "newsoul",
    "url": "https://news.ycombinator.com/user?id=newsoul"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31650459",
  "sameAs": "https://news.ycombinator.com/item?id=31650459",
  "dateCreated": "2022-06-07T06:31:19.792Z",
  "datePublished": "2022-06-07T06:14:50.000Z",
  "dateModified": "2022-06-07T06:31:19.792Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 数学和CS书籍，既教如何做，又教为什么做？\n",
  "headline_zh-Hant": "Ask HN: 數學和CS書籍，既教如何做，又教為什麼做？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "微积分是由牛顿和莱布尼茨开发的，作为解决物理学问题的一种方式。后来，实分析被开发出来，为微积分理论提供了一个强有力的、数学上严谨的基础。在其初创时期，微积分都是关于 \"如何 \"的；在实分析之后，又增加了 \"为什么 \"的内容。你需要同时学习如何做和为什么做。<p>数学家们经常为纯粹与应用而争论不休。由于这一点，书也是这样写的。如何写的书是针对工程师的，而为什么写的书是抽象的，很少包含如何写的内容。Strang的《线性代数》都是关于&quot;如何&quot;的。阿克斯勒的《正确的线性代数》(Linear Algebra Done Right)都是对该主题的抽象处理。<p>我在上面只谈到了数学书。我不太了解CS书籍在这方面的情况。<p>我想知道CS和数学两方面的书籍，它们都是在教授该学科的方法和原因。它展示了如何在现实中实践该材料，以及为什么该材料是真实的，如果有理论的话，就展示其背后的严格理论。<p>如果你不知道某个主题有这么全面的书，你可以建议一些在线课程（如果有的话）或一套单独教授如何做和为什么做的书，它们可以很好地相互补充。\n",
  "description_zh-Hant": "微積分是由牛頓和萊布尼茨開發的，作為解決物理學問題的一種方式。後來，實分析被開發出來，為微積分理論提供了一個強有力的、數學上嚴謹的基礎。在其初創時期，微積分都是關於 \"如何 \"的；在實分析之後，又增加了 \"為什麼 \"的內容。你需要同時學習如何做和為什麼做。<p>數學家們經常為純粹與應用而爭論不休。由於這一點，書也是這樣寫的。如何寫的書是針對工程師的，而為什麼寫的書是抽象的，很少包含如何寫的內容。Strang的《線性代數》都是關於&quot;如何&quot;的。阿克斯勒的《正確的線性代數》(Linear Algebra Done Right)都是對該主題的抽象處理。<p>我在上面只談到了數學書。我不太瞭解CS書籍在這方面的情況。<p>我想知道CS和數學兩方面的書籍，它們都是在教授該學科的方法和原因。它展示瞭如何在現實中實踐該材料，以及為什麼該材料是真實的，如果有理論的話，就展示其背後的嚴格理論。<p>如果你不知道某個主題有這麼全面的書，你可以建議一些在線課程（如果有的話）或一套單獨教授如何做和為什麼做的書，它們可以很好地相互補充。\n"
}