{
  "@type": "NewsArticle",
  "identifier": "2022--06--20--en--askhn--HackerNews--NewsArticle--31809104",
  "url": "https://news.ycombinator.com/item?id=31809104",
  "headline": "Ask HN: I've built a supposedly useful site. Now how do I make it known?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "So for the past few months, I started building a web site that's targeted to a niche group of people. It's partially a social network.<p>My assumption is that it will be useful and attractive to a lot of people out there. I shared it with friends and they've been using it every day, so I've been getting good feedback.<p>I myself been using it since the very early prototypes, since it was solving a problem I had.<p>Now it's reached a point where I think I should stop with adding more functionality, and start somehow advertising it to people that might find it interesting and join.<p>But I'm a bit stuck as to how to market this and make it known. Do you have any advice on one generally goes about making their project known to the world (not anybody, just the people that might care about it)?<p>To clarify: I don't have any plans or even thought about monetization. I'm doing this for fun and I there are no subscriptions charged etc.<p>Thanks<p>------<p>EDIT: I guess what I want to say is that... OK I've spent effort building this, and it looks good and useful to me. How do I validate my assumption that it will be good and useful to others?<p>Seeing people joining and using it would be a huge motivation to make me continue working on this. (Not that it's the only motivation.)<p>EDIT 2: Since this is for a pretty specific group of people and it aims to be free, I don't want to put paid ads anywhere.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "endorphine",
    "url": "https://news.ycombinator.com/user?id=endorphine"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31809104",
  "sameAs": "https://news.ycombinator.com/item?id=31809104",
  "dateCreated": "2022-06-20T11:55:58.199Z",
  "datePublished": "2022-06-20T11:41:23.000Z",
  "dateModified": "2022-06-20T11:55:58.199Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我已经建立了一个所谓有用的网站。现在我如何让它为人所知？\n",
  "headline_zh-Hant": "Ask HN: 我已經建立了一個所謂有用的網站。現在我如何讓它為人所知？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "所以在过去的几个月里，我开始建立一个针对小众群体的网站。它部分是一个社交网络。<p>我的假设是，它将是有用的，对外面的很多人有吸引力。我和朋友们分享了它，他们每天都在使用它，所以我得到了很好的反馈。<p>我自己从最早期的原型开始就一直在使用它，因为它解决了我的一个问题。<p>现在它已经达到了一个点，我想我应该停止增加更多的功能，并开始以某种方式向那些可能觉得它有趣并加入的人宣传它。<p>但我有点卡住了，不知道如何推销它并让它为人所知。你有什么建议吗，一般来说，一个人要让自己的项目为世人所知（不是任何人，只是可能关心它的人）？<p>澄清一下：我没有任何计划，甚至没有想过赚钱。我做这个是为了好玩，我没有收取任何订阅费等。<p>谢谢<p>------<p>编辑：我想我想说的是。好吧，我已经花了精力建立这个，而且它看起来很好，对我很有用。我如何验证我的假设，即它对其他人来说是好的和有用的？<p>看到人们加入和使用它将是一个巨大的动力，使我继续工作。(<p>编辑2：由于这是为一个相当特殊的群体服务的，而且它的目标是免费的，我不想把付费广告放在任何地方。\n",
  "description_zh-Hant": "所以在過去的幾個月裡，我開始建立一個針對小眾群體的網站。它部分是一個社交網絡。<p>我的假設是，它將是有用的，對外面的很多人有吸引力。我和朋友們分享了它，他們每天都在使用它，所以我得到了很好的反饋。<p>我自己從最早期的原型開始就一直在使用它，因為它解決了我的一個問題。<p>現在它已經達到了一個點，我想我應該停止增加更多的功能，並開始以某種方式向那些可能覺得它有趣並加入的人宣傳它。<p>但我有點卡住了，不知道如何推銷它並讓它為人所知。你有什麼建議嗎，一般來說，一個人要讓自己的項目為世人所知（不是任何人，只是可能關心它的人）？<p>澄清一下：我沒有任何計劃，甚至沒有想過賺錢。我做這個是為了好玩，我沒有收取任何訂閱費等。<p>謝謝<p>------<p>編輯：我想我想說的是。好吧，我已經花了精力建立這個，而且它看起來很好，對我很有用。我如何驗證我的假設，即它對其他人來說是好的和有用的？<p>看到人們加入和使用它將是一個巨大的動力，使我繼續工作。(<p>編輯2：由於這是為一個相當特殊的群體服務的，而且它的目標是免費的，我不想把付費廣告放在任何地方。\n"
}