{
  "@type": "NewsArticle",
  "identifier": "2022--04--26--en--askhn--HackerNews--NewsArticle--31167985",
  "url": "https://news.ycombinator.com/item?id=31167985",
  "headline": "Ask HN: How do defense startups work?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Reading a previous thread it got me wondering about defense startups and how they bridge the gap between garage office and desert testing ground.<p>For those maybe already in this field, I'd like to hear your experiences. Here are some questions that come to mind:<p>- What distinguishes a defense startup apart from just some nerds &quot;blowing things up in the desert&quot;?<p>- Aside from accidents in testing, what are the common pitfalls of this field of study?<p>- Are there stories that come to mind about notable contractors that encountered problems? Notable successes?<p>- What legal risks are there in the development and procurement process? I'd assume just by virtue of searching certain topics or even acquiring parts you'd be having some very serious conversations with officials. Do these startups have a formal way to announce their intentions ahead of time before trouble erupts?<p>- What is the general consensus of this field when it is not war time? Is it generally feast or famine, or is the demand for defense tech relatively constant?<p>- Are these startups typically VC funded on the open market, or does your government typically fund ideas it needs/wants?<p>- What are the limitations of the concepts that may be researched? Surely you can't just come up with an idea for a particle disintegrator and start vaporizing cacti in the wild. Are defense contractors generally limited to missiles and things of that sort?<p>- What are the dominant traits that contractors generally have that make them a good fit for this field?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "KineticArms",
    "url": "https://news.ycombinator.com/user?id=KineticArms"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31167985",
  "sameAs": "https://news.ycombinator.com/item?id=31167985",
  "dateCreated": "2022-04-26T14:39:05.533Z",
  "datePublished": "2022-04-26T14:35:47.000Z",
  "dateModified": "2022-04-26T14:39:05.533Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 国防初创企业如何运作？",
  "headline_zh-Hant": "Ask HN: 國防初創企業如何運作？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在阅读之前的一篇文章时，我开始思考国防初创企业的问题，以及他们如何在车库办公室和沙漠试验场之间架起桥梁。<p>对于那些也许已经在这个领域的人，我想听听你们的经验。以下是我想到的一些问题：<p>- 国防初创公司与一些书呆子&quot;在沙漠里炸东西&quot;有什么区别？<p>- 除了测试中的意外，这个研究领域的常见陷阱是什么？<p>- 是否有想到的关于著名承包商遇到问题的故事？显著的成功？<p>- 在开发和采购过程中存在哪些法律风险？我想，仅仅凭借搜索某些主题或甚至收购零件，你就会与官员进行一些非常严肃的对话。这些初创公司是否有正式的方式在麻烦爆发之前提前宣布他们的意图？<p>- 在非战争时期，这个领域的普遍共识是什么？一般来说，是盛宴还是饥荒，还是对国防技术的需求相对稳定？<p>- 这些初创公司通常是在公开市场上获得风险投资，还是你们政府通常资助它需要/想要的想法？<p>- 可能研究的概念有什么限制？当然，你不能只想出一个粒子分解器的想法，就开始在野外蒸发仙人掌。国防承包商一般只限于导弹和诸如此类的东西吗？<p>- 承包商一般有哪些主导特征，使他们很适合这个领域？",
  "description_zh-Hant": "在閱讀之前的一篇文章時，我開始思考國防初創企業的問題，以及他們如何在車庫辦公室和沙漠試驗場之間架起橋樑。<p>對於那些也許已經在這個領域的人，我想聽聽你們的經驗。以下是我想到的一些問題：<p>- 國防初創公司與一些書呆子&quot;在沙漠裡炸東西&quot;有什麼區別？<p>- 除了測試中的意外，這個研究領域的常見陷阱是什麼？<p>- 是否有想到的關於著名承包商遇到問題的故事？顯著的成功？<p>- 在開發和採購過程中存在哪些法律風險？我想，僅僅憑藉搜索某些主題或甚至收購零件，你就會與官員進行一些非常嚴肅的對話。這些初創公司是否有正式的方式在麻煩爆發之前提前宣佈他們的意圖？<p>- 在非戰爭時期，這個領域的普遍共識是什麼？一般來說，是盛宴還是饑荒，還是對國防技術的需求相對穩定？<p>- 這些初創公司通常是在公開市場上獲得風險投資，還是你們政府通常資助它需要/想要的想法？<p>- 可能研究的概念有什麼限制？當然，你不能只想出一個粒子分解器的想法，就開始在野外蒸發仙人掌。國防承包商一般只限於導彈和諸如此類的東西嗎？<p>- 承包商一般有哪些主導特徵，使他們很適合這個領域？"
}