{
  "@type": "NewsArticle",
  "identifier": "2022--06--19--en--askhn--HackerNews--NewsArticle--31801203",
  "url": "https://news.ycombinator.com/item?id=31801203",
  "headline": "Ask HN: Why are people still publishing bad math textbooks?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "For those who only read through one book per topics, you are not the audience. Because at least you don't seem to be able to judge whether a book is good or bad. I dump any book as soon as I notice that it is bad, usually within 30 pages, and find another one.<p>I personally used 4 books to learn Linear Algebra last year, and ever since then I hated math textbook so much that I think I will never read any of them again, despite the fact that my HDD is full of math books. Because those authors usually leave blanks on somewhere maybe it is important, and I am so nervous to fill in any gap that may exist.<p>Some books are just objectively worst written. Like famous Strange's linear algebra textbook. That seems easy at the first glance, and then the learning curve is just skyrocketed to nowhere a beginner can make sense. I mean, how would someone teaching LU decomposition in the INTRODUTION part of the book???<p>And many recommends 3B1B's linear algebra series, but I don't think that is a great material. He is a great animator but definitely not even a good teacher. Those who experiencing the same frustration watching his videos may understand what I mean.<p>The problem of major math textbook is that notorious &quot;leave it as an exercise&quot; or &quot;you should prove it yourself&quot;. I am here to learn, not  &quot;self-taught&quot; self-taught. If I knew how to do that, then I don't need you. I need you (the book) because I want to know. But in order to learn a thing, first I need to learn how to prove. Then I need to learn how to prove a proof. Then again learn how to prove a proof of a proof... \nYou get the point, it is a dead loop that is so obvious to any programmer.<p>Yes, I even read logic and set theory book and it told me to prove everything myself. But somehow I don't know if it is a typo or what, the LOGIC BOOK is showing wrong thing to me. So bye-bye. Typo is fatal to a math textbook.<p>There are few books that I don't hate thus far.<p>One is the Mathematics of Quantum Computing from Springer written by a Dutch guy. He proved that yes we can have a book that is so comprehensive and &quot;author-proof&quot;. There is none unproved theorem inside the 800 pages book. All steps are printed there explicitly.<p>And Stroud Engineering Mathematics is exceptionally best written for the narrative and educational approach.<p>And maybe the Openstax Calculus. Author provided all important proofs and for those omitted, I never feel any loss.<p>Especially in mathematics, books are written in Latex, mostly words. Only words are in the book. I wish they can draw more venn diagram and flow chart or something like that, to augment the intuition.<p>I think it is non sense to set up barricade against learners. Every non harmful knowledge should be accessible to anyone and this will aid the society and the world also reduce climate effect (no one ever need to spend 6 hours googling to find out the solution).<p>So IMO making math harder than what it is and what it should be is basically pointless and it is causing damage to the humanity. Those professors thinking the opposite should stop writting anything.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "3g4o53g4o5",
    "url": "https://news.ycombinator.com/user?id=3g4o53g4o5"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31801203",
  "sameAs": "https://news.ycombinator.com/item?id=31801203",
  "dateCreated": "2022-06-19T23:23:57.194Z",
  "datePublished": "2022-06-19T17:09:34.000Z",
  "dateModified": "2022-06-19T23:23:57.194Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么人们还在出版糟糕的数学教科书？\n",
  "headline_zh-Hant": "Ask HN: 為什麼人們還在出版糟糕的數學教科書？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "对于那些每个专题只读完一本书的人来说，你们不是观众。因为至少你似乎无法判断一本书是好是坏。我一发现任何一本书不好，通常在30页内就会扔掉，然后再找另一本。<p>我个人去年用了4本书来学习线性代数，从那时起我就非常讨厌数学课本，我想我再也不会读任何一本了，尽管我的硬盘里全是数学书。因为那些作者通常会在某个地方留下空白，也许这很重要，而我很紧张，要填补任何可能存在的空白。<p>有些书就是客观上写得最差的。比如著名的Strange的线性代数教科书。那本书乍一看很容易，然后学习曲线就直线上升到一个初学者无法理解的地方。我的意思是，有人会在书的INTRODUTION部分教LU分解吗？<p>还有很多人推荐3B1B的线性代数系列，但我不认为那是一本好教材。他是一个伟大的动画师，但绝对不是一个好老师。那些在看他的视频时遇到同样挫折的人可能会明白我的意思。<p>主要数学教科书的问题是，臭名昭著的&quot;把它作为一个练习&quot;或&quot;你应该自己证明&quot;。我是来学习的，而不是&quot;自学&quot;自学。如果我知道怎么做，那我就不需要你了。我需要你（书）是因为我想知道。但是为了学习一件事，首先我需要学习如何证明。然后我需要学习如何证明一个证明。然后再学习如何证明一个证明的证明...。\n你懂的，这是一个死循环，对任何程序员来说都很明显。<p>是的，我甚至读过逻辑和集合论的书，它告诉我自己要证明一切。但不知怎的，我不知道是打错了还是什么，逻辑书上显示的是错误的东西给我。所以，再见了。错别字对数学教科书来说是致命的。<p>到目前为止，有几本书我并不讨厌。<p>一本是斯普林格公司的《量子计算数学》，作者是一个荷兰人。他证明了是的，我们可以有一本如此全面和&quot;作者证明&quot;的书。在这本800页的书中，没有一个未被证明的定理。所有的步骤都明确地印在那里。<p>而斯特劳德工程数学在叙述和教育方法上写得特别好。<p>也许还有Openstax微积分。作者提供了所有重要的证明，对于那些被省略的证明，我从来没有感到任何损失。<p>特别是在数学方面，书是用Latex写的，大部分是文字。书中只有文字。我希望他们能多画一些维恩图和流程图之类的东西，以增强直觉。<p>我认为对学习者设置障碍是没有意义的。每一个无害的知识都应该向任何人开放，这将有助于社会和世界减少气候效应（没有人需要花6个小时上网查找解决方案）。<p>因此，我认为让数学比它本身和它应该有的更难，基本上是毫无意义的，它正在对人类造成伤害。那些有相反想法的教授应该停止写任何东西。\n",
  "description_zh-Hant": "對於那些每個專題只讀完一本書的人來說，你們不是觀眾。因為至少你似乎無法判斷一本書是好是壞。我一發現任何一本書不好，通常在30頁內就會扔掉，然後再找另一本。<p>我個人去年用了4本書來學習線性代數，從那時起我就非常討厭數學課本，我想我再也不會讀任何一本了，儘管我的硬盤裡全是數學書。因為那些作者通常會在某個地方留下空白，也許這很重要，而我很緊張，要填補任何可能存在的空白。<p>有些書就是客觀上寫得最差的。比如著名的Strange的線性代數教科書。那本書乍一看很容易，然後學習曲線就直線上升到一個初學者無法理解的地方。我的意思是，有人會在書的INTRODUTION部分教LU分解嗎？<p>還有很多人推薦3B1B的線性代數系列，但我不認為那是一本好教材。他是一個偉大的動畫師，但絕對不是一個好老師。那些在看他的視頻時遇到同樣挫折的人可能會明白我的意思。<p>主要數學教科書的問題是，臭名昭著的&quot;把它作為一個練習&quot;或&quot;你應該自己證明&quot;。我是來學習的，而不是&quot;自學&quot;自學。如果我知道怎麼做，那我就不需要你了。我需要你（書）是因為我想知道。但是為了學習一件事，首先我需要學習如何證明。然後我需要學習如何證明一個證明。然後再學習如何證明一個證明的證明...。\n你懂的，這是一個死循環，對任何程序員來說都很明顯。<p>是的，我甚至讀過邏輯和集合論的書，它告訴我自己要證明一切。但不知怎的，我不知道是打錯了還是什麼，邏輯書上顯示的是錯誤的東西給我。所以，再見了。錯別字對數學教科書來說是致命的。<p>到目前為止，有幾本書我並不討厭。<p>一本是斯普林格公司的《量子計算數學》，作者是一個荷蘭人。他證明了是的，我們可以有一本如此全面和&quot;作者證明&quot;的書。在這本800頁的書中，沒有一個未被證明的定理。所有的步驟都明確地印在那裡。<p>而斯特勞德工程數學在敘述和教育方法上寫得特別好。<p>也許還有Openstax微積分。作者提供了所有重要的證明，對於那些被省略的證明，我從來沒有感到任何損失。<p>特別是在數學方面，書是用Latex寫的，大部分是文字。書中只有文字。我希望他們能多畫一些維恩圖和流程圖之類的東西，以增強直覺。<p>我認為對學習者設置障礙是沒有意義的。每一個無害的知識都應該向任何人開放，這將有助於社會和世界減少氣候效應（沒有人需要花6個小時上網查找解決方案）。<p>因此，我認為讓數學比它本身和它應該有的更難，基本上是毫無意義的，它正在對人類造成傷害。那些有相反想法的教授應該停止寫任何東西。\n"
}