{
  "@type": "NewsArticle",
  "identifier": "2022--07--23--en--askhn--HackerNews--NewsArticle--32205233",
  "url": "https://news.ycombinator.com/item?id=32205233",
  "headline": "Ask HN: How to legally protect significant technical IP when taking on cofounder",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "For the last while I have developed a machine learning platform that I believe is valuable. The algorithms work, and while some are public, they are mostly only exposed via recent research papers with no public implementation/trained models. All questions aside to whether that is true, I developed the platform to support ten or so startup ideas. Probably some will not work. The idea is then to set up new startups for each idea, find a non technical cofounder, and give them significant equity in that particular business vertical.<p>So from a legal perspective, the IP sits in a separate company, which bills the consuming company for the compute, and the startup sits in a separate entity, from which the non technical founder has equity.<p>Is this common? Are there other ways to think about it?<p>Obviously should talk to a lawyer, and yes I know ideas are cheap, but here I have already reached 90% of the technical implementation for each idea. Other caveats, I am aware startups are hard, most fail, I should focus on one, etc.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ldjkfkdsjnv",
    "url": "https://news.ycombinator.com/user?id=ldjkfkdsjnv"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32205233",
  "sameAs": "https://news.ycombinator.com/item?id=32205233",
  "dateCreated": "2022-07-23T17:36:13.720Z",
  "datePublished": "2022-07-23T17:06:15.000Z",
  "dateModified": "2022-07-23T17:36:13.720Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 吸收联合创始人时如何从法律上保护重要的技术知识产权\n",
  "headline_zh-Hant": "Ask HN: 吸收聯合創始人時如何從法律上保護重要的技術知識產權\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在过去的一段时间里，我开发了一个机器学习平台，我认为它很有价值。这些算法是有效的，虽然有些算法是公开的，但它们大多只是通过最近的研究论文曝光，没有公开的实施/训练模型。撇开所有的问题不谈，是否真的如此，我开发的平台是为了支持十来个创业的想法。可能有些不会成功。我们的想法是为每个想法建立新的创业公司，找到一个非技术性的联合创始人，并给他们在该特定业务垂直领域的重要股权。<p>因此，从法律角度来看，知识产权位于一个独立的公司中，该公司向消费公司收取计算费用，而创业公司位于一个独立的实体中，非技术性创始人拥有股权。还有其他的考虑方法吗？<p>显然应该和律师谈谈，是的，我知道想法很便宜，但在这里我已经达到了每个想法的90%的技术实现。其他注意事项，我知道初创企业很难，大多数都会失败，我应该专注于一个，等等。\n",
  "description_zh-Hant": "在過去的一段時間裡，我開發了一個機器學習平臺，我認為它很有價值。這些算法是有效的，雖然有些算法是公開的，但它們大多隻是通過最近的研究論文曝光，沒有公開的實施/訓練模型。撇開所有的問題不談，是否真的如此，我開發的平臺是為了支持十來個創業的想法。可能有些不會成功。我們的想法是為每個想法建立新的創業公司，找到一個非技術性的聯合創始人，並給他們在該特定業務垂直領域的重要股權。<p>因此，從法律角度來看，知識產權位於一個獨立的公司中，該公司向消費公司收取計算費用，而創業公司位於一個獨立的實體中，非技術性創始人擁有股權。還有其他的考慮方法嗎？<p>顯然應該和律師談談，是的，我知道想法很便宜，但在這裡我已經達到了每個想法的90%的技術實現。其他注意事項，我知道初創企業很難，大多數都會失敗，我應該專注於一個，等等。\n"
}