{
  "@type": "NewsArticle",
  "identifier": "2022--07--25--en--askhn--HackerNews--NewsArticle--32221706",
  "url": "https://news.ycombinator.com/item?id=32221706",
  "headline": "Ask HN: Should AI trained on publicly available data be banned?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The creators DALL-E and Github Copilot -- and people in favor of training AIs on publicly available data in general -- argue that people have been studying and making derivative work since the dawn of history, so there should be no problems training these models on public art and OSS software. There are many IP and copyright laws and precedent cases addressing whether a derivative work is allowed, and the images and code snippets these AIs generate seem to satisfy all of them. They are trained on publicly available sources, are not identical copy, are not clearly attributable to any original author (unless explicitly prompted to), and the AI model is incapable of having clear intention of copying when the work is being generated. These are all valid points, and certainly the lawyers at Microsoft and OpenAI can argue in favor of them better than me.<p>The problem is these laws were created when creating derivative work was not scalable.<p>Just a year ago to create a painting you have to spend years learning how to paint, studying the works of the old masters, making and improving your own works. Each new paintings take less time than the last, but the hours dedicated to create new work, either a masterpiece or a book cover, is never insignificant. To create a variation take almost as much time. To change to a new style you have to start the learning process all over again. It is hard, but you put your personal time and efforts to it. If your work was inspired by others, as long as it is not a blatant copy, the original authors will certainly feel appreciated, even if they may not like it.<p>Now all it takes is a text prompt and a few clicks, and you can create images in any style, from any author, with as many variations as you want. Code snippets generated by Copilot is not currently in the same league, but I think we can all agree that it is only a matter of time before a whole project can be created with a requirement prompt, certainly in the same style as the author or authors of the individual packages the AI was trained on.<p>The difference is industrial scale harvesting of creative efforts. Somebody admiring your works and spend time and efforts trying to learn from you is okay. If they become famous and make a lot of money you will be credited as their inspiration and at least an influence on their success. An AI blindly scanning and blending and making mass copies of altered works to make a corporation rich is not; in the corporation's eye the original authors, from the old masters to the modern amateurs, are all no different than unpaid slaves producing textiles in a mill somewhere to be fed into a machine to create mass produced clothing.<p>Sure all the training data are taken from publicly available sources with permissive license, but those licenses are created when we still think creative arts will be the last AI frontier, which wasn't event that long ago. If you could have foreseen that the license you chose back then would allow a corporation to profit from your work, would you have made the same choice?<p>So I would argue that from now on, training AIs on publicly available data must be banned, except where the work is on public domain or where the license explicitly allow the work to be fed as training data for AI models. If a law is not explicitly passed, current permissive licenses such as Creative Commons should be revised to include a clause addressing this point and let the author decide whether to let AIs train on their work or not.<p>I feel like having such a law or licensing convention established as soon as possible will greatly benefit humanity in the long term. In the short term we all want more free content, but once AIs start taking over all jobs now performed by human, creative arts will be the only source of meaning left for us in the future.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lvnfg",
    "url": "https://news.ycombinator.com/user?id=lvnfg"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32221706",
  "sameAs": "https://news.ycombinator.com/item?id=32221706",
  "dateCreated": "2022-07-25T08:35:15.143Z",
  "datePublished": "2022-07-25T08:02:22.000Z",
  "dateModified": "2022-07-25T08:35:15.143Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 是否应该禁止用公开的数据训练的人工智能？\n",
  "headline_zh-Hant": "Ask HN: 是否應該禁止用公開的數據訓練的人工智能？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "DALL-E和Github Copilot的创造者--以及一般支持在公开可用的数据上训练AI的人--认为，自有史以来，人们一直在研究和制作衍生作品，所以在公共艺术和OSS软件上训练这些模型应该没有问题。有许多知识产权和版权法以及先例处理是否允许衍生作品的问题，而这些人工智能产生的图像和代码片段似乎满足所有这些要求。它们是在公开可用的资源上训练出来的，不是相同的复制，不明确归属于任何原作者（除非明确提示），而且人工智能模型在生成作品时，不可能有明确的复制意图。这些都是有效的观点，当然，微软和OpenAI的律师可以比我更好地论证这些观点。<p>问题是这些法律是在创造衍生作品无法扩展的情况下制定的。<p>就在一年前，为了创造一幅画，你必须花数年时间学习如何作画，研究老牌大师的作品，制作和改进自己的作品。每一幅新画所花的时间都比上一幅少，但为创作新作品而付出的时间，无论是杰作还是书的封面，都是不小的。创作一个变体几乎需要同样多的时间。要改变一个新的风格，你必须重新开始学习过程。这很难，但你要投入你个人的时间和精力。如果你的作品受到别人的启发，只要不是公然抄袭，原作者肯定会感到感激，即使他们可能不喜欢。<p>现在只需要一个文本提示和几次点击，你就可以创建任何风格的图像，来自任何作者，有多少变化就有多少。由Copilot生成的代码片段目前还不在同一联盟中，但我认为我们都同意，用需求提示来创建整个项目只是一个时间问题，当然，其风格与人工智能所训练的单个软件包的作者相同。<p>区别在于对创造性努力的工业规模收获。有人欣赏你的作品并花时间和精力试图向你学习是可以的。如果他们成名并赚了很多钱，你会被认为是他们的灵感来源，至少对他们的成功有影响。一个人工智能盲目地扫描和混合，并大量复制修改过的作品以使公司致富，这是不可能的；在公司的眼里，原作者，从古老的大师到现代的业余爱好者，都和在某个地方的磨坊里生产纺织品的无薪奴隶没有什么区别，他们被送进机器里制造大量的衣服。<p>当然，所有的训练数据都来自公开可用的来源，有许可权，但这些许可是在我们仍然认为创意艺术将是人工智能的最后疆域，这不是很久以前的事。如果你能预见到你当时选择的许可会允许一个公司从你的作品中获利，你还会做出同样的选择吗？<p>因此，我认为从现在开始，必须禁止用公开的数据训练人工智能，除非该作品属于公共领域，或者许可明确允许该作品作为人工智能模型的训练数据。如果没有明确的法律，目前的许可协议（如Creative Commons）应该被修改，以包括一个解决这个问题的条款，并让作者决定是否让人工智能训练他们的作品。在短期内，我们都希望有更多的免费内容，但一旦AI开始接管现在由人类完成的所有工作，创造性的艺术将是未来留给我们的唯一意义来源。\n",
  "description_zh-Hant": "DALL-E和Github Copilot的創造者--以及一般支持在公開可用的數據上訓練AI的人--認為，自有史以來，人們一直在研究和製作衍生作品，所以在公共藝術和OSS軟件上訓練這些模型應該沒有問題。有許多知識產權和版權法以及先例處理是否允許衍生作品的問題，而這些人工智能產生的圖像和代碼片段似乎滿足所有這些要求。它們是在公開可用的資源上訓練出來的，不是相同的複製，不明確歸屬於任何原作者（除非明確提示），而且人工智能模型在生成作品時，不可能有明確的複製意圖。這些都是有效的觀點，當然，微軟和OpenAI的律師可以比我更好地論證這些觀點。<p>問題是這些法律是在創造衍生作品無法擴展的情況下制定的。<p>就在一年前，為了創造一幅畫，你必須花數年時間學習如何作畫，研究老牌大師的作品，製作和改進自己的作品。每一幅新畫所花的時間都比上一幅少，但為創作新作品而付出的時間，無論是傑作還是書的封面，都是不小的。創作一個變體幾乎需要同樣多的時間。要改變一個新的風格，你必須重新開始學習過程。這很難，但你要投入你個人的時間和精力。如果你的作品受到別人的啟發，只要不是公然抄襲，原作者肯定會感到感激，即使他們可能不喜歡。<p>現在只需要一個文本提示和幾次點擊，你就可以創建任何風格的圖像，來自任何作者，有多少變化就有多少。由Copilot生成的代碼片段目前還不在同一聯盟中，但我認為我們都同意，用需求提示來創建整個項目只是一個時間問題，當然，其風格與人工智能所訓練的單個軟件包的作者相同。<p>區別在於對創造性努力的工業規模收穫。有人欣賞你的作品並花時間和精力試圖向你學習是可以的。如果他們成名並賺了很多錢，你會被認為是他們的靈感來源，至少對他們的成功有影響。一個人工智能盲目地掃描和混合，並大量複製修改過的作品以使公司致富，這是不可能的；在公司的眼裡，原作者，從古老的大師到現代的業餘愛好者，都和在某個地方的磨坊裡生產紡織品的無薪奴隸沒有什麼區別，他們被送進機器裡製造大量的衣服。<p>當然，所有的訓練數據都來自公開可用的來源，有許可權，但這些許可是在我們仍然認為創意藝術將是人工智能的最後疆域，這不是很久以前的事。如果你能預見到你當時選擇的許可會允許一個公司從你的作品中獲利，你還會做出同樣的選擇嗎？<p>因此，我認為從現在開始，必須禁止用公開的數據訓練人工智能，除非該作品屬於公共領域，或者許可明確允許該作品作為人工智能模型的訓練數據。如果沒有明確的法律，目前的許可協議（如Creative Commons）應該被修改，以包括一個解決這個問題的條款，並讓作者決定是否讓人工智能訓練他們的作品。在短期內，我們都希望有更多的免費內容，但一旦AI開始接管現在由人類完成的所有工作，創造性的藝術將是未來留給我們的唯一意義來源。\n"
}