{
  "@type": "NewsArticle",
  "identifier": "2022--07--27--en--askhn--HackerNews--NewsArticle--32245568",
  "url": "https://news.ycombinator.com/item?id=32245568",
  "headline": "Ask HN: Has programming become less desirable to you as a job, more as a hobby?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "That's how I'm feeling about programming right now. Here are indicators that lead to this conclusion:<p>I've been unemployed for the past 2.5 years, and with my job seeking process I'm just going through the motions. Even though I applied to nearly a thousand jobs in the past year, and gotten through interviewing at ~20 companies, I have no offers. I tend to just wing it with interviews. I don't like to rehearse, so I seldom rehearse. This all sounds like not enough interest and motivation to build my career on my part.<p>I actually still don't mind much programming on the job, but I don't like to treat the interview and job seeking stuff as work. Building a network and maintaining professional relationships feels draining, too. And I'd like follow the mantra of feeling like never working a day in your life if you enjoy your work enough.<p>On the other hand, I still find it enjoyable to write programs for personal interest. I have ongoing projects that I started this year. They probably have no impact on my ability to interview, given that I still have no offers.<p>But I feel like I'm over the idea putting on a front to be a developer just to earn an income. That works for a lot of people, but not me.<p>Financially, the only difference between recent graduate me and current me is I replaced my college debt with another kind of debt. My net worth hasn't really changed much.<p>I want to enjoy myself, and turning programming into a career felt like a big waste of time because my life and finances have not noticeably improved.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "djellybeans",
    "url": "https://news.ycombinator.com/user?id=djellybeans"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32245568",
  "sameAs": "https://news.ycombinator.com/item?id=32245568",
  "dateCreated": "2022-07-27T02:34:55.531Z",
  "datePublished": "2022-07-27T00:09:08.000Z",
  "dateModified": "2022-07-27T02:34:55.531Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "Ask HN: 对你来说，编程作为一种工作是否变得不那么理想，而更多地是一种爱好？\n",
  "headline_zh-Hant": "Ask HN: 對你來說，編程作為一種工作是否變得不那麼理想，而更多地是一種愛好？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这就是我现在对编程的感觉。以下是导致这一结论的指标：<p>在过去的两年半里，我一直处于失业状态，而我的求职过程只是在走过场。尽管我在过去一年中申请了近千份工作，并通过了约20家公司的面试，但我没有收到任何邀请。我倾向于在面试中随心所欲。我不喜欢排练，所以我很少排练。这一切听起来像是我对建立自己的职业生涯没有足够的兴趣和动力。<p>实际上，我仍然不介意在工作中进行很多编程，但我不喜欢把面试和找工作的事情当作工作。建立网络和维护职业关系也感觉很累。而且我想遵循这样的咒语：如果你足够喜欢你的工作，就会觉得一辈子都不会工作。<p>另一方面，我仍然觉得为个人兴趣写程序是一件很愉快的事。我有正在进行的项目，是今年开始的。这些项目可能对我的面试能力没有影响，因为我仍然没有收到任何邀请。<p>但我觉得我已经不再是为了赚取收入而装模作样地做一个开发者了。<p>在经济上，刚毕业的我和现在的我唯一的区别是我用另一种债务取代了我的大学债务。我的净资产其实没有什么变化。<p>我想享受自己，把编程变成一个职业感觉是在浪费时间，因为我的生活和财务状况并没有明显的改善。\n",
  "description_zh-Hant": "這就是我現在對編程的感覺。以下是導致這一結論的指標：<p>在過去的兩年半里，我一直處於失業狀態，而我的求職過程只是在走過場。儘管我在過去一年中申請了近千份工作，並通過了約20家公司的面試，但我沒有收到任何邀請。我傾向於在面試中隨心所欲。我不喜歡排練，所以我很少排練。這一切聽起來像是我對建立自己的職業生涯沒有足夠的興趣和動力。<p>實際上，我仍然不介意在工作中進行很多編程，但我不喜歡把面試和找工作的事情當作工作。建立網絡和維護職業關係也感覺很累。而且我想遵循這樣的咒語：如果你足夠喜歡你的工作，就會覺得一輩子都不會工作。<p>另一方面，我仍然覺得為個人興趣寫程序是一件很愉快的事。我有正在進行的項目，是今年開始的。這些項目可能對我的面試能力沒有影響，因為我仍然沒有收到任何邀請。<p>但我覺得我已經不再是為了賺取收入而裝模作樣地做一個開發者了。<p>在經濟上，剛畢業的我和現在的我唯一的區別是我用另一種債務取代了我的大學債務。我的淨資產其實沒有什麼變化。<p>我想享受自己，把編程變成一個職業感覺是在浪費時間，因為我的生活和財務狀況並沒有明顯的改善。\n"
}