{
  "@type": "NewsArticle",
  "identifier": "2022--06--17--en--askhn--HackerNews--NewsArticle--31779097",
  "url": "https://news.ycombinator.com/item?id=31779097",
  "headline": "Ask HN: Managing people smarter than you",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I lead a software dev team at a small startup. One of my direct reports is way smarter than me. They come up with clever, simple solutions to business needs. They're also really driven, and will do things like find out what our stakeholders need and create the specs and do planning for those things. Generally we are a team and communicate pretty well on those things, but most of the time I'm left feeling like I'm not adding much value. Usually, they're the one rejecting ideas and having better ones.<p>That said, they tend to get overwhelmed easily (a bit of overthinking at times), and I'm much more comfortable communicating with leadership/presenting ideas to the company, etc. So I wouldn't recommend they step into management just yet.<p>Really what I want is to continue leading the team as best I can, and not let my ego interfere. But I guess I'm wondering how to best manage this person. Do I just sit back and let them do their thing? Try harder to meet them at their level and challenge them? How would you all like to be managed if you were in their position?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "raygelogic",
    "url": "https://news.ycombinator.com/user?id=raygelogic"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31779097",
  "sameAs": "https://news.ycombinator.com/item?id=31779097",
  "dateCreated": "2022-06-17T14:57:18.392Z",
  "datePublished": "2022-06-17T14:54:04.000Z",
  "dateModified": "2022-06-17T14:57:18.392Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 管理比你更聪明的人\n",
  "headline_zh-Hant": "Ask HN: 管理比你更聰明的人\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在一家小型创业公司领导一个软件开发团队。我的一个直接下属比我聪明多了。他们为业务需求想出了聪明、简单的解决方案。他们也很有干劲，会做一些事情，比如找出我们的利益相关者需要什么，并为这些事情制定规格和做计划。一般来说，我们是一个团队，在这些事情上沟通得很好，但大多数时候，我都觉得自己没有增加多少价值。通常情况下，他们是那个拒绝想法和有更好想法的人。<p>这就是说，他们往往容易被压倒（有时有点想太多），而我在与领导沟通/向公司介绍想法等方面要舒服得多。所以我不建议他们现在就步入管理层。<p>实际上，我想要的是继续尽我所能地领导团队，而不是让我的自我干扰。但我想我在想，如何才能最好地管理这个人。我是否只是坐下来，让他们做他们的事？更加努力地满足他们的水平并挑战他们？如果你处于他们的位置，你希望如何管理他们？\n",
  "description_zh-Hant": "我在一家小型創業公司領導一個軟件開發團隊。我的一個直接下屬比我聰明多了。他們為業務需求想出了聰明、簡單的解決方案。他們也很有幹勁，會做一些事情，比如找出我們的利益相關者需要什麼，併為這些事情制定規格和做計劃。一般來說，我們是一個團隊，在這些事情上溝通得很好，但大多數時候，我都覺得自己沒有增加多少價值。通常情況下，他們是那個拒絕想法和有更好想法的人。<p>這就是說，他們往往容易被壓倒（有時有點想太多），而我在與領導溝通/向公司介紹想法等方面要舒服得多。所以我不建議他們現在就步入管理層。<p>實際上，我想要的是繼續盡我所能地領導團隊，而不是讓我的自我干擾。但我想我在想，如何才能最好地管理這個人。我是否只是坐下來，讓他們做他們的事？更加努力地滿足他們的水平並挑戰他們？如果你處於他們的位置，你希望如何管理他們？\n"
}