{
  "@type": "NewsArticle",
  "identifier": "2022--04--15--en--askhn--HackerNews--NewsArticle--31039002",
  "url": "https://news.ycombinator.com/item?id=31039002",
  "headline": "Ask HN: Our startup raised – would you care about inflation?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi everyone, our early stage startup just raised a first round, currently for 12-18 months of runway. Like the US, inflation is hitting Europe with ~7.5% p.a., salary expectations in job interviews with newly grads are already up 15-20% compared to last year.<p>After a long time of bootstrapping, &quot;just spend faster&quot; is not a viable option to prevent inflation from shrinking that pile of cash we're sitting on – we're both culturally and operationally not yet ready to open the floodgates: hiring the right people and building the team takes time, and we also haven't figured out which sales channels are the right ones to scale. Our business is highly cyclical, so we need certain periods of the year to figure stuff out while improving product and ramping up capacity in the mean time.<p>How do you fellow founders manage this situation? Do your companies hold assets to hedge inflation risks? Do you think about putting clauses into contracts with investors to adjust future payments to inflation? Are there any good reads on cash management for startups in general?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "nkmnz",
    "url": "https://news.ycombinator.com/user?id=nkmnz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31039002",
  "sameAs": "https://news.ycombinator.com/item?id=31039002",
  "dateCreated": "2022-04-15T11:49:55.532Z",
  "datePublished": "2022-04-15T11:36:42.000Z",
  "dateModified": "2022-04-15T11:49:55.532Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们的创业公司提出--你会关心通货膨胀吗？",
  "headline_zh-Hant": "Ask HN: 我們的創業公司提出--你會關心通貨膨脹嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，我们的早期创业公司刚刚筹集了第一轮资金，目前是12-18个月的跑道。与美国一样，欧洲的通货膨胀率也达到了每年7.5%。<p>经过长时间的引导，为了防止通货膨胀使我们坐拥的那堆现金缩水，\"加快支出 \"并不是一个可行的选择--我们在文化上和运营上都还没有准备好打开闸门：雇用合适的人和建立团队需要时间，而且我们也还没有弄清楚哪些销售渠道是适合扩展的。我们的业务具有很强的周期性，因此我们需要在一年中的某些时段来弄清楚问题，同时改进产品并提高产能。<p>各位创始人朋友是如何管理这种情况的？你们的公司是否持有资产来对冲通货膨胀风险？你是否考虑过在与投资者签订的合同中加入条款，根据通货膨胀调整未来的付款？有什么关于初创企业现金管理的好书吗？",
  "description_zh-Hant": "大家好，我們的早期創業公司剛剛籌集了第一輪資金，目前是12-18個月的跑道。與美國一樣，歐洲的通貨膨脹率也達到了每年7.5%。<p>經過長時間的引導，為了防止通貨膨脹使我們坐擁的那堆現金縮水，\"加快支出 \"並不是一個可行的選擇--我們在文化上和運營上都還沒有準備好打開閘門：僱用合適的人和建立團隊需要時間，而且我們也還沒有弄清楚哪些銷售渠道是適合擴展的。我們的業務具有很強的週期性，因此我們需要在一年中的某些時段來弄清楚問題，同時改進產品並提高產能。<p>各位創始人朋友是如何管理這種情況的？你們的公司是否持有資產來對沖通貨膨脹風險？你是否考慮過在與投資者簽訂的合同中加入條款，根據通貨膨脹調整未來的付款？有什麼關於初創企業現金管理的好書嗎？"
}