{
  "@type": "NewsArticle",
  "identifier": "2022--07--11--en--askhn--HackerNews--NewsArticle--32060047",
  "url": "https://news.ycombinator.com/item?id=32060047",
  "headline": "Ask HN: Surviving a FAANG acquisition as a tech lead",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been lucky enough to have found my passion (programming) at a very young age and have been able to build a career from it. First as a developer, than making my way up the ladder as a tech lead and eventually CTO. Not so long ago, my relatively small and humble company (of which I was a CTO, not founder), caught the attention of one of the FAANGs and got acquired. I thought I had hit the jackpot. I was part of the lucky 1% whose startup did not go bankrupt, and I could now proudly have this achievement in my resume. Turns out the transition into this new company has been far from perfect. Ridiculous pressure. Extreme politics. Unrealistic deadlines, etc. On top of it, my LinkedIn profile has gone silent. Nobody seems to care that I was CTO of a company which got acquired. Maybe I was naive, but I was expecting this would serve as some sort of validation to the industry that I at least have _something_ valuable to offer, and offers would be coming in left and right. Nope.<p>I used to be a high-achiever, go-getter, work-first type of person, but joining a FAANG through an acquisition as a glorified middle manager has completely ripped the soul out of me. I've gone from a positive, highly confident tech professional into a bad-tempered, cynic paper-pusher.<p>Has anyone been through a similar sort of experience? Is the only way out of this to simply leave the company, or is there a middle ground I'm not seeing?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "twaway322",
    "url": "https://news.ycombinator.com/user?id=twaway322"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32060047",
  "sameAs": "https://news.ycombinator.com/item?id=32060047",
  "dateCreated": "2022-07-11T19:21:59.450Z",
  "datePublished": "2022-07-11T18:44:26.000Z",
  "dateModified": "2022-07-11T19:21:59.450Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 作为技术带头人，在FAANG的收购中生存下来\n",
  "headline_zh-Hant": "Ask HN: 作為技術帶頭人，在FAANG的收購中生存下來\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我很幸运，在很年轻的时候就找到了自己的激情（编程），并且能够以此为基础建立自己的职业生涯。首先是作为一个开发人员，然后是作为一个技术负责人，最后是CTO，一路向上。不久前，我那相对较小的、不起眼的公司（我是首席技术官，而不是创始人），引起了一家FAANGs公司的注意并被收购。我以为我中了大奖。我是创业公司没有破产的那1%的幸运儿，我现在可以自豪地在我的简历上写上这个成就。结果发现，过渡到这家新公司的过程远非完美。可笑的压力。极端的政治。不现实的最后期限，等等。最重要的是，我的LinkedIn个人资料已经沉寂了。似乎没有人关心我是一家被收购的公司的CTO。也许我太天真了，但我本以为这将成为行业的某种验证，证明我至少有一些有价值的东西可以提供，然后就会有越来越多的邀请。<p>我曾经是一个有成就感、积极进取、工作至上的人，但通过收购加入一家FAANG公司，成为一名光荣的中层经理，这完全撕裂了我的灵魂。我从一个积极的、高度自信的技术专家变成了一个坏脾气的、愤世嫉俗的纸上谈兵者。<p>有谁经历过类似的经历？唯一的出路是直接离开公司，还是有一个我没有看到的中间地带？\n",
  "description_zh-Hant": "我很幸運，在很年輕的時候就找到了自己的激情（編程），並且能夠以此為基礎建立自己的職業生涯。首先是作為一個開發人員，然後是作為一個技術負責人，最後是CTO，一路向上。不久前，我那相對較小的、不起眼的公司（我是首席技術官，而不是創始人），引起了一家FAANGs公司的注意並被收購。我以為我中了大獎。我是創業公司沒有破產的那1%的幸運兒，我現在可以自豪地在我的簡歷上寫上這個成就。結果發現，過渡到這家新公司的過程遠非完美。可笑的壓力。極端的政治。不現實的最後期限，等等。最重要的是，我的LinkedIn個人資料已經沉寂了。似乎沒有人關心我是一家被收購的公司的CTO。也許我太天真了，但我本以為這將成為行業的某種驗證，證明我至少有一些有價值的東西可以提供，然後就會有越來越多的邀請。<p>我曾經是一個有成就感、積極進取、工作至上的人，但通過收購加入一家FAANG公司，成為一名光榮的中層經理，這完全撕裂了我的靈魂。我從一個積極的、高度自信的技術專家變成了一個壞脾氣的、憤世嫉俗的紙上談兵者。<p>有誰經歷過類似的經歷？唯一的出路是直接離開公司，還是有一個我沒有看到的中間地帶？\n"
}