{
  "@type": "NewsArticle",
  "identifier": "2022--06--10--en--askhn--HackerNews--NewsArticle--31689274",
  "url": "https://news.ycombinator.com/item?id=31689274",
  "headline": "Ask HN: How to Overcome “Musical Dyslexia?”",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "&quot;Musical dyslexia&quot; isn't quite the right term (what is a better term?) I have trouble anticipating/&quot;feeling&quot; music when (swing) dancing. So I have trouble recognizing/recalling musical patterns; not necessarily reading musical notation.<p>Dyslexics can learn how to read, but they need to be taught differently. Is there some type of musical training for people like me? I managed to learn how to feel/anticipate 8-count beats, but can't get beyond 8-counts (while dancing). I even tried building a beat-aware video player[1] to help me learn musicality.<p>I've heard the argument musicality is acquired, not learned. I think acquisition would be better, but does not rule out learning. For example, I never heard about &quot;uncountable nouns&quot; while learning English as a native speaker; only in the context of ESL. This is English grammar native speakers acquire, but ESL students tend to learn. But there doesn't seem to be any &quot;ESL&quot; for music.<p>I can read sheet music and understand musical patterns at an intellectual level. However, despite taking piano lessons for more than two years, I didn't understand some fundamental musical concepts (like the emphasis on the &quot;1&quot; beat) until over a decade later when learning how to dance.<p>During that whole time, I was listening to music all the time. Although vaguely aware of what a 3-count waltz beat was, my mind was blown when I learned you could waltz to a Bryan Adams song I had heard over and over before. So I think I have some type of music learning disability.<p>Often when music breaks dancers will stop with the music. I couldn't figure how other dancers knew when to do this. Did they memorize the songs? Even armed with the knowledge that (big band/pop) music often follows a very regular repeating 32-count pattern, it's very hard for me to predict exactly when the music will break (especially while dancing at the same time).<p>Apparently another way to feel the music is by the relative intensity of major beats. The first beat in a bar is usually the strongest; the last beat the weakest. Likewise, in a set of 2, 4, 8 bars the first beat will be strongest and the last beat the weakest. I explained this in more detail here[2]. In addition, there's often a &quot;ramp-up&quot; or &quot;ramp-down&quot; in the final bars of an 8-bar set leading to the big &quot;1&quot; beat of the next 8-bar set. So there is a spectrum of relative intensities correlated to position in the music.<p>Unfortunately, I either lack the ability to recall more than the most recent 8 beats and/or sense the fine differences in the relative intensity of the beats. My mind seems to be better at processing visual information slowly and recalling summaries; not processing audio information in real-time and verbatim recall.<p>I would be happy just to be able to feel the basic 32-count beat patterns. But I know there are even more layers to musicality. Like picking out the melody or a specific instrument. Apparently songs have structure and &quot;tell&quot; a story (outside the lyrics) which just goes completely over my head.<p>[1]: https://phrasier.leftium.com/<p>[2]: https://cafe.naver.com/hotcoolswing/7922",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Leftium",
    "url": "https://news.ycombinator.com/user?id=Leftium"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31689274",
  "sameAs": "https://news.ycombinator.com/item?id=31689274",
  "dateCreated": "2022-06-10T03:35:19.028Z",
  "datePublished": "2022-06-10T02:20:26.000Z",
  "dateModified": "2022-06-10T03:35:19.028Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何克服 \"音乐阅读障碍症\"？\n",
  "headline_zh-Hant": "Ask HN: 如何克服 \"音樂閱讀障礙症\"？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在跳（摇摆舞）时，很难预测/感觉到音乐。所以我在识别/回忆音乐模式方面有困难；不一定是阅读音乐符号。<p>阅读障碍者可以学习如何阅读，但他们需要不同的教育方式。是否有某种类型的音乐训练适合像我这样的人？我设法学会了如何感受/预测8拍，但却无法超过8拍（在跳舞时）。我甚至试图建立一个节拍感知的视频播放器[1]来帮助我学习音乐性。<p>我听说过这样的说法：音乐性是后天获得的，而不是学习的。我认为获得更好，但并不排除学习。例如，我在作为母语者学习英语时从未听说过&quot;不可数名词&quot;，只是在ESL的背景下听说过。这是以英语为母语者获得的英语语法，但ESL学生往往要学习。但是对于音乐来说，似乎没有任何&quot;ESL&quot;。<p>我可以阅读乐谱，并在知识层面理解音乐模式。然而，尽管上了两年多的钢琴课，我还是不明白一些基本的音乐概念（比如强调&quot;1&quot;节拍），直到十多年后学习舞蹈时才明白。<p>在这段时间里，我一直在听音乐。虽然我隐约知道什么是3拍华尔兹，但当我知道你可以随着我以前反复听过的布莱恩-亚当斯的歌跳华尔兹时，我的头脑被震撼了。所以我认为我有某种类型的音乐学习障碍。<p>通常当音乐中断时，舞者会随着音乐停止。我不明白其他舞者是如何知道什么时候该这样做的。他们记住了这些歌曲吗？即使掌握了（大乐队/流行乐）音乐通常遵循非常有规律的重复32拍模式的知识，我也很难准确预测音乐何时会中断（尤其是在同时跳舞的时候）。<p>显然，感受音乐的另一种方式是通过大节拍的相对强度。一个小节中的第一拍通常是最强的；最后一拍是最弱的。同样地，在一组2、4、8小节中，第一拍最强，最后一拍最弱。我在这里更详细地解释了这一点[2]。此外，往往有一个&quot;斜坡上升&quot;或&quot;斜坡下降&quot;在一个8小节组的最后一小节，导致下一个8小节组的大&quot;1&quot;节。因此，有一个相对强度的频谱与音乐中的位置相关。<p>不幸的是，我要么缺乏回忆最近8个节拍以上的能力，要么感觉不到节拍的相对强度的细微差别。我的大脑似乎更擅长缓慢地处理视觉信息和回忆摘要；而不是实时地处理音频信息和逐字逐句地回忆。但我知道，音乐性还有更多层次。比如挑选出旋律或特定的乐器。显然，歌曲是有结构的，而且（在歌词之外）还讲了一个故事，而我却完全不知道。<p>[1]: https://phrasier.leftium.com/<p>[2]: https://cafe.naver.com/hotcoolswing/7922\n",
  "description_zh-Hant": "我在跳（搖擺舞）時，很難預測/感覺到音樂。所以我在識別/回憶音樂模式方面有困難；不一定是閱讀音樂符號。<p>閱讀障礙者可以學習如何閱讀，但他們需要不同的教育方式。是否有某種類型的音樂訓練適合像我這樣的人？我設法學會了如何感受/預測8拍，但卻無法超過8拍（在跳舞時）。我甚至試圖建立一個節拍感知的視頻播放器[1]來幫助我學習音樂性。<p>我聽說過這樣的說法：音樂性是後天獲得的，而不是學習的。我認為獲得更好，但並不排除學習。例如，我在作為母語者學習英語時從未聽說過&quot;不可數名詞&quot;，只是在ESL的背景下聽說過。這是以英語為母語者獲得的英語語法，但ESL學生往往要學習。但是對於音樂來說，似乎沒有任何&quot;ESL&quot;。<p>我可以閱讀樂譜，並在知識層面理解音樂模式。然而，儘管上了兩年多的鋼琴課，我還是不明白一些基本的音樂概念（比如強調&quot;1&quot;節拍），直到十多年後學習舞蹈時才明白。<p>在這段時間裡，我一直在聽音樂。雖然我隱約知道什麼是3拍華爾茲，但當我知道你可以隨著我以前反覆聽過的布萊恩-亞當斯的歌跳華爾茲時，我的頭腦被震撼了。所以我認為我有某種類型的音樂學習障礙。<p>通常當音樂中斷時，舞者會隨著音樂停止。我不明白其他舞者是如何知道什麼時候該這樣做的。他們記住了這些歌曲嗎？即使掌握了（大樂隊/流行樂）音樂通常遵循非常有規律的重複32拍模式的知識，我也很難準確預測音樂何時會中斷（尤其是在同時跳舞的時候）。<p>顯然，感受音樂的另一種方式是通過大節拍的相對強度。一個小節中的第一拍通常是最強的；最後一拍是最弱的。同樣地，在一組2、4、8小節中，第一拍最強，最後一拍最弱。我在這裡更詳細地解釋了這一點[2]。此外，往往有一個&quot;斜坡上升&quot;或&quot;斜坡下降&quot;在一個8小節組的最後一小節，導致下一個8小節組的大&quot;1&quot;節。因此，有一個相對強度的頻譜與音樂中的位置相關。<p>不幸的是，我要麼缺乏回憶最近8個節拍以上的能力，要麼感覺不到節拍的相對強度的細微差別。我的大腦似乎更擅長緩慢地處理視覺信息和回憶摘要；而不是實時地處理音頻信息和逐字逐句地回憶。但我知道，音樂性還有更多層次。比如挑選出旋律或特定的樂器。顯然，歌曲是有結構的，而且（在歌詞之外）還講了一個故事，而我卻完全不知道。<p>[1]: https://phrasier.leftium.com/<p>[2]: https://cafe.naver.com/hotcoolswing/7922\n"
}