{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--askhn--HackerNews--NewsArticle--31587477",
  "url": "https://news.ycombinator.com/item?id=31587477",
  "headline": "Ask HN: Is Tether Under Attack?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have been watching Tether ever since the Terra implosion. As you know, shortly thereafter tether flash crashed to 95 cents. It has since recovered but it seems to me that it hasn’t recovered all the way. Disclaimer, I have just been checking in on tether on coinmarketcap.com. I have no doubt this isn’t the best way to get an accurate reading of the state of tether.<p>That being said, since the flash crash it looks like tether has been averaging just below $1. Somewhere around 0.9995. That might seem like close enough, but prior to the flash crash tether would regularly fluctuate above $1 by minuscule amounts. It doesn’t seem to every go above $1 now. Does this represent constant slow downward pressure on tether, maybe even traders take advantage of small arbitrage opportunities when the currency fluctuates lower?<p>I’ve also notice that in coinmarketcap there have multiple step-like movements, always downward, in tether’s market cap. These step down movements are roughly in increments of $1B. In total it has lost about $10B. I realize that this is superimposed on the background of the broader crypto ecosystem losing a large amount of market cap. But I guess the worry with tether is that some of it is probably well back with actual USD and some of it is probably backed with sketchy corporate paper. If they have to redeem to cover market cap loses, won’t they have to redeem the high quality backing first, meaning over time the percentage of tether that is sketchily back will increase?<p>Again, I realize the coinmarketcap probable isn’t the best way to be tracking this. What does anyone thing is going on?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "honksillet",
    "url": "https://news.ycombinator.com/user?id=honksillet"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31587477",
  "sameAs": "https://news.ycombinator.com/item?id=31587477",
  "dateCreated": "2022-06-02T13:54:07.262Z",
  "datePublished": "2022-06-01T20:18:20.000Z",
  "dateModified": "2022-06-02T13:54:07.262Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: Tether受到攻击吗？\n",
  "headline_zh-Hant": "Ask HN: Tether受到攻擊嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "自从Terra内爆以来，我一直在关注Tether。如你所知，此后不久，Tether闪存崩溃到95美分。此后，它又恢复了，但在我看来，它还没有完全恢复。免责声明，我只是在coinmarketcap.com上查看了ether的情况。我毫不怀疑这不是准确了解tether状况的最好方法。<p>话虽如此，自从闪电崩盘以来，tether的平均价格似乎一直略低于1美元，大约在0.9995左右。这可能看起来足够接近，但在闪电崩盘之前，tether经常在1美元以上波动，幅度很小。现在似乎没有超过1美元了。这是否代表了tether持续缓慢的下行压力，甚至可能是交易员在货币波动较低时利用小的套利机会？<p>我还注意到，在coinmarketcap中，tether的市值有多次阶梯式的移动，总是向下的。这些阶梯式的移动大约是以10亿美元为单位。总的来说，它已经损失了大约100亿美元。我意识到，这是在更广泛的加密货币生态系统失去大量市值的背景下叠加的。但我想，对tether的担心是，其中一些可能是用实际的美元支持的，一些可能是用简略的公司文件支持的。如果他们必须赎回以弥补市值的损失，他们岂不是要先赎回高质量的支持，这意味着随着时间的推移，小规模支持的tether的百分比会增加？有人认为这是怎么回事吗？\n",
  "description_zh-Hant": "自從Terra內爆以來，我一直在關注Tether。如你所知，此後不久，Tether閃存崩潰到95美分。此後，它又恢復了，但在我看來，它還沒有完全恢復。免責聲明，我只是在coinmarketcap.com上查看了ether的情況。我毫不懷疑這不是準確瞭解tether狀況的最好方法。<p>話雖如此，自從閃電崩盤以來，tether的平均價格似乎一直略低於1美元，大約在0.9995左右。這可能看起來足夠接近，但在閃電崩盤之前，tether經常在1美元以上波動，幅度很小。現在似乎沒有超過1美元了。這是否代表了tether持續緩慢的下行壓力，甚至可能是交易員在貨幣波動較低時利用小的套利機會？<p>我還注意到，在coinmarketcap中，tether的市值有多次階梯式的移動，總是向下的。這些階梯式的移動大約是以10億美元為單位。總的來說，它已經損失了大約100億美元。我意識到，這是在更廣泛的加密貨幣生態系統失去大量市值的背景下疊加的。但我想，對tether的擔心是，其中一些可能是用實際的美元支持的，一些可能是用簡略的公司文件支持的。如果他們必須贖回以彌補市值的損失，他們豈不是要先贖回高質量的支持，這意味著隨著時間的推移，小規模支持的tether的百分比會增加？有人認為這是怎麼回事嗎？\n"
}