{
  "@type": "NewsArticle",
  "identifier": "2022--04--26--en--askhn--HackerNews--NewsArticle--31163681",
  "url": "https://news.ycombinator.com/item?id=31163681",
  "headline": "Ask HN: What strategy should I use to determine whether to enter an app market?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have spent my entire career in the app development industry. I have many years of experience as an engineer, and many years of experience as a manager of native app engineers. I’m very entrepreneurially minded and I’m always looking for an app to make that can give me a reason to quit my day job.<p>I recently connected with a very successful entrepreneur who is far more wealthy than I could ever hope to be and we’ve been riffing on an app idea for a few months and we’re to the point where we’re clear on what we want to build, and he’s willing to pay for the development costs while I manage the team of developers.<p>We’re excited and nearly ready to pull the trigger!<p>But…there’s this nagging detail about the current market not exactly being void of competition that is giving me pause. I recognize it’s impossible these days to enter a market and be the only player, but there are a good number of apps that do small portions of what we want to do. Our vision for this tool is to make a large app that brings all of the functionality our customer could want into one app. As it happens, most of the main features exist in smaller apps, in varying degrees, on the App Store today but they are all disjointed. For our customer to get the quality of experience we want to deliver they’d need like five different apps, and then even then the apps don’t communicate with each other. So the experience for the customer is not seamless or pleasant.<p>So my question is about our fundamental approach to strategy. We didn’t set out to make a mega app that incorporated all of these apps under one roof, rather, we dreamed up what the ultimate experience would be for our customer and we happened to discover that smaller players had developed some pieces already in separate apps.<p>What are some things to keep in mind when deciding to enter a market? Is it a red flag when most of what we want to do is mostly available today, just in a lower quality/piece meal offering? If our value prop was to merely do everything well under one roof and for a reasonable price, is that enough to get compete against the smaller apps that already have a lead and somewhat of a following?<p>I love the vision we have for the product, but the existence of many smaller apps (many of which have not succeeded at all) give me reason to pause. But it very well could be the case that I’m being a scaredy-cat and I just need to plow through this.<p>Any thoughts or advice would be appreciated!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "archeantus",
    "url": "https://news.ycombinator.com/user?id=archeantus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31163681",
  "sameAs": "https://news.ycombinator.com/item?id=31163681",
  "dateCreated": "2022-04-26T03:46:14.287Z",
  "datePublished": "2022-04-26T03:37:00.000Z",
  "dateModified": "2022-04-26T03:46:14.287Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该用什么策略来决定是否进入一个应用市场？",
  "headline_zh-Hant": "Ask HN: 我應該用什麼策略來決定是否進入一個應用市場？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的整个职业生涯都是在应用开发行业度过的。我有多年的工程师经验，也有多年的原生应用工程师的管理经验。<p>我最近与一位非常成功的企业家建立了联系，他的财富远远超过了我的期望，我们已经就一个应用程序的想法进行了几个月的讨论，我们已经明确了我们想要建立的东西，他愿意支付开发成本，而我则管理开发团队。 <p>我们很兴奋，几乎已经准备好扣动扳机了！<p>但是......有一个令人不安的细节，即目前的市场并不完全是没有竞争的，这让我感到不安。我认识到，如今不可能进入一个市场并成为唯一的玩家，但有很多应用程序可以做我们想做的一小部分。我们对这个工具的愿景是制作一个大型应用程序，将我们的客户可能想要的所有功能都纳入一个应用程序。碰巧的是，大部分的主要功能都存在于今天App Store上的小型应用中，程度不一，但它们都是不连贯的。为了让我们的客户获得我们想要提供的高质量的体验，他们需要五个不同的应用程序，而且即使这样，这些应用程序之间也不能相互沟通。因此，客户的体验不是无缝的或令人愉快的。<p>因此，我的问题是关于我们的基本战略方法。我们并没有打算制作一个大型的应用程序，将所有这些应用程序整合到一个屋檐下，相反，我们梦想着客户的最终体验是什么，而且我们碰巧发现，小公司已经在独立的应用程序中开发了一些部分。如果我们想做的大部分事情在今天已经有了，只是质量/件数较低，这是不是一个红旗？如果我们的价值主张仅仅是在一个屋檐下以合理的价格做好所有事情，这是否足以与那些已经拥有领先优势和一些追随者的小型应用程序竞争？<p>我喜欢我们对产品的愿景，但许多小型应用程序（其中许多根本没有成功）的存在让我有理由暂停。但是，这很可能是我太胆小了，我只需要把它做完。<p>如果有任何想法或建议，我们将不胜感激",
  "description_zh-Hant": "我的整個職業生涯都是在應用開發行業度過的。我有多年的工程師經驗，也有多年的原生應用工程師的管理經驗。<p>我最近與一位非常成功的企業家建立了聯繫，他的財富遠遠超過了我的期望，我們已經就一個應用程序的想法進行了幾個月的討論，我們已經明確了我們想要建立的東西，他願意支付開發成本，而我則管理開發團隊。 <p>我們很興奮，幾乎已經準備好扣動扳機了！<p>但是......有一個令人不安的細節，即目前的市場並不完全是沒有競爭的，這讓我感到不安。我認識到，如今不可能進入一個市場併成為唯一的玩家，但有很多應用程序可以做我們想做的一小部分。我們對這個工具的願景是製作一個大型應用程序，將我們的客戶可能想要的所有功能都納入一個應用程序。碰巧的是，大部分的主要功能都存在於今天App Store上的小型應用中，程度不一，但它們都是不連貫的。為了讓我們的客戶獲得我們想要提供的高質量的體驗，他們需要五個不同的應用程序，而且即使這樣，這些應用程序之間也不能相互溝通。因此，客戶的體驗不是無縫的或令人愉快的。<p>因此，我的問題是關於我們的基本戰略方法。我們並沒有打算製作一個大型的應用程序，將所有這些應用程序整合到一個屋簷下，相反，我們夢想著客戶的最終體驗是什麼，而且我們碰巧發現，小公司已經在獨立的應用程序中開發了一些部分。如果我們想做的大部分事情在今天已經有了，只是質量/件數較低，這是不是一個紅旗？如果我們的價值主張僅僅是在一個屋簷下以合理的價格做好所有事情，這是否足以與那些已經擁有領先優勢和一些追隨者的小型應用程序競爭？<p>我喜歡我們對產品的願景，但許多小型應用程序（其中許多根本沒有成功）的存在讓我有理由暫停。但是，這很可能是我太膽小了，我只需要把它做完。<p>如果有任何想法或建議，我們將不勝感激"
}