{
  "@type": "NewsArticle",
  "identifier": "2022--04--15--en--askhn--HackerNews--NewsArticle--31045615",
  "url": "https://news.ycombinator.com/item?id=31045615",
  "headline": "Ask HN: Am I being fooled at a Dutch startup?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "A couple years ago I started working for a Dutch startup. I was offered an equity package, but didn't think much of it at that time. After going through a couple of funding rounds, well, I started looking into it. The Dutch structure is called STAK and is basically a company-in-a-company without any voting rights. Currently it is about 6% of company stock divided among 10 employees. I'm still very well aware that it could be worth 0 EUR in the end. I also very well aware of tricks being played by investors and engineers being squeezed out of their faire share. Since money came, it all about scaling up and getting a good exit.<p>A month ago I (and the other engineers) were finally able to sign the original STAK equity contract. It was apparently an additonal contract. This might be negligence on my side, but I simply didn't know. The equity package and vesting scheme is briefly mentioned in my initial contract. In this new contract the vesting scheme changed and included a lot of additional company and personal goals to be achieved. So it is not only time-based now. (it was said this was for tax reasons). Due to this it makes it a lot harder to vest any additional stock (about half would probably impossible to vest).<p>I'm on good terms with the founders and I think it is possible to renogatiate this. But I don't know where to start. I read a lot about equity packages at American startups, but this probably doesn't apply for my situation. Can anyone offer me advice\n- What to do best?\n- How do I make sure what I vest, I really do vest and they don't change the rules again?\n- Is it worth anything (even after an exit).\n- The additional goals were set because of tax authority rules (is this a straight out lie)?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway106720",
    "url": "https://news.ycombinator.com/user?id=throwaway106720"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31045615",
  "sameAs": "https://news.ycombinator.com/item?id=31045615",
  "dateCreated": "2022-04-15T20:49:55.359Z",
  "datePublished": "2022-04-15T20:45:43.000Z",
  "dateModified": "2022-04-15T20:49:55.359Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我在荷兰的一家创业公司被愚弄了吗？",
  "headline_zh-Hant": "Ask HN: 我在荷蘭的一家創業公司被愚弄了嗎？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几年前，我开始为一家荷兰创业公司工作。我得到了一个股权方案，但当时并没有多想。在经历了几轮融资后，好吧，我开始研究它。荷兰的结构被称为STAK，基本上是一个没有任何投票权的公司中公司。目前，它是大约6%的公司股票，由10名员工分担。我仍然非常清楚地知道，它最终可能只值0欧元。我也非常清楚地知道投资者在玩什么把戏，工程师被挤出了他们的份额。<p>一个月前，我（和其他工程师）终于能够签署STAK的原始股权合同。这显然是一份附加的合同。这可能是我这边的疏忽，但我根本不知道。在我最初的合同中简要地提到了股权方案和归属计划。在这份新的合同中，归属计划发生了变化，包括了许多需要实现的额外的公司和个人目标。因此，现在不仅仅是基于时间。(据说这是出于税收原因）。由于这个原因，它使得任何额外的股票都很难归属（大约有一半可能无法归属）。<p>我和创始人的关系很好，我认为有可能重新达成协议。但我不知道该从哪里开始。我读了很多关于美国初创公司的股权方案，但这可能不适用于我的情况。谁能给我建议\n- 做什么最好？\n- 我怎样才能确保我的权益真的得到了，而且他们不会再改变规则？\n- 它是否有价值（即使在退出后）。\n- 额外的目标是由于税务机关的规则而设定的（这是一个直接的谎言吗）？",
  "description_zh-Hant": "幾年前，我開始為一家荷蘭創業公司工作。我得到了一個股權方案，但當時並沒有多想。在經歷了幾輪融資後，好吧，我開始研究它。荷蘭的結構被稱為STAK，基本上是一個沒有任何投票權的公司中公司。目前，它是大約6%的公司股票，由10名員工分擔。我仍然非常清楚地知道，它最終可能只值0歐元。我也非常清楚地知道投資者在玩什麼把戲，工程師被擠出了他們的份額。<p>一個月前，我（和其他工程師）終於能夠簽署STAK的原始股權合同。這顯然是一份附加的合同。這可能是我這邊的疏忽，但我根本不知道。在我最初的合同中簡要地提到了股權方案和歸屬計劃。在這份新的合同中，歸屬計劃發生了變化，包括了許多需要實現的額外的公司和個人目標。因此，現在不僅僅是基於時間。(據說這是出於稅收原因）。由於這個原因，它使得任何額外的股票都很難歸屬（大約有一半可能無法歸屬）。<p>我和創始人的關係很好，我認為有可能重新達成協議。但我不知道該從哪裡開始。我讀了很多關於美國初創公司的股權方案，但這可能不適用於我的情況。誰能給我建議\n- 做什麼最好？\n- 我怎樣才能確保我的權益真的得到了，而且他們不會再改變規則？\n- 它是否有價值（即使在退出後）。\n- 額外的目標是由於稅務機關的規則而設定的（這是一個直接的謊言嗎）？"
}