{
  "@type": "NewsArticle",
  "identifier": "2022--06--13--en--askhn--HackerNews--NewsArticle--31732767",
  "url": "https://news.ycombinator.com/item?id=31732767",
  "headline": "Ask HN: How broken is YouTube these days?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been sick two weeks ago and had lots of time to spare while laying on the couch. I used that for viewing too much stuff on YouTube.<p>Here are some findings (German user) and I'd like your experience on this. Maybe it's anecdotal but I've got the feeling YouTube is really going down the drain.<p>- _lots of_ ads everywhere<p>- I got unskippable 15 second pre-roll ads on 17 second videos<p>- I got three pre-roll ads regularly, even on short videos and smaller channels<p>- I got lots of post-roll ads, too<p>- I've got lots of video ads where pharmaceutical companies are promoting to &quot;talk to your doctor about the vaccine for XY&quot; - wtf, is this even legal?<p>- Ads load better than the video<p>- In-App ads are directly from the shady/scummy section: &quot;get rich quick&quot;-schemes/courses, cartoonish erotic apps, phone optimizer apps, &quot;lose 30 pounds in 30 days&quot;-fitness apps, &quot;free&quot; book downloads with signup pages from hell, probably fake IPO signups, crypto investment apps... the list goes on...<p>- after reporting too many of those ads, I've lost the function to report any ad at all. I'm not kidding, the menu item is just gone.<p>- recommendations are showing me lots of videos I've watched before OR are totally unrelated to what I'm interested in<p>- recommendations are often filled with videos from 6 to 10 years ago<p>All in all YouTube seems to be a total shitshow and it feels like they don't care anything at all about the user experience.<p>With all those scummy ads I felt like 15 years ago on some crazy &quot;free movie downloadz&quot;-website but not on THE biggest video platform of the world.<p>Does Google/YT care so little? Have they automated and laid off everybody who could veto against all those &quot;create your sexy arabian princess and play with her&quot;-apps or all the &quot;phone optimizers&quot; who are going to do god knows what with your phone?<p>What's your experience on YT these days? Is it similar to mine or totally different?<p>I really like lots of the content, but the surroundings...",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "martin_a",
    "url": "https://news.ycombinator.com/user?id=martin_a"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31732767",
  "sameAs": "https://news.ycombinator.com/item?id=31732767",
  "dateCreated": "2022-06-13T22:57:55.305Z",
  "datePublished": "2022-06-13T22:54:26.000Z",
  "dateModified": "2022-06-13T22:57:55.305Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 现在的YouTube有多破？\n",
  "headline_zh-Hant": "Ask HN: 現在的YouTube有多破？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "两周前我生病了，躺在沙发上时有很多时间。我利用这段时间在YouTube上看了太多的东西。<p>这里有一些发现（德国用户），我想知道你对此的经验。也许这只是传闻，但我感觉到YouTube真的在走下坡路。 <p>- 到处都是大量的广告<p>- 我在17秒的视频上看到了不可跳过的15秒的预热广告<p>- 我经常看到三个预热广告，甚至在短视频和小频道上也是如此<p>- 我也看到了很多后滚动广告<p>- 我看到了很多视频广告，制药公司正在宣传&quot;与你的医生讨论XY的疫苗&quot;--wtf，这甚至合法吗？ <p>- 广告加载比视频更好<p>- 应用内广告直接来自阴暗/淫秽部分：&quot;快速致富&quot;计划/课程、卡通色情应用、手机优化应用、&quot;30天内减掉30磅&quot;健身应用、&quot;免费&quot;书籍下载与来自地狱的注册页面、可能是假的IPO注册、加密货币投资应用。 ......名单还在继续......<p>-在报告了太多这样的广告后，我已经失去了报告任何广告的功能。我不是在开玩笑，这个菜单项就这样消失了。<p>- 推荐给我的是很多我以前看过的视频，或者与我感兴趣的东西完全无关的视频<p>- 推荐经常充满了6到10年前的视频<p>总之，YouTube似乎是一个完全的狗屎节目，感觉他们根本不关心用户体验的事情。 <p>所有这些垃圾广告让我感觉像是15年前在一些疯狂的&quot;免费电影下载z&quot;网站上，但不是在世界最大的视频平台上。<p>Google/YT这么不在乎吗？他们是否已经将所有能够否决所有那些 \"创造你的性感阿拉伯公主并与她一起玩耍 \"的应用程序或所有 \"手机优化器 \"的人自动化并解雇了，他们将对你的手机做天知道的事情？是与我相似还是完全不同？<p>我真的喜欢很多内容，但周围的环境...\n",
  "description_zh-Hant": "兩週前我生病了，躺在沙發上時有很多時間。我利用這段時間在YouTube上看了太多的東西。<p>這裡有一些發現（德國用戶），我想知道你對此的經驗。也許這只是傳聞，但我感覺到YouTube真的在走下坡路。 <p>- 到處都是大量的廣告<p>- 我在17秒的視頻上看到了不可跳過的15秒的預熱廣告<p>- 我經常看到三個預熱廣告，甚至在短視頻和小頻道上也是如此<p>- 我也看到了很多後滾動廣告<p>- 我看到了很多視頻廣告，製藥公司正在宣傳&quot;與你的醫生討論XY的疫苗&quot;--wtf，這甚至合法嗎？ <p>- 廣告加載比視頻更好<p>- 應用內廣告直接來自陰暗/淫穢部分：&quot;快速致富&quot;計劃/課程、卡通色情應用、手機優化應用、&quot;30天內減掉30磅&quot;健身應用、&quot;免費&quot;書籍下載與來自地獄的註冊頁面、可能是假的IPO註冊、加密貨幣投資應用。 ......名單還在繼續......<p>-在報告了太多這樣的廣告後，我已經失去了報告任何廣告的功能。我不是在開玩笑，這個菜單項就這樣消失了。<p>- 推薦給我的是很多我以前看過的視頻，或者與我感興趣的東西完全無關的視頻<p>- 推薦經常充滿了6到10年前的視頻<p>總之，YouTube似乎是一個完全的狗屎節目，感覺他們根本不關心用戶體驗的事情。 <p>所有這些垃圾廣告讓我感覺像是15年前在一些瘋狂的&quot;免費電影下載z&quot;網站上，但不是在世界最大的視頻平臺上。<p>Google/YT這麼不在乎嗎？他們是否已經將所有能夠否決所有那些 \"創造你的性感阿拉伯公主並與她一起玩耍 \"的應用程序或所有 \"手機優化器 \"的人自動化並解僱了，他們將對你的手機做天知道的事情？是與我相似還是完全不同？<p>我真的喜歡很多內容，但周圍的環境...\n"
}