{
  "@type": "NewsArticle",
  "identifier": "2022--06--27--en--askhn--HackerNews--NewsArticle--31901726",
  "url": "https://news.ycombinator.com/item?id=31901726",
  "headline": "Ask HN: Why is mobile keyboard completion so bad?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN,<p>This has been bugging me for a while. We've got things like GPT-3 that can apparently create text out of whole cloth, and tools like Google Docs that provide the ability to complete sentences with the context of previous words before you even type the next word. And yet the swype-style completion on my smartphone continues to be consistently terrible.<p>As an example, just moments ago I was trying to type &quot;about&quot;, and none of the completion options started with &quot;a&quot; or ended with &quot;t&quot;, let alone resembled the semantic meaning of &quot;about&quot;. And this is not an infrequent occurrence for me; I probably get at most 85-90% accuracy on a good day. That means I'm missing a word almost every sentence, and the typos are so far off from what I intended that I often don't even remember what I intended if I don't stop immediately to fix them.<p>Maybe I just type poorly, but I'd think even a relatively poor input (with the context of previous words) would be good enough to make a pretty accurate keyboard.<p>Does anyone else have this experience? Any ideas why the state of practice isn't more advanced at this point?<p>For reference: I'm on a Pixel device with stock Android keyboard, fully updated. But my experiences have generally been similar on other devices I've used.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "eslaught",
    "url": "https://news.ycombinator.com/user?id=eslaught"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31901726",
  "sameAs": "https://news.ycombinator.com/item?id=31901726",
  "dateCreated": "2022-06-27T22:44:56.483Z",
  "datePublished": "2022-06-27T22:29:38.000Z",
  "dateModified": "2022-06-27T22:44:56.483Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么移动键盘的完成度这么差？\n",
  "headline_zh-Hant": "Ask HN: 為什麼移動鍵盤的完成度這麼差？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Hi HN,<p>这个问题已经困扰了我一段时间了。我们已经有了像GPT-3这样的东西，显然可以从整体上创建文本，还有像Google Docs这样的工具，可以在你输入下一个词之前，通过前面的上下文来完成句子。<p>举个例子，就在刚才，我试图输入&quot;about&quot;，但没有一个完成选项是以&quot;a&quot;开头或以&quot;t&quot;结尾的，更不用说与&quot;about&quot;的语义相近。而这种情况对我来说并不罕见；在一个好的日子里，我可能最多能达到85-90%的准确率。这意味着我几乎每句话都会漏掉一个字，而且这些错别字与我的意图相差甚远，如果我不立即停下来改正，我甚至常常不记得我的意图。<p>也许我只是打得不好，但我认为即使是一个相对较差的输入（与前面的词的上下文有关），也足以使键盘相当准确。<p>还有人有这种经历吗？有什么想法吗？为什么现在的实践状况没有更先进？<p>供参考。我使用的是Pixel设备，带有原生安卓键盘，已经完全更新。但在我使用过的其他设备上，我的经验一般都是类似的。\n",
  "description_zh-Hant": "Hi HN,<p>這個問題已經困擾了我一段時間了。我們已經有了像GPT-3這樣的東西，顯然可以從整體上創建文本，還有像Google Docs這樣的工具，可以在你輸入下一個詞之前，通過前面的上下文來完成句子。<p>舉個例子，就在剛才，我試圖輸入&quot;about&quot;，但沒有一個完成選項是以&quot;a&quot;開頭或以&quot;t&quot;結尾的，更不用說與&quot;about&quot;的語義相近。而這種情況對我來說並不罕見；在一個好的日子裡，我可能最多能達到85-90%的準確率。這意味著我幾乎每句話都會漏掉一個字，而且這些錯別字與我的意圖相差甚遠，如果我不立即停下來改正，我甚至常常不記得我的意圖。<p>也許我只是打得不好，但我認為即使是一個相對較差的輸入（與前面的詞的上下文有關），也足以使鍵盤相當準確。<p>還有人有這種經歷嗎？有什麼想法嗎？為什麼現在的實踐狀況沒有更先進？<p>供參考。我使用的是Pixel設備，帶有原生安卓鍵盤，已經完全更新。但在我使用過的其他設備上，我的經驗一般都是類似的。\n"
}