{
  "@type": "NewsArticle",
  "identifier": "2022--06--05--en--askhn--HackerNews--NewsArticle--31628108",
  "url": "https://news.ycombinator.com/item?id=31628108",
  "headline": "Ask HN: Is hiring a PM with domain expertise considered harmful?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm only speaking from my experience, but we shipped things quicker and were better received, and I'm curious if part of that reason is that, for the first time in my career, product didn't start with a background in the target domain. I wouldn't say this area is simple either. We deal with a lot of features on the merchant side of things (ecommerce).<p>I also don't doubt a lot of other factors came into play, but I want to focus on the product's background for a moment. One thing that stood out to me was that there were less arguments to push for something just because it's been done in other software for the past two decades. Which very well may be true, but uncertainty pushes my current PMs to investigate.<p>It's almost like we're starting from a blank slate and only adding the essential parts. They do take cues from other existing products, but I love how their attitude defaults to challenging them. We're also fortunate enough to have good relationships with our clients in order to validate our ideas. But we're not letting them lead the direction of the product.<p>Because that's what I feel sometimes with PMs rooted with deep domain knowledge. What we're building is being designed by a customer. This not only has the potential to make it less user friendly (UX designers feel less empowered to challenge them because the PM has relevant background while they don't), but it cascades down to the engineers with the amount of work that's been added.<p>I won't dismiss that that a PM can have both a background and release good products. But why do certain companies make it necessary for *all* PMs to have such backgrounds?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jehlakj",
    "url": "https://news.ycombinator.com/user?id=jehlakj"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31628108",
  "sameAs": "https://news.ycombinator.com/item?id=31628108",
  "dateCreated": "2022-06-05T04:51:40.396Z",
  "datePublished": "2022-06-05T04:48:33.000Z",
  "dateModified": "2022-06-05T04:51:40.396Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 雇用一个具有领域专长的PM是否被认为是有害的？\n",
  "headline_zh-Hant": "Ask HN: 僱用一個具有領域專長的PM是否被認為是有害的？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我只是从我的经验出发，但我们的产品出货更快，也更受欢迎，我很好奇这其中的原因是否是，在我的职业生涯中第一次，产品没有从目标领域的背景开始。我也不会说这个领域很简单。我们在商家方面（电子商务）处理了很多功能。<p>我也不怀疑有很多其他因素在起作用，但我想先关注一下产品的背景。有一件事让我印象深刻，那就是仅仅因为过去二十年来其他软件都是这样做的，就没有那么多的论据去推崇。这很可能是真的，但不确定因素促使我现在的PM去调查。<p>这几乎就像我们从一块白板开始，只添加必要的部分。他们确实从其他现有的产品中获取了线索，但我喜欢他们的态度，即挑战它们。我们也很幸运，与我们的客户有良好的关系，以验证我们的想法。但我们并没有让他们主导产品的方向。<p>因为这就是我有时对扎根于深厚领域知识的PM的感受。我们正在构建的东西是由客户设计的。这不仅有可能使其对用户不那么友好（用户体验设计师感到没有权力挑战他们，因为PM有相关的背景，而他们没有），而且它还会随着工作量的增加而连带影响到工程师。<p>我不会否认，一个PM可以同时拥有背景和发布好产品。但是，为什么某些公司要让**的PM都有这样的背景？\n",
  "description_zh-Hant": "我只是從我的經驗出發，但我們的產品出貨更快，也更受歡迎，我很好奇這其中的原因是否是，在我的職業生涯中第一次，產品沒有從目標領域的背景開始。我也不會說這個領域很簡單。我們在商家方面（電子商務）處理了很多功能。<p>我也不懷疑有很多其他因素在起作用，但我想先關注一下產品的背景。有一件事讓我印象深刻，那就是僅僅因為過去二十年來其他軟件都是這樣做的，就沒有那麼多的論據去推崇。這很可能是真的，但不確定因素促使我現在的PM去調查。<p>這幾乎就像我們從一塊白板開始，只添加必要的部分。他們確實從其他現有的產品中獲取了線索，但我喜歡他們的態度，即挑戰它們。我們也很幸運，與我們的客戶有良好的關係，以驗證我們的想法。但我們並沒有讓他們主導產品的方向。<p>因為這就是我有時對紮根於深厚領域知識的PM的感受。我們正在構建的東西是由客戶設計的。這不僅有可能使其對用戶不那麼友好（用戶體驗設計師感到沒有權力挑戰他們，因為PM有相關的背景，而他們沒有），而且它還會隨著工作量的增加而連帶影響到工程師。<p>我不會否認，一個PM可以同時擁有背景和發佈好產品。但是，為什麼某些公司要讓**的PM都有這樣的背景？\n"
}