{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--askhn--HackerNews--NewsArticle--32294747",
  "url": "https://news.ycombinator.com/item?id=32294747",
  "headline": "Ask HN: How to keep our software free while obtaining a revenue stream?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We are a small team that spent the better part of a decade building an application to aid web devs and we are almost release ready.<p>Our goals are to keep this software free of charge, require no user account, collect no data and avoid all forms of ads while obtaining a revenue stream to fund further development.<p>The idea at present is to release this as a free closed source software and start looking for investors while developing new features to be released in a shareware version should we fail to obtain capital in other ways.<p>If we released a shareware edition we would then gradually move every feature to the free version with a timeframe of 3-24 months for each feature. This would provide incentive for funding while ensuring all content is available for free over time.<p>Should we get lucky enough to find a VC or similar we would instead open source it in a heartbeat.<p>I’m wondering though if this would be an accepted approach by the community. We have the best intentions at heart but it torments me.<p>Any thoughts on this?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "katla",
    "url": "https://news.ycombinator.com/user?id=katla"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32294747",
  "sameAs": "https://news.ycombinator.com/item?id=32294747",
  "dateCreated": "2022-07-31T11:43:52.276Z",
  "datePublished": "2022-07-31T10:59:08.000Z",
  "dateModified": "2022-07-31T11:43:52.276Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何在获得收入来源的同时保持我们的软件免费？\n",
  "headline_zh-Hant": "Ask HN: 如何在獲得收入來源的同時保持我們的軟件免費？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们是一个小团队，花了十年的时间建立了一个应用程序，以帮助网络开发人员，我们几乎已经准备好发布。<p>我们的目标是保持这个软件免费，不需要用户账户，不收集数据，避免所有形式的广告，同时获得收入流以资助进一步发展。 <p>目前的想法是将其作为一个免费的封闭源码软件发布，并开始寻找投资者，同时开发新的功能，如果我们无法通过其他方式获得资金，则在共享软件版本中发布。<p>如果我们发布共享软件版本，我们将逐步将每个功能转移到免费版本，每个功能的时间框架为3-24个月。<p>如果我们幸运地找到了风险投资公司或类似的公司，我们会在第一时间开放源代码。我们的出发点是好的，但这让我很纠结。<p>对此有什么想法？\n",
  "description_zh-Hant": "我們是一個小團隊，花了十年的時間建立了一個應用程序，以幫助網絡開發人員，我們幾乎已經準備好發佈。<p>我們的目標是保持這個軟件免費，不需要用戶賬戶，不收集數據，避免所有形式的廣告，同時獲得收入流以資助進一步發展。 <p>目前的想法是將其作為一個免費的封閉源碼軟件發佈，並開始尋找投資者，同時開發新的功能，如果我們無法通過其他方式獲得資金，則在共享軟件版本中發佈。<p>如果我們發佈共享軟件版本，我們將逐步將每個功能轉移到免費版本，每個功能的時間框架為3-24個月。<p>如果我們幸運地找到了風險投資公司或類似的公司，我們會在第一時間開放源代碼。我們的出發點是好的，但這讓我很糾結。<p>對此有什麼想法？\n"
}