{
  "@type": "NewsArticle",
  "identifier": "2022--07--23--en--askhn--HackerNews--NewsArticle--32208127",
  "url": "https://news.ycombinator.com/item?id=32208127",
  "headline": "Ask HN: A matching site for intellectual/study partners?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Here's an idea for a site/service that I would love to use. This must have been tried before, but I can't find a lot of examples:<p>A matching/partnering service for intellectuals, or people with those interests. For example, let's say I want to read a big/hard/long book, on any topic, with someone else. I could create a pitch for some reading project or course of study: create a post where I discuss what I want to get out of it, disclose any prior knowledge or training, etc..--then let anyone who's interested propose to read/study/research with me.<p>I know book clubs are a thing. I found https://bookworm.club, a reader matching service posted here[1] less than a year ago, but what I am thinking about is a little different. It would be broader matchmaking service than just book reading, applicable to any project involving committed study or research. Maybe I'm good at math, and I'm looking for someone who's interested in doing a self-guided intro to quantum mechanics. Or I'm interested in learning more about early US colonial history, and I want someone to help me pick the five most important books on King Philip's War to skim and synthesize. Or I have an idea for a robotics hobby project, and I want to find someone with a technical background that's complementary to my own. Or I've always gotten stuck on the fourth book of Proust's <i>In Search of Lost Time</i>, and I want to find someone to go through it with me and discuss every two weeks. Anything--you define the terms.<p>I know formal classes and education are an approximate solution here, but I think that a person's commitment and interest are often higher in cases of self-study, because your motivation comes from being clear with yourself about what you want to get out of your efforts. Self-studiers are a special group. There are also a lot more niche interests than formal classes.<p>My guess is there are actually a good number of smart people who want to do these things, but they give up because the chance of finding a suitable partner is low. The people with the same interests are often irregularly distributed. and feel isolated. A service that would work at internet scale, especially with more people willing to do this over Zoom, would help to match a lot of these ardent intellectual loners on the long tail of interests.<p>My initial sense is that a good match between prospective partners would be hard to discern algorithmically, since so much about intellectual fit depends on the nuances of what they want to do. So the actual matching would involve pitching, conversation back and forth, negotiation, etc.<p>Anyways, can someone point me to previous efforts in this area? General thoughts are of course welcome too.<p>[1]: https://news.ycombinator.com/item?id=29230283",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tusslewake",
    "url": "https://news.ycombinator.com/user?id=tusslewake"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32208127",
  "sameAs": "https://news.ycombinator.com/item?id=32208127",
  "dateCreated": "2022-07-23T22:25:23.458Z",
  "datePublished": "2022-07-23T22:20:57.000Z",
  "dateModified": "2022-07-23T22:25:23.458Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 一个知识分子/研究伙伴的匹配网站？\n",
  "headline_zh-Hant": "Ask HN: 一個知識分子/研究夥伴的匹配網站？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "Here's an idea for a site/service that I would love to use. This must have been tried before, but I can't find a lot of examples:<p>A matching/partnering service for intellectuals, or people with those interests. For example, let's say I want to read a big/hard/long book, on any topic, with someone else. I could create a pitch for some reading project or course of study: create a post where I discuss what I want to get out of it, disclose any prior knowledge or training, etc..--then let anyone who's interested propose to read/study/research with me.<p>I know book clubs are a thing. I found https://bookworm.club, a reader matching service posted here[1] less than a year ago, but what I am thinking about is a little different. It would be broader matchmaking service than just book reading, applicable to any project involving committed study or research. Maybe I'm good at math, and I'm looking for someone who's interested in doing a self-guided intro to quantum mechanics. Or I'm interested in learning more about early US colonial history, and I want someone to help me pick the five most important books on King Philip's War to skim and synthesize. Or I have an idea for a robotics hobby project, and I want to find someone with a technical background that's complementary to my own. Or I've always gotten stuck on the fourth book of Proust's <i>In Search of Lost Time</i>, and I want to find someone to go through it with me and discuss every two weeks. <p>我知道正式的课程和教育是一个近似的解决方案，但我认为在自学的情况下，一个人的承诺和兴趣往往更高，因为你的动机来自于你自己清楚你想从你的努力中得到什么。自学者是一个特殊的群体。比起正式的课程，还有很多小众的兴趣。<p>我的猜测是，实际上有相当数量的聪明人想做这些事情，但他们放弃了，因为找到合适伙伴的机会很低。有相同兴趣的人往往是不定期分布的。并且感到被孤立。一个能在互联网规模上运作的服务，特别是有更多的人愿意在Zoom上做这件事，将有助于在兴趣的长尾上匹配很多这些热心的知识分子。<p>我最初的感觉是，潜在的合作伙伴之间的良好匹配将很难用算法来辨别，因为关于智力的匹配有很多取决于他们想做的事情的细微差别。因此，实际的匹配工作将涉及推销、来回对话、谈判等。<p>无论如何，谁能给我指出这一领域以前的努力？当然，我们也欢迎一般的想法。<p>[1]: https://news.ycombinator.com/item?id=29230283\n",
  "description_zh-Hant": "Here's an idea for a site/service that I would love to use. This must have been tried before, but I can't find a lot of examples:<p>A matching/partnering service for intellectuals, or people with those interests. For example, let's say I want to read a big/hard/long book, on any topic, with someone else. I could create a pitch for some reading project or course of study: create a post where I discuss what I want to get out of it, disclose any prior knowledge or training, etc..--then let anyone who's interested propose to read/study/research with me.<p>I know book clubs are a thing. I found https://bookworm.club, a reader matching service posted here[1] less than a year ago, but what I am thinking about is a little different. It would be broader matchmaking service than just book reading, applicable to any project involving committed study or research. Maybe I'm good at math, and I'm looking for someone who's interested in doing a self-guided intro to quantum mechanics. Or I'm interested in learning more about early US colonial history, and I want someone to help me pick the five most important books on King Philip's War to skim and synthesize. Or I have an idea for a robotics hobby project, and I want to find someone with a technical background that's complementary to my own. Or I've always gotten stuck on the fourth book of Proust's <i>In Search of Lost Time</i>, and I want to find someone to go through it with me and discuss every two weeks. <p>我知道正式的課程和教育是一個近似的解決方案，但我認為在自學的情況下，一個人的承諾和興趣往往更高，因為你的動機來自於你自己清楚你想從你的努力中得到什麼。自學者是一個特殊的群體。比起正式的課程，還有很多小眾的興趣。<p>我的猜測是，實際上有相當數量的聰明人想做這些事情，但他們放棄了，因為找到合適夥伴的機會很低。有相同興趣的人往往是不定期分佈的。並且感到被孤立。一個能在互聯網規模上運作的服務，特別是有更多的人願意在Zoom上做這件事，將有助於在興趣的長尾上匹配很多這些熱心的知識分子。<p>我最初的感覺是，潛在的合作伙伴之間的良好匹配將很難用算法來辨別，因為關於智力的匹配有很多取決於他們想做的事情的細微差別。因此，實際的匹配工作將涉及推銷、來回對話、談判等。<p>無論如何，誰能給我指出這一領域以前的努力？當然，我們也歡迎一般的想法。<p>[1]: https://news.ycombinator.com/item?id=29230283\n"
}