{
  "@type": "NewsArticle",
  "identifier": "2022--07--31--en--askhn--HackerNews--NewsArticle--32296464",
  "url": "https://news.ycombinator.com/item?id=32296464",
  "headline": "Ask HN: Should I sell my project to the big player?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Throwaway account.<p>I built a semantic search engine in the legal space (non-U.S.), and am thinking about offering the system to one of the established players in that market.<p>There are several players in the market who have millions of subscribers. Their system, however, only search for legal documents based on whether or not the keywords you entered occur in the text.<p>My system, which took me about a year to build, uses semantic similarity to find relevant documents. That is to say, it will also find documents that talk about the topic you search for, even though different words are used.<p>Also, it finds matches not only on the document level, but on the level of individual paragraphs and snippets. Thus saving the user (mostly attorneys) valuable time, which they'd otherwise spend scrolling through pages of irrelevant text just to find the one or two sentences that are actually relevant to their case.<p>The system I have is up and running. It is not yet perfect. For instance, it fails when users are searching for a particular document by date and name of the court. Also, my database is only about half the size of that of the major players. But it works well enough that it demonstrates that the system works for the intended purpose of discovering court rulings relevant to your query based on semantic similarity.<p>Now that I have it, I find that I don't want to actually operate it, or deal with marketing, end users, data providers etc..<p>So what should I do now?<p>How would I, for instance, go about selling such a system to one of the established players?<p>To be of use to them, my system would need to be tightly integrated with their own. So I guess my offer should be to work with their team as some kind of technical consultant.<p>However, I've never done anything like this before, and wouldn't know how to to about it, who to talk to, how to position myself, what to offer, what price, etc..<p>Because it is such unfamiliar territory, I've already been putting the matter off for several months, and have even considered to just chalk the whole project up as a learning experience and to just move on. Part of me thinks, &quot;If they really wanted such a thing, they'd just hire people to build it&quot;.<p>Also, if they expressed interest, what should I charge, and on what basis? Per month of consulting? Based on successful implementation? Mile-stones, perhaps?<p>I wouldn't actually be in control of how quickly the system gets implemented. Because I'd have to be working with their team, with a code base I don't understand, perhaps even in a language that I'm not proficient in (say, Java).<p>Any recommendations how I should proceed?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "semantic123",
    "url": "https://news.ycombinator.com/user?id=semantic123"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32296464",
  "sameAs": "https://news.ycombinator.com/item?id=32296464",
  "dateCreated": "2022-07-31T17:33:55.675Z",
  "datePublished": "2022-07-31T16:03:11.000Z",
  "dateModified": "2022-07-31T17:33:55.675Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该把我的项目卖给大玩家吗？\n",
  "headline_zh-Hant": "Ask HN: 我應該把我的項目賣給大玩家嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "扔掉的账户。<p>我在法律领域（非美国）建立了一个语义搜索引擎，并且正在考虑将该系统提供给该市场的一个成熟的参与者。<p>市场上有几个参与者拥有数百万的用户。但是，他们的系统只根据你输入的关键词是否出现在文本中来搜索法律文件。<p>我的系统，我花了大约一年时间来建立，使用语义相似性来寻找相关文件。也就是说，它也会找到谈论你所搜索的主题的文件，即使使用的是不同的词。<p>此外，它不仅在文件层面，而且在单个段落和片段的层面上找到匹配的文件。因此，为用户（主要是律师）节省了宝贵的时间，否则他们会花时间滚动浏览几页不相关的文本，只是为了找到与他们的案件真正相关的一两个句子。<p>我的系统已经启动并运行。它还不够完美。例如，当用户按日期和法院名称搜索某一特定文件时，它就会失败。此外，我的数据库只有主要参与者的一半大小。<p>现在我有了这个系统，我发现我不想实际操作它，也不想处理营销、终端用户和数据提供商等问题。<p>那么我现在应该做什么呢？<p>例如，我如何将这样一个系统卖给一个成熟的参与者？<p>但是，我以前从来没有做过这样的事情，我不知道该怎么做，该和谁谈，如何定位自己，提供什么，什么价格，等等。<p>另外，如果他们表示有兴趣，我应该怎么收费，以什么为基础？每个月的咨询费？基于成功的实施？<p>我实际上无法控制该系统实施的速度。因为我必须与他们的团队合作，使用我不了解的代码库，甚至可能使用我不精通的语言（例如Java）。\n",
  "description_zh-Hant": "扔掉的賬戶。<p>我在法律領域（非美國）建立了一個語義搜索引擎，並且正在考慮將該系統提供給該市場的一個成熟的參與者。<p>市場上有幾個參與者擁有數百萬的用戶。但是，他們的系統只根據你輸入的關鍵詞是否出現在文本中來搜索法律文件。<p>我的系統，我花了大約一年時間來建立，使用語義相似性來尋找相關文件。也就是說，它也會找到談論你所搜索的主題的文件，即使使用的是不同的詞。<p>此外，它不僅在文件層面，而且在單個段落和片段的層面上找到匹配的文件。因此，為用戶（主要是律師）節省了寶貴的時間，否則他們會花時間滾動瀏覽幾頁不相關的文本，只是為了找到與他們的案件真正相關的一兩個句子。<p>我的系統已經啟動並運行。它還不夠完美。例如，當用戶按日期和法院名稱搜索某一特定文件時，它就會失敗。此外，我的數據庫只有主要參與者的一半大小。<p>現在我有了這個系統，我發現我不想實際操作它，也不想處理營銷、終端用戶和數據提供商等問題。<p>那麼我現在應該做什麼呢？<p>例如，我如何將這樣一個系統賣給一個成熟的參與者？<p>但是，我以前從來沒有做過這樣的事情，我不知道該怎麼做，該和誰談，如何定位自己，提供什麼，什麼價格，等等。<p>另外，如果他們表示有興趣，我應該怎麼收費，以什麼為基礎？每個月的諮詢費？基於成功的實施？<p>我實際上無法控制該系統實施的速度。因為我必須與他們的團隊合作，使用我不瞭解的代碼庫，甚至可能使用我不精通的語言（例如Java）。\n"
}