{
  "@type": "NewsArticle",
  "identifier": "2022--06--24--en--askhn--HackerNews--NewsArticle--31868770",
  "url": "https://news.ycombinator.com/item?id=31868770",
  "headline": "Ask HN: Can a politically exposed person in middle age become a CS researcher?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been a programmer for about 20 years. I've long since outgrown business programming, but I also didn't like being a manager very much. As I wrap up a couple other projects, I'm pursuing a master's degree. So far, I enjoy it a lot and I'm doing well. I think I'd like to continue for a PhD, and see what lies beyond that.<p>My problems are twofold. One is age. I don't think I'm too old to get into a PhD program, but by the time I would complete one, I'll be, best-case scenario, in my mid-40s. I don't think should matter at all, because what matters is how many productive years a person has left--a highly variable unknown, with a median low enough that my age is a complete non-issue--but, of course, I don't control perceptions. There is a possibility that getting a PhD will only make me more overqualified and unemployable than I already am.<p>The second issue is that I'm a politically exposed person. The less said about that, the better, but I've publicly associated myself with the antifascism (&quot;antifa&quot;) movement, and I have exposed some truly bad actors in the tech industry. I have no regrets about this, but it turned out those bad actors had friends. Whoops. I'm sure my real name would mean absolutely nothing to the younger crowd, but I've made enemies in high places (and suffered death threats, rescinded job offers, rumor campaigns, you name it). At one point, I got a warning from a federal agency not to go to San Francisco for a talk I was going to give, because it would put my life in danger. I will never be able to get a job (or, in an academic context, a grant) from any of the FAANGs. (I'm mostly okay with, because I dislike those companies). I have no small number of permanent enemies who will never forgive me.<p>At some point, it became clear that the decent jobs in the tech industry were no longer (and would never be) available to me. Political exposure cools off over time; however, the issue of age goes the other way. My fear is that, research being more competitive, this political exposure might be a permanent blocker, or at least an issue for long enough that it would, say, complicate a job search five years from now in a competitive field.<p>Does anyone familiar with computer science research (inside or outside of academia) have enough experience to have an informed opinion on this? I have worked in (mostly private-sector) research before, so I know what I'm getting into in terms of the work itself. What I don't know is whether age and political exposure, given the hypercompetitive nature of the research job market, are insurmountable obstacles. I may have to change countries, which is of course another thing I am looking into.<p>Thanks in advance for your help.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cs137",
    "url": "https://news.ycombinator.com/user?id=cs137"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31868770",
  "sameAs": "https://news.ycombinator.com/item?id=31868770",
  "dateCreated": "2022-06-24T20:26:26.780Z",
  "datePublished": "2022-06-24T20:19:24.000Z",
  "dateModified": "2022-06-24T20:26:26.780Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 一个中年的政治暴露者能成为一名CS研究者吗？\n",
  "headline_zh-Hant": "Ask HN: 一箇中年的政治暴露者能成為一名CS研究者嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我做了大约20年的程序员。我早就不喜欢商业编程了，但我也不太喜欢当经理。当我结束了其他几个项目后，我正在攻读硕士学位。到目前为止，我非常喜欢它，而且我做得很好。我想我想继续攻读博士学位，看看以后会有什么发展。<p>我的问题有两个。一个是年龄。我不认为我太老而无法进入博士课程，但当我完成一个博士课程时，最好的情况是我已经40多岁了。我认为这根本不重要，因为重要的是一个人还有多少年的生产能力--一个高度可变的未知数，中位数低到我的年龄完全不是问题--但是，当然，我不能控制观念。有一种可能性是，获得博士学位只会让我比现在更不合格，更无法就业。<p>第二个问题是，我是一个政治上暴露的人。这一点说得越少越好，但我已经公开与反法西斯主义（&quot;antifa&quot;）运动联系在一起，而且我已经揭露了科技行业中一些真正的坏行为。我对此并不后悔，但事实证明，那些坏演员有朋友。呜呼。我确信我的真名对年轻人来说绝对没有意义，但我在高处树敌（并遭受死亡威胁、被取消的工作机会、谣言运动，你说了算）。有一次，我得到了一个联邦机构的警告，不要去旧金山参加我准备做的讲座，因为这会使我的生命受到威胁。我将永远无法从任何一家FAANGs获得工作（或者，在学术方面，获得资助）。(我基本没问题，因为我不喜欢这些公司）。我有为数不少的永远的敌人，他们永远不会原谅我。<p>在某个时候，很明显，科技行业的体面工作不再（也永远不会）提供给我。政治上的接触会随着时间的推移而冷却；然而，年龄的问题却反过来了。我担心的是，由于研究工作更具竞争性，这种政治曝光可能会成为一个永久的障碍，或者至少是一个足够长的问题，比如说，它将使五年后在一个竞争激烈的领域寻找工作变得更加复杂。<p>有谁熟悉计算机科学研究（学术界内部或外部），有足够的经验来对这个问题发表意见？我以前曾在（主要是私营部门）研究机构工作过，所以我知道我在工作本身方面的情况。我不知道的是，鉴于研究工作市场的超强竞争性，年龄和政治接触是否是不可逾越的障碍。我可能要换个国家，这当然是我正在考虑的另一件事。<p>预先感谢您的帮助。\n",
  "description_zh-Hant": "我做了大約20年的程序員。我早就不喜歡商業編程了，但我也不太喜歡當經理。當我結束了其他幾個項目後，我正在攻讀碩士學位。到目前為止，我非常喜歡它，而且我做得很好。我想我想繼續攻讀博士學位，看看以後會有什麼發展。<p>我的問題有兩個。一個是年齡。我不認為我太老而無法進入博士課程，但當我完成一個博士課程時，最好的情況是我已經40多歲了。我認為這根本不重要，因為重要的是一個人還有多少年的生產能力--一個高度可變的未知數，中位數低到我的年齡完全不是問題--但是，當然，我不能控制觀念。有一種可能性是，獲得博士學位只會讓我比現在更不合格，更無法就業。<p>第二個問題是，我是一個政治上暴露的人。這一點說得越少越好，但我已經公開與反法西斯主義（&quot;antifa&quot;）運動聯繫在一起，而且我已經揭露了科技行業中一些真正的壞行為。我對此並不後悔，但事實證明，那些壞演員有朋友。嗚呼。我確信我的真名對年輕人來說絕對沒有意義，但我在高處樹敵（並遭受死亡威脅、被取消的工作機會、謠言運動，你說了算）。有一次，我得到了一個聯邦機構的警告，不要去舊金山參加我準備做的講座，因為這會使我的生命受到威脅。我將永遠無法從任何一家FAANGs獲得工作（或者，在學術方面，獲得資助）。(我基本沒問題，因為我不喜歡這些公司）。我有為數不少的永遠的敵人，他們永遠不會原諒我。<p>在某個時候，很明顯，科技行業的體面工作不再（也永遠不會）提供給我。政治上的接觸會隨著時間的推移而冷卻；然而，年齡的問題卻反過來了。我擔心的是，由於研究工作更具競爭性，這種政治曝光可能會成為一個永久的障礙，或者至少是一個足夠長的問題，比如說，它將使五年後在一個競爭激烈的領域尋找工作變得更加複雜。<p>有誰熟悉計算機科學研究（學術界內部或外部），有足夠的經驗來對這個問題發表意見？我以前曾在（主要是私營部門）研究機構工作過，所以我知道我在工作本身方面的情況。我不知道的是，鑑於研究工作市場的超強競爭性，年齡和政治接觸是否是不可逾越的障礙。我可能要換個國家，這當然是我正在考慮的另一件事。<p>預先感謝您的幫助。\n"
}