{
  "@type": "NewsArticle",
  "identifier": "2022--04--27--en--askhn--HackerNews--NewsArticle--31178255",
  "url": "https://news.ycombinator.com/item?id=31178255",
  "headline": "Ask HN: How do you keep engineers happy in “Professional Services” teams?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "We have a Product and a &quot;Professional Services&quot; (PS) team. PS builds custom projects for clients, one after another. Projects last few weeks to few months.<p>Project Managers in PS assign tasks to developers and they do the work and go to the next task. Their time is tracked and how much of it is billable is measured. Managers in PS has a target &quot;billable utilisation&quot; they are expected to hit. The target is almost all of developers' time other than company meetings.<p>We encourage developers to come up with side-projects, improvements, learning goals etc. and we make time for them when there is something tangible. We also come up with initatives and offer them to take these up which would also contribute to their career progression. There is some take up but not much.<p>We have been having turnover issues and the prominent feedback from exit polls is the work is not interesting or engaging.<p>We are seeking feedback from the team but would like to hear about how other companies are handling it. If your company has a similar team that only build custom client projects:<p>- Does your compnay have similar problems?<p>- Are developers assigned tasks in a similar way or do you have different ways of working?<p>- What are the things that are keeping them happy and engaged?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "elevatortrim",
    "url": "https://news.ycombinator.com/user?id=elevatortrim"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31178255",
  "sameAs": "https://news.ycombinator.com/item?id=31178255",
  "dateCreated": "2022-04-27T10:35:33.825Z",
  "datePublished": "2022-04-27T10:23:45.000Z",
  "dateModified": "2022-04-27T10:35:33.825Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何让工程师在 \"专业服务 \"团队中保持快乐？",
  "headline_zh-Hant": "Ask HN: 你如何讓工程師在 \"專業服務 \"團隊中保持快樂？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我们有一个产品和一个专业服务（PS）团队。PS为客户建立定制项目，一个接一个。项目持续几周到几个月。<p>PS的项目经理将任务分配给开发人员，他们完成工作后去做下一个任务。他们的时间被跟踪，其中有多少时间是可以计费的。PS的经理们有一个目标&quot;计费利用率&quot;他们被期望达到。<p>我们鼓励开发人员提出副业、改进、学习目标等，只要有实际的东西，我们就会为他们腾出时间。我们还提出了一些倡议，并让他们接受这些倡议，这也将有助于他们的职业发展。<p>我们一直有人员流动的问题，而且从离职调查中得到的突出反馈是工作不有趣或不吸引人。<p>我们正在寻求团队的反馈，但希望听到其他公司是如何处理的。如果你的公司有一个类似的团队，只建立定制的客户项目：<p>- 你的公司是否有类似的问题？<p>- 开发人员是以类似的方式分配任务，还是有不同的工作方式？<p>- 有什么事情能让他们高兴和参与？",
  "description_zh-Hant": "我們有一個產品和一個專業服務（PS）團隊。PS為客戶建立定製項目，一個接一個。項目持續幾周到幾個月。<p>PS的項目經理將任務分配給開發人員，他們完成工作後去做下一個任務。他們的時間被跟蹤，其中有多少時間是可以計費的。PS的經理們有一個目標&quot;計費利用率&quot;他們被期望達到。<p>我們鼓勵開發人員提出副業、改進、學習目標等，只要有實際的東西，我們就會為他們騰出時間。我們還提出了一些倡議，並讓他們接受這些倡議，這也將有助於他們的職業發展。<p>我們一直有人員流動的問題，而且從離職調查中得到的突出反饋是工作不有趣或不吸引人。<p>我們正在尋求團隊的反饋，但希望聽到其他公司是如何處理的。如果你的公司有一個類似的團隊，只建立定製的客戶項目：<p>- 你的公司是否有類似的問題？<p>- 開發人員是以類似的方式分配任務，還是有不同的工作方式？<p>- 有什麼事情能讓他們高興和參與？"
}