{
  "@type": "NewsArticle",
  "identifier": "2022--08--07--en--askhn--HackerNews--NewsArticle--32377084",
  "url": "https://news.ycombinator.com/item?id=32377084",
  "headline": "Ask HN: Where should I move to meet interesting tech people?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey everybody,<p>So after about 8 years of various unsuccessful startup attempts I bit the bullet and got a job.<p>Classical 6 figures tech job in AI for bigtech. Fully remote chill work hours you know the deal.<p>I used to live for work pouring all my heart into an idea talking to customers iterating working day and night.<p>Now, I want to work to live travel and most importantly I want to meet as many interesting tech people as possible.<p>Now my question. Where should I go?  Ideally, I want to be able to go back to Germany at least for 3 months a year the rest I am open for suggestions.<p>Should I move to a digital nomad place like Bali or Portugal? Or a tech hub like San Francisco or Austin?<p>Time zone wise Hong Kong would be ideal but I am mostly working on my own so it isn't a deal breaker.<p>Also wherever I am, should I go to conferences ? Meetups? Dm random people on Twitter and Hackernews? Otherwise, il just keep chatting up a bunch of people in co-working spaces.<p>I feel like nowadays there must be quite a few people in this situation. Would love to hear your thoughts.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "anonimouse1234",
    "url": "https://news.ycombinator.com/user?id=anonimouse1234"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32377084",
  "sameAs": "https://news.ycombinator.com/item?id=32377084",
  "dateCreated": "2022-08-07T15:26:39.272Z",
  "datePublished": "2022-08-07T15:10:49.000Z",
  "dateModified": "2022-08-07T15:26:39.272Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该搬到哪里去认识有趣的科技人员？\n",
  "headline_zh-Hant": "Ask HN: 我應該搬到哪裡去認識有趣的科技人員？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>在经历了8年各种不成功的创业尝试后，我咬咬牙找了一份工作。<p>典型的6位数技术工作，在大公司的人工智能领域。<p>我曾经为工作而活，把我所有的心思都倾注在一个想法上，与客户交谈，日夜不停地工作。<p>现在，我想通过工作来生活旅行，最重要的是我想尽可能多地认识有趣的科技人员。我应该去哪里？ 理想情况下，我希望每年至少能回德国3个月，其余的我愿意接受建议。<p>我应该搬到巴厘岛或葡萄牙这样的数字游牧地方吗？<p>从时区来看，香港是最理想的，但我大部分时间都是自己工作，所以这并不是什么大问题。<p>另外，无论我在哪里，我应该去参加会议吗？碰头会？在Twitter和Hackernews上随机采访一些人？否则，我就一直在联合办公空间里和一群人聊天。<p>我觉得现在肯定有不少人处于这种情况。很想听听你的想法。\n",
  "description_zh-Hant": "大家好，<p>在經歷了8年各種不成功的創業嘗試後，我咬咬牙找了一份工作。<p>典型的6位數技術工作，在大公司的人工智能領域。<p>我曾經為工作而活，把我所有的心思都傾注在一個想法上，與客戶交談，日夜不停地工作。<p>現在，我想通過工作來生活旅行，最重要的是我想盡可能多地認識有趣的科技人員。我應該去哪裡？ 理想情況下，我希望每年至少能回德國3個月，其餘的我願意接受建議。<p>我應該搬到巴厘島或葡萄牙這樣的數字遊牧地方嗎？<p>從時區來看，香港是最理想的，但我大部分時間都是自己工作，所以這並不是什麼大問題。<p>另外，無論我在哪裡，我應該去參加會議嗎？碰頭會？在Twitter和Hackernews上隨機採訪一些人？否則，我就一直在聯合辦公空間裡和一群人聊天。<p>我覺得現在肯定有不少人處於這種情況。很想聽聽你的想法。\n"
}