{
  "@type": "NewsArticle",
  "identifier": "2022--07--05--en--askhn--HackerNews--NewsArticle--31990737",
  "url": "https://news.ycombinator.com/item?id=31990737",
  "headline": "Ask HN: What do you do when you’re a Software Developer who doesn’t code?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This is kind of a strange question but through a company restructure my job title has changed from Senior Analyst to Senior Software Developer, yet I am doing neither Analytics nor SWE at this point.<p>My day to day work involves configuration in a front end application that doesn’t require “raw” coding. The most code I ever end up touching is occasionally pulling data with a SQL query or editing an .xml file.<p>I am very lost on how to pivot in my career. I do have some coding experience but mainly in SQL and doing very brief classes on C++ and Swift. I do have a lot of experience finding the right hardware/software solution to different issues in previous jobs.<p>Additionally, I’m not even sure I want to keep pursuing code or do it as a career. It’s a great set of skills but it’s not my strongest skill. I love technology and creative projects but I’m having a LOT of trouble finding the right job.<p>Recruiters from companies reach out but only because my title leads them to believe I can fit into SWE positions.<p>How do I move forward from here? I feel like my title has trapped me in a corner with my options.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Rocko72",
    "url": "https://news.ycombinator.com/user?id=Rocko72"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31990737",
  "sameAs": "https://news.ycombinator.com/item?id=31990737",
  "dateCreated": "2022-07-05T20:59:22.349Z",
  "datePublished": "2022-07-05T16:59:09.000Z",
  "dateModified": "2022-07-05T20:59:22.349Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 当你是一个不写代码的软件开发人员时，你该怎么办？\n",
  "headline_zh-Hant": "Ask HN: 當你是一個不寫代碼的軟件開發人員時，你該怎麼辦？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这是一个很奇怪的问题，但通过公司的重组，我的工作头衔已经从高级分析师变成了高级软件开发人员，但我现在既不做分析，也不做SWE。<p>我的日常工作涉及前端应用程序的配置，不需要 \"原始 \"编码。我最终接触到的最多的代码是偶尔用SQL查询来提取数据或编辑一个.xml文件。我确实有一些编码经验，但主要是在SQL和做非常简短的C++和Swift课程方面。在以前的工作中，我确实有很多经验为不同的问题找到正确的硬件/软件解决方案。<p>此外，我甚至不确定我是否想继续追求代码或将其作为职业。这是一套伟大的技能，但它不是我最强的技能。我喜欢技术和创意项目，但我在寻找合适的工作方面遇到了很多困难。<p>公司的招聘人员会主动联系我，但只是因为我的头衔让他们相信我可以胜任SWE的职位。<p>我应该如何从这里继续前进？我觉得我的头衔把我困在了选择的角落里。\n",
  "description_zh-Hant": "這是一個很奇怪的問題，但通過公司的重組，我的工作頭銜已經從高級分析師變成了高級軟件開發人員，但我現在既不做分析，也不做SWE。<p>我的日常工作涉及前端應用程序的配置，不需要 \"原始 \"編碼。我最終接觸到的最多的代碼是偶爾用SQL查詢來提取數據或編輯一個.xml文件。我確實有一些編碼經驗，但主要是在SQL和做非常簡短的C++和Swift課程方面。在以前的工作中，我確實有很多經驗為不同的問題找到正確的硬件/軟件解決方案。<p>此外，我甚至不確定我是否想繼續追求代碼或將其作為職業。這是一套偉大的技能，但它不是我最強的技能。我喜歡技術和創意項目，但我在尋找合適的工作方面遇到了很多困難。<p>公司的招聘人員會主動聯繫我，但只是因為我的頭銜讓他們相信我可以勝任SWE的職位。<p>我應該如何從這裡繼續前進？我覺得我的頭銜把我困在了選擇的角落裡。\n"
}