{
  "@type": "NewsArticle",
  "identifier": "2022--08--08--en--askhn--HackerNews--NewsArticle--32387068",
  "url": "https://news.ycombinator.com/item?id=32387068",
  "headline": "Ask HN: How do you motivate yourself to do your best work?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi everyone,<p>I have been working as a software engineer for a while now and have built confidence in my skills, but I’m recently struggling to motivate myself to apply these skills to do work that I am happy with at my job. I have a great job, great coworkers, a fantastic manager who gives me everything I need, work in my ideal environment, and I’m still struggling to find motivation to complete my tasks, let alone to the standard that I know I could. I have very strong feelings about making things good and doing my best, so while half assing things like this is rewarding in the short term, in the long term I just feel like I’m doing bad work and not living up to my potential. I should say (I think) my teammates love me and my managers are happy with my work and keep giving me raises and promotions. But (while my family and I certainly appreciate the money) it kind of makes me feel bad because I feel like they’re going to realize how badly I’m doing at some point. I don’t have some kind of feudal loyalty to the company, but I do feel a loyalty to my managers and coworkers who have helped me a lot and always treated me very well. I don’t want to leave this job because it’s great and I’m almost certain whatever other job I get would be objectively worse, but I really feel like I need to change something so I can feel good about my work again.<p>I think earlier in my career I had this drive to prove myself that was a big motivator for me to to my best, and now that I’m more confident in my skills I don’t have that motivation anymore.<p>Anyway, I know there’s nothing more annoying than someone complaining about how good their situation is, but I would really appreciate advice from anyone reading who’s been in a similar situation.<p>Thanks for reading.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "JonShartwell",
    "url": "https://news.ycombinator.com/user?id=JonShartwell"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32387068",
  "sameAs": "https://news.ycombinator.com/item?id=32387068",
  "dateCreated": "2022-08-08T16:38:19.522Z",
  "datePublished": "2022-08-08T15:52:31.000Z",
  "dateModified": "2022-08-08T16:38:19.522Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何激励自己去做最好的工作？\n",
  "headline_zh-Hant": "Ask HN: 你如何激勵自己去做最好的工作？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>我从事软件工程师工作已经有一段时间了，对自己的技能建立了信心，但最近我在努力激励自己运用这些技能去做我在工作中满意的工作。我有一份很好的工作，有很好的同事，有一个给我提供一切的出色的经理，在我理想的环境中工作，而我仍然在努力寻找动力来完成我的任务，更不用说达到我知道我可以做到的标准。我对把事情做好和做到最好有着非常强烈的感情，所以虽然像这样半途而废的事情在短期内是有意义的，但从长远来看，我只是觉得自己做得不好，没有发挥出自己的潜力。我应该说（我认为）我的队友很喜欢我，我的经理对我的工作很满意，不断给我加薪和晋升。但是（虽然我的家人和我当然很感激这些钱），这有点让我感觉不好，因为我觉得他们会在某个时候意识到我做得有多糟糕。我对公司没有某种封建的忠诚，但我确实对我的经理和同事感到忠诚，他们帮助了我很多，总是对我非常好。我不想离开这份工作，因为它很好，而且我几乎可以肯定，无论我得到什么其他工作，客观上都会更糟糕，但我真的觉得我需要改变一些东西，这样我才能再次对我的工作感到满意。<p>我认为在我职业生涯的早期，我有这种证明自己的动力，这是促使我做到最好的一大动力，而现在我对自己的技能更加自信，我不再有这种动力。 <p>无论如何，我知道没有什么比有人抱怨他们的情况有多好更令人讨厌的了，但我真的很感谢任何曾有过类似情况的读者的建议。\n",
  "description_zh-Hant": "大家好，<p>我從事軟件工程師工作已經有一段時間了，對自己的技能建立了信心，但最近我在努力激勵自己運用這些技能去做我在工作中滿意的工作。我有一份很好的工作，有很好的同事，有一個給我提供一切的出色的經理，在我理想的環境中工作，而我仍然在努力尋找動力來完成我的任務，更不用說達到我知道我可以做到的標準。我對把事情做好和做到最好有著非常強烈的感情，所以雖然像這樣半途而廢的事情在短期內是有意義的，但從長遠來看，我只是覺得自己做得不好，沒有發揮出自己的潛力。我應該說（我認為）我的隊友很喜歡我，我的經理對我的工作很滿意，不斷給我加薪和晉升。但是（雖然我的家人和我當然很感激這些錢），這有點讓我感覺不好，因為我覺得他們會在某個時候意識到我做得有多糟糕。我對公司沒有某種封建的忠誠，但我確實對我的經理和同事感到忠誠，他們幫助了我很多，總是對我非常好。我不想離開這份工作，因為它很好，而且我幾乎可以肯定，無論我得到什麼其他工作，客觀上都會更糟糕，但我真的覺得我需要改變一些東西，這樣我才能再次對我的工作感到滿意。<p>我認為在我職業生涯的早期，我有這種證明自己的動力，這是促使我做到最好的一大動力，而現在我對自己的技能更加自信，我不再有這種動力。 <p>無論如何，我知道沒有什麼比有人抱怨他們的情況有多好更令人討厭的了，但我真的很感謝任何曾有過類似情況的讀者的建議。\n"
}