{
  "@type": "NewsArticle",
  "identifier": "2022--06--10--en--askhn--HackerNews--NewsArticle--31696447",
  "url": "https://news.ycombinator.com/item?id=31696447",
  "headline": "Ask HN: How are you dealing with the M1/ARM migration?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I love the M1 chips. I use a 2021 MacBook both personally and professionally. My job is DevOps work.<p>But the migration to ARM is proving to be quite a pain point. Not being able to just do things as I would on x86-64 is damaging my productivity and creating a necessity for horrible workarounds.<p>As far as I know none of our pipelines yet do multi-arch Docker builds, so everything we have is heavily x86-64 oriented. VirtualBox is out of the picture because it doesn't support ARM. That means other tools that rely on it are also out of the picture, like Molecule. My colleague wrote a sort of wrapper script that uses Multipass instead but Multipass can't do x86-on-ARM emulation.<p>I've been using Lima to create virtual machines which works quite well because it can do multiple architectures. I haven't tested it on Linux though, and since it claims to be geared towards macOS that worries me. We are a company using a mix of MacBooks and Linux machines so we need a tool that will work for everyone.<p>The virtualisation situation on MacBooks in general isn't great. I think Apple introduced Virtualization.framework to try and improve things but the performance is actually worse than QEMU. You can try enabling it in the Docker Desktop experimental options and you'll notice it gets more sluggish. Then there's just other annoyances, like having to run a VM in the background for Docker all the time because 'real' Docker is not possible on macOS. Sometimes I'll have three or more VMs going and everything except my browser is paying that virtualisation penalty.<p>Ugh. Again, I love the performance and battery life, but the fragmentation this has created is a nightmare.<p>How is your experience so far? Any tips/tricks?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "c7DJTLrn",
    "url": "https://news.ycombinator.com/user?id=c7DJTLrn"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31696447",
  "sameAs": "https://news.ycombinator.com/item?id=31696447",
  "dateCreated": "2022-06-10T17:06:40.028Z",
  "datePublished": "2022-06-10T16:39:51.000Z",
  "dateModified": "2022-06-10T17:06:40.028Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 7
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 你是如何处理M1/ARM迁移问题的？\n",
  "headline_zh-Hant": "Ask HN: 你是如何處理M1/ARM遷移問題的？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我喜欢M1芯片。我个人和职业上都使用2021年的MacBook。我的工作是DevOps工作。<p>但事实证明，向ARM的迁移是一个相当大的痛点。我不能像在 x86-64 上那样做事情，这损害了我的生产力，并且需要采取可怕的变通办法。<p>据我所知，我们的管道还不能进行多架构的 Docker 构建，因此我们拥有的一切都严重面向 x86-64。VirtualBox被排除在外，因为它不支持ARM。这意味着依赖它的其他工具也被排除在外，比如Molecule。我的同事写了一种使用Multipass的包装脚本，但Multipass不能进行x86-on-ARM仿真。<p>我一直在使用Lima来创建虚拟机，效果相当好，因为它可以做多种架构。但我还没有在 Linux 上测试过它，而且由于它声称是针对 macOS 的，所以我很担心。我们是一家混合使用MacBooks和Linux机器的公司，所以我们需要一个对所有人都有效的工具。<p>MacBooks上的虚拟化情况一般来说不是很好。我认为苹果公司推出了Virtualization.framework，试图改善情况，但其性能实际上比QEMU更差。你可以尝试在Docker Desktop的实验选项中启用它，你会发现它变得更加迟钝。然后还有其他一些烦人的事情，比如不得不一直在后台为Docker运行一个虚拟机，因为 \"真正的 \"Docker在macOS上是不可能的。有时我会有三个或更多的虚拟机在运行，而除了我的浏览器之外，所有的东西都在支付这种虚拟化的代价。同样，我喜欢它的性能和电池寿命，但它造成的碎片化是一场噩梦。<p>到目前为止，你的经验如何？有什么技巧/窍门吗？\n",
  "description_zh-Hant": "我喜歡M1芯片。我個人和職業上都使用2021年的MacBook。我的工作是DevOps工作。<p>但事實證明，向ARM的遷移是一個相當大的痛點。我不能像在 x86-64 上那樣做事情，這損害了我的生產力，並且需要採取可怕的變通辦法。<p>據我所知，我們的管道還不能進行多架構的 Docker 構建，因此我們擁有的一切都嚴重面向 x86-64。VirtualBox被排除在外，因為它不支持ARM。這意味著依賴它的其他工具也被排除在外，比如Molecule。我的同事寫了一種使用Multipass的包裝腳本，但Multipass不能進行x86-on-ARM仿真。<p>我一直在使用Lima來創建虛擬機，效果相當好，因為它可以做多種架構。但我還沒有在 Linux 上測試過它，而且由於它聲稱是針對 macOS 的，所以我很擔心。我們是一家混合使用MacBooks和Linux機器的公司，所以我們需要一個對所有人都有效的工具。<p>MacBooks上的虛擬化情況一般來說不是很好。我認為蘋果公司推出了Virtualization.framework，試圖改善情況，但其性能實際上比QEMU更差。你可以嘗試在Docker Desktop的實驗選項中啟用它，你會發現它變得更加遲鈍。然後還有其他一些煩人的事情，比如不得不一直在後臺為Docker運行一個虛擬機，因為 \"真正的 \"Docker在macOS上是不可能的。有時我會有三個或更多的虛擬機在運行，而除了我的瀏覽器之外，所有的東西都在支付這種虛擬化的代價。同樣，我喜歡它的性能和電池壽命，但它造成的碎片化是一場噩夢。<p>到目前為止，你的經驗如何？有什麼技巧/竅門嗎？\n"
}