{
  "@type": "NewsArticle",
  "identifier": "2022--07--22--en--askhn--HackerNews--NewsArticle--32191786",
  "url": "https://news.ycombinator.com/item?id=32191786",
  "headline": "Ask HN: How do I unseat a local NIMBY councillor? Need strategy and tech advice",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": " I live in an affluent neighbourhood in Toronto - a city in pangs of a housing crisis - represented by a councillor who's a living caricature of a NIMBY. I tried contacting her regarding the home affordability issue but she ghosted me once she realized I'm not a wealthy homeowner. Instead, I now receive her newsletter every month with a list of development projects she &quot;successfully opposed / delayed / deferred&quot;. This is despite almost half of the constituents in her ward being renters.\nShe's an entrenched incumbent but fortunately there's someone running to oppose her in municipal elections this October. He's a political newbie but a competent person with good vision for the city. Even though it's a classic David VS Goliath story, I'm ready to invest time and energy into trying to help him win the seat.<p>So I was hoping there are people here who tried something similar and are willing to share their experiences. Is there a playbook to follow to ensure we at least cover the basics? Are there any tech solutions that could provide us with an advantage?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway2207A",
    "url": "https://news.ycombinator.com/user?id=throwaway2207A"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32191786",
  "sameAs": "https://news.ycombinator.com/item?id=32191786",
  "dateCreated": "2022-07-22T22:27:17.957Z",
  "datePublished": "2022-07-22T13:42:50.000Z",
  "dateModified": "2022-07-22T22:27:17.957Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我如何推翻当地的NIMBY议员？需要战略和技术建议\n",
  "headline_zh-Hant": "Ask HN: 我如何推翻當地的NIMBY議員？需要戰略和技術建議\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": " 我住在多伦多的一个富人区--这个城市正处于住房危机的痛苦之中--由一位议员代表，她是一个活生生的NIMBY的漫画。我曾试图就房屋可负担性问题与她联系，但当她意识到我不是一个富有的房主时，就把我晾在一边。相反，我现在每个月都会收到她的通讯，上面列有她成功反对/推迟/延缓的发展项目。尽管她的选区里几乎有一半的选民是租房者。\n她是一个根深蒂固的现任者，但幸运的是，在今年十月的市政选举中，有人要反对她。他是一个政治新手，但却是一个有能力的人，对城市有良好的愿景。虽然这是一个典型的大卫与歌利亚的故事，但我准备投入时间和精力，试图帮助他赢得这个席位。<p>因此，我希望这里有一些人尝试过类似的事情，并愿意分享他们的经验。是否有一个可以遵循的游戏手册，以确保我们至少涵盖了基本的内容？是否有任何技术解决方案可以为我们提供优势？\n",
  "description_zh-Hant": " 我住在多倫多的一個富人區--這個城市正處於住房危機的痛苦之中--由一位議員代表，她是一個活生生的NIMBY的漫畫。我曾試圖就房屋可負擔性問題與她聯繫，但當她意識到我不是一個富有的房主時，就把我晾在一邊。相反，我現在每個月都會收到她的通訊，上面列有她成功反對/推遲/延緩的發展項目。儘管她的選區裡幾乎有一半的選民是租房者。\n她是一個根深蒂固的現任者，但幸運的是，在今年十月的市政選舉中，有人要反對她。他是一個政治新手，但卻是一個有能力的人，對城市有良好的願景。雖然這是一個典型的大衛與歌利亞的故事，但我準備投入時間和精力，試圖幫助他贏得這個席位。<p>因此，我希望這裡有一些人嘗試過類似的事情，並願意分享他們的經驗。是否有一個可以遵循的遊戲手冊，以確保我們至少涵蓋了基本的內容？是否有任何技術解決方案可以為我們提供優勢？\n"
}