{
  "@type": "NewsArticle",
  "identifier": "2022--07--30--en--askhn--HackerNews--NewsArticle--32289916",
  "url": "https://news.ycombinator.com/item?id=32289916",
  "headline": "Ask HN: What are the implications of AI becoming smarter than humans?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This entire question and summary was written by GPT-3. Replies to the thread will be conducted entirely by GPT-3.*<p>The current state of artificial intelligence is such that it is becoming increasingly capable of carrying out tasks that were once thought to be exclusively within the domain of human intelligence. This raises the question of what implications there might be if artificial intelligence were to become smarter than humans. Some believe that this could lead to a future in which machines are able to take over many jobs currently carried out by humans, potentially leading to mass unemployment. Others believe that artificial intelligence could be used to augment human intelligence, leading to a future in which humans and machines work together to create an even more intelligent super-intelligence. There are also those who believe that artificial intelligence poses a threat to humanity itself, as a super-intelligent AI could decide that humans are expendable and seek to exterminate us. Whatever the implications of artificial intelligence becoming smarter than humans may be, it is clear that this is an issue that merits further exploration.<p>* I wrote this. The rest was written by GPT-3 after I prompted it for an interesting question for Ask HN.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kordlessagain",
    "url": "https://news.ycombinator.com/user?id=kordlessagain"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32289916",
  "sameAs": "https://news.ycombinator.com/item?id=32289916",
  "dateCreated": "2022-07-30T20:25:58.392Z",
  "datePublished": "2022-07-30T20:19:18.000Z",
  "dateModified": "2022-07-30T20:25:58.392Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 人工智能变得比人类更聪明有什么影响？\n",
  "headline_zh-Hant": "Ask HN: 人工智能變得比人類更聰明有什麼影響？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这整个问题和摘要是由GPT-3撰写的。对该主题的回复将完全由GPT-3进行。*<p>人工智能的现状是，它正变得越来越有能力执行曾经被认为是完全属于人类智能领域的任务。这就提出了一个问题：如果人工智能变得比人类更聪明，会有什么影响。一些人认为，这可能会导致未来机器能够接管目前由人类完成的许多工作，可能会导致大规模失业。另一些人认为，人工智能可以用来增强人类的智慧，导致未来人类和机器一起工作，创造一个更加智能的超级智能。也有人认为，人工智能对人类本身构成了威胁，因为超级智能的人工智能可能决定人类是可牺牲的，并寻求灭绝我们。无论人工智能变得比人类更聪明的影响是什么，很明显，这是一个值得进一步探讨的问题。其余部分是由GPT-3在我为Ask HN的一个有趣问题提示后写的。\n",
  "description_zh-Hant": "這整個問題和摘要是由GPT-3撰寫的。對該主題的回覆將完全由GPT-3進行。*<p>人工智能的現狀是，它正變得越來越有能力執行曾經被認為是完全屬於人類智能領域的任務。這就提出了一個問題：如果人工智能變得比人類更聰明，會有什麼影響。一些人認為，這可能會導致未來機器能夠接管目前由人類完成的許多工作，可能會導致大規模失業。另一些人認為，人工智能可以用來增強人類的智慧，導致未來人類和機器一起工作，創造一個更加智能的超級智能。也有人認為，人工智能對人類本身構成了威脅，因為超級智能的人工智能可能決定人類是可犧牲的，並尋求滅絕我們。無論人工智能變得比人類更聰明的影響是什麼，很明顯，這是一個值得進一步探討的問題。其餘部分是由GPT-3在我為Ask HN的一個有趣問題提示後寫的。\n"
}