{
  "@type": "NewsArticle",
  "identifier": "2022--04--20--en--askhn--HackerNews--NewsArticle--31095379",
  "url": "https://news.ycombinator.com/item?id=31095379",
  "headline": "Ask HN: What to do if job sucks?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi everyone,I hope this is an ok place to rant because I'm so tired - mentally and physically.<p>I found a job in the marketing area and it is draining. Not the job as much as the people I work with. I'm very new to the field, but asking questions is bad. I'm good at my job (the results show) but the people around me are rude, hostile, and downright condescending when I ask questions. Even HR is rude, so there's really no one to talk to. The turnover rate is high as well. It's exhausting to deal with this day in day out and feel anxious and dreaded to go into work. That said, I can't quit for now - I need the money and I'm not hearing back from anyone else. Are there people out there who can go into work and just go home without having to deal with all this BS? I'm also seeing a therapist because my self-esteem is at an all-time-low. It's slow but for now I just feel like running away from all of this.<p>PS I know it's pointless to rant but I just feel so stuck and hopeless.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "intronextron",
    "url": "https://news.ycombinator.com/user?id=intronextron"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31095379",
  "sameAs": "https://news.ycombinator.com/item?id=31095379",
  "dateCreated": "2022-04-20T13:37:19.526Z",
  "datePublished": "2022-04-20T11:34:50.000Z",
  "dateModified": "2022-04-20T13:37:19.526Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如果工作很糟糕，该怎么办？",
  "headline_zh-Hant": "Ask HN: 如果工作很糟糕，該怎麼辦？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，我希望这是个可以发牢骚的地方，因为我太累了--精神上和身体上。不是因为工作，而是因为和我一起工作的人。我对这个领域很陌生，但问问题是不好的。我的工作很出色（结果显示），但当我问问题时，我周围的人都很粗鲁，充满敌意，而且完全是居高临下的。甚至人力资源部门也很粗鲁，所以真的没有人可以谈。流动率也很高。日复一日地处理这些事情，让人筋疲力尽，感到焦虑和害怕去工作。话虽如此，我暂时还不能辞职--我需要钱，而且我没有听到其他人的回音。有没有人可以去上班，然后回家，而不必处理所有这些麻烦事？我也在看治疗师，因为我的自尊心处于历史最低点。这很慢，但现在我只觉得想逃离这一切。<p>PS 我知道咆哮是没有意义的，但我只是觉得很困，没有希望。",
  "description_zh-Hant": "大家好，我希望這是個可以發牢騷的地方，因為我太累了--精神上和身體上。不是因為工作，而是因為和我一起工作的人。我對這個領域很陌生，但問問題是不好的。我的工作很出色（結果顯示），但當我問問題時，我周圍的人都很粗魯，充滿敵意，而且完全是居高臨下的。甚至人力資源部門也很粗魯，所以真的沒有人可以談。流動率也很高。日復一日地處理這些事情，讓人筋疲力盡，感到焦慮和害怕去工作。話雖如此，我暫時還不能辭職--我需要錢，而且我沒有聽到其他人的迴音。有沒有人可以去上班，然後回家，而不必處理所有這些麻煩事？我也在看治療師，因為我的自尊心處於歷史最低點。這很慢，但現在我只覺得想逃離這一切。<p>PS 我知道咆哮是沒有意義的，但我只是覺得很困，沒有希望。"
}