{
  "@type": "NewsArticle",
  "identifier": "2022--08--07--en--askhn--HackerNews--NewsArticle--32373392",
  "url": "https://news.ycombinator.com/item?id=32373392",
  "headline": "Ask HN: Is living in NYC worth it?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I live in SF but location flexible and considering making a move to NYC.<p>Biggest issue is obviously cost. I’m shocked even living in what is considered a high cost of living area by the rent prices I’m seeing in Manhattan and parts of Brooklyn. I’m seeing fairly basic 1 bedroom apartments being listed that are $5k+ not including utilities or brokers fees which can be as high as 15% of the annual rent, and most likely not rent stabilized meaning they can raise the rent however much they want after the lease ends.<p>Outside of rent the cost of entertainment and eating out is not surprisingly on the higher side relative to other cities though I would not say it’s as wildly expensive as the rent is.<p>The upside is that there’s an energy to the city that is lacking here, and you don’t need a car to get to most places within the city (though to be fair I don’t have a car in SF either).<p>For people who have recently considered moving or have been living there do you feel it’s worth it considering the rent/housing situation on top of everything else (food, groceries, entertainment, taxation, etc)?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tempsy",
    "url": "https://news.ycombinator.com/user?id=tempsy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32373392",
  "sameAs": "https://news.ycombinator.com/item?id=32373392",
  "dateCreated": "2022-08-07T03:38:01.605Z",
  "datePublished": "2022-08-07T02:38:11.000Z",
  "dateModified": "2022-08-07T03:38:01.605Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 24
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 34
    }
  ],
  "headline_zh-Hans": "Ask HN: 住在纽约市值得吗？\n",
  "headline_zh-Hant": "Ask HN: 住在紐約市值得嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我住在旧金山，但位置灵活，正在考虑搬到纽约市。<p>最大的问题显然是成本。即使生活在被认为是高生活成本的地区，我也对我在曼哈顿和布鲁克林部分地区看到的租金价格感到震惊。我所看到的相当基本的一居室公寓的挂牌价是5千美元以上，还不包括水电费或中介费，这些费用可能高达年租金的15%，而且很可能不是稳定租金，这意味着他们可以在租约结束后随意提高租金。<p>除了租金之外，娱乐和外出就餐的费用相对于其他城市来说也是比较高的，尽管我不会说它像租金一样疯狂昂贵。 <p>好处是，城市有一种活力，这是这里所缺乏的，而且你不需要汽车就能去市内的大多数地方（尽管公平地说，我在旧金山也没有汽车）。<p>对于最近考虑搬家或已经住在那里的人，考虑到租金/住房情况以及其他一切（食品、杂货、娱乐、税收等），你觉得值得吗？\n",
  "description_zh-Hant": "我住在舊金山，但位置靈活，正在考慮搬到紐約市。<p>最大的問題顯然是成本。即使生活在被認為是高生活成本的地區，我也對我在曼哈頓和布魯克林部分地區看到的租金價格感到震驚。我所看到的相當基本的一居室公寓的掛牌價是5千美元以上，還不包括水電費或中介費，這些費用可能高達年租金的15%，而且很可能不是穩定租金，這意味著他們可以在租約結束後隨意提高租金。<p>除了租金之外，娛樂和外出就餐的費用相對於其他城市來說也是比較高的，儘管我不會說它像租金一樣瘋狂昂貴。 <p>好處是，城市有一種活力，這是這裡所缺乏的，而且你不需要汽車就能去市內的大多數地方（儘管公平地說，我在舊金山也沒有汽車）。<p>對於最近考慮搬家或已經住在那裡的人，考慮到租金/住房情況以及其他一切（食品、雜貨、娛樂、稅收等），你覺得值得嗎？\n"
}