{
  "@type": "NewsArticle",
  "identifier": "2022--06--14--en--askhn--HackerNews--NewsArticle--31743452",
  "url": "https://news.ycombinator.com/item?id=31743452",
  "headline": "Ask HN: How do I stop flip-flopping an important decision?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been indeterministically bouncing from one state to another (and back again) for longer than I would like to admit. Frankly, I'm in a while(1) loop, and I desperately need someone to hand me a 'break.' I would love to settle on the decision and act upon it. For context, I'm 28, a non-EU resident, and have been programming for five years.<p>I have always wanted to get a degree in software engineering. However, when I first considered going to university, my math skills were far below the level required for passing the entrance exam. Despite not knowing how to add two fractions, I was determined to get into the study program I wanted in the future. Fast-forward a few years: I invested about 2K hours, scattered across three years, in mathematics only. Besides math, I read and programmed a lot. I was very disciplined and covered about 70% of the university curriculum I was aiming for, including areas like computer architecture, computer networks, computer security, databases, operating systems, compilers, etc.<p>Considering that I have very high aspirations (migrating to EU/US, six-figure income, etc.), what should I do? There are some compelling things about enrolling in a university: I'm sure having a diploma is very valuable for the immigration process, and good networking can never hurt. But I keep seeing people who succeeded even without a degree. I don't know their path in detail, but I know they have done it, although they are usually EU residents. Anyway, an inevitable question arises: why haven't I enrolled earlier? It almost feels unfair now. I've put so much work into everything, and for what, only to start from the beginning again? Time is precious. Besides that, I'm a bit skeptical about how the networking part would turn out since I'd be 10+ years older than most students. On the other hand, I'm positive I would regret it for the rest of my life if I hadn't at least tried. I know that I would be miserable if I stayed here forever.<p>I just need someone to nudge me in the right direction with a convincing argument.<p>Thanks for reading.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "overclk64",
    "url": "https://news.ycombinator.com/user?id=overclk64"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31743452",
  "sameAs": "https://news.ycombinator.com/item?id=31743452",
  "dateCreated": "2022-06-14T18:31:32.642Z",
  "datePublished": "2022-06-14T18:06:25.000Z",
  "dateModified": "2022-06-14T18:31:32.642Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我怎样才能停止翻来覆去的重要决定？\n",
  "headline_zh-Hant": "Ask HN: 我怎樣才能停止翻來覆去的重要決定？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我不确定地从一个状态跳到另一个状态（再跳回来）的时间比我愿意承认的要长。坦率地说，我在一个while(1)的循环中，我迫切需要有人递给我一个'休息'。我很想定下决定并付诸行动。就背景而言，我28岁，非欧盟居民，已经有五年的编程经验。<p>我一直想获得一个软件工程的学位。然而，当我第一次考虑上大学时，我的数学技能远远低于通过入学考试所需的水平。尽管我不知道如何将两个分数相加，但我决心将来要进入我想要的学习课程。快进了几年。我投入了大约2000个小时，分散在三年里，只学了数学。除了数学之外，我还读了很多书，编了很多程序。我非常自律，涵盖了我目标大学课程的70%，包括计算机结构、计算机网络、计算机安全、数据库、操作系统、编译器等领域。<p>考虑到我有很高的期望（移民到欧盟/美国，六位数的收入等），我应该做什么？报考大学有一些令人信服的地方。我相信拥有一张文凭对移民过程非常有价值，而且良好的人际关系永远不会有坏处。但我一直看到那些即使没有学位也能成功的人。我不知道他们的详细路径，但我知道他们已经做到了，尽管他们通常是欧盟居民。总之，一个不可避免的问题出现了：为什么我没有早点入学？现在几乎感觉不公平。我为每件事都付出了这么多努力，为了什么，只能从头再来？时间是宝贵的。此外，我对网络部分的结果有点怀疑，因为我比大多数学生大10多岁。另一方面，我肯定，如果我没有至少尝试过，我会后悔一辈子的。我知道，如果我永远呆在这里，我会很痛苦的。<p>我只是需要有人用令人信服的论据来促使我朝正确的方向前进。<p>谢谢你的阅读。\n",
  "description_zh-Hant": "我不確定地從一個狀態跳到另一個狀態（再跳回來）的時間比我願意承認的要長。坦率地說，我在一個while(1)的循環中，我迫切需要有人遞給我一個'休息'。我很想定下決定並付諸行動。就背景而言，我28歲，非歐盟居民，已經有五年的編程經驗。<p>我一直想獲得一個軟件工程的學位。然而，當我第一次考慮上大學時，我的數學技能遠遠低於通過入學考試所需的水平。儘管我不知道如何將兩個分數相加，但我決心將來要進入我想要的學習課程。快進了幾年。我投入了大約2000個小時，分散在三年裡，只學了數學。除了數學之外，我還讀了很多書，編了很多程序。我非常自律，涵蓋了我目標大學課程的70%，包括計算機結構、計算機網絡、計算機安全、數據庫、操作系統、編譯器等領域。<p>考慮到我有很高的期望（移民到歐盟/美國，六位數的收入等），我應該做什麼？報考大學有一些令人信服的地方。我相信擁有一張文憑對移民過程非常有價值，而且良好的人際關係永遠不會有壞處。但我一直看到那些即使沒有學位也能成功的人。我不知道他們的詳細路徑，但我知道他們已經做到了，儘管他們通常是歐盟居民。總之，一個不可避免的問題出現了：為什麼我沒有早點入學？現在幾乎感覺不公平。我為每件事都付出了這麼多努力，為了什麼，只能從頭再來？時間是寶貴的。此外，我對網絡部分的結果有點懷疑，因為我比大多數學生大10多歲。另一方面，我肯定，如果我沒有至少嘗試過，我會後悔一輩子的。我知道，如果我永遠呆在這裡，我會很痛苦的。<p>我只是需要有人用令人信服的論據來促使我朝正確的方向前進。<p>謝謝你的閱讀。\n"
}