{
  "@type": "NewsArticle",
  "identifier": "2022--04--15--en--askhn--HackerNews--NewsArticle--31043717",
  "url": "https://news.ycombinator.com/item?id=31043717",
  "headline": "Ask HN: Career paths when you've been disillusioned by the software dev process?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm 10 years into my career, and I'm very tired of team based software development. I still enjoy programming but I've come to dread almost everything surrounding it.<p>My work / life balance is decent, I work for a pretty good company on a cool product, and my co-workers are good people. I have suffered from mild to moderate depression most of my life, but I'm doing my best to take care of the basics there, and I'm seeing a therapist. I'm beginning to see some of the classic signs of burnout, but I don't think this is strictly a burnout question.<p>I work well on teams, my teammates like me, but I've always preferred solo work. I think this is a stable personality trait, as I remember feeling like this as early as kindergarten. Other factors include the already incredibly complex social problems that come from developing software with a team of humans, the monster that Agile / Scrum have become, bizarre and poorly thought out technical decisions, failed projects, endless meetings, and being told what to do by people who have never written any code.<p>Anywhere, here are some of the possible ideas I've come up with, and my thoughts on them.<p><i>Make the most of what I already have</i> - I'm fully willing to admit that I may be in the best possible scenario already. The Hedonic Treadmill is real, and the grass is often not greener. I might just need to reframe how I think about it.<p><i>Find the perfect team</i> - Maybe if I job hop enough, I'll land on the perfect team that actually fits my work style.<p><i>Consulting / freelance</i> - I'm not sure if this is any better, because you have the constant pressure of needing to find and work with clients. There's something to be said for having the freedom to only take on the projects that interest you (or pay the best), and to not be shackled to them forever. The freelancers I've talked with all seem to agree that your happiness in this path is largely contingent on your ability to find good clients.<p><i>Solo Founder / Indie Hacker</i> - It sounds like a dream to have a small product that you build entirely yourself, that makes $100k-$200k/year. There's a lot of cool stories in that space, but I've also read a lot of stories of people working tirelessly for years on a project that never makes over $1k MRR. The thought of putting that much work into building something while also working full time just feels like too much to me.<p>One idea is to combine freelancing with being a solo founder: do enough freelancing to cover living expenses, then use the rest of the time to build your own things (with the hope to sell them).<p><i>Optimize for salary, and FIRE as quickly as possible</i> - I could just grind to get a job with the highest total compensation possible, work it for enough years to be able to FIRE, and then just code on my own terms. It mentally exhausts me just to think about doing this, though. I don't want to go through the interview hazing followed by months of learning a company's internal politics.<p><i>Get out of writing software as a career entirely, do it as a hobby only</i> - Maybe, but at the moment I don't have anything else that I'm either skilled enough at to get a job for now, or interested enough to put the work into. But it's something I can keep in the back of my mind.<p>--<p>The &quot;freelancing part time while working on my own product(s)&quot; seems like an interesting path to pursue. I'm being cautious though, and I don't plan to make any big changes for 1 or 2 more years at least. I may find that I'm already in the best possible spot, and that this is just the Hedonic Treadmill at work.<p>Has anyone else here been going through a similar thought process? Or decided to take one of these paths (or another I haven't thought of) already for similar reasons?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Trasmatta",
    "url": "https://news.ycombinator.com/user?id=Trasmatta"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31043717",
  "sameAs": "https://news.ycombinator.com/item?id=31043717",
  "dateCreated": "2022-04-15T18:37:20.942Z",
  "datePublished": "2022-04-15T18:20:02.000Z",
  "dateModified": "2022-04-15T18:37:20.942Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 当你对软件开发过程感到失望时的职业道路？",
  "headline_zh-Hant": "Ask HN: 當你對軟件開發過程感到失望時的職業道路？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的职业生涯已经有10年了，我对基于团队的软件开发感到非常厌倦。我仍然喜欢编程，但我已经开始害怕围绕它的几乎所有事情。<p>我的工作/生活平衡得很好，我在一家相当好的公司工作，产品很酷，我的同事们都是好人。我一生中大部分时间都患有轻度到中度的抑郁症，但我正在尽力照顾那里的基本情况，而且我正在看心理医生。我开始看到一些典型的倦怠迹象，但我认为这不是严格意义上的倦怠问题。<p>我在团队中工作得很好，我的队友喜欢我，但我总是喜欢单独工作。我认为这是一个稳定的人格特征，因为我记得早在幼儿园时就有这样的感觉。其他因素包括：与人类团队一起开发软件所带来的已经非常复杂的社会问题、敏捷/Scrum已经成为的怪物、怪异和考虑不周的技术决定、失败的项目、无休止的会议，以及被那些从未写过任何代码的人告知该怎么做。<p>无论如何，这里是我想到的一些可能的想法，以及我对它们的想法。<p><i>充分利用我已经拥有的东西</i> - 我完全愿意承认，我可能已经处于最好的情况下。The Hedonic Treadmill is real, and the grass is often not greener. I might just need to reframe how I think about it.<p><i>Find the perfect team</i> - Maybe if I job hop enough, I'll land on the perfect team that actually fits my work style.<p><i>Consulting / freelance</i> - I'm not sure if this is any better, because you have the constant pressure of needing to find and work with clients. 你可以自由地只接你感兴趣的项目（或报酬最好的项目），而且不会被永远束缚在这些项目上，这一点是值得肯定的。与我交谈过的自由职业者似乎都同意，你在这条道路上的幸福在很大程度上取决于你找到好客户的能力。<p><i>独立创始人/独立创客</i>--拥有一个完全由你自己打造的小产品，每年赚取10万至20万美元，这听起来像是一个梦想。在这个领域有很多很酷的故事，但我也读过很多人在一个项目上不知疲倦地工作了几年，却从未赚到超过1千美元的MRR的故事。The thought of putting that much work into building something while also working full time just feels like too much to me.<p>One idea is to combine freelancing with being a solo founder: do enough freelancing to cover living expenses, then use the rest of the time to build your own things (with the hope to sell them). <p><i>Optimize for salary, and FIRE as quickly as possible</i> - I could just grind to get a job with the highest total compensation possible, work it for enough years to be able to FIRE, and then just code on my own terms. It mentally exhausts me just to think about doing this, though. <p><i>完全不把写软件作为一种职业，只把它作为一种爱好</i> - 也许吧，但目前我没有其他的东西，既没有足够的技能去找一份工作，也没有足够的兴趣去投入工作。  但我还是很谨慎，至少在1到2年内我不打算做任何大的改变。我可能会发现我已经处于最好的状态，而这只是Hedonic Treadmill在工作。<p>这里有其他人经历过类似的思考过程吗？或者因为类似的原因已经决定走其中一条路（或另一条我没有想到的路）？",
  "description_zh-Hant": "我的職業生涯已經有10年了，我對基於團隊的軟件開發感到非常厭倦。我仍然喜歡編程，但我已經開始害怕圍繞它的幾乎所有事情。<p>我的工作/生活平衡得很好，我在一家相當好的公司工作，產品很酷，我的同事們都是好人。我一生中大部分時間都患有輕度到中度的抑鬱症，但我正在盡力照顧那裡的基本情況，而且我正在看心理醫生。我開始看到一些典型的倦怠跡象，但我認為這不是嚴格意義上的倦怠問題。<p>我在團隊中工作得很好，我的隊友喜歡我，但我總是喜歡單獨工作。我認為這是一個穩定的人格特徵，因為我記得早在幼兒園時就有這樣的感覺。其他因素包括：與人類團隊一起開發軟件所帶來的已經非常複雜的社會問題、敏捷/Scrum已經成為的怪物、怪異和考慮不周的技術決定、失敗的項目、無休止的會議，以及被那些從未寫過任何代碼的人告知該怎麼做。<p>無論如何，這裡是我想到的一些可能的想法，以及我對它們的想法。<p><i>充分利用我已經擁有的東西</i> - 我完全願意承認，我可能已經處於最好的情況下。The Hedonic Treadmill is real, and the grass is often not greener. I might just need to reframe how I think about it.<p><i>Find the perfect team</i> - Maybe if I job hop enough, I'll land on the perfect team that actually fits my work style.<p><i>Consulting / freelance</i> - I'm not sure if this is any better, because you have the constant pressure of needing to find and work with clients. 你可以自由地只接你感興趣的項目（或報酬最好的項目），而且不會被永遠束縛在這些項目上，這一點是值得肯定的。與我交談過的自由職業者似乎都同意，你在這條道路上的幸福在很大程度上取決於你找到好客戶的能力。<p><i>獨立創始人/獨立創客</i>--擁有一個完全由你自己打造的小產品，每年賺取10萬至20萬美元，這聽起來像是一個夢想。在這個領域有很多很酷的故事，但我也讀過很多人在一個項目上不知疲倦地工作了幾年，卻從未賺到超過1千美元的MRR的故事。The thought of putting that much work into building something while also working full time just feels like too much to me.<p>One idea is to combine freelancing with being a solo founder: do enough freelancing to cover living expenses, then use the rest of the time to build your own things (with the hope to sell them). <p><i>Optimize for salary, and FIRE as quickly as possible</i> - I could just grind to get a job with the highest total compensation possible, work it for enough years to be able to FIRE, and then just code on my own terms. It mentally exhausts me just to think about doing this, though. <p><i>完全不把寫軟件作為一種職業，只把它作為一種愛好</i> - 也許吧，但目前我沒有其他的東西，既沒有足夠的技能去找一份工作，也沒有足夠的興趣去投入工作。  但我還是很謹慎，至少在1到2年內我不打算做任何大的改變。我可能會發現我已經處於最好的狀態，而這只是Hedonic Treadmill在工作。<p>這裡有其他人經歷過類似的思考過程嗎？或者因為類似的原因已經決定走其中一條路（或另一條我沒有想到的路）？"
}