{
  "@type": "NewsArticle",
  "identifier": "2022--07--08--en--askhn--HackerNews--NewsArticle--32022641",
  "url": "https://news.ycombinator.com/item?id=32022641",
  "headline": "Ask HN: How to manage a team when you don’t know the tech",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I recently started as a manager at a  smallish company working on &lt;complex tech&gt;. I inherited a team of mixed skill level and tenure.<p>I think I’m pretty good at people management and generally organizing work and protecting the team. But I’m having real trouble delivering more value because I just don’t have domain knowledge either as a domain-specific developer or end user.<p>I’ve managed teams before but I was somewhat, or very familiar with the domain, allowing me to engage in much deep conversations with stakeholders up to unblocking the team by taking on design or architecture work that enabled others to come in behind me with a solid scaffolding in place.<p>I am reading and studying outside of work when I can but with 3 small kids I can’t do much. It seems like I need  months of dedicated study and a couple of practical projects under my belt to get up to speed and feel useful instead of just asking for status and estimates like a useless middle manager.<p>What do you do? Have you had a manager in this position that handled it well? Should I just keep plugging away?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "doitLP",
    "url": "https://news.ycombinator.com/user?id=doitLP"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32022641",
  "sameAs": "https://news.ycombinator.com/item?id=32022641",
  "dateCreated": "2022-07-08T03:55:32.151Z",
  "datePublished": "2022-07-08T03:15:53.000Z",
  "dateModified": "2022-07-08T03:55:32.151Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 当你不懂技术时如何管理一个团队\n",
  "headline_zh-Hant": "Ask HN: 當你不懂技術時如何管理一個團隊\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我最近开始在一家小型公司担任经理，从事&lt;复杂的技术&gt;工作。我继承了一个技术水平和任期不一的团队。<p>我认为我在人员管理和一般组织工作以及保护团队方面相当出色。<p>我以前也管理过团队，但我对该领域有些或非常熟悉，这使我能够与利益相关者进行深入的对话，并通过承担设计或架构工作来疏通团队，使其他人能够在我身后有一个坚实的脚手架。看来我需要几个月的潜心学习，再加上几个实际的项目，才能尽快上手，觉得自己有用，而不是像个无用的中层管理者一样，只知道问状况和估算。<p>你是怎么做的？你有没有在这个位置上的经理，处理得很好？我是否应该继续插手？\n",
  "description_zh-Hant": "我最近開始在一家小型公司擔任經理，從事&lt;複雜的技術&gt;工作。我繼承了一個技術水平和任期不一的團隊。<p>我認為我在人員管理和一般組織工作以及保護團隊方面相當出色。<p>我以前也管理過團隊，但我對該領域有些或非常熟悉，這使我能夠與利益相關者進行深入的對話，並通過承擔設計或架構工作來疏通團隊，使其他人能夠在我身後有一個堅實的腳手架。看來我需要幾個月的潛心學習，再加上幾個實際的項目，才能儘快上手，覺得自己有用，而不是像個無用的中層管理者一樣，只知道問狀況和估算。<p>你是怎麼做的？你有沒有在這個位置上的經理，處理得很好？我是否應該繼續插手？\n"
}