{
  "@type": "NewsArticle",
  "identifier": "2022--07--03--en--askhn--HackerNews--NewsArticle--31968683",
  "url": "https://news.ycombinator.com/item?id=31968683",
  "headline": "Ask HN: I'm feeling lost and don't know what route to take on my career/life",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello everyone, I’ve been a HN reader for a long time and this is my first time posting here.<p>I’m currently doing my thesis for a CS degree about to graduate, but I don’t have internship or work experience any other than the work on my university courses.<p>I would appreciate any suggestions to prepare for the HR, behavioral and technical interviews and how all of the interview process works. Should I grind Leetcode or specialize in a specific framework?<p>I also get lost when I start searching for a job since all of them ask for a lot of qualifications that I don’t feel prepared for, hence I feel like I have to prepare and prepare but never actually apply for any job since I'm stuck in this &quot;preparing loop&quot; where I don't have a path to follow. I’m lost and not sure what to do or where to start.<p>Lastly, for economic reasons, I have a part time job (~30 hours a week) which is hard work and not tech related at all, which also makes me think about on what to spend my time on, whether to focus on my thesis, or preparing for interviews, or both? I've even considered getting a job as a help desk or something since my current job is very exhausting working under the heat, but again, I don't know what keywords to use when searching for a job. I don't have any contacts  since I'm a (legal) immigrant and recently moved here (USA). I'd appreciate any advise for this.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "malzeno",
    "url": "https://news.ycombinator.com/user?id=malzeno"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31968683",
  "sameAs": "https://news.ycombinator.com/item?id=31968683",
  "dateCreated": "2022-07-03T16:34:52.204Z",
  "datePublished": "2022-07-03T16:01:49.000Z",
  "dateModified": "2022-07-03T16:34:52.204Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 我感到迷茫，不知道我的职业/生活应该采取什么路线。\n",
  "headline_zh-Hant": "Ask HN: 我感到迷茫，不知道我的職業/生活應該採取什麼路線。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，我已经是HN的读者了，这是我第一次在这里发帖。<p>我目前正在做CS学位的论文，即将毕业，但除了大学课程的工作之外，我没有任何实习或工作经验。<p>我希望得到任何建议，以准备人力资源、行为和技术面试，以及所有面试过程如何进行。当我开始寻找工作时，我也很迷茫，因为所有的工作都要求有很多资格，我觉得自己没有准备好，因此我觉得我必须准备和准备，但实际上从未申请过任何工作，因为我被困在这个&quot;准备循环&quot;中，我没有路径可循。<p>最后，由于经济原因，我有一份兼职工作（每周约30小时），工作很辛苦，而且与技术完全无关，这也让我思考该把时间花在什么地方，是专注于我的论文，还是准备面试，还是两者都做？我甚至考虑过找一份服务台之类的工作，因为我现在的工作在高温下工作非常累，但我又不知道在寻找工作时应该用什么关键词。我没有任何联系，因为我是一个（合法）移民，最近才搬到这里（美国）。我希望得到任何这方面的建议。\n",
  "description_zh-Hant": "大家好，我已經是HN的讀者了，這是我第一次在這裡發帖。<p>我目前正在做CS學位的論文，即將畢業，但除了大學課程的工作之外，我沒有任何實習或工作經驗。<p>我希望得到任何建議，以準備人力資源、行為和技術面試，以及所有面試過程如何進行。當我開始尋找工作時，我也很迷茫，因為所有的工作都要求有很多資格，我覺得自己沒有準備好，因此我覺得我必須準備和準備，但實際上從未申請過任何工作，因為我被困在這個&quot;準備循環&quot;中，我沒有路徑可循。<p>最後，由於經濟原因，我有一份兼職工作（每週約30小時），工作很辛苦，而且與技術完全無關，這也讓我思考該把時間花在什麼地方，是專注於我的論文，還是準備面試，還是兩者都做？我甚至考慮過找一份服務檯之類的工作，因為我現在的工作在高溫下工作非常累，但我又不知道在尋找工作時應該用什麼關鍵詞。我沒有任何聯繫，因為我是一個（合法）移民，最近才搬到這裡（美國）。我希望得到任何這方面的建議。\n"
}