{
  "@type": "NewsArticle",
  "identifier": "2022--07--17--en--askhn--HackerNews--NewsArticle--32127891",
  "url": "https://news.ycombinator.com/item?id=32127891",
  "headline": "Ask HN: To what extent is an effectively cooperative global community an utopia?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "HN do you think it's possible to have a global community in which people from richer countries would be truly compelled or wanted to share their resources with people in a far away land, (i.e. not as much as in their local communities but much more than now) ?\nFor example in case of draught based hunger, rising sea levels  because of climate change, oil tanker spill etc.<p>Especially in case of climate change, where consequences come relatively slowly.<p>Context:\nI read developed countries are helping but they do not have a sense of urgency as it is happening far away. \nIn other words<p>&quot;out of sight, out of mind&quot;.<p>Humans  mostly agree on what constituts suffering and pain while there are many definitions of happiness.<p>I am thinking that in very simplified terms, emotions are &quot;weights&quot; to data in our neurophysiology.\nSimilarly as nods in neural network have weights to them.<p>I feel a stronger connection to people I personally know and whom I can experience with my physical senses.\nThis feeling of connection in my experience grows strong the more my values and values of other people are aligned and the more time we spend together, especially if situations are diverse and optimally challenging (we experience state of flow together or in a timely manner).<p>I find it difficulty to truly empathize with people with whom I have no or rare contact in real life.\nThe challenges of their struggle are soon just a data point in my consciousness with no important emotional weight attached to it.<p>Where as if I am connected to my local community these weights attached to data are much bigger and they correspond to me much more. Even more so if something is going on with my friends or family, then the emotional &quot;weight&quot; on that data is even bigger<p>This means I dedicate more of my energy, time and resources to my local community, which is probably optimal.<p>I also vaguely remember reading Foundations where in the end Isaac Asimov character\nthinks that telepathy is important also because is provides with a greater *feeling* (emotional weights in my sense) of connection between members who share this connection and can share feeling even if physically farther apart.<p>Unless we have case of trekonomics with unlimited clean energy and even in that case there are limited resurces we would need to share if we would like to prevent suffering and pain for a vast majority of people living on Earth.<p>HN what are you thoughts on this?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "just_a_machine",
    "url": "https://news.ycombinator.com/user?id=just_a_machine"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32127891",
  "sameAs": "https://news.ycombinator.com/item?id=32127891",
  "dateCreated": "2022-07-17T16:00:01.376Z",
  "datePublished": "2022-07-17T15:55:19.000Z",
  "dateModified": "2022-07-17T16:00:01.376Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 一个有效合作的全球社区在多大程度上是一个乌托邦？\n",
  "headline_zh-Hant": "Ask HN: 一個有效合作的全球社區在多大程度上是一個烏托邦？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你认为是否有可能建立一个全球社区，让来自富裕国家的人们真正被迫或希望与远方的人们分享他们的资源，（即不像在当地社区那样多，但比现在多得多）？\n例如，在干旱导致的饥饿、气候变化导致的海平面上升、油轮泄漏等情况下。<p>特别是在气候变化的情况下，后果来得相对缓慢。<p>背景。\n我读到发达国家正在提供帮助，但他们没有紧迫感，因为它发生在遥远的地方。\n<p>换句话说，<p>&quot;看不见，摸不着&quot;。<p>人类大多同意什么是痛苦，而对幸福有很多定义。<p>我在想，用非常简化的术语来说，情绪是我们神经生理学中数据的&quot;权重&quot。\n<p>我感觉到与我自己认识的人有更强的联系，我可以用我的身体感官来体验他们。\n在我的经验中，这种联系的感觉越来越强烈，我的价值观和其他人的价值观越一致，我们在一起的时间越长，特别是当情况是多样化和具有最佳挑战性的时候（我们一起体验流动状态或及时）。<p>我发现很难真正同情那些在现实生活中没有或很少接触的人。\n他们挣扎的挑战很快就只是我意识中的一个数据点，没有附加任何重要的情感重量。<p>如果我与当地社区有联系，这些附加在数据上的重量就大得多，它们与我的关系也更密切。更有甚者，如果我的朋友或家人发生了什么事，那么该数据的情感权重就更大了<p>这意味着我将更多的精力、时间和资源投入到我的本地社区，这可能是最理想的。<p>我还依稀记得读过《基础》，最后艾萨克-阿西莫夫的角色\n<p>除非我们有拥有无限清洁能源的trekonomics的情况，即使在这种情况下，如果我们想防止生活在地球上的绝大多数人遭受痛苦和折磨，我们也需要分享有限的资源。\n",
  "description_zh-Hant": "你認為是否有可能建立一個全球社區，讓來自富裕國家的人們真正被迫或希望與遠方的人們分享他們的資源，（即不像在當地社區那樣多，但比現在多得多）？\n例如，在乾旱導致的飢餓、氣候變化導致的海平面上升、油輪洩漏等情況下。<p>特別是在氣候變化的情況下，後果來得相對緩慢。<p>背景。\n我讀到發達國家正在提供幫助，但他們沒有緊迫感，因為它發生在遙遠的地方。\n<p>換句話說，<p>&quot;看不見，摸不著&quot;。<p>人類大多同意什麼是痛苦，而對幸福有很多定義。<p>我在想，用非常簡化的術語來說，情緒是我們神經生理學中數據的&quot;權重&quot。\n<p>我感覺到與我自己認識的人有更強的聯繫，我可以用我的身體感官來體驗他們。\n在我的經驗中，這種聯繫的感覺越來越強烈，我的價值觀和其他人的價值觀越一致，我們在一起的時間越長，特別是當情況是多樣化和具有最佳挑戰性的時候（我們一起體驗流動狀態或及時）。<p>我發現很難真正同情那些在現實生活中沒有或很少接觸的人。\n他們掙扎的挑戰很快就只是我意識中的一個數據點，沒有附加任何重要的情感重量。<p>如果我與當地社區有聯繫，這些附加在數據上的重量就大得多，它們與我的關係也更密切。更有甚者，如果我的朋友或家人發生了什麼事，那麼該數據的情感權重就更大了<p>這意味著我將更多的精力、時間和資源投入到我的本地社區，這可能是最理想的。<p>我還依稀記得讀過《基礎》，最後艾薩克-阿西莫夫的角色\n<p>除非我們有擁有無限清潔能源的trekonomics的情況，即使在這種情況下，如果我們想防止生活在地球上的絕大多數人遭受痛苦和折磨，我們也需要分享有限的資源。\n"
}