{
  "@type": "NewsArticle",
  "identifier": "2022--07--03--en--askhn--HackerNews--NewsArticle--31971019",
  "url": "https://news.ycombinator.com/item?id=31971019",
  "headline": "Ask HN: Which social media app has the best design in your opinion?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Which social media app do you think has the best design? This can include UX or UI design. Apparently most people don't pay attention to fonts, symbols and other stuff closely, but for those of us that do, which app speaks to you the most? This can really be any app, but preferably one of the more known social media apps.<p>For me, I've used Twitter probably the most by far, so I might be biased. They have a great black dark mode. The font is genuinely so cool. The high contrast labels and icons are so pleasing to look at.  The profile pages are cool and overall, the app layout makes the most sense to me in terms of the replies and features. Apparently Twitter is one of the more confusing apps to use, but Reddit is insanely confusing to me. When you look at social media and the internet overall, Twitter and Bootstrap seem to have had the biggest influence on app and website design, so many apps have similar features that Twitter does.<p>My least favorite is probably Reddit and Snapchat. Snapchat is pretty smooth to use, but the colors and bubble-like design just doesn't do it for me, and the profiles and searching thing is very confusing. Reddit is just a horrifically slow app and replies to posts are insanely annoying to sift through. I find myself closing every first tier replies so I can read replies instead if replies to replies. It's a confusing mess and there's just about nothing on the app that makes sense to me, which is interesting considering Quora, Twitter and Reddit are essentially the same thing and apparently had some of the same people on their design teams.<p>There's plenty of more stuff I like about Twitter, but the main thing is that fact that I prefer Twitter's design in general over other apps.<p>What about you?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "nikolqy",
    "url": "https://news.ycombinator.com/user?id=nikolqy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31971019",
  "sameAs": "https://news.ycombinator.com/item?id=31971019",
  "dateCreated": "2022-07-03T21:21:50.827Z",
  "datePublished": "2022-07-03T21:04:13.000Z",
  "dateModified": "2022-07-03T21:21:50.827Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 在你看来，哪个社交媒体应用的设计最好？\n",
  "headline_zh-Hant": "Ask HN: 在你看來，哪個社交媒體應用的設計最好？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你认为哪个社交媒体应用的设计最好？这可以包括用户体验或用户界面设计。显然，大多数人并不关注字体、符号和其他东西，但对于那些关注的人来说，哪个应用最能让你心动？这真的可以是任何应用程序，但最好是一个更知名的社交媒体应用程序。<p>对我来说，到目前为止，我可能使用Twitter最多的，所以我可能有偏见。他们有一个很棒的黑色黑暗模式。字体确实非常酷。高对比度的标签和图标让人看了很舒服。 个人资料页面很酷，总的来说，在回复和功能方面，这个应用程序的布局对我来说最有意义。显然，Twitter是使用起来比较混乱的应用程序之一，但Reddit对我来说是非常混乱的。当你看社会媒体和互联网整体时，Twitter和Bootstrap似乎对应用程序和网站设计的影响最大，所以许多应用程序有类似Twitter的功能。<p>我最不喜欢的可能是Reddit和Snapchat。Snapchat使用起来很顺畅，但它的颜色和类似气泡的设计对我来说并不合适，而且它的资料和搜索功能非常令人困惑。Reddit是一个慢得可怕的应用程序，而且对帖子的回复也非常令人讨厌，难以筛选。我发现自己关闭了每一个第一层的回复，所以我可以阅读回复，而不是回复的回复。这是一个混乱的局面，而且这个应用程序上没有任何东西对我来说是有意义的，这很有趣，因为Quora、Twitter和Reddit本质上是同一件事，而且显然他们的设计团队中有一些相同的人。<p>关于Twitter还有很多我喜欢的东西，但最主要的是，相比其他应用程序，我更喜欢Twitter的设计。\n",
  "description_zh-Hant": "你認為哪個社交媒體應用的設計最好？這可以包括用戶體驗或用戶界面設計。顯然，大多數人並不關注字體、符號和其他東西，但對於那些關注的人來說，哪個應用最能讓你心動？這真的可以是任何應用程序，但最好是一個更知名的社交媒體應用程序。<p>對我來說，到目前為止，我可能使用Twitter最多的，所以我可能有偏見。他們有一個很棒的黑色黑暗模式。字體確實非常酷。高對比度的標籤和圖標讓人看了很舒服。 個人資料頁面很酷，總的來說，在回覆和功能方面，這個應用程序的佈局對我來說最有意義。顯然，Twitter是使用起來比較混亂的應用程序之一，但Reddit對我來說是非常混亂的。當你看社會媒體和互聯網整體時，Twitter和Bootstrap似乎對應用程序和網站設計的影響最大，所以許多應用程序有類似Twitter的功能。<p>我最不喜歡的可能是Reddit和Snapchat。Snapchat使用起來很順暢，但它的顏色和類似氣泡的設計對我來說並不合適，而且它的資料和搜索功能非常令人困惑。Reddit是一個慢得可怕的應用程序，而且對帖子的回覆也非常令人討厭，難以篩選。我發現自己關閉了每一個第一層的回覆，所以我可以閱讀回覆，而不是回覆的回覆。這是一個混亂的局面，而且這個應用程序上沒有任何東西對我來說是有意義的，這很有趣，因為Quora、Twitter和Reddit本質上是同一件事，而且顯然他們的設計團隊中有一些相同的人。<p>關於Twitter還有很多我喜歡的東西，但最主要的是，相比其他應用程序，我更喜歡Twitter的設計。\n"
}