{
  "@type": "NewsArticle",
  "identifier": "2022--07--24--en--askhn--HackerNews--NewsArticle--32218825",
  "url": "https://news.ycombinator.com/item?id=32218825",
  "headline": "Ask HN: Ethics of Requesting a Demo from a Competitor",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm considering building a web-based system to make finding domain-specific government publications easier.  This is for a friend whose organization cannot afford the cost of a supposedly similar service.  However, it likely could be monetized and possibly also improved upon based on the limited information available about the existing provider.<p>The question is, Is it unethical to register to get a demo of the competitor's offering?  I personally feel uncomfortable with the idea, but I get a lot of advice from non-technical people that it's no big deal, and I should do it.<p>I'm certain people in the HN community have considered or experienced such a quandry.<p>To be clear, I believe I know what I need to build for my current target user, but I also think this would be a very useful service to other organizations who aren't typically well funded but are working for the public good.  Likely I would get some useful additional ideas from seeing what the competition does.  The people for whom my potentially improved product would benefit are people who are not current customers of the competition.  Of course, if I did build a better mousetrap for a lower price, it could take business from the competition.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "z9znz",
    "url": "https://news.ycombinator.com/user?id=z9znz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32218825",
  "sameAs": "https://news.ycombinator.com/item?id=32218825",
  "dateCreated": "2022-07-24T23:26:44.614Z",
  "datePublished": "2022-07-24T23:23:33.000Z",
  "dateModified": "2022-07-24T23:26:44.614Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 向竞争者要求演示的道德问题\n",
  "headline_zh-Hant": "Ask HN: 向競爭者要求演示的道德問題\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我正在考虑建立一个基于网络的系统，使寻找特定领域的政府出版物更加容易。 这是为一个朋友设计的，他的组织无法承担所谓的类似服务的费用。 然而，根据现有供应商的有限信息，它很可能被货币化，也可能被改进。<p>问题是，注册以获得竞争对手产品的演示，这是否不道德？ 我个人对这个想法感到不舒服，但我从非技术人员那里得到了很多建议，说这没什么大不了的，我应该这么做。<p>我确信HN社区的人们已经考虑过或经历过这样的困境。<p>明确地说，我相信我知道我需要为我目前的目标用户建立什么，但我也认为这对其他通常没有充足资金但为公共利益而工作的组织来说是一个非常有用的服务。 我可能会从看到竞争对手的工作中得到一些有用的额外想法。 我可能改进的产品将使那些不是竞争对手的现有客户的人受益。 当然，如果我真的以较低的价格制造了一个更好的捕鼠器，它可能会抢走竞争对手的生意。\n",
  "description_zh-Hant": "我正在考慮建立一個基於網絡的系統，使尋找特定領域的政府出版物更加容易。 這是為一個朋友設計的，他的組織無法承擔所謂的類似服務的費用。 然而，根據現有供應商的有限信息，它很可能被貨幣化，也可能被改進。<p>問題是，註冊以獲得競爭對手產品的演示，這是否不道德？ 我個人對這個想法感到不舒服，但我從非技術人員那裡得到了很多建議，說這沒什麼大不了的，我應該這麼做。<p>我確信HN社區的人們已經考慮過或經歷過這樣的困境。<p>明確地說，我相信我知道我需要為我目前的目標用戶建立什麼，但我也認為這對其他通常沒有充足資金但為公共利益而工作的組織來說是一個非常有用的服務。 我可能會從看到競爭對手的工作中得到一些有用的額外想法。 我可能改進的產品將使那些不是競爭對手的現有客戶的人受益。 當然，如果我真的以較低的價格製造了一個更好的捕鼠器，它可能會搶走競爭對手的生意。\n"
}