{
  "@type": "NewsArticle",
  "identifier": "2022--07--12--en--askhn--HackerNews--NewsArticle--32065541",
  "url": "https://news.ycombinator.com/item?id=32065541",
  "headline": "Ask HN: Does SpaceX have a chance at making life multiplanetary?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN. There’s not much reliable / unbiased analysis of SpaceX’s mission statement of making humanity multiplanetary. So, what are the chances? I’ve been following spacex for a while and, ignoring all the elon shenanigans old and new, they do incredible stuff. Docking with the space station, humans on the space station, reusable rockets launching more than weekly… it’s insane. The progress they’ve made in the last 15 years is unheard of, only rivaled by the Apollo program.<p>But a self sustaining civilization on Mars? I’m skeptical. Yes, it’s physically possible. And spacex seems to be heading in the right direction. But the sheer difficulty of the problem I think is sometimes understated.<p>Elon’s rough estimates on what it’ll take to create a self sustaining civilization vary from interview to interview. One quote:<p>“Roughly 800 to 1000 per year. That’s about what’s needed over ten years to create the fleet to build a self-sustaining city on Mars”<p>More than 3 launches per day for 10 years? That’s where the impossibility of it all starts to seep in.<p>Many seemingly unsolvable problems also arise. Where does the money come from? How will we make the Martian surface habitable? Even if getting launch costs down to 2 million as Musk stated once is possible (hard to believe, Falcon 9 is nowhere near that today), the amount of peripheral costs (maintenance, staffing, logistics, training, the list goes on) is extraordinary.<p>I’m pretty sure they’ll get to mars in the next 10 years. And they even have a good shot and doing that multiple times. But based on the sheer amount of payload that needs to get to Mars, it seems like a mission that will exceed the lifetime of SpaceX.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "quickaskq",
    "url": "https://news.ycombinator.com/user?id=quickaskq"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32065541",
  "sameAs": "https://news.ycombinator.com/item?id=32065541",
  "dateCreated": "2022-07-12T05:17:11.563Z",
  "datePublished": "2022-07-12T04:12:57.000Z",
  "dateModified": "2022-07-12T05:17:11.563Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: SpaceX公司是否有机会实现多行星生活？\n",
  "headline_zh-Hant": "Ask HN: SpaceX公司是否有機會實現多行星生活？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，HN。对于SpaceX公司使人类成为多行星的任务声明，没有多少可靠/公正的分析。那么，机会有多大？我已经关注Spacex有一段时间了，而且，忽略所有Elon的新老诡计，他们做了令人难以置信的事情。与空间站对接，人类在空间站上，可重复使用的火箭每周发射一次以上......这太疯狂了。他们在过去15年取得的进展是闻所未闻的，只有阿波罗计划可以与之媲美。<p>但在火星上实现自我维持的文明？我持怀疑态度。是的，这在物理上是可能的。而且spacex似乎正朝着正确的方向前进。但我认为这个问题的难度有时被低估了。<p>埃隆对创造一个自我维持的文明所需的粗略估计在不同的采访中有所不同。一句话：<p>\"大约每年800到1000人。这大约是在十年内建立舰队以在火星上建立一个自给自足的城市所需要的数量。\"<p>十年内每天发射超过3次？这就是这一切的不可能性开始渗入的地方。<p>许多看似无法解决的问题也出现了。钱从哪里来？我们将如何使火星表面适合居住？即使像马斯克曾经说过的那样将发射成本降低到200万是可能的（很难相信，猎鹰9号今天还远远没有达到这个水平），周边成本的数量（维护、人员、后勤、培训，不胜枚举）也是非同寻常的。<p>我很确定他们会在未来10年里到达火星。他们甚至有很好的机会做到这一点，而且是多次。但根据需要到达火星的有效载荷的数量，这似乎是一个将超过SpaceX寿命的任务。\n",
  "description_zh-Hant": "嘿，HN。對於SpaceX公司使人類成為多行星的任務聲明，沒有多少可靠/公正的分析。那麼，機會有多大？我已經關注Spacex有一段時間了，而且，忽略所有Elon的新老詭計，他們做了令人難以置信的事情。與空間站對接，人類在空間站上，可重複使用的火箭每週發射一次以上......這太瘋狂了。他們在過去15年取得的進展是聞所未聞的，只有阿波羅計劃可以與之媲美。<p>但在火星上實現自我維持的文明？我持懷疑態度。是的，這在物理上是可能的。而且spacex似乎正朝著正確的方向前進。但我認為這個問題的難度有時被低估了。<p>埃隆對創造一個自我維持的文明所需的粗略估計在不同的採訪中有所不同。一句話：<p>\"大約每年800到1000人。這大約是在十年內建立艦隊以在火星上建立一個自給自足的城市所需要的數量。\"<p>十年內每天發射超過3次？這就是這一切的不可能性開始滲入的地方。<p>許多看似無法解決的問題也出現了。錢從哪裡來？我們將如何使火星表面適合居住？即使像馬斯克曾經說過的那樣將發射成本降低到200萬是可能的（很難相信，獵鷹9號今天還遠遠沒有達到這個水平），周邊成本的數量（維護、人員、後勤、培訓，不勝枚舉）也是非同尋常的。<p>我很確定他們會在未來10年裡到達火星。他們甚至有很好的機會做到這一點，而且是多次。但根據需要到達火星的有效載荷的數量，這似乎是一個將超過SpaceX壽命的任務。\n"
}