{
  "@type": "NewsArticle",
  "identifier": "2022--04--28--en--askhn--HackerNews--NewsArticle--31191992",
  "url": "https://news.ycombinator.com/item?id=31191992",
  "headline": "Ask HN: Gender Slider iOS/Google App",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "A couple of years ago I had an idea for a gender slider. The basic idea is that instead of a dropdown different specific values, you slide along a slider between two values. So in it's most basic form, you'd slide between male and female, somewhere inbetween is where you are.<p>Initially I thought this would be a one-time entry thing. But then I thought that it be nice to track gender over time. I.e. sliding each day over a month would give you an average of how you felt that month.<p>Then I realised that if other people were going to do this, then I didn't want to know what their average meant nor their gender nor anything else. So I decided to replace the specific gender values with colours. So you slide between two colors, their meaning is up to you, and at the end of the month you get a &quot;average&quot; colour.<p>Ironically, it seems, that there is a real need for such a slider. A child of a brother-of-different-mother would love to use it but because it's not an app (i.e. iOS dungeon ..err.. market or Google cave ..err... store) she won't use it (its just a web page - in fact a large SVG). Basically it needs to be a button on the home screen (I know, browser can put bookmarks on screens but try explaining that to a non-tech teenager).<p>I really don't want to get into building apps for android nor iOS, so if anyone is interested in doing this, then please do.<p>Monetisation would definitely not come from selling data (even that isn't possible in the current implementation [1]). A couple of things I was thinking about was perhaps being able to change colour would a premium feature. Or perhaps using a circle, i.e. 2 dimensional sliding could also be premium.<p>But of course, the premium feature that would be the cash cow would be an edit button ... if you forget to slide on a particular day, then you pay to change history.<p>Anyway a semi tongue-in-cheek write up[1] and the webapp[2] are both available. Thanks for reading this far!<p>[1]=https://gregorius.rippenstein.art/works/slider\n[2]=https://gender.sldr.in",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "surfTide",
    "url": "https://news.ycombinator.com/user?id=surfTide"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31191992",
  "sameAs": "https://news.ycombinator.com/item?id=31191992",
  "dateCreated": "2022-04-28T13:38:28.476Z",
  "datePublished": "2022-04-28T13:07:40.000Z",
  "dateModified": "2022-04-28T13:38:28.476Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 性别滑块iOS/谷歌应用程序",
  "headline_zh-Hant": "Ask HN: 性別滑塊iOS/谷歌應用程序",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几年前，我有一个制作性别滑块的想法。其基本想法是，你可以在两个数值之间沿着滑块滑动，而不是用下拉式的不同具体数值。因此，在它最基本的形式中，你会在男性和女性之间滑动，在两者之间的某处就是你的位置。<p>最初我认为这将是一个一次性的条目。但后来我想，随着时间的推移，跟踪性别是很好的。<p>然后我意识到，如果其他人要做这个，那么我不想知道他们的平均数意味着什么，也不想知道他们的性别或其他什么。所以我决定用颜色来代替具体的性别值。因此，你在两种颜色之间滑动，它们的含义由你决定，在月底你会得到一个&quot;平均&quot;颜色。<p>说起来，似乎真的需要这样一个滑块。一个不同母亲的兄弟的孩子很想使用它，但由于它不是一个应用程序（即iOS地牢...呃...市场或谷歌洞穴...呃...商店），她不会使用它（它只是一个网页 - 事实上是一个大的SVG）。基本上，它需要成为主屏幕上的一个按钮（我知道，浏览器可以把书签放在屏幕上，但试着向一个非技术少年解释一下）。<p>我真的不想为安卓或iOS建立应用程序，所以如果有人有兴趣做这个，那么请做。我正在考虑的几件事是，也许能够改变颜色将是一项高级功能。<p>当然，成为摇钱树的高级功能将是一个编辑按钮......如果你忘了在某一天滑动，那么你就得花钱改变历史。<p>无论如何，一个半开玩笑的写法[1]和webapp[2]都是可用的。谢谢你读到这里！<p>[1]=https://gregorius.rippenstein.art/works/slider\n[2]=https://gender.sldr.in",
  "description_zh-Hant": "幾年前，我有一個製作性別滑塊的想法。其基本想法是，你可以在兩個數值之間沿著滑塊滑動，而不是用下拉式的不同具體數值。因此，在它最基本的形式中，你會在男性和女性之間滑動，在兩者之間的某處就是你的位置。<p>最初我認為這將是一個一次性的條目。但後來我想，隨著時間的推移，跟蹤性別是很好的。<p>然後我意識到，如果其他人要做這個，那麼我不想知道他們的平均數意味著什麼，也不想知道他們的性別或其他什麼。所以我決定用顏色來代替具體的性別值。因此，你在兩種顏色之間滑動，它們的含義由你決定，在月底你會得到一個&quot;平均&quot;顏色。<p>說起來，似乎真的需要這樣一個滑塊。一個不同母親的兄弟的孩子很想使用它，但由於它不是一個應用程序（即iOS地牢...呃...市場或谷歌洞穴...呃...商店），她不會使用它（它只是一個網頁 - 事實上是一個大的SVG）。基本上，它需要成為主屏幕上的一個按鈕（我知道，瀏覽器可以把書籤放在屏幕上，但試著向一個非技術少年解釋一下）。<p>我真的不想為安卓或iOS建立應用程序，所以如果有人有興趣做這個，那麼請做。我正在考慮的幾件事是，也許能夠改變顏色將是一項高級功能。<p>當然，成為搖錢樹的高級功能將是一個編輯按鈕......如果你忘了在某一天滑動，那麼你就得花錢改變歷史。<p>無論如何，一個半開玩笑的寫法[1]和webapp[2]都是可用的。謝謝你讀到這裡！<p>[1]=https://gregorius.rippenstein.art/works/slider\n[2]=https://gender.sldr.in"
}