{
  "@type": "NewsArticle",
  "identifier": "2022--06--26--en--askhn--HackerNews--NewsArticle--31885991",
  "url": "https://news.ycombinator.com/item?id=31885991",
  "headline": "Ask HN: Why can't the government forced standardized bottles and containers?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Climate change and environmentalism has been on my mind a lot lately and it's got me thinking ways to solutions to tackle it. One solution I thought of is why can't the US government force the standardization of bottles and containers. Imagine if the government create a standard for two types of bottles and containers; one for consumables (drinks, etc) and the other for non-consumables (shampoo, liquid soap, etc). Within these two categories, there will be different sizes, 16oz, 28oz, etc. The only type of material that can be used is glass and aluminum. If the government mandate all companies do this, then companies who manufacture bottles and containers will compete on price since everything (design, sizes, material) else is standardized. Initially the cost of the bottles/containers will be higher but overtime it should go lower as manufacturing companies compete on price and consumers start reusing existing bottles/containers. With this mandate, now I can take my used shampoo bottle and refill it at the store (assuming stores offer this). Recycling would be easier as aluminum is profitable for recycling and glass can be washed and be reused. Government can mandate stores that sell things in these bottles/containers to take them back. We can even have some form of CRV to encourage people to return/recycle them. What kind of disadvantages are there to standardization of bottles and containers? Can the government realistically create such a mandate?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samemail88",
    "url": "https://news.ycombinator.com/user?id=samemail88"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31885991",
  "sameAs": "https://news.ycombinator.com/item?id=31885991",
  "dateCreated": "2022-06-26T22:35:18.686Z",
  "datePublished": "2022-06-26T17:34:56.000Z",
  "dateModified": "2022-06-26T22:35:18.686Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 9
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么政府不能强制推行标准化的瓶子和容器？\n",
  "headline_zh-Hant": "Ask HN: 為什麼政府不能強制推行標準化的瓶子和容器？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "气候变化和环保主义最近一直在我的脑海中，它让我思考解决这个问题的方法。我想到的一个解决方案是，为什么美国政府不能强制实现瓶子和容器的标准化。想象一下，如果政府为两种类型的瓶子和容器制定标准；一种用于消耗品（饮料等），另一种用于非消耗品（洗发水、液体肥皂等）。在这两个类别中，将有不同的尺寸，16盎司、28盎司等。唯一可以使用的材料类型是玻璃和铝。如果政府授权所有公司这样做，那么生产瓶子和容器的公司将在价格上竞争，因为其他一切（设计、尺寸、材料）都是标准化的。起初，瓶子/容器的成本会更高，但随着制造公司的价格竞争和消费者开始重复使用现有的瓶子/容器，成本应该会逐渐降低。有了这项规定，现在我可以拿着我用过的洗发水瓶在商店里重新灌装（假设商店提供这种服务）。回收会更容易，因为铝的回收是有利可图的，而玻璃可以被清洗并被重新使用。政府可以强制要求用这些瓶子/容器卖东西的商店把它们收回来。我们甚至可以制定某种形式的CRV，以鼓励人们归还/回收它们。瓶子和容器的标准化会有什么样的缺点？政府能否现实地制定这样的规定？\n",
  "description_zh-Hant": "氣候變化和環保主義最近一直在我的腦海中，它讓我思考解決這個問題的方法。我想到的一個解決方案是，為什麼美國政府不能強制實現瓶子和容器的標準化。想象一下，如果政府為兩種類型的瓶子和容器制定標準；一種用於消耗品（飲料等），另一種用於非消耗品（洗髮水、液體肥皂等）。在這兩個類別中，將有不同的尺寸，16盎司、28盎司等。唯一可以使用的材料類型是玻璃和鋁。如果政府授權所有公司這樣做，那麼生產瓶子和容器的公司將在價格上競爭，因為其他一切（設計、尺寸、材料）都是標準化的。起初，瓶子/容器的成本會更高，但隨著製造公司的價格競爭和消費者開始重複使用現有的瓶子/容器，成本應該會逐漸降低。有了這項規定，現在我可以拿著我用過的洗髮水瓶在商店裡重新灌裝（假設商店提供這種服務）。回收會更容易，因為鋁的回收是有利可圖的，而玻璃可以被清洗並被重新使用。政府可以強制要求用這些瓶子/容器賣東西的商店把它們收回來。我們甚至可以制定某種形式的CRV，以鼓勵人們歸還/回收它們。瓶子和容器的標準化會有什麼樣的缺點？政府能否現實地制定這樣的規定？\n"
}