{
  "@type": "NewsArticle",
  "identifier": "2022--07--13--en--askhn--HackerNews--NewsArticle--32086607",
  "url": "https://news.ycombinator.com/item?id=32086607",
  "headline": "Ask HN: Do we need a better workflow solution exist, or is it already out there?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been on the hunt for some time for a workflow solution that:<p>1. bifurcates administrator vs user experiences. So for example, an admin defines a universe of possible actions, and a user defines a workflow consisting of one or more triggers that, when fired, executes some series of those predefined actions in the flow that the user defines<p>2. is no-code. If the admin must sometimes work with a config file (such as JSON), that's OK. But none of this python or coding business-- not that I have anything against that myself, but it's just the use case we need to address. For non-admin users, it should have a graphical UI<p>3. is versatile. For example, I'd like to be able to define an action to invoke any executable I choose, or to make any REST call I define<p>4. can dynamically chain each step's output to any of the next steps' input. For example, let's say I'm a regular user, and my admin has defined 2 actions I can use: XLSX_to_CSV, which converts X.xlsx to output/X.csv, for any X, and CSV_to_SQLITE, which converts XX.csv to output/XX.db, for any XX. Then I should be able to define a new workflow, using a UI, with a trigger that, for example, will monitor folder X that I specify, and upon receiving an XLSX file named Y.xlsx, will execute action 1 followed by action 2, to produce output/Y.csv and output/Y.db.<p>This should all sound pretty basic, because it is. I've looked at Airflow, Argo, OpenWDL and others, as well as explored whether the requirements could be met with a collection of technologies (such as something plus WuFoo together)-- but so far, they all seem to fall short.<p>The closest thing I have seen is https://docs.microsoft.com/en-us/azure/logic-apps/logic-apps-workflow-definition-language, but that does not let an admin user define actions for regular users to then mix and match (but admittedly, it is otherwise very close to what I'm looking for).<p>Any suggestions on other solutions that may fit the bill? Or alternatively, if not, how might I go about gauging whether there might be sufficient interest to opensource a project for doing so (a decent amount of which is already built, since I needed some solution and built a workable one already, though it could use a facelift)?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mattewong",
    "url": "https://news.ycombinator.com/user?id=mattewong"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32086607",
  "sameAs": "https://news.ycombinator.com/item?id=32086607",
  "dateCreated": "2022-07-13T18:31:12.314Z",
  "datePublished": "2022-07-13T18:12:49.000Z",
  "dateModified": "2022-07-13T18:31:12.314Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们是否需要一个更好的工作流程解决方案存在，或者它已经存在了？\n",
  "headline_zh-Hant": "Ask HN: 我們是否需要一個更好的工作流程解決方案存在，或者它已經存在了？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我一直在寻找一种工作流解决方案：<p>1.将管理员与用户的体验分化。因此，例如，管理员定义了一个可能的行动范围，而用户则定义了一个由一个或多个触发器组成的工作流，这些触发器一旦被触发，就会在用户定义的流程中执行一系列预定义的行动<p>2.是没有代码的。如果管理员有时必须处理一个配置文件（如JSON），那是可以的。但是，没有这种python或编码业务--并不是说我自己有什么反对，但这只是我们需要解决的用例。对于非管理员用户，它应该有一个图形化的UI<p>3.是多功能的。例如，我希望能够定义一个动作来调用我选择的任何可执行程序，或者进行我定义的任何REST调用<p>4.能够动态地将每个步骤的输出与任何下一个步骤的输入联系起来。例如，假设我是一个普通用户，而我的管理员定义了两个我可以使用的动作。XLSX_to_CSV，它将X.xlsx转换为输出/X.csv，适用于任何X；CSV_to_SQLITE，它将XX.csv转换为输出/XX.db，适用于任何XX。然后，我应该能够定义一个新的工作流程，使用一个UI，触发器，例如，将监测我指定的文件夹X，并在收到一个名为Y.xlsx的XLSX文件时，执行动作1，然后是动作2，以产生输出/Y.csv和输出/Y.db.<p>这一切听起来应该很基本，因为它是。我已经研究了Airflow、Argo、OpenWDL和其他技术，并探讨了是否可以通过一系列技术来满足这些要求（例如将WuFoo放在一起）--但到目前为止，它们似乎都没有达到要求。<p>我看到的最接近的东西是https://docs.microsoft.com/en-us/azure/logic-apps/logic-apps-workflow-definition-language，但它不能让管理员用户为普通用户定义动作，然后进行混合和匹配（但我承认，它在其他方面非常接近我正在寻找的东西）。<p>对其他可能符合要求的解决方案有什么建议？或者，如果没有的话，我应该如何去衡量是否有足够的兴趣去开源一个项目（其中相当多的项目已经建成，因为我需要一些解决方案，并且已经建立了一个可行的项目，尽管它可以使用整容）？\n",
  "description_zh-Hant": "我一直在尋找一種工作流解決方案：<p>1.將管理員與用戶的體驗分化。因此，例如，管理員定義了一個可能的行動範圍，而用戶則定義了一個由一個或多個觸發器組成的工作流，這些觸發器一旦被觸發，就會在用戶定義的流程中執行一系列預定義的行動<p>2.是沒有代碼的。如果管理員有時必須處理一個配置文件（如JSON），那是可以的。但是，沒有這種python或編碼業務--並不是說我自己有什麼反對，但這只是我們需要解決的用例。對於非管理員用戶，它應該有一個圖形化的UI<p>3.是多功能的。例如，我希望能夠定義一個動作來調用我選擇的任何可執行程序，或者進行我定義的任何REST調用<p>4.能夠動態地將每個步驟的輸出與任何下一個步驟的輸入聯繫起來。例如，假設我是一個普通用戶，而我的管理員定義了兩個我可以使用的動作。XLSX_to_CSV，它將X.xlsx轉換為輸出/X.csv，適用於任何X；CSV_to_SQLITE，它將XX.csv轉換為輸出/XX.db，適用於任何XX。然後，我應該能夠定義一個新的工作流程，使用一個UI，觸發器，例如，將監測我指定的文件夾X，並在收到一個名為Y.xlsx的XLSX文件時，執行動作1，然後是動作2，以產生輸出/Y.csv和輸出/Y.db.<p>這一切聽起來應該很基本，因為它是。我已經研究了Airflow、Argo、OpenWDL和其他技術，並探討了是否可以通過一系列技術來滿足這些要求（例如將WuFoo放在一起）--但到目前為止，它們似乎都沒有達到要求。<p>我看到的最接近的東西是https://docs.microsoft.com/en-us/azure/logic-apps/logic-apps-workflow-definition-language，但它不能讓管理員用戶為普通用戶定義動作，然後進行混合和匹配（但我承認，它在其他方面非常接近我正在尋找的東西）。<p>對其他可能符合要求的解決方案有什麼建議？或者，如果沒有的話，我應該如何去衡量是否有足夠的興趣去開源一個項目（其中相當多的項目已經建成，因為我需要一些解決方案，並且已經建立了一個可行的項目，儘管它可以使用整容）？\n"
}