{
  "@type": "NewsArticle",
  "identifier": "2022--07--27--en--askhn--HackerNews--NewsArticle--32256862",
  "url": "https://news.ycombinator.com/item?id=32256862",
  "headline": "Ask HN: Interview prep area with a greater focus on soft skills?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm unemployed and having trouble getting a full-time developer job. My job history is dominated by freelance work. My time as a freelancer and working on personal projects is more isolating. It hasn't allowed me to grow the &quot;office&quot; skills such as working on teams, collaborating, advocating for yourself and others, etc. I'm pretty sure that in many places I interview with, they reject me because I'm seen too much as a lone wolf and won't fit in for that reason.<p>Every single prep website or course I can find regarding tech jobs, is only focused on tech questions. That's obvious you might say, but I feel that's only half the picture of winning the interview. Especially since I feel I would benefit more for improving my soft skills and navigating a workplace with many people.<p>I took a course before, it was paid and mostly focused on tech skills. I learned a couple of things on solving certain tech problems, but after a year of follow-through I still haven't found a job because of them. (which I now owe lots of money anyways, even though it was supposed to be deferred payment and still have no job)<p>What I would like to find are either prep guides focused on the soft skills needed to navigate work politics. Especially since I don't know if my future job will stick with 100% remote. Or perhaps workplace-oriented team-building setting that exists outside of work, as I'm currently out of a job.<p>Or perhaps something like a co-working space that's very casual and does workshops? Know of any places that provide this kind of practice that can help unemployed developers looking to boost their soft skills? I'm having trouble finding local ones tbh, they're all still recovering from the past lockdowns.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "spearingthehead",
    "url": "https://news.ycombinator.com/user?id=spearingthehead"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32256862",
  "sameAs": "https://news.ycombinator.com/item?id=32256862",
  "dateCreated": "2022-07-27T21:23:11.567Z",
  "datePublished": "2022-07-27T20:57:52.000Z",
  "dateModified": "2022-07-27T21:23:11.567Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 面试准备领域，更注重软技能？\n",
  "headline_zh-Hant": "Ask HN: 面試準備領域，更注重軟技能？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我现在失业了，很难找到一份全职的开发工作。我的工作经历主要是自由职业者的工作。我作为自由职业者和从事个人项目的时间是比较孤立的。它没有让我增长&quot;办公室&quot;技能，如在团队中工作，合作，为自己和他人辩护，等等。我很确定，在我面试的许多地方，他们拒绝我是因为我被看作是一匹独狼，不会因此而适应。<p>我可以找到的所有关于技术工作的预备网站或课程，都只专注于技术问题。你可能会说这很明显，但我觉得这只是赢得面试的一半。<p>我以前上过一门课，是付费的，主要集中在技术技能方面。我学到了一些关于解决某些技术问题的东西，但经过一年的跟进，我仍然没有因为这些东西而找到工作。(这一点我现在无论如何都欠了很多钱，尽管它应该是延期付款，但仍然没有工作)<p>我想找到的是专注于驾驭工作政治所需软技能的预习指南。特别是因为我不知道我未来的工作是否会坚持100%远程。<p>或者是以工作场所为导向的、存在于工作之外的团队建设环境，因为我目前没有工作。<p>或者是类似于联合办公空间的、非常休闲的、做研讨会的东西？你知道有什么地方可以提供这种实践，帮助失业的开发人员提高他们的软技能吗？我很难找到本地的，总之他们都还在从过去的封锁中恢复过来。\n",
  "description_zh-Hant": "我現在失業了，很難找到一份全職的開發工作。我的工作經歷主要是自由職業者的工作。我作為自由職業者和從事個人項目的時間是比較孤立的。它沒有讓我增長&quot;辦公室&quot;技能，如在團隊中工作，合作，為自己和他人辯護，等等。我很確定，在我面試的許多地方，他們拒絕我是因為我被看作是一匹獨狼，不會因此而適應。<p>我可以找到的所有關於技術工作的預備網站或課程，都只專注於技術問題。你可能會說這很明顯，但我覺得這只是贏得面試的一半。<p>我以前上過一門課，是付費的，主要集中在技術技能方面。我學到了一些關於解決某些技術問題的東西，但經過一年的跟進，我仍然沒有因為這些東西而找到工作。(這一點我現在無論如何都欠了很多錢，儘管它應該是延期付款，但仍然沒有工作)<p>我想找到的是專注於駕馭工作政治所需軟技能的預習指南。特別是因為我不知道我未來的工作是否會堅持100%遠程。<p>或者是以工作場所為導向的、存在於工作之外的團隊建設環境，因為我目前沒有工作。<p>或者是類似於聯合辦公空間的、非常休閒的、做研討會的東西？你知道有什麼地方可以提供這種實踐，幫助失業的開發人員提高他們的軟技能嗎？我很難找到本地的，總之他們都還在從過去的封鎖中恢復過來。\n"
}