{
  "@type": "NewsArticle",
  "identifier": "2022--04--25--en--askhn--HackerNews--NewsArticle--31156914",
  "url": "https://news.ycombinator.com/item?id=31156914",
  "headline": "Ask HN: A way to utilize all my machines?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have this idea, that maybe exists as a product, or it doesn't. If it does, please point me to it. If it doesn't, please feel free to make it a product, and maybe just give me a free copy or a thanks in the credits. Here we go.<p>I have two MacBooks one windows laptop, and one windows machine.<p>I usually use one of the MacBooks as the main machine, but everyday it's reaching it's limits with memory and whatever else.<p>I would love to, say, offload all the random apps to the other MacBook, so say slack and messenger and WhatsApp and my calendar run on the other MacBook, but they show up on my main machine as if I'm remote-desktop-ing just on that window/app. Kinda like what Parallels (I think) can do with this funky feature where it shows the guest windows on the host desktop.<p>That would keep my main machine slightly more free of that &quot;baggage&quot;.<p>I could ask for more with windows, gaming and now, but let's keep it simple.<p>Does this exist?<p>Can I use some kind of ssh, remote-desktop, docker, other things I don't even know the names of, to do this? To have another machine run an app, and have it show up as if it's running on my main machine? I don't mind if the graphics rendering is happening on the main machine or on the other machine and it's just streamed in. I just want the resources to be used from that other machine.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pvinis",
    "url": "https://news.ycombinator.com/user?id=pvinis"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31156914",
  "sameAs": "https://news.ycombinator.com/item?id=31156914",
  "dateCreated": "2022-04-25T16:47:38.088Z",
  "datePublished": "2022-04-25T16:13:23.000Z",
  "dateModified": "2022-04-25T16:47:38.088Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 一种利用我所有机器的方法？",
  "headline_zh-Hant": "Ask HN: 一種利用我所有機器的方法？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我有这样一个想法，也许作为一个产品存在，或者不存在。如果有，请指给我看。如果没有，请随时把它变成一个产品，也许只是给我一个免费的拷贝，或者在字幕中写上感谢。<p>我有两台MacBooks，一台windows笔记本，一台windows机器。<p>我通常使用其中一台MacBooks作为主机，但每天它的内存和其他东西都达到了极限。<p>我很想，比如说，将所有随机的应用程序卸载到另一台MacBook上，所以说Slack、Messenger、WhatsApp和我的日历在另一台MacBook上运行，但它们在我主机上显示，好像我只是在那个窗口/应用程序上远程桌面。有点像Parallels（我想）可以做的这个有趣的功能，它可以在主机桌面上显示客人的窗口。<p>这将使我的主机稍微摆脱那些 \"包袱\"。<p>我可以对windows、游戏和现在要求更多，但让我们保持简单。<p>这存在吗？<p>我可以使用某种ssh、远程桌面、docker或其他我甚至不知道名字的东西来做这个吗？让另一台机器运行一个应用程序，并让它像在我的主机上运行一样显示出来？我不介意图形渲染是在主机上进行的，还是在另一台机器上进行的，它只是流进来。我只是想从另一台机器上使用资源。",
  "description_zh-Hant": "我有這樣一個想法，也許作為一個產品存在，或者不存在。如果有，請指給我看。如果沒有，請隨時把它變成一個產品，也許只是給我一個免費的拷貝，或者在字幕中寫上感謝。<p>我有兩臺MacBooks，一臺windows筆記本，一臺windows機器。<p>我通常使用其中一臺MacBooks作為主機，但每天它的內存和其他東西都達到了極限。<p>我很想，比如說，將所有隨機的應用程序卸載到另一臺MacBook上，所以說Slack、Messenger、WhatsApp和我的日曆在另一臺MacBook上運行，但它們在我主機上顯示，好像我只是在那個窗口/應用程序上遠程桌面。有點像Parallels（我想）可以做的這個有趣的功能，它可以在主機桌面上顯示客人的窗口。<p>這將使我的主機稍微擺脫那些 \"包袱\"。<p>我可以對windows、遊戲和現在要求更多，但讓我們保持簡單。<p>這存在嗎？<p>我可以使用某種ssh、遠程桌面、docker或其他我甚至不知道名字的東西來做這個嗎？讓另一臺機器運行一個應用程序，並讓它像在我的主機上運行一樣顯示出來？我不介意圖形渲染是在主機上進行的，還是在另一臺機器上進行的，它只是流進來。我只是想從另一臺機器上使用資源。"
}