{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--askhn--HackerNews--NewsArticle--31599452",
  "url": "https://news.ycombinator.com/item?id=31599452",
  "headline": "Ask HN: Got job offer where I would downshift technically but upshift culturally",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have two job offers which are both good in their own ways and I struggle to choose between them.<p>Offer #1: Well-paid remote job at a startup, cool tech stack where I would learn a lot, but most likely stressful.<p>Offer #2: Well-paid remote job, irrelevant/outdated tech stack, most likely relaxed environment, and ability to practice and improve German at work.<p>Context:<p>I have been in the software development industry for ten years. I've worked for startups, small and larger companies, and bloody enterprises. During the last 5 years, I had technically challenging jobs, with a modern tech stack, and I was also improving my skills and trying to stay in the age. At the same time, I have been learning German as a hobby, reached a B1-ish level, and had a lot of fun learning it and traveling to countries where German is spoken. I would say learning a new language opens a completely new perspective to see a word and, without joking, makes you a different person.<p>It has become a bit hard to work at my current company because the founder would push us to deliver more and more, faster and of coerce with fewer bugs. Recently he was wondering why we still perform not well enough and told me that he knows people who don't stick nine-to-five, deliver on weekends, etc. He didn't say it meaning forcing me to work more, but more as a sidenote. However, I understood his point well, updated my CV, and got two job offers with salaries 50-70% higher than my current level.<p>Now I came to the point of deciding what to do next and surprisingly it turned out to be hard.<p>Normally, I would decline the second job offer or I wouldn't even consider it in the first place.  But because of German, I went through the process. They are a small company producing goods. In the team, they speak German, and they wanted to find somebody with whom they wouldn't have to break the routines and have to speak English. They use SVN, Java 8, Vaadin, BPM tools, and some other stuff that is not relevant on the job market. It sounds like serious downshifting. But the more I think about it, the more I understand that it might be a cultural upshifting. There is no doubt my German would be at a new level after a year in the company and this on its own will make me a better person. At the same time, I doubt whether I would be able to do something boring for a long time understanding that whatever I have been doing in my whole career was already more modern than this.<p>What would you do if you were me?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "4ippp",
    "url": "https://news.ycombinator.com/user?id=4ippp"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31599452",
  "sameAs": "https://news.ycombinator.com/item?id=31599452",
  "dateCreated": "2022-06-02T20:26:53.755Z",
  "datePublished": "2022-06-02T19:27:59.000Z",
  "dateModified": "2022-06-02T20:26:53.755Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我得到了一个工作机会，在技术上我可以降档，但在文化上可以升档。\n",
  "headline_zh-Hant": "Ask HN: 我得到了一個工作機會，在技術上我可以降檔，但在文化上可以升檔。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我有两个工作机会，它们都有各自的优点，我很难在它们之间做出选择。<p>机会一：在初创公司的高薪远程工作，很酷的技术栈，我会学到很多东西，但很可能有压力。<p>机会二：高薪远程工作，不相关/过时的技术栈，很可能是轻松的环境，并且能够在工作中练习和提高德语。<p>背景：<p>我在软件开发行业已经有十年了。我曾为初创企业、小型和大型公司以及血腥的企业工作。在过去的5年里，我做过技术上有挑战性的工作，拥有现代化的技术栈，我也在提高自己的技能，努力保持在这个时代。同时，我一直把学习德语作为一种爱好，达到了B1左右的水平，并在学习德语和到讲德语的国家旅行时获得了很多乐趣。我想说的是，学习一门新的语言可以打开一个全新的视角来看待一个词，而且，不开玩笑地说，让你成为一个不同的人。<p>在我目前的公司工作已经变得有点困难，因为创始人会催促我们交付越来越多的东西，速度越来越快，而且要减少错误。最近他想知道为什么我们的表现仍然不够好，并告诉我他认识一些不坚持朝九晚五的人，在周末交货，等等。他说这话的意思并不是强迫我多工作，而是更多的作为一种附言。然而，我很好地理解了他的观点，更新了我的简历，并得到了两个工作机会，工资比我目前的水平高50-70%。<p>现在我来到了决定下一步该做什么的时候，令人惊讶的是，这变成了一件难事。<p>通常来说，我会拒绝第二个工作机会，或者我甚至不会首先考虑它。 但因为德国人，我经历了这个过程。他们是一家生产商品的小公司。在团队中，他们讲德语，他们想找一个人，和他在一起不必打破常规，必须讲英语。他们使用SVN、Java 8、Vaadin、BPM工具，以及其他一些在就业市场上不相关的东西。这听起来像是严重的降级。但我越想越明白，这可能是一种文化上的转变。毫无疑问，在公司工作一年后，我的德语会达到一个新的水平，这本身就会使我成为一个更好的人。同时，我怀疑我是否能够长期做一些无聊的事情，因为我在整个职业生涯中所做的任何事情都已经比这更现代。<p>如果你是我，你会怎么做？\n",
  "description_zh-Hant": "我有兩個工作機會，它們都有各自的優點，我很難在它們之間做出選擇。<p>機會一：在初創公司的高薪遠程工作，很酷的技術棧，我會學到很多東西，但很可能有壓力。<p>機會二：高薪遠程工作，不相關/過時的技術棧，很可能是輕鬆的環境，並且能夠在工作中練習和提高德語。<p>背景：<p>我在軟件開發行業已經有十年了。我曾為初創企業、小型和大型公司以及血腥的企業工作。在過去的5年裡，我做過技術上有挑戰性的工作，擁有現代化的技術棧，我也在提高自己的技能，努力保持在這個時代。同時，我一直把學習德語作為一種愛好，達到了B1左右的水平，並在學習德語和到講德語的國家旅行時獲得了很多樂趣。我想說的是，學習一門新的語言可以打開一個全新的視角來看待一個詞，而且，不開玩笑地說，讓你成為一個不同的人。<p>在我目前的公司工作已經變得有點困難，因為創始人會催促我們交付越來越多的東西，速度越來越快，而且要減少錯誤。最近他想知道為什麼我們的表現仍然不夠好，並告訴我他認識一些不堅持朝九晚五的人，在週末交貨，等等。他說這話的意思並不是強迫我多工作，而是更多的作為一種附言。然而，我很好地理解了他的觀點，更新了我的簡歷，並得到了兩個工作機會，工資比我目前的水平高50-70%。<p>現在我來到了決定下一步該做什麼的時候，令人驚訝的是，這變成了一件難事。<p>通常來說，我會拒絕第二個工作機會，或者我甚至不會首先考慮它。 但因為德國人，我經歷了這個過程。他們是一家生產商品的小公司。在團隊中，他們講德語，他們想找一個人，和他在一起不必打破常規，必須講英語。他們使用SVN、Java 8、Vaadin、BPM工具，以及其他一些在就業市場上不相關的東西。這聽起來像是嚴重的降級。但我越想越明白，這可能是一種文化上的轉變。毫無疑問，在公司工作一年後，我的德語會達到一個新的水平，這本身就會使我成為一個更好的人。同時，我懷疑我是否能夠長期做一些無聊的事情，因為我在整個職業生涯中所做的任何事情都已經比這更現代。<p>如果你是我，你會怎麼做？\n"
}