{
  "@type": "NewsArticle",
  "identifier": "2022--04--20--en--askhn--HackerNews--NewsArticle--31093734",
  "url": "https://news.ycombinator.com/item?id=31093734",
  "headline": "Ask HN: How do you deal with remote ppl working multiple full-time jobs?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey folks,<p>I'm working in a small company located in Europe, which has a business model that extends existing development teams of other companies with a minor number of local developers and a much higher number of remote developers (different contintent). Pre-Covid-era we noticed twice that remote developers tend to work full-time in two (or even more) jobs, which was affecting the work done together with us quite a lot.<p>Now with the pandemic bringing remote working to a much broader acceptance rate it seems that the issue of multiple jobs is rising. Recently I've read an article about 37% of remote people in U.S. are working two full-time jobs. From our experience the number also rose quite a lot in our remote developer employee market - generally spoken. We don't have exact numbers for our employees yet.<p>And this leads me to my question(s): How do you deal with such a situation?<p>First of all, I'd like to figure out how we can identify someone working more than we are aware of. Generally it would be fine for me (/us) what people do in their non-work time, but if it affects our work, then it's not acceptable. So how can we identify such a situation?<p>Secondly if one has figured out that someone is working additionally at other jobs, how should one handle that? From a contract perspective, we would (/could) need to fire that someone the next day, but from a business model and general work perspective we can't easily compensate if someone leaves from one day to another.<p>I'm looking forward to your experiences and ideas.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "NaTopp",
    "url": "https://news.ycombinator.com/user?id=NaTopp"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31093734",
  "sameAs": "https://news.ycombinator.com/item?id=31093734",
  "dateCreated": "2022-04-20T07:30:55.277Z",
  "datePublished": "2022-04-20T07:12:47.000Z",
  "dateModified": "2022-04-20T07:30:55.277Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 你是如何处理从事多份全职工作的远程人员的？",
  "headline_zh-Hant": "Ask HN: 你是如何處理從事多份全職工作的遠程人員的？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，伙计们，<p>我在一家位于欧洲的小公司工作，该公司的业务模式是将其他公司现有的开发团队扩展为少量的本地开发人员和数量更多的远程开发人员（不同的内容）。在Covid时代之前，我们曾两次注意到，远程开发人员倾向于在两份（甚至更多）工作中全职工作，这对与我们一起完成的工作影响很大。<p>现在，随着远程工作的流行，远程工作的接受率更广，似乎多份工作的问题正在上升。最近我读到一篇文章，说美国有37%的远程人员在做两份全职工作。根据我们的经验，这个数字在我们的远程开发员工市场上也上升了不少--一般说来。<p>这让我想到了我的问题：你是如何处理这种情况的？<p>首先，我想弄清楚我们如何能够识别一个比我们所知道的更多的工作。一般来说，对我（/我们）来说，人们在非工作时间做什么都可以，但如果影响到我们的工作，那就不能接受。那么，我们如何识别这样的情况呢？<p>其次，如果人们发现某人在其他工作中额外工作，应该如何处理？从合同的角度来看，我们将（/可能）需要在第二天解雇那个人，但从商业模式和一般工作的角度来看，如果有人从一天到另一天离开，我们不可能轻易补偿。<p>我期待着你的经验和想法。",
  "description_zh-Hant": "嘿，夥計們，<p>我在一家位於歐洲的小公司工作，該公司的業務模式是將其他公司現有的開發團隊擴展為少量的本地開發人員和數量更多的遠程開發人員（不同的內容）。在Covid時代之前，我們曾兩次注意到，遠程開發人員傾向於在兩份（甚至更多）工作中全職工作，這對與我們一起完成的工作影響很大。<p>現在，隨著遠程工作的流行，遠程工作的接受率更廣，似乎多份工作的問題正在上升。最近我讀到一篇文章，說美國有37%的遠程人員在做兩份全職工作。根據我們的經驗，這個數字在我們的遠程開發員工市場上也上升了不少--一般說來。<p>這讓我想到了我的問題：你是如何處理這種情況的？<p>首先，我想弄清楚我們如何能夠識別一個比我們所知道的更多的工作。一般來說，對我（/我們）來說，人們在非工作時間做什麼都可以，但如果影響到我們的工作，那就不能接受。那麼，我們如何識別這樣的情況呢？<p>其次，如果人們發現某人在其他工作中額外工作，應該如何處理？從合同的角度來看，我們將（/可能）需要在第二天解僱那個人，但從商業模式和一般工作的角度來看，如果有人從一天到另一天離開，我們不可能輕易補償。<p>我期待著你的經驗和想法。"
}