{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--askhn--HackerNews--NewsArticle--31590084",
  "url": "https://news.ycombinator.com/item?id=31590084",
  "headline": "Ask HN: Patenting a software system that supports open source?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm working on an open source platform for building 3D content, using what I believe to be a new/clever core system design. This platform exports to open source targets, such as Unity.<p>I hope to make a profit off of the concept, in the admittedly very unlikely event that this platform takes off. One play is selling the tech to a graphics company, to fund my development on it.<p>I've been considering patenting all or part of this system, with options like:\n- Try to patent some or part of the system, and only use it as personal financial protection when trying to sell the product, and never enforce it any other way\n- Patent some specific part of the system that no one would care about, to avoid scaring off open source users<p>Worries:\n- Discouraging open source users, who might think it skeevy or unethical to have patented software (see: Unity patenting ECS)\n- A patent preventing/discouraging this platform from being embedded/used by other open source ecosystems.<p>I have no experience with software patents. I see companies value patents for their IP, and I'm curious about the patent process, and like the idea of having a patent on my CV. Should I try to patent all or part of this design, while still targeting open source?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "stevebmark",
    "url": "https://news.ycombinator.com/user?id=stevebmark"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31590084",
  "sameAs": "https://news.ycombinator.com/item?id=31590084",
  "dateCreated": "2022-06-02T13:54:07.320Z",
  "datePublished": "2022-06-02T00:58:26.000Z",
  "dateModified": "2022-06-02T13:54:07.320Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为支持开放源代码的软件系统申请专利？\n",
  "headline_zh-Hant": "Ask HN: 為支持開放源代碼的軟件系統申請專利？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我正在开发一个用于构建3D内容的开源平台，使用我认为是一个新的/聪明的核心系统设计。这个平台可以输出到开源目标，比如Unity。<p>我希望能从这个概念中获利，当然，这个平台起飞的可能性非常小。我一直在考虑为这一系统的全部或部分申请专利，包括以下选项。\n- 尝试为该系统的某些或部分申请专利，并在试图销售产品时仅将其作为个人财务保护，而不以任何其他方式实施。\n- 为该系统的某些特定部分申请专利，没有人会在意，以避免吓跑开源用户<p>担心。\n- 阻止开源用户，他们可能认为拥有专利的软件很诡异或不道德（见：Unity为ECS申请专利）。\n- 专利阻止/劝阻该平台被其他开源生态系统嵌入/使用。<p>我对软件专利没有经验。我看到公司很重视知识产权的专利，我对专利程序很好奇，也喜欢在我的简历上有一个专利的想法。我是否应该尝试为这个设计的全部或部分申请专利，同时仍以开源为目标？\n",
  "description_zh-Hant": "我正在開發一個用於構建3D內容的開源平臺，使用我認為是一個新的/聰明的核心繫統設計。這個平臺可以輸出到開源目標，比如Unity。<p>我希望能從這個概念中獲利，當然，這個平臺起飛的可能性非常小。我一直在考慮為這一系統的全部或部分申請專利，包括以下選項。\n- 嘗試為該系統的某些或部分申請專利，並在試圖銷售產品時僅將其作為個人財務保護，而不以任何其他方式實施。\n- 為該系統的某些特定部分申請專利，沒有人會在意，以避免嚇跑開源用戶<p>擔心。\n- 阻止開源用戶，他們可能認為擁有專利的軟件很詭異或不道德（見：Unity為ECS申請專利）。\n- 專利阻止/勸阻該平臺被其他開源生態系統嵌入/使用。<p>我對軟件專利沒有經驗。我看到公司很重視知識產權的專利，我對專利程序很好奇，也喜歡在我的簡歷上有一個專利的想法。我是否應該嘗試為這個設計的全部或部分申請專利，同時仍以開源為目標？\n"
}