{
  "@type": "NewsArticle",
  "identifier": "2022--07--23--en--askhn--HackerNews--NewsArticle--32206555",
  "url": "https://news.ycombinator.com/item?id=32206555",
  "headline": "Ask HN: Is top talent in software overrated?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "What do you think about this imaginary argument between an unnamed corporation and an unnamed engineer?<p>&quot;Software engineers ask for too much, and we will lower our salaries to line them up with the rest of the non-technical staff.&quot;<p>&quot;That's a stupid decision.&quot;<p>&quot;Why?&quot;<p>&quot;Software engineers are less replaceable than non-technical staff and are the most important people in your company.&quot;<p>&quot;We do not share the belief that engineers are any less replaceable or more important than non-technical staff.&quot;<p>&quot;Then you will not attract top talent.&quot;<p>&quot;Top talent does not always chase the biggest paycheck. And we can do just fine without top talent.&quot;<p>&quot;Top talent will go to your competitors instead.&quot;<p>&quot;Top talent is overrated and will not give our competitors any meaningful edge. A team of ten average engineers can produce as much value as two self-claimed 'top engineers' for the same price.&quot;<p>&quot;What makes you think that top talent is overrated?&quot;<p>&quot;Some engineers are better than others. We recognize that. But the top 20% of engineers is not that much better than the middle 60%. They do not produce significantly more code, or significantly better quality or scalable code. An average engineer can do almost anything a top engineer can, but for a much lower price. They cost-to-value ratio favors average engineers.&quot;",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Victerius",
    "url": "https://news.ycombinator.com/user?id=Victerius"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32206555",
  "sameAs": "https://news.ycombinator.com/item?id=32206555",
  "dateCreated": "2022-07-23T19:21:42.105Z",
  "datePublished": "2022-07-23T19:09:37.000Z",
  "dateModified": "2022-07-23T19:21:42.105Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 软件领域的顶尖人才被高估了吗？\n",
  "headline_zh-Hant": "Ask HN: 軟件領域的頂尖人才被高估了嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你怎么看一个不知名的公司和一个不知名的工程师之间的这种想象中的争论？<p>&quot;软件工程师要求的太多了，我们将降低工资，让他们与其他非技术人员一致。<p>&quot;这是一个愚蠢的决定。<p>&quot;为什么？ &quot;<p>&quot;软件工程师比非技术人员更不容易被取代，而且是你们公司最重要的人。&quot;<p>&quot;我们不认为工程师比非技术人员更不容易被取代或更重要。&quot;<p>&quot;那么你们就不会吸引顶级人才。&quot;<p>&quot;顶级人才并不总是追寻最大的薪水。而且没有顶尖人才我们也能做得很好。&quot;<p>&quot;顶尖人才反而会去找你的竞争对手。&quot;<p>&quot;顶尖人才被高估了，不会给我们的竞争对手带来任何有意义的优势。一个由10名普通工程师组成的团队，以同样的价格可以产生与两名自称 \"顶级工程师 \"一样多的价值。&quot;<p>&quot;是什么让你认为顶级人才被高估了？我们承认这一点。但前20%的工程师并不比中间60%的工程师好多少。他们不会产生明显更多的代码，或明显更好的质量或可扩展的代码。一个普通的工程师几乎可以做顶级工程师能做的任何事情，但价格要低得多。他们的成本价值比更有利于普通工程师。\n",
  "description_zh-Hant": "你怎麼看一個不知名的公司和一個不知名的工程師之間的這種想象中的爭論？<p>&quot;軟件工程師要求的太多了，我們將降低工資，讓他們與其他非技術人員一致。<p>&quot;這是一個愚蠢的決定。<p>&quot;為什麼？ &quot;<p>&quot;軟件工程師比非技術人員更不容易被取代，而且是你們公司最重要的人。&quot;<p>&quot;我們不認為工程師比非技術人員更不容易被取代或更重要。&quot;<p>&quot;那麼你們就不會吸引頂級人才。&quot;<p>&quot;頂級人才並不總是追尋最大的薪水。而且沒有頂尖人才我們也能做得很好。&quot;<p>&quot;頂尖人才反而會去找你的競爭對手。&quot;<p>&quot;頂尖人才被高估了，不會給我們的競爭對手帶來任何有意義的優勢。一個由10名普通工程師組成的團隊，以同樣的價格可以產生與兩名自稱 \"頂級工程師 \"一樣多的價值。&quot;<p>&quot;是什麼讓你認為頂級人才被高估了？我們承認這一點。但前20%的工程師並不比中間60%的工程師好多少。他們不會產生明顯更多的代碼，或明顯更好的質量或可擴展的代碼。一個普通的工程師幾乎可以做頂級工程師能做的任何事情，但價格要低得多。他們的成本價值比更有利於普通工程師。\n"
}