{
  "@type": "NewsArticle",
  "identifier": "2022--07--17--en--askhn--HackerNews--NewsArticle--32128439",
  "url": "https://news.ycombinator.com/item?id=32128439",
  "headline": "Ask HN: Is it feasible to have real-time price comparison?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Recently I've been thinking of building a project that would aggregate and sort prices of products from a specific industry, these products are into the hundreds of thousands at least. As a feature I wish to offer the user the ability to see if ordering multile products from one site will be cheaper in shipping than ordering these items separately, or suggest a route where this will end up being the cheapest.<p>However at it's core, every time a user submits a query for a product, I must route this request(read scrape) to a set of websites that contain these products and sort the data however the user wants it. If the data is scraped from 10 websites, then 1 user = 10 requests from my end, 2 users = 20. Just mentally thinking about it, I wonder at what point my traffic will be interpreted as an attack and then blocked, not to mention at least one of these sites is CloudFlare protected. Because of the nature of the products, a single user may need to find several products, so again several queries I must route.<p>The data cannot be prescraped because I have to issue hundreds of thousands of search queries to PER site, and then the price may change because of reasons such as a discount was in effect, a price hike or price reduction, usually it will be discounts, the overall price may not change as frequently as say GPU prices these days.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "techwiz137",
    "url": "https://news.ycombinator.com/user?id=techwiz137"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32128439",
  "sameAs": "https://news.ycombinator.com/item?id=32128439",
  "dateCreated": "2022-07-17T17:03:06.901Z",
  "datePublished": "2022-07-17T16:46:39.000Z",
  "dateModified": "2022-07-17T17:03:06.901Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 进行实时价格比较是可行的吗？\n",
  "headline_zh-Hant": "Ask HN: 進行實時價格比較是可行的嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "最近，我一直在考虑建立一个项目，对特定行业的产品价格进行汇总和分类，这些产品至少有数十万种。作为一项功能，我希望为用户提供这样的能力：从一个网站订购多个产品是否比分别订购这些产品的运费更便宜，或者建议一条最终最便宜的路线。<p>然而，在它的核心，每次用户提交一个产品的查询，我必须将这个请求（读作刮擦）发送到一组包含这些产品的网站，并按照用户的要求对数据进行排序。如果数据是从10个网站刮来的，那么1个用户=10个来自我这端的请求，2个用户=20个。只是在心理上想想，我不知道在什么时候我的流量会被解释为攻击，然后被阻止，更不用说这些网站中至少有一个是CloudFlare保护的。由于产品的性质，一个用户可能需要找到几个产品，所以我必须再次进行几次查询。<p>数据不能被预先抓取，因为我必须向PER网站发出数十万次的搜索查询，然后价格可能会因为一些原因而改变，例如折扣生效、涨价或降价，通常是折扣，整体价格可能不会像现在的GPU价格那样频繁变化。\n",
  "description_zh-Hant": "最近，我一直在考慮建立一個項目，對特定行業的產品價格進行彙總和分類，這些產品至少有數十萬種。作為一項功能，我希望為用戶提供這樣的能力：從一個網站訂購多個產品是否比分別訂購這些產品的運費更便宜，或者建議一條最終最便宜的路線。<p>然而，在它的核心，每次用戶提交一個產品的查詢，我必須將這個請求（讀作刮擦）發送到一組包含這些產品的網站，並按照用戶的要求對數據進行排序。如果數據是從10個網站刮來的，那麼1個用戶=10個來自我這端的請求，2個用戶=20個。只是在心理上想想，我不知道在什麼時候我的流量會被解釋為攻擊，然後被阻止，更不用說這些網站中至少有一個是CloudFlare保護的。由於產品的性質，一個用戶可能需要找到幾個產品，所以我必須再次進行幾次查詢。<p>數據不能被預先抓取，因為我必須向PER網站發出數十萬次的搜索查詢，然後價格可能會因為一些原因而改變，例如折扣生效、漲價或降價，通常是折扣，整體價格可能不會像現在的GPU價格那樣頻繁變化。\n"
}