{
  "@type": "NewsArticle",
  "identifier": "2022--06--03--en--askhn--HackerNews--NewsArticle--31610706",
  "url": "https://news.ycombinator.com/item?id=31610706",
  "headline": "Ask HN: I Need more work, what to do?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Dilemma I never expected to find myself in. As a dev, I've always prided myself on doing a good job on (or at least making a good dent in) whatever is put in front of me. In my current role, I initially got plenty of opportunities to do just that, which ended up with me being promoted and other boons to my career trajectory. Then, somehow or another, projects on my team just dried up. Only been here about two years and not sure if these sort of dry spells really happen naturally, but nothing substantial has come to (or been solicited by our team lead) in about 2-3 months. There has been the odd snack-sized project, and some trivial tickets to pick out of the backlog, but we seem to be twiddling our thumbs a lot. Other teams (appear at least) much busier, and what's more we added a new team member in the midst of this!<p>I actually like my job and work (when it's available), I'd like to try and get out of this &quot;jam&quot; without doing something drastic. My initial ideas are:<p>1. Talk to my team lead about getting more work.\n2. Talk to my manager (who oddly leads other teams) about the situation/options<p>3. Scrounge and dig for any meaningful work I can, concocting some if I must (been doing this...sucks)<p>Admittedly, I'm not great with people and I've never been in a spell like this that didn't resolve itself naturally (didn't have to force some issue). I'd like to accomplish 1/2 without making things weird if at all possible. Is there anything else I should know about these things to avoid stepping on a land mine? Are there options I haven't considered?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "preordained",
    "url": "https://news.ycombinator.com/user?id=preordained"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31610706",
  "sameAs": "https://news.ycombinator.com/item?id=31610706",
  "dateCreated": "2022-06-03T17:05:20.961Z",
  "datePublished": "2022-06-03T16:48:03.000Z",
  "dateModified": "2022-06-03T17:05:20.961Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 我需要更多的工作，该怎么做？\n",
  "headline_zh-Hant": "Ask HN: 我需要更多的工作，該怎麼做？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我从未想过自己会陷入这样的困境。作为一名开发人员，我一直为自己能做好（或至少在）任何摆在我面前的工作而自豪。在我目前的岗位上，我最初有很多机会做到这一点，最终我得到了晋升和其他有利于我职业发展的好处。然后，不知何故，我的团队中的项目就这样枯竭了。我在这里只有两年时间，不知道这种枯竭期是否真的会自然发生，但在大约2-3个月的时间里，没有任何实质性的项目出现（或被我们的团队领导征集）。有一些零星的小项目，还有一些琐碎的票据可以从积压的工作中挑选出来，但我们似乎经常在玩弄我们的拇指。其他团队（至少看起来）要忙得多，而且我们还在这期间增加了一个新的团队成员！<p>我实际上喜欢我的工作和工作（当它可用时），我想尝试摆脱这种 \"困境\"，而不做一些激烈的事情。我的初步想法是：<p>1. 与我的团队领导讨论如何获得更多的工作。\n2. 2.与我的经理（他奇怪地领导着其他团队）谈谈情况/选择<p>3.寻找和挖掘任何有意义的工作，如果我必须这样做的话，就编造一些（一直这样做......很糟糕）<p>诚然，我不善于与人打交道，我从来没有遇到过像这样的咒语，没有自然解决（没有强迫一些问题）。如果可能的话，我想在不使事情变得奇怪的情况下完成1/2。对于这些事情，我还有什么需要了解的，以避免踩到地雷吗？是否有我没有考虑过的选择？\n",
  "description_zh-Hant": "我從未想過自己會陷入這樣的困境。作為一名開發人員，我一直為自己能做好（或至少在）任何擺在我面前的工作而自豪。在我目前的崗位上，我最初有很多機會做到這一點，最終我得到了晉升和其他有利於我職業發展的好處。然後，不知何故，我的團隊中的項目就這樣枯竭了。我在這裡只有兩年時間，不知道這種枯竭期是否真的會自然發生，但在大約2-3個月的時間裡，沒有任何實質性的項目出現（或被我們的團隊領導徵集）。有一些零星的小項目，還有一些瑣碎的票據可以從積壓的工作中挑選出來，但我們似乎經常在玩弄我們的拇指。其他團隊（至少看起來）要忙得多，而且我們還在這期間增加了一個新的團隊成員！<p>我實際上喜歡我的工作和工作（當它可用時），我想嘗試擺脫這種 \"困境\"，而不做一些激烈的事情。我的初步想法是：<p>1. 與我的團隊領導討論如何獲得更多的工作。\n2. 2.與我的經理（他奇怪地領導著其他團隊）談談情況/選擇<p>3.尋找和挖掘任何有意義的工作，如果我必須這樣做的話，就編造一些（一直這樣做......很糟糕）<p>誠然，我不善於與人打交道，我從來沒有遇到過像這樣的咒語，沒有自然解決（沒有強迫一些問題）。如果可能的話，我想在不使事情變得奇怪的情況下完成1/2。對於這些事情，我還有什麼需要了解的，以避免踩到地雷嗎？是否有我沒有考慮過的選擇？\n"
}