{
  "@type": "NewsArticle",
  "identifier": "2022--07--04--en--askhn--HackerNews--NewsArticle--31978206",
  "url": "https://news.ycombinator.com/item?id=31978206",
  "headline": "Ask HN: How many of you delibrately wear a watch that isn't a smart watch?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "When the Apple Watch first came out, I swore I'd buy one as soon as the technology matured after a few iterations-I had always loved the idea of wearables, and the Apple Watch really seemed to hit a sweet spot.<p>Fast forward several years, and I'm very disgruntled with the idea of smart/wearable/IOT/etc devices-the fact that they're expensive and require replacing regularly like a phone, require regular charging, the fact that I'd sometimes like to be alone without any outside connectivity, etc just really turns me off. Also having had a few instances of natural disasters to deal with over the past few years makes me yearn for something just a lot less dependent on regular charging than a smart watch.<p>So, Ive gone back to (for the time being) ordering a good old Timex Ironman as a cheap standby that will last quite a while and do what it needs to do. I'll look into upgrading to something a bit fancier and possibly mechanical if the Timex experiment works out. I'm just wondering if I'm alone in this, or maybe I'm tapping into a (very slight) anti smart device sentiment that's only prevalent in really tech centric communities.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ZanyProgrammer",
    "url": "https://news.ycombinator.com/user?id=ZanyProgrammer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31978206",
  "sameAs": "https://news.ycombinator.com/item?id=31978206",
  "dateCreated": "2022-07-04T15:48:41.281Z",
  "datePublished": "2022-07-04T15:37:40.000Z",
  "dateModified": "2022-07-04T15:48:41.281Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "Ask HN: 你们有多少人刻意佩戴不是智能手表的手表？\n",
  "headline_zh-Hant": "Ask HN: 你們有多少人刻意佩戴不是智能手錶的手錶？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "当Apple Watch首次面世时，我曾发誓，一旦技术在几次迭代后成熟，我就会买一个，我一直喜欢可穿戴设备的想法，而Apple Watch似乎真的击中了一个甜蜜的点。<p>快几年了，我对智能/可穿戴/IOT/等设备的想法非常不满--事实上，它们很昂贵，需要像手机一样定期更换，需要定期充电，有时我想在没有任何外部连接的情况下独自一人，等等，这些都让我很不满意。此外，在过去的几年里，我还遇到过几次自然灾害，这让我渴望得到一些比智能手表更不依赖定期充电的东西。<p>因此，我又回到了（暂时）订购一个好的老式Timex Ironman，作为一个便宜的备用产品，它将持续相当长的时间，并做它需要做的事情。如果Timex的试验成功，我将考虑升级到更高级的东西，可能是机械的。我只是想知道是否只有我一个人这样做，或者也许我正在挖掘一种（非常轻微的）反智能设备的情绪，这种情绪只在真正以技术为中心的社区中普遍存在。\n",
  "description_zh-Hant": "當Apple Watch首次面世時，我曾發誓，一旦技術在幾次迭代後成熟，我就會買一個，我一直喜歡可穿戴設備的想法，而Apple Watch似乎真的擊中了一個甜蜜的點。<p>快幾年了，我對智能/可穿戴/IOT/等設備的想法非常不滿--事實上，它們很昂貴，需要像手機一樣定期更換，需要定期充電，有時我想在沒有任何外部連接的情況下獨自一人，等等，這些都讓我很不滿意。此外，在過去的幾年裡，我還遇到過幾次自然災害，這讓我渴望得到一些比智能手錶更不依賴定期充電的東西。<p>因此，我又回到了（暫時）訂購一個好的老式Timex Ironman，作為一個便宜的備用產品，它將持續相當長的時間，並做它需要做的事情。如果Timex的試驗成功，我將考慮升級到更高級的東西，可能是機械的。我只是想知道是否只有我一個人這樣做，或者也許我正在挖掘一種（非常輕微的）反智能設備的情緒，這種情緒只在真正以技術為中心的社區中普遍存在。\n"
}