{
  "@type": "NewsArticle",
  "identifier": "2022--06--09--en--askhn--HackerNews--NewsArticle--31681881",
  "url": "https://news.ycombinator.com/item?id=31681881",
  "headline": "Ask HN: Please share opinions on coding post “singularity” event",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Dear Reader,<p>recently I've been thinking about how automation influences our daily lives. In contrast to people working mundane or dangerous jobs being replaced by the machines is the ever growing demand for software developers in the world. This gives the impression software development is the high paying future proof career. Is it though? What are we really as software developers and why should we think we will not be the first ones to be deprecated by automation/ai in coming years...<p>assumptions:<p>1. a lot of software development jobs consist of translating business requirements to code, as opposed to smaller subset of jobs where computer science or other research is done<p>2. new code abstraction layers are consistently piled on top of how we communicate with the machines asm-&gt;c-&gt;python-&gt;js-&gt;frameworks-&gt;no-code<p>3. translation is a task that can be performed by AI achievable today, google translate, GPT-3..4..x...<p>I was wondering what is your opinion on life of software developers after some sort of &quot;singularity&quot; event, where requirements defined by humans can be translated to machine executable code for most business use cases.<p>Is this level of AI achievable in our life time, if so how close are we to this kind of event?<p>Maybe you have already seen smart/ai code translation employed at your work, could you share your opinion on how well this works?<p>Should I bail while I can and learn how to cut hair or make sausages?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "iExploder",
    "url": "https://news.ycombinator.com/user?id=iExploder"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31681881",
  "sameAs": "https://news.ycombinator.com/item?id=31681881",
  "dateCreated": "2022-06-09T14:56:08.254Z",
  "datePublished": "2022-06-09T14:48:56.000Z",
  "dateModified": "2022-06-09T14:56:08.254Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 请分享对编码后 \"奇点 \"事件的看法\n",
  "headline_zh-Hant": "Ask HN: 請分享對編碼後 \"奇點 \"事件的看法\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "亲爱的读者，<p>最近我一直在思考自动化如何影响我们的日常生活。与人们从事平凡或危险的工作被机器取代形成对比的是，世界上对软件开发人员的需求不断增长。这给人的印象是，软件开发是一个高薪的未来职业。但这是真的吗？作为软件开发人员，我们到底是什么，为什么我们应该认为我们不会在未来几年里成为第一个被自动化/AI淘汰的人呢？<p>假设：<p>1.许多软件开发工作包括将业务需求转化为代码，而不是在计算机科学或其他研究领域进行的较小的工作子集<p>2.新的代码抽象层一直在不断增加。新的代码抽象层不断地堆积在我们与机器交流的方式之上，asm-&gt;c-&gt;python-&gt;js-&gt;frameworks-&gt;no-code<p>3.翻译是一项可以由人工智能完成的任务，今天可以实现，谷歌翻译，GPT-3. <p>我想知道你对软件开发人员在某种&quot;奇点&quot;事件之后的生活有什么看法，在这种情况下，人类定义的需求可以被翻译成机器可执行代码，用于大多数商业用例。 <p>这种水平的人工智能在我们的有生之年是否可以实现，如果可以的话，我们离这种事件还有多远？<p>也许你已经在你的工作中看到了智能/人工智能代码翻译的应用，你能分享一下你对这种工作的看法吗？<p>我是否应该趁早离开，学习如何剪头发或做香肠？\n",
  "description_zh-Hant": "親愛的讀者，<p>最近我一直在思考自動化如何影響我們的日常生活。與人們從事平凡或危險的工作被機器取代形成對比的是，世界上對軟件開發人員的需求不斷增長。這給人的印象是，軟件開發是一個高薪的未來職業。但這是真的嗎？作為軟件開發人員，我們到底是什麼，為什麼我們應該認為我們不會在未來幾年裡成為第一個被自動化/AI淘汰的人呢？<p>假設：<p>1.許多軟件開發工作包括將業務需求轉化為代碼，而不是在計算機科學或其他研究領域進行的較小的工作子集<p>2.新的代碼抽象層一直在不斷增加。新的代碼抽象層不斷地堆積在我們與機器交流的方式之上，asm-&gt;c-&gt;python-&gt;js-&gt;frameworks-&gt;no-code<p>3.翻譯是一項可以由人工智能完成的任務，今天可以實現，谷歌翻譯，GPT-3. <p>我想知道你對軟件開發人員在某種&quot;奇點&quot;事件之後的生活有什麼看法，在這種情況下，人類定義的需求可以被翻譯成機器可執行代碼，用於大多數商業用例。 <p>這種水平的人工智能在我們的有生之年是否可以實現，如果可以的話，我們離這種事件還有多遠？<p>也許你已經在你的工作中看到了智能/人工智能代碼翻譯的應用，你能分享一下你對這種工作的看法嗎？<p>我是否應該趁早離開，學習如何剪頭髮或做香腸？\n"
}