{
  "@type": "NewsArticle",
  "identifier": "2022--04--23--en--askhn--HackerNews--NewsArticle--31139172",
  "url": "https://news.ycombinator.com/item?id=31139172",
  "headline": "Ask HN: Advice running a big scale chess tournament",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "For a couple of months I've been planning to run and organize a relatively big chess tournament with a group of people that I know. It is an online chess tournament targeted at chess players of around 2100-2400 elo rating.<p>The tournament is not aimed at the highest/elite sector of chess but I take pride in the craftsmanship and the artistry that goes into the planning and organizing of a tournament. So I put a lot of work on making sure every corner of the tournament is expertly crafted and also unique. For example I put a lot of effort in having a custom/in-house user interface, tournament managing software, soundtrack, big monetary prizes, and more.<p>The part that I struggle the most with is earning revenue for myself and my crew. At the moment, I run a small, but competent team of 4 people (including me) and each person is focused at their area of their expertise. They are:\n- Chess expert: They orchestrate the tournament structure and handle chess related technical intricacies such as writing a comprehensive rule book.<p>- Communications: They are responsible for finding sponsors, business deals, business partners and so on.\n- Graphical Designer: They focus on the graphical design of the tournament UI, and graphical material.\n- Leader: That's me, besides organizing everyone and managing the tournament as a whole, I also do a huge chunk of the graphical design, talking with potential sponsors, technical chess stuff and so on.<p>We have almost reached the end of the 'pre-production' stage, so it means we have all the ideas nailed down, we have UI mockups ready, we have potential investors in mind. We are simply waiting for some legal processes before we officially can look for sponsors.<p>I enjoy doing this and I know that my crew also enjoy it to some extent. Despite months of work, I haven't paid anyone anything yet so there is some passion involved. What I really want to do is to be able to pay my crew and myself for all this invaluable effort that we have put in.<p>In the beginning I was naive and hoped that we could 'pay ourselves' by having our 'salaries' as part of the running cost of the tournament so that the sponsors would pay for it. This seems to be a no go, so I focused on the ways that we can earn revenue. Such as: an entry fee, affiliate links, selling merchandise, and direct ads.<p>But I am worried that these will not generate a satisfiable amount of revenue. Our aim is that, the sponsors will cover all the running costs of the tournament, so whatever revenue we generate would count as 'profit' that we could divide between ourselves.<p>This is my first 'business' rodeo. While I have a lot of confidence that the tournament will be a success from an engineering, artistic, and craftsmanship point of view, I am very worried about the commercial success of the tournament.<p>I want to ask you, if you could give me advice on how can I make this tournament a commercial success. I look at the organization of this tournament as a way for me to enter the 'business field'. So I want it to commercially succeed as well. But I am aware of my limited knowledge and experience in this matter.<p>edit: formatting",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tahoslav",
    "url": "https://news.ycombinator.com/user?id=tahoslav"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31139172",
  "sameAs": "https://news.ycombinator.com/item?id=31139172",
  "dateCreated": "2022-04-23T22:31:12.265Z",
  "datePublished": "2022-04-23T22:15:50.000Z",
  "dateModified": "2022-04-23T22:31:12.265Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 举办大型国际象棋比赛的建议",
  "headline_zh-Hant": "Ask HN: 舉辦大型國際象棋比賽的建議",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "几个月来，我一直在计划与我认识的一群人一起举办和组织一个比较大的国际象棋比赛。这是一个在线国际象棋比赛，目标是2100-2400ELO等级的棋手。<p>这个比赛不是针对国际象棋的最高/精英阶层，但我对策划和组织比赛的工艺和艺术性感到自豪。因此，我投入了大量的工作，确保比赛的每个角落都是专业的，也是独特的。例如，我在定制/内部用户界面、锦标赛管理软件、配乐、大额奖金等方面投入了大量的精力。<p>我最纠结的部分是为自己和我的团队赚取收入。目前，我经营着一个由4人组成的小型但有能力的团队（包括我），每个人都专注于他们的专业领域。他们是\n- 国际象棋专家：他们策划比赛结构，处理国际象棋相关的复杂技术问题，如编写全面的规则书。<p>- 通讯。他们负责寻找赞助商、商业交易、商业伙伴等。\n- 图形设计师。他们专注于赛事用户界面的图形设计，以及图形材料。\n- 领导。这就是我，除了组织大家和管理整个赛事，我还做了一大块图形设计，与潜在的赞助商交谈，技术性的国际象棋等等。<p>我们几乎已经达到了'预生产'阶段的尾声，所以这意味着我们有所有的想法，我们已经准备好UI模拟图，我们有潜在的投资者的想法。我们只是在等待一些法律程序，然后就可以正式寻找赞助商了。<p>我喜欢做这个，我知道我的工作人员在某种程度上也喜欢这个。尽管工作了几个月，我还没有向任何人支付任何东西，所以有一些激情。我真正想做的是能够支付我的工作人员和我自己所付出的这些宝贵的努力。<p>一开始我很天真，希望我们能够 \"支付自己\"，将我们的 \"工资 \"作为赛事运行成本的一部分，这样赞助商就会支付它。这似乎是不可能的，所以我专注于我们可以获得收入的方式。例如：参赛费、联盟链接、销售商品和直接广告。<p>但我担心这些不会产生令人满意的收入。我们的目标是，赞助商将支付比赛的所有运行成本，因此我们产生的任何收入都将算作'利润'，我们可以在自己之间进行分配。<p>这是我第一次'商业'圈地。虽然从工程、艺术和工艺的角度来看，我对比赛的成功很有信心，但我非常担心比赛的商业成功。<p>我想问你，你能不能给我一些建议，我怎样才能使这次比赛取得商业成功。我把组织这项比赛看成是我进入 \"商业领域 \"的一种方式。所以我希望它在商业上也能成功。但我知道我在这方面的知识和经验有限。<p>编辑：格式化",
  "description_zh-Hant": "幾個月來，我一直在計劃與我認識的一群人一起舉辦和組織一個比較大的國際象棋比賽。這是一個在線國際象棋比賽，目標是2100-2400ELO等級的棋手。<p>這個比賽不是針對國際象棋的最高/精英階層，但我對策劃和組織比賽的工藝和藝術性感到自豪。因此，我投入了大量的工作，確保比賽的每個角落都是專業的，也是獨特的。例如，我在定製/內部用戶界面、錦標賽管理軟件、配樂、大額獎金等方面投入了大量的精力。<p>我最糾結的部分是為自己和我的團隊賺取收入。目前，我經營著一個由4人組成的小型但有能力的團隊（包括我），每個人都專注於他們的專業領域。他們是\n- 國際象棋專家：他們策劃比賽結構，處理國際象棋相關的複雜技術問題，如編寫全面的規則書。<p>- 通訊。他們負責尋找贊助商、商業交易、商業夥伴等。\n- 圖形設計師。他們專注於賽事用戶界面的圖形設計，以及圖形材料。\n- 領導。這就是我，除了組織大家和管理整個賽事，我還做了一大塊圖形設計，與潛在的贊助商交談，技術性的國際象棋等等。<p>我們幾乎已經達到了'預生產'階段的尾聲，所以這意味著我們有所有的想法，我們已經準備好UI模擬圖，我們有潛在的投資者的想法。我們只是在等待一些法律程序，然後就可以正式尋找贊助商了。<p>我喜歡做這個，我知道我的工作人員在某種程度上也喜歡這個。儘管工作了幾個月，我還沒有向任何人支付任何東西，所以有一些激情。我真正想做的是能夠支付我的工作人員和我自己所付出的這些寶貴的努力。<p>一開始我很天真，希望我們能夠 \"支付自己\"，將我們的 \"工資 \"作為賽事運行成本的一部分，這樣贊助商就會支付它。這似乎是不可能的，所以我專注於我們可以獲得收入的方式。例如：參賽費、聯盟鏈接、銷售商品和直接廣告。<p>但我擔心這些不會產生令人滿意的收入。我們的目標是，贊助商將支付比賽的所有運行成本，因此我們產生的任何收入都將算作'利潤'，我們可以在自己之間進行分配。<p>這是我第一次'商業'圈地。雖然從工程、藝術和工藝的角度來看，我對比賽的成功很有信心，但我非常擔心比賽的商業成功。<p>我想問你，你能不能給我一些建議，我怎樣才能使這次比賽取得商業成功。我把組織這項比賽看成是我進入 \"商業領域 \"的一種方式。所以我希望它在商業上也能成功。但我知道我在這方面的知識和經驗有限。<p>編輯：格式化"
}