{
  "@type": "NewsArticle",
  "identifier": "2022--07--23--en--askhn--HackerNews--NewsArticle--32198952",
  "url": "https://news.ycombinator.com/item?id=32198952",
  "headline": "Ask HN: What FOSS self-hosted chat programs do you recommend? Text/voice/video",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been using Nextcloud, which is not that great.  The text chat interface is confusing, installation was painful last time I did it, and the voice and video parts were hard to get working on my laptop.  IIRC the Android phone app didn't work for chat.  I don't know whether there is an iPhone app, so in either case, I haven't tried it.<p>I'd be using this mostly to talk to family, including my mom who is quite elderly and is thrown off a lot by interface elements changing, fonts changing, etc.  IRC is really better than any web chat app I know of, except it doesn't keep scrollback when the client is disconnected.  It is important to be able to use text and video at the same time, since her hearing is poor so it's better to type text that she can read.<p>My mom uses a Debian laptop that I set up for her, so if there's a Linux desktop app that's better than the web interface, that's great.  She doesn't use mobile phones at all.  I could imagine mobile apps also being worthwhile though, for users other than my mom.  My sister uses an iPhone so the availability of an iPhone app would be nice.<p>I've tried the hosted version of Jitsi Meet (meet.jit.si) and it was nice.  I haven't tried self-hosting it yet.  I'm happy to hear about experiences, and also about anything else interesting that is out there.<p>Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway81523",
    "url": "https://news.ycombinator.com/user?id=throwaway81523"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32198952",
  "sameAs": "https://news.ycombinator.com/item?id=32198952",
  "dateCreated": "2022-07-23T02:28:30.800Z",
  "datePublished": "2022-07-23T00:41:15.000Z",
  "dateModified": "2022-07-23T02:28:30.800Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 5
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 您推荐哪些FOSS自带的聊天程序？文本/语音/视频\n",
  "headline_zh-Hant": "Ask HN: 您推薦哪些FOSS自帶的聊天程序？文本/語音/視頻\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我一直在使用Nextcloud，它并不怎么好。 文本聊天界面很混乱，我上次安装时很痛苦，语音和视频部分很难在我的笔记本电脑上运行。 我记得安卓手机的应用程序不能用于聊天。 我不知道是否有iPhone应用，所以无论如何，我都没有试过。<p>我主要是用它来和家人聊天，包括我妈妈，她年纪大了，经常被界面元素的变化、字体的变化等所干扰。 IRC确实比我所知道的任何网络聊天应用程序都要好，除了它在客户端断开连接时不会保持滚动。 能够同时使用文字和视频是很重要的，因为她的听力不好，所以最好是打出她能看懂的文字。<p>我妈妈用的是我为她设置的Debian笔记本电脑，所以如果有一个Linux桌面应用比网页界面更好，那就太好了。 她根本不使用移动电话。 不过我可以想象，对于我妈妈以外的用户来说，移动应用程序也是值得一试的。 <p>我试过Jitsi Meet（meet.jit.si）的托管版本，它很不错。 我还没有尝试过自我托管。 我很高兴听到有关经验，以及其他任何有趣的事情。\n",
  "description_zh-Hant": "我一直在使用Nextcloud，它並不怎麼好。 文本聊天界面很混亂，我上次安裝時很痛苦，語音和視頻部分很難在我的筆記本電腦上運行。 我記得安卓手機的應用程序不能用於聊天。 我不知道是否有iPhone應用，所以無論如何，我都沒有試過。<p>我主要是用它來和家人聊天，包括我媽媽，她年紀大了，經常被界面元素的變化、字體的變化等所幹擾。 IRC確實比我所知道的任何網絡聊天應用程序都要好，除了它在客戶端斷開連接時不會保持滾動。 能夠同時使用文字和視頻是很重要的，因為她的聽力不好，所以最好是打出她能看懂的文字。<p>我媽媽用的是我為她設置的Debian筆記本電腦，所以如果有一個Linux桌面應用比網頁界面更好，那就太好了。 她根本不使用移動電話。 不過我可以想象，對於我媽媽以外的用戶來說，移動應用程序也是值得一試的。 <p>我試過Jitsi Meet（meet.jit.si）的託管版本，它很不錯。 我還沒有嘗試過自我託管。 我很高興聽到有關經驗，以及其他任何有趣的事情。\n"
}