{
  "@type": "NewsArticle",
  "identifier": "2022--07--27--en--askhn--HackerNews--NewsArticle--32254877",
  "url": "https://news.ycombinator.com/item?id=32254877",
  "headline": "Ask HN: Ideas for Late Career Reinvigoration?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Throwaway. I'm a mid 40's developer (non-manager) who's worked at a gamut of companies (big cos, startups, self employment/contract, &quot;fun&quot; but low-paying gigs), in many problem domains, but mainly FAANG for the most of the last ~15 years. Close to being able to retire, but not quite there yet. I'm bored. I've done a bit of everything at this point, and it's starting to feel tedious. I don't care about title/level anymore. With various market meltdowns, the golden handcuffs are feeling less binding, and I'm feeling a bit more free to make choices career-wise, since at this point I'm fortunate in that I only really need to cross the finish line so to speak. I have no desire to leave software development - I'm not going to become a woodworker or teacher. After I retire I will still code as one of my main hobbies. But everywhere I look, it all seems very &quot;been there, done that.&quot; I've reinvented myself several times over my career (domain-wise) and I think I'm quite malleable in that regard, but the intrinsic motivation is waning after decades of enthusiasm. What have other folks my age done when this sort of ennui hits?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwexaway",
    "url": "https://news.ycombinator.com/user?id=throwexaway"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32254877",
  "sameAs": "https://news.ycombinator.com/item?id=32254877",
  "dateCreated": "2022-07-27T19:24:06.033Z",
  "datePublished": "2022-07-27T18:51:56.000Z",
  "dateModified": "2022-07-27T19:24:06.033Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 晚期职业重振的想法？\n",
  "headline_zh-Hant": "Ask HN: 晚期職業重振的想法？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "扔掉。我是一个40多岁的开发人员（非管理人员），曾在各种公司（大公司、初创公司、自雇/合同、&quot;有趣&quot;但低薪的工作）工作，涉及许多问题领域，但在过去15年的大部分时间里主要是FAANG。离退休不远了，但还没到时候。我很无聊。在这一点上，我什么都做过了，而且开始感到乏味了。我不再关心职称/级别了。随着各种市场的崩溃，金手铐感觉不那么有约束力了，我感觉在职业选择上更自由了，因为在这一点上我很幸运，我只需要越过终点线就可以了。我没有离开软件开发的愿望--我不打算成为一个木工或教师。在我退休后，我仍然会把编码作为我的主要爱好之一。但是，在我看来，这一切似乎都是 \"过去的事，现在的事\"。在我的职业生涯中，我已经多次重塑了自己（从领域上来说），我认为我在这方面有相当的可塑性，但是在几十年的热情之后，内在的动力正在减弱。当这种倦怠感袭来时，其他与我同龄的人都做了什么？\n",
  "description_zh-Hant": "扔掉。我是一個40多歲的開發人員（非管理人員），曾在各種公司（大公司、初創公司、自僱/合同、&quot;有趣&quot;但低薪的工作）工作，涉及許多問題領域，但在過去15年的大部分時間裡主要是FAANG。離退休不遠了，但還沒到時候。我很無聊。在這一點上，我什麼都做過了，而且開始感到乏味了。我不再關心職稱/級別了。隨著各種市場的崩潰，金手銬感覺不那麼有約束力了，我感覺在職業選擇上更自由了，因為在這一點上我很幸運，我只需要越過終點線就可以了。我沒有離開軟件開發的願望--我不打算成為一個木工或教師。在我退休後，我仍然會把編碼作為我的主要愛好之一。但是，在我看來，這一切似乎都是 \"過去的事，現在的事\"。在我的職業生涯中，我已經多次重塑了自己（從領域上來說），我認為我在這方面有相當的可塑性，但是在幾十年的熱情之後，內在的動力正在減弱。當這種倦怠感襲來時，其他與我同齡的人都做了什麼？\n"
}