{
  "@type": "NewsArticle",
  "identifier": "2022--06--20--en--askhn--HackerNews--NewsArticle--31813201",
  "url": "https://news.ycombinator.com/item?id=31813201",
  "headline": "Ask HN: Directors and above, why did you decide to play in the game of thrones?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm in my mid-40s and my next job is likely pivotal: I'll either decide to be an individual contributor in my field (and manage a couple small teams on the side), or start senior management type positions (managing relationships between larger teams of teams across the enterprise, possibly including a couple of my own small teams, or even go found a company). Either choice comes with opportunity cost. To go the IC route, I'm likely renouncing a lot of opportunities that presently exist. To go the senior management route, I'm likely walking away from my subspecialist skill set to a degree that it may be hard to go back to an IC role later.<p>Intuitively, the IC role is &quot;safer&quot;. I know what I can do, and I can grind it out for another 20 years and, retire, and leave my kids a couple properties. The senior management role seems riskier to me. Press, internal politics, external politics. None of which is guaranteed to fall in my favor. I have led before (up to 53 people). I've seen the C suite interactions enough (I was an EA for a couple years) to know there's a bunch of it that comes down to high school level politics and the vagaries of scheduling. Why would I give up hard science research and clinical impact to play high school politics?<p>That's genuinely the question: why did you do it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "killjoywashere",
    "url": "https://news.ycombinator.com/user?id=killjoywashere"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31813201",
  "sameAs": "https://news.ycombinator.com/item?id=31813201",
  "dateCreated": "2022-06-20T17:55:49.290Z",
  "datePublished": "2022-06-20T17:41:45.000Z",
  "dateModified": "2022-06-20T17:55:49.290Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 董事及以上，你为什么决定参加权力的游戏？\n",
  "headline_zh-Hant": "Ask HN: 董事及以上，你為什麼決定參加權力的遊戲？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我已经40多岁了，我的下一份工作很可能是举足轻重的：我要么决定在我的领域里做一个个人贡献者（同时管理几个小团队），要么开始高级管理类型的职位（管理整个企业中较大团队之间的关系，可能包括我自己的几个小团队，甚至去创立一家公司）。无论哪种选择都会有机会成本。如果走集成电路路线，我可能会放弃目前存在的很多机会。如果走高级管理路线，我可能会离开我的亚专业技能组合，以至于以后可能很难再回到IC角色。我知道自己能做什么，我可以再磨练20年，然后退休，给我的孩子留下几处房产。对我来说，高级管理层的角色似乎风险更大。新闻、内部政治、外部政治。这些都不能保证对我有利。我曾经领导过（多达53人）。我见过足够多的C组互动（我做过几年的EA），知道其中有一堆是高中水平的政治和变化无常的日程安排。我为什么要放弃艰苦的科学研究和临床影响来玩高中政治呢？\n",
  "description_zh-Hant": "我已經40多歲了，我的下一份工作很可能是舉足輕重的：我要麼決定在我的領域裡做一個個人貢獻者（同時管理幾個小團隊），要麼開始高級管理類型的職位（管理整個企業中較大團隊之間的關係，可能包括我自己的幾個小團隊，甚至去創立一家公司）。無論哪種選擇都會有機會成本。如果走集成電路路線，我可能會放棄目前存在的很多機會。如果走高級管理路線，我可能會離開我的亞專業技能組合，以至於以後可能很難再回到IC角色。我知道自己能做什麼，我可以再磨練20年，然後退休，給我的孩子留下幾處房產。對我來說，高級管理層的角色似乎風險更大。新聞、內部政治、外部政治。這些都不能保證對我有利。我曾經領導過（多達53人）。我見過足夠多的C組互動（我做過幾年的EA），知道其中有一堆是高中水平的政治和變化無常的日程安排。我為什麼要放棄艱苦的科學研究和臨床影響來玩高中政治呢？\n"
}