{
  "@type": "NewsArticle",
  "identifier": "2022--06--07--en--askhn--HackerNews--NewsArticle--31657423",
  "url": "https://news.ycombinator.com/item?id=31657423",
  "headline": "Ask HN: I am PM/Generalist,Should I get back to development? [Re-post]",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a generalist and have worked in early-stage startups thus having done various roles: Developer, Dev Rel, Sales, Marketing, Success, Operations, etc, across different industries, learning being my key skill.\nWhile I am grateful to have worked in various roles, there is a certain joy I get while programming. I am not the best programmer anymore but can learn and get stuff done. In the last 5 years I have worked on an iOS app, a Web app &amp; scraped and parsed 100K plus pages for a friend, built a Google sheet addon, partly built and manage a data pipeline &amp; Dashboard, and am dabbling with Unity right now.<p>I want to transition back to Software development by going into a developer advocate role so that I can leverage all my client-facing experience and code on a daily basis. I am hoping that this will allow me to build a micro SaaS in the next few years to set up a parallel income stream or become a CTO with a strong product &amp; strategy mindset in a few years.<p>I am probably going to lose the option to be a product executive in the future, but I feel I will get bumped out of the PM role anyway. I am very confident in my Product &amp; Strategy skills, I have correctly predicted changes in many of the industries I have worked with (but my employers did not)<p>I am guessing I can be more relevant to organization at the intersection of Technical and Business roles, thus I am also inclined to work for an org which has developers as their TG.<p>Side note<p>1. This is a throw away account, and I surprisingly don't have imposter syndrome.<p>2. This is a repost as my first post probably got flagged",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "gobacktodev",
    "url": "https://news.ycombinator.com/user?id=gobacktodev"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31657423",
  "sameAs": "https://news.ycombinator.com/item?id=31657423",
  "dateCreated": "2022-06-07T17:40:33.742Z",
  "datePublished": "2022-06-07T17:19:01.000Z",
  "dateModified": "2022-06-07T17:40:33.742Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我是PM/Generalist,我应该回去发展吗？[重发]\n",
  "headline_zh-Hant": "Ask HN: 我是PM/Generalist,我應該回去發展嗎？[重發]\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个通才，曾在早期创业公司工作过，因此做过各种角色。开发人员、开发相关人员、销售人员、市场人员、成功人员、运营人员等，涉及不同行业，学习是我的主要技能。\n虽然我很感激在各种角色中工作过，但在编程时我有某种快乐。我不再是最好的程序员，但可以学习并完成任务。在过去的5年里，我做过一个iOS应用程序，一个Web应用程序和amp; 为一个朋友刮削和解析了10万多个页面，建立了一个Google sheet插件，部分建立和管理了一个数据管道和amp; Dashboard，现在正在涉足Unity。<p>我想通过进入一个开发者倡导者的角色来过渡到软件开发，这样我可以利用我所有面向客户的经验和日常代码。我希望这将使我在未来几年内建立一个微型SaaS，以建立一个平行的收入流，或者在几年内成为一个具有强大产品&amp; 战略思维的CTO。<p>我可能会在未来失去成为产品主管的选择，但我觉得无论如何我都会被从PM的角色中挤掉。我对自己的产品和战略技能非常有信心，我正确地预测了我所工作的许多行业的变化（但我的雇主没有）<p>我猜测我可以在技术和商业角色的交叉点上与组织更加相关，因此我也倾向于为一个以开发人员为TG的组织工作。<p>侧面说明<p>1。这是一个废弃的账户，而且我竟然没有冒名顶替的综合症。<p>2.这是一个转帖，因为我的第一个帖子可能被标记了。\n",
  "description_zh-Hant": "我是一個通才，曾在早期創業公司工作過，因此做過各種角色。開發人員、開發相關人員、銷售人員、市場人員、成功人員、運營人員等，涉及不同行業，學習是我的主要技能。\n雖然我很感激在各種角色中工作過，但在編程時我有某種快樂。我不再是最好的程序員，但可以學習並完成任務。在過去的5年裡，我做過一個iOS應用程序，一個Web應用程序和amp; 為一個朋友刮削和解析了10萬多個頁面，建立了一個Google sheet插件，部分建立和管理了一個數據管道和amp; Dashboard，現在正在涉足Unity。<p>我想通過進入一個開發者倡導者的角色來過渡到軟件開發，這樣我可以利用我所有面向客戶的經驗和日常代碼。我希望這將使我在未來幾年內建立一個微型SaaS，以建立一個平行的收入流，或者在幾年內成為一個具有強大產品&amp; 戰略思維的CTO。<p>我可能會在未來失去成為產品主管的選擇，但我覺得無論如何我都會被從PM的角色中擠掉。我對自己的產品和戰略技能非常有信心，我正確地預測了我所工作的許多行業的變化（但我的僱主沒有）<p>我猜測我可以在技術和商業角色的交叉點上與組織更加相關，因此我也傾向於為一個以開發人員為TG的組織工作。<p>側面說明<p>1。這是一個廢棄的賬戶，而且我竟然沒有冒名頂替的綜合症。<p>2.這是一個轉帖，因為我的第一個帖子可能被標記了。\n"
}