{
  "@type": "NewsArticle",
  "identifier": "2022--07--21--en--askhn--HackerNews--NewsArticle--32183401",
  "url": "https://news.ycombinator.com/item?id=32183401",
  "headline": "Ask HN: Rusty at math, best applied books and materials to relearn?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've spent the past 2 days writing code to work with OCR results and use the position of words and sentences to link them together and classify them.<p>In the process my math knowledge has had a real workout, even though it's 2D geometry.<p>I did undergrad physics at university 20 years ago. Since then I've done web programming that hasn't needed maths and I've forgotten so much. Though I don't feel I ever understood the maths properly, just enough to pass my courses.<p>Can you recommend any books or learning materials to help me get back in practice? I'm visual and learn best with applied examples, which is where many of my textbooks fell down as they were too abstract.<p>I'm also interested in material that covers how you apply maths on computers. E.g. I was extrapolating a line through two points and got caught out when the gradient went to infinity (in x-y coords, a line parallel to the y-axis). I fudged it by adding a tiny amount to the denominator so it'll never by zero, but I'd like to learn the proper way to handle these cases. \nTranslating problems into vector representations would be good too, as I tried and got lost in all the different meanings of Vector.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "pbowyer",
    "url": "https://news.ycombinator.com/user?id=pbowyer"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32183401",
  "sameAs": "https://news.ycombinator.com/item?id=32183401",
  "dateCreated": "2022-07-21T19:02:57.111Z",
  "datePublished": "2022-07-21T19:01:10.000Z",
  "dateModified": "2022-07-21T19:02:57.111Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 数学生疏，最好的应用书籍和材料来重新学习？\n",
  "headline_zh-Hant": "Ask HN: 數學生疏，最好的應用書籍和材料來重新學習？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在过去的两天里，我一直在编写代码，以处理OCR结果，并利用单词和句子的位置将它们联系在一起并进行分类。<p>在这个过程中，我的数学知识得到了真正的锻炼，尽管它是二维几何。从那时起，我就开始做不需要数学的网络编程，我已经忘记了很多东西。虽然我觉得我没有正确理解过数学，只是为了通过我的课程。<p>你能推荐一些书籍或学习材料来帮助我重新开始练习吗？我是视觉型的，在应用实例中学习效果最好，而这正是我的许多教科书的失败之处，因为它们太抽象了。<p>我还对涉及如何在计算机上应用数学的材料感兴趣。例如，我在推算一条通过两点的直线时，当梯度达到无限大时，我被发现了（在X-Y坐标中，一条与Y轴平行的直线）。我在分母上加了一个小量，所以它永远不会为零，但我想学习处理这些情况的正确方法。\n把问题翻译成矢量表示也很好，因为我尝试过，但在矢量的所有不同含义中迷失了方向。\n",
  "description_zh-Hant": "在過去的兩天裡，我一直在編寫代碼，以處理OCR結果，並利用單詞和句子的位置將它們聯繫在一起並進行分類。<p>在這個過程中，我的數學知識得到了真正的鍛鍊，儘管它是二維幾何。從那時起，我就開始做不需要數學的網絡編程，我已經忘記了很多東西。雖然我覺得我沒有正確理解過數學，只是為了通過我的課程。<p>你能推薦一些書籍或學習材料來幫助我重新開始練習嗎？我是視覺型的，在應用實例中學習效果最好，而這正是我的許多教科書的失敗之處，因為它們太抽象了。<p>我還對涉及如何在計算機上應用數學的材料感興趣。例如，我在推算一條通過兩點的直線時，當梯度達到無限大時，我被發現了（在X-Y座標中，一條與Y軸平行的直線）。我在分母上加了一個小量，所以它永遠不會為零，但我想學習處理這些情況的正確方法。\n把問題翻譯成矢量表示也很好，因為我嘗試過，但在矢量的所有不同含義中迷失了方向。\n"
}