{
  "@type": "NewsArticle",
  "identifier": "2022--07--07--en--askhn--HackerNews--NewsArticle--32017176",
  "url": "https://news.ycombinator.com/item?id=32017176",
  "headline": "Ask HN: Should we call it 'aesthetics' instead of 'technical debt'?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "There's a couple reasons I don't feel the term 'technical debt' is very good:<p>- There's an implication that it should be 0, but anyone who's ever worked on a large enough project will tell you that any large project will have some technical debt. When you get down to practical implementation there's always tradeoffs that have no single clear answer<p>- There's this dissonance where the things that are called 'technical debt' are potentially serious enough to cause problems, but not serious enough for anyone to actually prioritize dealing with them.<p>Using the description 'aesthetics' makes more sense to me<p>- I think it's inherent that aesthetics has a subjective element and that there's no way to drive it down to 0 or 100 or whatever.<p>- I think it helps with prioritization by setting the right context. &quot;Removing technical debt&quot; doesn't sound like a particularly productive activity, but &quot;improving aesthetics,&quot; while clearly not as high priority as, say, &quot;improving functionality,&quot; at least carries the connotation that something will get improved as a result of the work, even if it's something not totally tangible.<p>What are HN's thoughts? Are there other words besides aesthetics or technical debt we could/should be using?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "actinium226",
    "url": "https://news.ycombinator.com/user?id=actinium226"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32017176",
  "sameAs": "https://news.ycombinator.com/item?id=32017176",
  "dateCreated": "2022-07-07T17:57:48.098Z",
  "datePublished": "2022-07-07T17:54:09.000Z",
  "dateModified": "2022-07-07T17:57:48.098Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们是否应该称其为 \"美学 \"而不是 \"技术债务\"？\n",
  "headline_zh-Hant": "Ask HN: 我們是否應該稱其為 \"美學 \"而不是 \"技術債務\"？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "有几个原因让我觉得 \"技术债务 \"这个词不是很好：<p>- 有一种暗示，它应该是0，但任何曾经在大型项目上工作过的人都会告诉你，任何大型项目都有一些技术债务。当你深入到实际执行时，总是会有一些没有明确答案的权衡<p>- 有这样一种不和谐的现象，被称为 \"技术债务 \"的东西有可能严重到导致问题，但却没有严重到让人真正优先处理它们。<p> 使用 \"美学 \"的描述对我来说更有意义<p>- 我认为美学是固有的，有主观因素，没有办法把它降低到0或100或其他。 <p>- 我认为它通过设置正确的背景来帮助确定优先次序。&quot;消除技术债务&quot;听起来不像是一个特别有成效的活动，但是&quot;改善美学&quot;虽然显然不像&quot;改善功能&quot;那样优先，但至少带有这样的含义：某些东西会因为这项工作而得到改善，即使它不是完全具体的东西。除了美学或技术债务之外，我们还可以/应该使用其他词汇吗？\n",
  "description_zh-Hant": "有幾個原因讓我覺得 \"技術債務 \"這個詞不是很好：<p>- 有一種暗示，它應該是0，但任何曾經在大型項目上工作過的人都會告訴你，任何大型項目都有一些技術債務。當你深入到實際執行時，總是會有一些沒有明確答案的權衡<p>- 有這樣一種不和諧的現象，被稱為 \"技術債務 \"的東西有可能嚴重到導致問題，但卻沒有嚴重到讓人真正優先處理它們。<p> 使用 \"美學 \"的描述對我來說更有意義<p>- 我認為美學是固有的，有主觀因素，沒有辦法把它降低到0或100或其他。 <p>- 我認為它通過設置正確的背景來幫助確定優先次序。&quot;消除技術債務&quot;聽起來不像是一個特別有成效的活動，但是&quot;改善美學&quot;雖然顯然不像&quot;改善功能&quot;那樣優先，但至少帶有這樣的含義：某些東西會因為這項工作而得到改善，即使它不是完全具體的東西。除了美學或技術債務之外，我們還可以/應該使用其他詞彙嗎？\n"
}