{
  "@type": "NewsArticle",
  "identifier": "2022--07--21--en--askhn--HackerNews--NewsArticle--32175311",
  "url": "https://news.ycombinator.com/item?id=32175311",
  "headline": "Ask HN: I don't read fiction, how much am I missing out on?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Aside from the readings way back in school, I haven't touched any fiction. I haven't felt the need for it (I went into the sciences), and in general I just no longer have the patience to follow entire storylines (eg I also don't watch any shows).<p>However, as I spend more time in social science and humanities spaces, I find myself running into literary references (especially the classics) more often that I would have expected, to the point where I'm now wondering how much am I missing out on if I don't understand these references? How much am I missing out on if I've never read these classics, or just fiction in general?<p>Ironically, I feel that now as an adult I'd appreciate these a lot more than back then when it was required.<p>If I were to try reading fiction, especially the classics, where/how should I start? Maybe some shorter titles that may help pique my interest in fiction? Any particular works that are must-reads, more so than the others?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32175311",
  "sameAs": "https://news.ycombinator.com/item?id=32175311",
  "dateCreated": "2022-07-21T03:54:10.379Z",
  "datePublished": "2022-07-21T03:07:09.000Z",
  "dateModified": "2022-07-21T03:54:10.379Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "Ask HN: 我不读小说，我到底错过了多少东西？\n",
  "headline_zh-Hant": "Ask HN: 我不讀小說，我到底錯過了多少東西？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "除了学校里的读物之外，我没有接触过任何小说。<p>然而，随着我在社会科学和人文科学领域花费更多的时间，我发现自己比预期的更经常地遇到文学参考资料（尤其是经典作品），以至于我现在想知道，如果我不理解这些参考资料，我到底错过了多少东西？如果我没有读过这些经典作品，或者只是读过一般的小说，我又会错过多少呢？<p>从历史上看，我觉得现在作为一个成年人，我会比当时需要的时候更欣赏这些。<p>如果我想尝试阅读小说，尤其是经典作品，我应该从哪里/如何开始？也许一些较短的书可以帮助激发我对小说的兴趣？有什么特别的作品是必须要读的，比其他作品更重要的？\n",
  "description_zh-Hant": "除了學校裡的讀物之外，我沒有接觸過任何小說。<p>然而，隨著我在社會科學和人文科學領域花費更多的時間，我發現自己比預期的更經常地遇到文學參考資料（尤其是經典作品），以至於我現在想知道，如果我不理解這些參考資料，我到底錯過了多少東西？如果我沒有讀過這些經典作品，或者只是讀過一般的小說，我又會錯過多少呢？<p>從歷史上看，我覺得現在作為一個成年人，我會比當時需要的時候更欣賞這些。<p>如果我想嘗試閱讀小說，尤其是經典作品，我應該從哪裡/如何開始？也許一些較短的書可以幫助激發我對小說的興趣？有什麼特別的作品是必須要讀的，比其他作品更重要的？\n"
}