{
  "@type": "NewsArticle",
  "identifier": "2022--04--20--en--askhn--HackerNews--NewsArticle--31095345",
  "url": "https://news.ycombinator.com/item?id=31095345",
  "headline": "Ask HN: How do you deal with running errands guilt?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I work a 40 hour week, usually from 10 to 6.<p>It's so happened, that most of businesses surrounding me are also only open during exactly same time.<p>I am a human, and I need to go to doctors, therapists, other time I need to visit some place to let's say choose some furniture to buy, or just to drink a cup of coffee in a lunch time on a terrace of a cafe. I am human, and I feel I am becoming less human if I don't allow myself such things!<p>The problem is that I don't understand how to talk about that with my employer. Usually when I need to get out, I just put the &quot;afk&quot; status on slack and go.<p>What happens after: if I had no slack mentions, and nothing happened, I feel okay, as if my &quot;bad move&quot; went unnoticed. But if I see some unviewed mentions, somebody was pinging me, I immediately feel lots of shame and guilt. My reaction is: &quot;I'm here now, let's work work work! I am sorry I was absent people!&quot; It feels really bad and weird.<p>HN, did you also ever feel like this? What strategies you found useful?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mib32",
    "url": "https://news.ycombinator.com/user?id=mib32"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31095345",
  "sameAs": "https://news.ycombinator.com/item?id=31095345",
  "dateCreated": "2022-04-20T11:36:38.015Z",
  "datePublished": "2022-04-20T11:30:45.000Z",
  "dateModified": "2022-04-20T11:36:38.015Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你是如何处理跑腿的内疚感的？",
  "headline_zh-Hant": "Ask HN: 你是如何處理跑腿的內疚感的？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我每周工作40个小时，通常从10点到6点。<p>碰巧的是，我周围的大多数企业也只在同一时间营业。<p>我是一个人，我需要去看医生、治疗师，其他时候我需要去一些地方，比如说选择一些家具来买，或者只是在午餐时间在咖啡馆的露台上喝杯咖啡。我是人，如果我不允许自己做这样的事情，我觉得我就变得不那么像人了！<p>问题是，我不明白如何与我的雇主谈这个问题。通常，当我需要离开时，我只是把&quot;afk&quot;状态放在slack上，然后就走了。<p>之后会发生什么：如果我没有在slack上提及，也没有发生任何事情，我觉得还好，好像我的&quot;坏动作&quot;没有被注意到。但是，如果我看到一些未查看的提及，有人在给我打招呼，我立即感到很多羞愧和内疚。我的反应是：&quot;我现在在这里，让我们工作吧！&quot;。我很抱歉我缺席了！&quot; 这感觉真的很糟糕，很奇怪。<p>HN，你也曾有过这样的感觉吗？你觉得什么策略有用？",
  "description_zh-Hant": "我每週工作40個小時，通常從10點到6點。<p>碰巧的是，我周圍的大多數企業也只在同一時間營業。<p>我是一個人，我需要去看醫生、治療師，其他時候我需要去一些地方，比如說選擇一些傢俱來買，或者只是在午餐時間在咖啡館的露臺上喝杯咖啡。我是人，如果我不允許自己做這樣的事情，我覺得我就變得不那麼像人了！<p>問題是，我不明白如何與我的僱主談這個問題。通常，當我需要離開時，我只是把&quot;afk&quot;狀態放在slack上，然後就走了。<p>之後會發生什麼：如果我沒有在slack上提及，也沒有發生任何事情，我覺得還好，好像我的&quot;壞動作&quot;沒有被注意到。但是，如果我看到一些未查看的提及，有人在給我打招呼，我立即感到很多羞愧和內疚。我的反應是：&quot;我現在在這裡，讓我們工作吧！&quot;。我很抱歉我缺席了！&quot; 這感覺真的很糟糕，很奇怪。<p>HN，你也曾有過這樣的感覺嗎？你覺得什麼策略有用？"
}