{
  "@type": "NewsArticle",
  "identifier": "2022--04--18--en--askhn--HackerNews--NewsArticle--31072465",
  "url": "https://news.ycombinator.com/item?id=31072465",
  "headline": "Ask HN: I burned out but I don't want to let my team down",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I never thought I'd write these words but, yeah, it happened to me too: I burned out.<p>I can't even stand checking my emails anymore but I manage a team of 5 amazing devs (for a relatively large corp) who clearly started to notice something's wrong.<p>The job, the people, the tasks, the work-life balance are all great so the issue lies somewhere else. I eat healthy, exercise every day and have a good social life. I also see a therapist regularly (I started years ago and find it incredibly helpful to gain perspective on various areas of life). But most days I'd rather spend 3 hours in bed watching Netflix than write a single line of code.<p>I worked on a couple of side projects, and that helped, but I lost motivation to continue that as well. I'm researching the topic and this community helped me a lot throughout the last few years so I thought I'd post this.<p>How can I manage responsibilities and deal with this at the same time? Should I delegate my work to someone else for a while? Should I just take a couple of weeks' vacation? I'm kind of lost at the moment.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "burnedoutanon",
    "url": "https://news.ycombinator.com/user?id=burnedoutanon"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31072465",
  "sameAs": "https://news.ycombinator.com/item?id=31072465",
  "dateCreated": "2022-04-18T16:13:34.745Z",
  "datePublished": "2022-04-18T15:59:11.000Z",
  "dateModified": "2022-04-18T16:13:34.745Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我烧掉了，但我不想让我的团队失望",
  "headline_zh-Hant": "Ask HN: 我燒掉了，但我不想讓我的團隊失望",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我从未想过我会写下这些话，但是，是的，这也发生在我身上。<p>我甚至无法忍受检查我的电子邮件，但我管理着一个由5名出色的开发人员组成的团队（为一个相对较大的公司），他们显然开始注意到了一些问题。我吃得很健康，每天都在锻炼，有很好的社交生活。我还定期看心理医生（我几年前就开始看了，发现这对获得对生活各个领域的看法有很大帮助）。但大多数时候，我宁愿花3个小时在床上看Netflix，也不愿写一行代码。<p>我曾做过几个副业，这很有帮助，但我也失去了继续做下去的动力。我正在研究这个话题，这个社区在过去几年中对我帮助很大，所以我想我应该发这个帖子。<p>我怎样才能在管理责任的同时处理好这个问题？我应该把我的工作委托给别人一段时间吗？我是否应该放几个星期的假？我此刻有点迷茫。",
  "description_zh-Hant": "我從未想過我會寫下這些話，但是，是的，這也發生在我身上。<p>我甚至無法忍受檢查我的電子郵件，但我管理著一個由5名出色的開發人員組成的團隊（為一個相對較大的公司），他們顯然開始注意到了一些問題。我吃得很健康，每天都在鍛鍊，有很好的社交生活。我還定期看心理醫生（我幾年前就開始看了，發現這對獲得對生活各個領域的看法有很大幫助）。但大多數時候，我寧願花3個小時在床上看Netflix，也不願寫一行代碼。<p>我曾做過幾個副業，這很有幫助，但我也失去了繼續做下去的動力。我正在研究這個話題，這個社區在過去幾年中對我幫助很大，所以我想我應該發這個帖子。<p>我怎樣才能在管理責任的同時處理好這個問題？我應該把我的工作委託給別人一段時間嗎？我是否應該放幾個星期的假？我此刻有點迷茫。"
}