{
  "@type": "NewsArticle",
  "identifier": "2022--06--18--en--askhn--HackerNews--NewsArticle--31786898",
  "url": "https://news.ycombinator.com/item?id=31786898",
  "headline": "Ask HN: As a senior engineer content with programming chops, what to learn next?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a senior software engineer who has been in the field for about 25 years. I mainly use Python and SQL and feel like I can use it to solve mostly all problems. I also have a good knowledge of programming techniques like functional, OO and logic programming. I am aware that as a senior software engineer one has to have other skills like caring about the team overall, and mentoring juniors.\nI am wondering what should I learn next. Somebody said I should learn Go or Rust but I feel like if it’s another programming language, its really nothing new. Spend a weekend, do some tutorials and you should be good since you are a senior engineer and you know the basics that underpin programming languages.<p>What novel thing should I learn next that will enhance my capability as a senior engineer? Or open to my eyes to things that I haven’t considered till now?<p>I realize this is a vague request but was just wondering if there were other people with the same dilemma.<p>Thanks in advance!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "captmorrel",
    "url": "https://news.ycombinator.com/user?id=captmorrel"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31786898",
  "sameAs": "https://news.ycombinator.com/item?id=31786898",
  "dateCreated": "2022-06-18T03:34:08.803Z",
  "datePublished": "2022-06-18T02:50:07.000Z",
  "dateModified": "2022-06-18T03:34:08.803Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 作为一个满足于编程能力的高级工程师，接下来要学习什么？\n",
  "headline_zh-Hant": "Ask HN: 作為一個滿足於編程能力的高級工程師，接下來要學習什麼？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一名高级软件工程师，已经在这个领域工作了大约25年。我主要使用Python和SQL，并且觉得我可以用它来解决大部分的问题。我对编程技术也有很好的了解，如函数式、OO和逻辑编程。我知道，作为一名高级软件工程师，必须具备其他技能，比如关心团队的整体情况，以及指导后辈。\n我在想我接下来应该学什么？有人说我应该学习Go或Rust，但我觉得如果是另一种编程语言，其实也没什么新意。花一个周末的时间，做一些教程，你应该很好，因为你是一个高级工程师，你知道支撑编程语言的基础知识。<p>接下来我应该学习什么新东西，以提高我作为一个高级工程师的能力？<p>我意识到这是一个模糊的要求，但我只是想知道是否有其他人有同样的困境。\n",
  "description_zh-Hant": "我是一名高級軟件工程師，已經在這個領域工作了大約25年。我主要使用Python和SQL，並且覺得我可以用它來解決大部分的問題。我對編程技術也有很好的瞭解，如函數式、OO和邏輯編程。我知道，作為一名高級軟件工程師，必須具備其他技能，比如關心團隊的整體情況，以及指導後輩。\n我在想我接下來應該學什麼？有人說我應該學習Go或Rust，但我覺得如果是另一種編程語言，其實也沒什麼新意。花一個週末的時間，做一些教程，你應該很好，因為你是一個高級工程師，你知道支撐編程語言的基礎知識。<p>接下來我應該學習什麼新東西，以提高我作為一個高級工程師的能力？<p>我意識到這是一個模糊的要求，但我只是想知道是否有其他人有同樣的困境。\n"
}