{
  "@type": "NewsArticle",
  "identifier": "2022--07--04--en--askhn--HackerNews--NewsArticle--31977889",
  "url": "https://news.ycombinator.com/item?id=31977889",
  "headline": "Ask HN: Is an undergrad research experience in something other than CS useful?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am asking this as someone who is not an undergraduate, but rather a post-doctoral researcher who is advising undergraduates who will work with our group. I am a computational physicist, that means that yes I deal with the horrors of scientific code, etc etc, but the general pitch I make for undergraduate students to join us for two semesters is that they will pick up and practice generalizable &quot;power user&quot; level skills, like working with the terminal, shell scripting for coordinating simulation runs, doing basic analysis (making plots), as well as developing basic performance-minded reasoning. The idea is that these skills are definitely a plus if they are physics or engineering students moving on to graduate work, but are also generalizeable to CS in general in case they want to do data science or something like that eventually.<p>What I'm asking is how truthful is this? To people who are actual developer types, would an undergraduate research project like ours in computational physics look interesting on a resume if you're hiring a fresh graduate? I generally think of myself as adjacent to dev work but not really a developer given the difference in focus and just day to day operations, so I don't want to lie to students when I tell them that this is valuable if you want to be a dev someday.<p>I'm assuming if you ranked  what is remarkable or valuable on a resume for an undergrad, something like an internship at a company is first followed by an undergrad research project in CS followed by working for us, then followed by any other sort of research experience that has no connection to computing in general. Is this correct?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "noobermin",
    "url": "https://news.ycombinator.com/user?id=noobermin"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31977889",
  "sameAs": "https://news.ycombinator.com/item?id=31977889",
  "dateCreated": "2022-07-04T15:27:59.806Z",
  "datePublished": "2022-07-04T15:11:35.000Z",
  "dateModified": "2022-07-04T15:27:59.806Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 本科生在CS以外的其他领域的研究经历是否有用？\n",
  "headline_zh-Hant": "Ask HN: 本科生在CS以外的其他領域的研究經歷是否有用？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是作为一个不是本科生的人问这个问题的，我是一个博士后研究人员，正在为将与我们小组合作的本科生提供建议。我是一名计算物理学家，这意味着我是在处理科学代码的恐怖问题，等等，但是我为本科生加入我们的两个学期所做的一般宣传是，他们将获得并练习可通用的&quot;power user&quot;级别的技能，比如使用终端、协调模拟运行的shell脚本、做基本分析（制作图表），以及发展基本的注重性能的推理。我们的想法是，如果他们是物理或工程专业的学生，那么这些技能绝对是一个加分项，但也可以推广到一般的CS，以防他们最终想做数据科学或类似的工作。<p>我想问的是这有多真实？对于那些真正的开发者类型的人来说，如果你要招聘一个刚毕业的学生，像我们这样的计算物理学的本科研究项目在简历上会不会看起来很有趣？我一般认为自己与开发工作相邻，但鉴于工作重点和日常操作的不同，我并不是一个真正的开发者，所以当我告诉学生，如果你将来想成为一个开发者，这是很有价值的，我不想对他们撒谎。<p>我假设如果你对本科生简历上的显著或有价值的东西进行排名，像在一家公司实习的东西，首先是CS的本科研究项目，然后是为我们工作，然后是任何其他类型的研究经验，与一般的计算没有联系。这样做对吗？\n",
  "description_zh-Hant": "我是作為一個不是本科生的人問這個問題的，我是一個博士後研究人員，正在為將與我們小組合作的本科生提供建議。我是一名計算物理學家，這意味著我是在處理科學代碼的恐怖問題，等等，但是我為本科生加入我們的兩個學期所做的一般宣傳是，他們將獲得並練習可通用的&quot;power user&quot;級別的技能，比如使用終端、協調模擬運行的shell腳本、做基本分析（製作圖表），以及發展基本的注重性能的推理。我們的想法是，如果他們是物理或工程專業的學生，那麼這些技能絕對是一個加分項，但也可以推廣到一般的CS，以防他們最終想做數據科學或類似的工作。<p>我想問的是這有多真實？對於那些真正的開發者類型的人來說，如果你要招聘一個剛畢業的學生，像我們這樣的計算物理學的本科研究項目在簡歷上會不會看起來很有趣？我一般認為自己與開發工作相鄰，但鑑於工作重點和日常操作的不同，我並不是一個真正的開發者，所以當我告訴學生，如果你將來想成為一個開發者，這是很有價值的，我不想對他們撒謊。<p>我假設如果你對本科生簡歷上的顯著或有價值的東西進行排名，像在一家公司實習的東西，首先是CS的本科研究項目，然後是為我們工作，然後是任何其他類型的研究經驗，與一般的計算沒有聯繫。這樣做對嗎？\n"
}