{
  "@type": "NewsArticle",
  "identifier": "2022--07--22--en--askhn--HackerNews--NewsArticle--32188691",
  "url": "https://news.ycombinator.com/item?id=32188691",
  "headline": "Ask HN: Iterating on Side Projects?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "(TL;DR: at bottom.)<p>A couple of years ago i used to work for a traditional company as a technical officer that had a lot of linear / related workflows (with many external deadlines) that didn't have any project management for any of it. Emails and &quot;final copy.xlsx&quot; was the only thing the company ever used besides printed sheets of paper.<p>I tried to use something like trello to keep on top of my work (which rapidly became &quot;everything&quot;), but because of the multitude of things I had to be on top of at once, I felt too restricted in the &quot;one row&quot; trello layout. I also didn't like that people could just move things back and forth and mess up my card columns.<p>So as a side project I started to build my own trello like application that had what I felt I needed:<p>* multiple &quot;rows&quot; of projects, each with different number of columns if needed.<p>* cards can only flow left to right. and only when they fill requirements (ie file attached fill a certain naming scheme, not too many cards in a particular stage.)<p>* projects can connect to each other, so the end of one project would flow into another.<p>I thought this was a great project and was tinkering away at it, and in talking to others about it I actually got a much better job out of it as a python developer, which was completely the opposite in workflow (more single focused, simple workflows, internal deadlines, etc).<p>Since then the project has sorta fallen by the wayside. I still think it has merit, but I'm not that close to the heat anymore. My job uses asana and I am pretty comfortable with the workflow I have now.<p>I've since tried to slim back my hacky project and make it to a more robust online Saas thing for others, but without the heat of solving my own problem, I don't feel like I can properly experience using my own tool. I merely have to rely on my memories of the chaos I was trying to solve.<p>I'm feeling conflicted now, because I really like the project idea. I try to use it now for my new job and other side projects, but I'm not its own target audience and I don't know if it quite works for where I am at now, should I be changing it to work for me? what if there's nothing I need to be improved yet, should I just put the project down, mark it as archived and move on?<p>To make matters worse, I really like the name/domain of the project. it's grown to its own little thing (almost like my pet) that has to sit nicely on the shelf and not be used.<p>I've shown my wife the project and she thinks that it would be a good tool for her (traditional) company to use as well, but she wants her company to already doing something like it, not for me to make it work for her company.<p>TL;DR: Should one continue to re-work side projects to your evolving requirements, or do you archive them and move on? do you bother with putting a side project &quot;out there&quot; even if you don't have a need for it anymore? even if you like it?<p>Edit: I'm not using this as self promotion, because it's no where near ready for public consumption, but if you want to see the project, it's at https://zukini.io - you can &quot;sign in anonymously&quot; if you wish, which will just generate a random user and log in.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "drekipus",
    "url": "https://news.ycombinator.com/user?id=drekipus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32188691",
  "sameAs": "https://news.ycombinator.com/item?id=32188691",
  "dateCreated": "2022-07-22T05:34:19.457Z",
  "datePublished": "2022-07-22T05:01:07.000Z",
  "dateModified": "2022-07-22T05:34:19.457Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 侧面项目的迭代？\n",
  "headline_zh-Hant": "Ask HN: 側面項目的迭代？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "(TL;DR: at bottom.)<p>几年前，我曾在一家传统公司担任技术官员，该公司有许多线性/相关工作流程（有许多外部截止日期），但没有任何项目管理。<p>我曾尝试使用类似trello的东西来保持我的工作（很快就变成了&quot;一切&quot;），但由于我必须同时处理大量的事情，我觉得在&quot;一排&quot;trello的布局中受到了太多限制。<p>因此，作为一个辅助项目，我开始建立我自己的类似trello的应用程序，它有我认为需要的东西：<p>* 多行&quot;行&quot;的项目，如果需要，每行有不同数量的列。<p>* 卡片只能从左到右流动。只有当它们满足要求时（即所附文件满足一定的命名方案，在一个特定阶段没有太多的卡片。 <p>* 项目可以相互连接，所以一个项目的结束会流入另一个项目。<p>我认为这是一个伟大的项目，并在修补它，在与其他人谈论它时，我实际上得到了一个更好的工作，作为一个python开发人员，它的工作流程完全相反（更单一的重点，简单的工作流程，内部期限，等等）。我仍然认为它有可取之处，但我不再那么接近热度了。我的工作使用asana，而且我对现在的工作流程相当满意。<p>后来，我试图将我的黑客项目瘦身，使其成为一个更强大的在线Saas东西，供他人使用，但如果没有解决自己问题的热度，我觉得我无法正确体验使用自己的工具。我只是不得不依赖我对我试图解决的混乱的记忆。<p>我现在感到很矛盾，因为我真的很喜欢这个项目的想法。我现在试着把它用于我的新工作和其他副业，但我不是它自己的目标受众，我不知道它是否完全适合我现在的情况，我是否应该改变它来为我工作？如果没有什么我需要改进的地方，我是否应该把项目放下，把它标记为存档并继续前进？<p>更糟糕的是，我真的喜欢这个项目的名字/域名。<p>我给我妻子看了这个项目，她认为这对她的（传统）公司来说也是一个很好的工具，但她希望她的公司已经在做类似的事情，而不是让我让它为她的公司工作。 <p>TL;DR：你应该继续按照你不断变化的要求重新制作副业，还是将它们归档并继续前进？即使你不再需要一个副业，你是否还要将它放在那里？ <p>编辑：我不会用这个来自我宣传，因为它还没有准备好供公众使用，但如果你想看这个项目，它在https://zukini.io - 你可以&quot;匿名登录&quot;，如果你愿意，这将只是生成一个随机用户并登录。\n",
  "description_zh-Hant": "(TL;DR: at bottom.)<p>幾年前，我曾在一家傳統公司擔任技術官員，該公司有許多線性/相關工作流程（有許多外部截止日期），但沒有任何項目管理。<p>我曾嘗試使用類似trello的東西來保持我的工作（很快就變成了&quot;一切&quot;），但由於我必須同時處理大量的事情，我覺得在&quot;一排&quot;trello的佈局中受到了太多限制。<p>因此，作為一個輔助項目，我開始建立我自己的類似trello的應用程序，它有我認為需要的東西：<p>* 多行&quot;行&quot;的項目，如果需要，每行有不同數量的列。<p>* 卡片只能從左到右流動。只有當它們滿足要求時（即所附文件滿足一定的命名方案，在一個特定階段沒有太多的卡片。 <p>* 項目可以相互連接，所以一個項目的結束會流入另一個項目。<p>我認為這是一個偉大的項目，並在修補它，在與其他人談論它時，我實際上得到了一個更好的工作，作為一個python開發人員，它的工作流程完全相反（更單一的重點，簡單的工作流程，內部期限，等等）。我仍然認為它有可取之處，但我不再那麼接近熱度了。我的工作使用asana，而且我對現在的工作流程相當滿意。<p>後來，我試圖將我的黑客項目瘦身，使其成為一個更強大的在線Saas東西，供他人使用，但如果沒有解決自己問題的熱度，我覺得我無法正確體驗使用自己的工具。我只是不得不依賴我對我試圖解決的混亂的記憶。<p>我現在感到很矛盾，因為我真的很喜歡這個項目的想法。我現在試著把它用於我的新工作和其他副業，但我不是它自己的目標受眾，我不知道它是否完全適合我現在的情況，我是否應該改變它來為我工作？如果沒有什麼我需要改進的地方，我是否應該把項目放下，把它標記為存檔並繼續前進？<p>更糟糕的是，我真的喜歡這個項目的名字/域名。<p>我給我妻子看了這個項目，她認為這對她的（傳統）公司來說也是一個很好的工具，但她希望她的公司已經在做類似的事情，而不是讓我讓它為她的公司工作。 <p>TL;DR：你應該繼續按照你不斷變化的要求重新制作副業，還是將它們歸檔並繼續前進？即使你不再需要一個副業，你是否還要將它放在那裡？ <p>編輯：我不會用這個來自我宣傳，因為它還沒有準備好供公眾使用，但如果你想看這個項目，它在https://zukini.io - 你可以&quot;匿名登錄&quot;，如果你願意，這將只是生成一個隨機用戶並登錄。\n"
}