{
  "@type": "NewsArticle",
  "identifier": "2022--06--06--en--askhn--HackerNews--NewsArticle--31642123",
  "url": "https://news.ycombinator.com/item?id=31642123",
  "headline": "Ask HN: Have You Burned Out?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am looking to discuss / talk to people who have burned out, whether or not you feel you've recovered.<p>I just got turned down for another job and I am at the end of my mental and emotional rope.<p>Tomorrow I have a second interview at a local retail store. I've been a web developer or software engineer for a decade but increasingly painful failures have ruined me as a person and I am lost and without purpose in life. I think I just need to give up on software, I no longer feel welcome or wanted.<p>I have read that burnout can take up to five years to be resolved, I'm about in year three at this point. It's kinda like a recession you can't see it coming but looking back its easier to see when it started and its root causes.<p>Even with resources (supportive wife, limited family, therapist) recovery is slow, difficult, confusing and not a straight path. I need a job and purpose before life can improve and I can find a daily existence that's not 90% stress. Until then every day is a catastrophe where I'm upset that I didn't solve &quot;the problem&quot; and all I can think about is fixing &quot;everything&quot; or I'll lose my wife, my house, my independence, my dignity...<p>If you are suffering from burnout I wish you luck in the eternal struggle for normalcy. I can't say it ever gets better, but try to be kind to yourself. Most of all be honest with yourself even if you can't be with others.<p>If this post in any way resonates with you feel free to respond or just yell into the void.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "dirtybirdnj",
    "url": "https://news.ycombinator.com/user?id=dirtybirdnj"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31642123",
  "sameAs": "https://news.ycombinator.com/item?id=31642123",
  "dateCreated": "2022-06-06T16:38:15.487Z",
  "datePublished": "2022-06-06T15:57:36.000Z",
  "dateModified": "2022-06-06T16:38:15.487Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 59
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 40
    }
  ],
  "headline_zh-Hans": "Ask HN: 你已经倦怠了吗？\n",
  "headline_zh-Hant": "Ask HN: 你已經倦怠了嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我想和那些已经倦怠的人讨论/交流，无论你是否觉得自己已经恢复了。<p>我刚刚被另一份工作拒绝了，我在精神和情感上已经走到了尽头。<p>明天我有一个当地零售店的第二次面试。我做了十年的网络开发或软件工程师，但越来越痛苦的失败毁了我这个人，我迷失了，没有了生活的目标。我想我只需要放弃软件，我不再感到受欢迎或被需要。<p>我读到过，职业倦怠可能需要五年的时间才能解决，我现在大约在第三年。这有点像经济衰退，你看不到它的到来，但回顾一下，你会更容易看到它是什么时候开始的，以及它的根源。<p>即使有资源（支持我的妻子、有限的家庭、治疗师），恢复也是缓慢、困难、混乱的，不是一条直线。我需要一份工作和目标，然后才能改善生活，才能找到一种没有90%压力的日常存在。在那之前，每一天都是一场灾难，我为我没有解决&quot;问题&quot;而感到不安，我所想的是解决&quot;一切&quot;，否则我会失去我的妻子、我的房子、我的独立、我的尊严...<p>如果你正在遭受倦怠，我祝你在为正常生活的永恒斗争中好运。我不能说它永远会好起来，但要努力对自己好一点。最重要的是要对自己诚实，即使你不能对别人诚实。<p>如果这个帖子以任何方式与你产生共鸣，请随时回应或对着虚空大吼。\n",
  "description_zh-Hant": "我想和那些已經倦怠的人討論/交流，無論你是否覺得自己已經恢復了。<p>我剛剛被另一份工作拒絕了，我在精神和情感上已經走到了盡頭。<p>明天我有一個當地零售店的第二次面試。我做了十年的網絡開發或軟件工程師，但越來越痛苦的失敗毀了我這個人，我迷失了，沒有了生活的目標。我想我只需要放棄軟件，我不再感到受歡迎或被需要。<p>我讀到過，職業倦怠可能需要五年的時間才能解決，我現在大約在第三年。這有點像經濟衰退，你看不到它的到來，但回顧一下，你會更容易看到它是什麼時候開始的，以及它的根源。<p>即使有資源（支持我的妻子、有限的家庭、治療師），恢復也是緩慢、困難、混亂的，不是一條直線。我需要一份工作和目標，然後才能改善生活，才能找到一種沒有90%壓力的日常存在。在那之前，每一天都是一場災難，我為我沒有解決&quot;問題&quot;而感到不安，我所想的是解決&quot;一切&quot;，否則我會失去我的妻子、我的房子、我的獨立、我的尊嚴...<p>如果你正在遭受倦怠，我祝你在為正常生活的永恆鬥爭中好運。我不能說它永遠會好起來，但要努力對自己好一點。最重要的是要對自己誠實，即使你不能對別人誠實。<p>如果這個帖子以任何方式與你產生共鳴，請隨時迴應或對著虛空大吼。\n"
}