{
  "@type": "NewsArticle",
  "identifier": "2022--06--04--en--askhn--HackerNews--NewsArticle--31624401",
  "url": "https://news.ycombinator.com/item?id=31624401",
  "headline": "Ask HN: Anyone else quickly losing confidence in Amazon?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I feel like every time I search for something I expect the products to be either fake, filled with fake reviews, broken when I receive them, or from a no-name fake brand that popped up last week.  It has become seemingly impossible to wade through the mess.<p>What's worse, there seems to be zero way to report these listings.  I tried submitting a review warning other customers about the fake reviews for a fake product, but the review was not approved.  In that particular instance, I was actively recommended a &quot;wasp trap&quot; by Amazon.  Curious, I saw it was rated 4.8.<p>Turns out the positive reviews were all for... a pet cemetery headstone (complete with photos, to make the issue completely unambiguous).  The listing itself was posted by a seller that had almost all negative reviews that were -- removed by Amazon!  The reason?  Amazon took responsibility, since it was fulfilled by Amazon.  The problem: none of the negative reviews had anything to do with things like shipping time.  They were all basically calling the product a scam.<p>This seems like a looming disaster for Amazon.  It baffles me that there is no way for customers to at least report these issues.  I've done most of my shopping for the last 15 years on Amazon, but I'm seriously considering stopping.  Is anyone else in this boat?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "d23",
    "url": "https://news.ycombinator.com/user?id=d23"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31624401",
  "sameAs": "https://news.ycombinator.com/item?id=31624401",
  "dateCreated": "2022-06-04T19:57:24.329Z",
  "datePublished": "2022-06-04T19:52:32.000Z",
  "dateModified": "2022-06-04T19:57:24.329Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 还有人对亚马逊迅速失去信心吗？\n",
  "headline_zh-Hant": "Ask HN: 還有人對亞馬遜迅速失去信心嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我觉得每次我搜索某样东西时，我都希望这些产品要么是假的，充满了虚假评论，在我收到它们时已经坏了，或者是来自上周突然出现的一个无名的假品牌。 <p>更糟糕的是，似乎没有任何方法可以报告这些列表。 我试着提交了一份评论，警告其他客户关于一个假产品的虚假评论，但评论没有被批准。 在那个特定的例子中，我被亚马逊积极推荐了一个&quot;黄蜂夹&quot;。 好奇之下，我看到它的评价是4.8.<p>原来好评都是为了......一个宠物墓地的墓碑（有照片，使问题完全不含糊）。 该清单本身是由一个卖家发布的，该卖家几乎所有的负面评论都被亚马逊删除了！为什么？ 原因是什么？ 亚马逊承担了责任，因为它是由亚马逊完成的。 问题是：所有的负面评论都与运输时间等事情无关。 他们基本上都说该产品是个骗局。<p>这对亚马逊来说似乎是一场迫在眉睫的灾难。 让我困惑的是，没有办法让客户至少报告这些问题。 在过去的15年中，我的大部分购物都是在亚马逊上完成的，但我正在认真考虑停止。 还有人处于这种状况吗？\n",
  "description_zh-Hant": "我覺得每次我搜索某樣東西時，我都希望這些產品要麼是假的，充滿了虛假評論，在我收到它們時已經壞了，或者是來自上週突然出現的一個無名的假品牌。 <p>更糟糕的是，似乎沒有任何方法可以報告這些列表。 我試著提交了一份評論，警告其他客戶關於一個假產品的虛假評論，但評論沒有被批准。 在那個特定的例子中，我被亞馬遜積極推薦了一個&quot;黃蜂夾&quot;。 好奇之下，我看到它的評價是4.8.<p>原來好評都是為了......一個寵物墓地的墓碑（有照片，使問題完全不含糊）。 該清單本身是由一個賣家發佈的，該賣家幾乎所有的負面評論都被亞馬遜刪除了！為什麼？ 原因是什麼？ 亞馬遜承擔了責任，因為它是由亞馬遜完成的。 問題是：所有的負面評論都與運輸時間等事情無關。 他們基本上都說該產品是個騙局。<p>這對亞馬遜來說似乎是一場迫在眉睫的災難。 讓我困惑的是，沒有辦法讓客戶至少報告這些問題。 在過去的15年中，我的大部分購物都是在亞馬遜上完成的，但我正在認真考慮停止。 還有人處於這種狀況嗎？\n"
}