{
  "@type": "NewsArticle",
  "identifier": "2022--07--06--en--askhn--HackerNews--NewsArticle--32002848",
  "url": "https://news.ycombinator.com/item?id=32002848",
  "headline": "Ask HN: My girlfriend of three years just broke up with me, how to move forward?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I had been with my girlfriend for three years, i knew we probably wouldn’t last forever but it kinda caught me off guard. I’ve already been moderately depressed so this just makes that worse. I haven’t even texted her, been trying to just move on and forget but it’s hard.<p>It sucks too because i really just want to talk to my dad because he always knew how to help me and what to say, but he passed three or four years ago so i feel very Alone.<p>I know it’s better to just move forward, should i block her on everything and just really quit social media? Should i just start grinding code and learning more? It’s sucks because i was trying to build for my portfolio to find and internship for next summer but i keep getting hit with hardships this summer that are making it hard for me to motivate myself. I guess if there’s anyone out there that read this and been in similar shoes, what is my best course of action",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "leach",
    "url": "https://news.ycombinator.com/user?id=leach"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32002848",
  "sameAs": "https://news.ycombinator.com/item?id=32002848",
  "dateCreated": "2022-07-06T16:39:40.038Z",
  "datePublished": "2022-07-06T15:58:32.000Z",
  "dateModified": "2022-07-06T16:39:40.038Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 9
    }
  ],
  "headline_zh-Hans": "Ask HN: 我谈了三年的女朋友刚刚和我分手，如何向前看？\n",
  "headline_zh-Hant": "Ask HN: 我談了三年的女朋友剛剛和我分手，如何向前看？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我和我的女朋友在一起三年了，我知道我们可能不会永远在一起，但这让我有点措手不及。我已经有了适度的抑郁症，所以这只是使情况变得更糟。我甚至没有给她发过短信，一直想继续前进，忘记一切，但这很难。<p>这也很糟糕，因为我真的只想和我父亲谈谈，因为他总是知道如何帮助我，说些什么，但他三四年前就去世了，所以我觉得很孤独。<p>我知道最好是继续前进，我是否应该屏蔽她的一切，真的退出社交媒体？我是否应该开始研磨代码和学习更多的东西？这很糟糕，因为我正试图为我的投资组合建立，以便在明年夏天找到实习机会，但我在这个夏天不断遇到困难，使我难以激励自己。我想，如果有谁读到这篇文章并有过类似的经历，我的最佳行动方案是什么？\n",
  "description_zh-Hant": "我和我的女朋友在一起三年了，我知道我們可能不會永遠在一起，但這讓我有點措手不及。我已經有了適度的抑鬱症，所以這只是使情況變得更糟。我甚至沒有給她發過短信，一直想繼續前進，忘記一切，但這很難。<p>這也很糟糕，因為我真的只想和我父親談談，因為他總是知道如何幫助我，說些什麼，但他三四年前就去世了，所以我覺得很孤獨。<p>我知道最好是繼續前進，我是否應該屏蔽她的一切，真的退出社交媒體？我是否應該開始研磨代碼和學習更多的東西？這很糟糕，因為我正試圖為我的投資組合建立，以便在明年夏天找到實習機會，但我在這個夏天不斷遇到困難，使我難以激勵自己。我想，如果有誰讀到這篇文章並有過類似的經歷，我的最佳行動方案是什麼？\n"
}