{
  "@type": "NewsArticle",
  "identifier": "2022--06--02--en--askhn--HackerNews--NewsArticle--31589233",
  "url": "https://news.ycombinator.com/item?id=31589233",
  "headline": "Ask HN: What's the name of that rubber coating crap, do you like it?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi, I don't throw away electronic equipment, I like to keep my old hardware in working condition to repurpose it for my projects. I got my old Nexus5 back from my storage room to repurpose it as SDR and, despite having stored it properly, with desiccant salt bags, in box, surrounded by two layers of pluriball, the rubber coat of the phone now is a nasty, sticky crap. I wasted time to completely remove that disgusting stuff using isopropyl alcohol, not having the proper solvent. This is a problem of a lot of electronic products , having that treatment with the only purpose, I guess, to obtain a better &quot;look and feel&quot; or to implement some kind of induced obsolescence reducing devices in perfect working condition a trap for flies. If you ask me, I'm sick and tired that my stuff literally decompose like corpses in my closets because someone think that nasty shit is cool. Youtube is full of peoples with the same problem, so I think it's time to say &quot;enough&quot;. Anyway, what's the name of that stuff?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "gabrielblack",
    "url": "https://news.ycombinator.com/user?id=gabrielblack"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31589233",
  "sameAs": "https://news.ycombinator.com/item?id=31589233",
  "dateCreated": "2022-06-02T13:54:07.295Z",
  "datePublished": "2022-06-01T23:00:18.000Z",
  "dateModified": "2022-06-02T13:54:07.295Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "Ask HN: 那个橡胶涂层的垃圾叫什么名字，你喜欢吗？\n",
  "headline_zh-Hant": "Ask HN: 那個橡膠塗層的垃圾叫什麼名字，你喜歡嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，我不丢弃电子设备，我喜欢保持我的旧硬件处于工作状态，以便为我的项目重新使用它。我把我的旧Nexus5从我的储藏室拿回来，想把它重新用作SDR，尽管我把它存放得很好，用干燥剂盐袋，放在盒子里，周围有两层pluriball，但手机的橡胶涂层现在是一个讨厌的、粘乎乎的垃圾。我浪费了时间用异丙醇来彻底清除这些恶心的东西，因为没有合适的溶剂。这是很多电子产品的问题，进行这种处理的唯一目的，我猜是为了获得更好的外观和感觉，或者实施某种诱导性的淘汰，使处于完美工作状态的设备成为苍蝇的陷阱。如果你问我，我已经厌倦了我的东西像尸体一样在我的衣柜里腐烂，因为有人认为那些恶心的东西很酷。Youtube上有很多人有同样的问题，所以我认为是时候说 \"够了 \"了。总之，那东西叫什么名字？\n",
  "description_zh-Hant": "你好，我不丟棄電子設備，我喜歡保持我的舊硬件處於工作狀態，以便為我的項目重新使用它。我把我的舊Nexus5從我的儲藏室拿回來，想把它重新用作SDR，儘管我把它存放得很好，用乾燥劑鹽袋，放在盒子裡，周圍有兩層pluriball，但手機的橡膠塗層現在是一個討厭的、粘乎乎的垃圾。我浪費了時間用異丙醇來徹底清除這些噁心的東西，因為沒有合適的溶劑。這是很多電子產品的問題，進行這種處理的唯一目的，我猜是為了獲得更好的外觀和感覺，或者實施某種誘導性的淘汰，使處於完美工作狀態的設備成為蒼蠅的陷阱。如果你問我，我已經厭倦了我的東西像屍體一樣在我的衣櫃裡腐爛，因為有人認為那些噁心的東西很酷。Youtube上有很多人有同樣的問題，所以我認為是時候說 \"夠了 \"了。總之，那東西叫什麼名字？\n"
}