{
  "@type": "NewsArticle",
  "identifier": "2022--07--30--en--askhn--HackerNews--NewsArticle--32287113",
  "url": "https://news.ycombinator.com/item?id=32287113",
  "headline": "Ask HN: How are fake AirPods spoofing the special interface on iOS,why no auth?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I recently came to own the highest end fake AirPods Pro on the market apparently which sell for the equivalent of $49 in USD in China and sell for $60-100 in US on the black market. They work surprisingly well. Sound quality is good. Not excellent/amazing like the real ones. And the noise cancellation doesn’t work.<p>From the outside appearance this thing looks 99% like the real one (I’ll post pics in a seperate comment). \nFor those who don’t know, AirPods get a special interface in iOS, special screens that no regular Bluetooth headset gets. a white box appears with an animated AirPods Pro sprite, it says the connection status when you pair to your device, battery status etc. AirPods also have a special interface in Bluetooth -&gt; My Devices -&gt; Info that shows all sorts of information about them, which the fake emulates perfectly. Everything works in the software except the ear tip test always passes and it says Coverage Expired where it should say Limited Warranty. Now doesn’t it seem a little weird how good these fakes are? An average person would clearly be fooled into thinking these were real if they didn’t know what to look for. It begs the question why isn’t there any sort of secure authentication method for the headphones to attest their legitimacy before identifying themselves as “AirPods Pro” in iOS in all its native interfaces, and if there is one-how was it bypassed (as of the latest iOS 16 u3 beta)? It’s actually kind of scary that a fake device was able to invoke the legitimate AirPods interfaces in my iPhone when I connected it. What are your thoughts on",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "unknownaccount",
    "url": "https://news.ycombinator.com/user?id=unknownaccount"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32287113",
  "sameAs": "https://news.ycombinator.com/item?id=32287113",
  "dateCreated": "2022-07-30T14:42:48.687Z",
  "datePublished": "2022-07-30T14:37:25.000Z",
  "dateModified": "2022-07-30T14:42:48.687Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 假AirPods是如何欺骗iOS上的特殊界面的，为什么没有授权？\n",
  "headline_zh-Hant": "Ask HN: 假AirPods是如何欺騙iOS上的特殊界面的，為什麼沒有授權？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我最近拥有了市场上最高端的假冒AirPods Pro，在中国售价相当于49美元，在美国的黑市上售价为60-100美元。它们出乎意料地好用。声音质量很好。不像真品那样出色/令人惊奇。<p>从外观上看，这个东西看起来99%像真的（我会在另一篇评论中张贴照片）。\n对于那些不知道的人来说，AirPods在iOS中得到了一个特殊的界面，普通蓝牙耳机没有的特殊屏幕。一个白色的盒子出现，上面有一个动画的AirPods Pro精灵，当你与设备配对时，它会显示连接状态，电池状态等。AirPods在蓝牙中也有一个特殊的界面--&gt;我的设备--&gt;信息，显示关于它们的各种信息，假货完美地模仿了这一点。除了耳尖测试总是通过，而且在应该写有限保修的地方写着覆盖范围过期，其他一切都在软件中运行。现在看来，这些假货有多好，不觉得有点奇怪吗？一个普通人如果不知道该怎么看，显然会被骗，以为这些是真的。这就引出了一个问题，为什么在iOS的所有原生界面中，在确认自己是 \"AirPods Pro \"之前，没有任何安全的认证方法来证明耳机的合法性，如果有的话，它是如何被绕过的（截至最新的iOS 16 u3 beta）？实际上，当我连接一个假设备时，它能够在我的iPhone中调用合法的AirPods接口，这有点可怕。你有什么想法？\n",
  "description_zh-Hant": "我最近擁有了市場上最高端的假冒AirPods Pro，在中國售價相當於49美元，在美國的黑市上售價為60-100美元。它們出乎意料地好用。聲音質量很好。不像真品那樣出色/令人驚奇。<p>從外觀上看，這個東西看起來99%像真的（我會在另一篇評論中張貼照片）。\n對於那些不知道的人來說，AirPods在iOS中得到了一個特殊的界面，普通藍牙耳機沒有的特殊屏幕。一個白色的盒子出現，上面有一個動畫的AirPods Pro精靈，當你與設備配對時，它會顯示連接狀態，電池狀態等。AirPods在藍牙中也有一個特殊的界面--&gt;我的設備--&gt;信息，顯示關於它們的各種信息，假貨完美地模仿了這一點。除了耳尖測試總是通過，而且在應該寫有限保修的地方寫著覆蓋範圍過期，其他一切都在軟件中運行。現在看來，這些假貨有多好，不覺得有點奇怪嗎？一個普通人如果不知道該怎麼看，顯然會被騙，以為這些是真的。這就引出了一個問題，為什麼在iOS的所有原生界面中，在確認自己是 \"AirPods Pro \"之前，沒有任何安全的認證方法來證明耳機的合法性，如果有的話，它是如何被繞過的（截至最新的iOS 16 u3 beta）？實際上，當我連接一個假設備時，它能夠在我的iPhone中調用合法的AirPods接口，這有點可怕。你有什麼想法？\n"
}