{
  "@type": "NewsArticle",
  "identifier": "2022--07--17--en--askhn--HackerNews--NewsArticle--32124602",
  "url": "https://news.ycombinator.com/item?id=32124602",
  "headline": "Ask HN: Need advice from veteran software developers",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been programming for 6 years and I feel I'm in a loop and not making a progress.<p>Basically I want to know is how to become better.<p>Few questions for you:<p>- how do you learn new codebase?<p>- do you ever stop struggling?<p>- what helped you become productive?<p>- are you 10x? do you know how to become 3x?<p>To me it feels no matter how much time passes I keep on struggling. Every ticket is a start of new torture. I learned design patterns but it didn't really help. I have read lot of code and written lot of code, but against code bases that are like 8 years old there is really no way to &quot;get it&quot;. There is just too much inconsistent abstractions going on. Too much complexity everywhere.<p>I don't consider myself stupid, but I just feel hopeless, like you would if you were a climate scientist and seeing world just produce more and more greenhouse gases despite all you said and did. Trying to stop unstoppable force.<p>I change jobs every 1-2 years and most of my career as a result has been in noob stage of learning new tools, codebase, framework, industry, etc. It takes like 1 year to even feel productive. So this is probably the big thing. But at few jobs things never got easier so had to leave, there it was politics, scrum.<p>Speaking of scrum/agile/points/crap/etc... wtf. How to take something vague, force you to give an estimate over 2 line description and then cry when it's wrong. I feel any team or company that uses scrum is masking for its incompetent management.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lifeplusplus",
    "url": "https://news.ycombinator.com/user?id=lifeplusplus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32124602",
  "sameAs": "https://news.ycombinator.com/item?id=32124602",
  "dateCreated": "2022-07-17T05:05:18.006Z",
  "datePublished": "2022-07-17T05:02:34.000Z",
  "dateModified": "2022-07-17T05:05:18.006Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 需要资深软件开发人员的建议\n",
  "headline_zh-Hant": "Ask HN: 需要資深軟件開發人員的建議\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我做了6年的编程，我觉得我在一个循环中，没有进步。<p>基本上我想知道的是如何变得更好。<p>有几个问题要问你：<p>-你如何学习新的代码库？<p>-你曾经停止挣扎吗？<p>-什么帮助你变得富有成效？<p>-你是10倍吗？你知道如何变成3倍吗？<p>对我来说，无论时间过去多少，我都在挣扎。每张票都是新的折磨的开始。我学习了设计模式，但它并没有真正的帮助。我读了很多代码，也写了很多代码，但面对8年前的代码库，我真的没有办法去了解它。这里有太多不一致的抽象概念了。<p>我不认为自己很笨，但我只是觉得没有希望，就像你是一个气候科学家，看到世界上产生越来越多的温室气体，尽管你说了很多，做了很多。<p>我每隔1-2年就换一次工作，因此我的大部分职业生涯都处于学习新工具、代码库、框架、行业等的新手阶段。我花了一年时间才感觉到有成效。所以这可能是最重要的事情。<p>说到Scrum/agile/point/crap/etc...wtf。如何把一些模糊的东西，强迫你给出一个超过2行描述的估计，然后在错误时哭泣。我觉得任何使用Scrum的团队或公司都在掩盖其无能的管理。\n",
  "description_zh-Hant": "我做了6年的編程，我覺得我在一個循環中，沒有進步。<p>基本上我想知道的是如何變得更好。<p>有幾個問題要問你：<p>-你如何學習新的代碼庫？<p>-你曾經停止掙扎嗎？<p>-什麼幫助你變得富有成效？<p>-你是10倍嗎？你知道如何變成3倍嗎？<p>對我來說，無論時間過去多少，我都在掙扎。每張票都是新的折磨的開始。我學習了設計模式，但它並沒有真正的幫助。我讀了很多代碼，也寫了很多代碼，但面對8年前的代碼庫，我真的沒有辦法去了解它。這裡有太多不一致的抽象概念了。<p>我不認為自己很笨，但我只是覺得沒有希望，就像你是一個氣候科學家，看到世界上產生越來越多的溫室氣體，儘管你說了很多，做了很多。<p>我每隔1-2年就換一次工作，因此我的大部分職業生涯都處於學習新工具、代碼庫、框架、行業等的新手階段。我花了一年時間才感覺到有成效。所以這可能是最重要的事情。<p>說到Scrum/agile/point/crap/etc...wtf。如何把一些模糊的東西，強迫你給出一個超過2行描述的估計，然後在錯誤時哭泣。我覺得任何使用Scrum的團隊或公司都在掩蓋其無能的管理。\n"
}