{
  "@type": "NewsArticle",
  "identifier": "2022--07--16--en--askhn--HackerNews--NewsArticle--32116964",
  "url": "https://news.ycombinator.com/item?id=32116964",
  "headline": "Ask HN: Do emoji help you in written communication?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "(Please answer if you are a neurodiverse person struggling to read other people's emotions in offline conversations: I'd love to hear your thoughts on this)<p>I often hear an opinion that there is no place for emoji in professional communication. Generally I avoid them myself, preferring other, lengthier means to express my feelings, but time to time I can use a smiley as an ice breaker. It is also pretty clear to me that whatever standard of professional communication developed many years ago, it is not set in stone: communications evolve together with our culture and we do not speak Shakespearean or the language of Victorian society anymore. Emoji are on track to become an universal and cross-cultural language that enriches our communication with empathy: why would we exclude such a powerful tool from our professional life? Do you use emoji at work? How do you feel when you see someone else using them? Is there any trend or a curious observation that you can share?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ivan_gammel",
    "url": "https://news.ycombinator.com/user?id=ivan_gammel"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32116964",
  "sameAs": "https://news.ycombinator.com/item?id=32116964",
  "dateCreated": "2022-07-16T11:22:45.817Z",
  "datePublished": "2022-07-16T11:16:15.000Z",
  "dateModified": "2022-07-16T11:22:45.817Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 表情符号对你的书面交流有帮助吗？\n",
  "headline_zh-Hant": "Ask HN: 表情符號對你的書面交流有幫助嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "(如果你是一个在离线对话中努力解读他人情绪的神经病患者，请回答。我很想听听你对这个问题的看法）<p>我经常听到一种观点，认为在专业交流中没有表情符号的位置。一般来说，我自己会避免使用它们，我更喜欢用其他更冗长的方式来表达我的感受，但有时我也会使用笑脸作为破冰的方式。我也很清楚，无论专业交流的标准是在多年前形成的，它都不是一成不变的：交流与我们的文化一起发展，我们不再说莎士比亚或维多利亚社会的语言了。表情符号有望成为一种普遍的、跨文化的语言，以移情的方式丰富我们的沟通：我们为什么要把这样一个强大的工具排除在我们的职业生活之外呢？你在工作中使用表情符号吗？当你看到别人使用它们时，你有什么感觉？是否有任何趋势或好奇的观察，你可以分享？\n",
  "description_zh-Hant": "(如果你是一個在離線對話中努力解讀他人情緒的神經病患者，請回答。我很想聽聽你對這個問題的看法）<p>我經常聽到一種觀點，認為在專業交流中沒有表情符號的位置。一般來說，我自己會避免使用它們，我更喜歡用其他更冗長的方式來表達我的感受，但有時我也會使用笑臉作為破冰的方式。我也很清楚，無論專業交流的標準是在多年前形成的，它都不是一成不變的：交流與我們的文化一起發展，我們不再說莎士比亞或維多利亞社會的語言了。表情符號有望成為一種普遍的、跨文化的語言，以移情的方式豐富我們的溝通：我們為什麼要把這樣一個強大的工具排除在我們的職業生活之外呢？你在工作中使用表情符號嗎？當你看到別人使用它們時，你有什麼感覺？是否有任何趨勢或好奇的觀察，你可以分享？\n"
}