{
  "@type": "NewsArticle",
  "identifier": "2022--07--24--en--askhn--HackerNews--NewsArticle--32213903",
  "url": "https://news.ycombinator.com/item?id=32213903",
  "headline": "Ask HN: Should I quit .NET programming to get away from enterprise-y work?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "In the first years of my career, I would talk to users, get to know their business domain and model it with them. I would find their problems, and then open up Balsamiq Mockups and put together something that would make their workday easier. If they liked it, I would have a cost/benefit conversation with the person paying the bills or some other stakeholders. Then if I got the green light, my team and I would build it with .NET and JavaScript. I loved my job.<p>10 years later and I'm now a senior developer, but I feel like my career is evolving backwards. I am now working on a tiny sliver of a huge system. I know nothing about the user or their business domain because they are so far away from my work. I'm clueless about how my work fits into the business needs because those decisions are made by someone I've never met high up a command chain. I don't get to find problems and creatively solve them. I don't get to see the moving parts of user needs, business needs, frontend needs and backend needs, nor do I get to engineer solutions for all those needs to effectively fit together. I hate my job.<p>How do I make myself attractive for employers with smaller projects? I've heard the suggestion that I should look for startup jobs, but my early projects were all in big companies and I still got to do smaller self-contained projects.<p>Is the problem .NET? If I switched career track to .Node.js, would I attract the kind of projects I love?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "unknownsky",
    "url": "https://news.ycombinator.com/user?id=unknownsky"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32213903",
  "sameAs": "https://news.ycombinator.com/item?id=32213903",
  "dateCreated": "2022-07-24T14:43:58.487Z",
  "datePublished": "2022-07-24T14:38:29.000Z",
  "dateModified": "2022-07-24T14:43:58.487Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我是否应该放弃.NET编程以摆脱企业级的工作？\n",
  "headline_zh-Hant": "Ask HN: 我是否應該放棄.NET編程以擺脫企業級的工作？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在我职业生涯的最初几年，我会与用户交谈，了解他们的业务领域并与他们一起建模。我会找到他们的问题，然后打开Balsamiq Mockups，把一些东西放在一起，让他们的工作日更容易。如果他们喜欢它，我就会和付账的人或其他利益相关者进行成本/效益的对话。然后，如果我得到了绿灯，我和我的团队将用.NET和JavaScript构建它。我很喜欢我的工作。<p>10年后，我现在是一名高级开发人员，但我觉得我的职业生涯在向后发展。我现在在一个巨大的系统中只工作了一小部分。我对用户或他们的业务领域一无所知，因为他们离我的工作太远了。我对我的工作如何融入业务需求毫无头绪，因为这些决定是由我从未见过的高高在上的人做出的。我不能发现问题并创造性地解决它们。我没有机会看到用户需求、业务需求、前端需求和后端需求的移动部分，也没有机会为所有这些需求有效地结合在一起而设计解决方案。我讨厌我的工作。<p>我怎样才能让自己在小型项目中吸引雇主？我听到有人建议我应该寻找创业公司的工作，但是我早期的项目都是在大公司，我仍然可以做一些较小的独立项目。<p>问题是.NET吗？如果我把职业方向换成.Node.js，会不会吸引我喜欢的那种项目？\n",
  "description_zh-Hant": "在我職業生涯的最初幾年，我會與用戶交談，瞭解他們的業務領域並與他們一起建模。我會找到他們的問題，然後打開Balsamiq Mockups，把一些東西放在一起，讓他們的工作日更容易。如果他們喜歡它，我就會和付賬的人或其他利益相關者進行成本/效益的對話。然後，如果我得到了綠燈，我和我的團隊將用.NET和JavaScript構建它。我很喜歡我的工作。<p>10年後，我現在是一名高級開發人員，但我覺得我的職業生涯在向後發展。我現在在一個巨大的系統中只工作了一小部分。我對用戶或他們的業務領域一無所知，因為他們離我的工作太遠了。我對我的工作如何融入業務需求毫無頭緒，因為這些決定是由我從未見過的高高在上的人做出的。我不能發現問題並創造性地解決它們。我沒有機會看到用戶需求、業務需求、前端需求和後端需求的移動部分，也沒有機會為所有這些需求有效地結合在一起而設計解決方案。我討厭我的工作。<p>我怎樣才能讓自己在小型項目中吸引僱主？我聽到有人建議我應該尋找創業公司的工作，但是我早期的項目都是在大公司，我仍然可以做一些較小的獨立項目。<p>問題是.NET嗎？如果我把職業方向換成.Node.js，會不會吸引我喜歡的那種項目？\n"
}