{
  "@type": "NewsArticle",
  "identifier": "2022--06--07--en--askhn--HackerNews--NewsArticle--31649726",
  "url": "https://news.ycombinator.com/item?id=31649726",
  "headline": "Ask HN: Can you recover from burnout without switching jobs?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been at my employer (unicorn startup) for several years now, and have worked myself to a staff+ role. I burned out pretty badly last year. I've been slowly coming back from that: a moderate workload, better separation between work and not-work hours, etc. I'm better now, but the enthusiasm/enjoyment I had before is totally gone, replaced with a knee-jerk cynicism/fatalism that I don't really like. All of my personal expectations for performance are also anchored at what I did at an unsustainable pace, which makes it hard to feel good about what I'm contributing now (I still get decent reviews even if I'm not a star performer anymore).<p>Separately, I feel like I'm in a rut. I've done more or less the same thing for a couple years now, and I've done all the growing I'm going to in that function. I'm aware of other opportunities within the org, but the lingering burnout/cynicism/fatalism make it hard to get excited about them.<p>My first reaction is to take a couple months as a breather, and get a fresh start at a new job; leaving baggage behind, hopefully not working myself to burnout again. Aside from burnout, I do really like my company, though – the people are fun, the product is interesting, the pay is good, etc. If I could confidently address the issues above without leaving, I would.<p>I'm curious if anyone has managed to turn around a situation like this without getting a new job. What did you do? If you switched projects/roles within the same company, was that enough of a reset? Did you end up staying for a while afterwards, or were you gone anyway in short order?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "annoyingcyclist",
    "url": "https://news.ycombinator.com/user?id=annoyingcyclist"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31649726",
  "sameAs": "https://news.ycombinator.com/item?id=31649726",
  "dateCreated": "2022-06-07T04:20:06.269Z",
  "datePublished": "2022-06-07T03:56:17.000Z",
  "dateModified": "2022-06-07T04:20:06.269Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 不换工作就能从倦怠中恢复吗？\n",
  "headline_zh-Hant": "Ask HN: 不換工作就能從倦怠中恢復嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在我的雇主（独角兽创业公司）已经工作了几年，并把自己锻炼成一个员工以上的角色。去年，我被严重烧伤了。我一直在慢慢恢复过来：适度的工作量，更好地将工作和非工作时间分开，等等。我现在好多了，但之前的热情/乐趣完全消失了，取而代之的是一种我不太喜欢的膝跳式的嘲讽/宿命论。我个人对业绩的所有期望也都锚定在我以不可持续的速度所做的事情上，这使得我很难对我现在的贡献感到满意（即使我不再是一个明星演员，我仍然得到了体面的评价）。<p>单独来说，我觉得我正处于一个困境。几年来，我一直在做差不多相同的事情，而且我已经完成了我在这一职能方面的所有成长。我知道公司内部还有其他的机会，但是挥之不去的倦怠感/民族主义/宿命论让我很难对它们感到兴奋。<p>我的第一反应是花几个月的时间喘口气，在新的工作中重新开始；把包袱留在身后，希望不要再把自己搞得疲惫不堪。除了倦怠之外，我确实很喜欢我的公司--人们很有趣，产品也很有趣，工资也很高，等等。如果我可以在不离开的情况下自信地解决上述问题，我会的。<p>我很好奇，是否有人在没有找到新工作的情况下成功地扭转了这样的局面。你是怎么做的？如果你在同一家公司里换了项目/角色，这足以让你重新振作起来吗？你后来是继续呆了一段时间，还是在短时间内就离开了？\n",
  "description_zh-Hant": "我在我的僱主（獨角獸創業公司）已經工作了幾年，並把自己鍛鍊成一個員工以上的角色。去年，我被嚴重燒傷了。我一直在慢慢恢復過來：適度的工作量，更好地將工作和非工作時間分開，等等。我現在好多了，但之前的熱情/樂趣完全消失了，取而代之的是一種我不太喜歡的膝跳式的嘲諷/宿命論。我個人對業績的所有期望也都錨定在我以不可持續的速度所做的事情上，這使得我很難對我現在的貢獻感到滿意（即使我不再是一個明星演員，我仍然得到了體面的評價）。<p>單獨來說，我覺得我正處於一個困境。幾年來，我一直在做差不多相同的事情，而且我已經完成了我在這一職能方面的所有成長。我知道公司內部還有其他的機會，但是揮之不去的倦怠感/民族主義/宿命論讓我很難對它們感到興奮。<p>我的第一反應是花幾個月的時間喘口氣，在新的工作中重新開始；把包袱留在身後，希望不要再把自己搞得疲憊不堪。除了倦怠之外，我確實很喜歡我的公司--人們很有趣，產品也很有趣，工資也很高，等等。如果我可以在不離開的情況下自信地解決上述問題，我會的。<p>我很好奇，是否有人在沒有找到新工作的情況下成功地扭轉了這樣的局面。你是怎麼做的？如果你在同一家公司裡換了項目/角色，這足以讓你重新振作起來嗎？你後來是繼續呆了一段時間，還是在短時間內就離開了？\n"
}