{
  "@type": "NewsArticle",
  "identifier": "2022--04--15--en--askhn--HackerNews--NewsArticle--31036843",
  "url": "https://news.ycombinator.com/item?id=31036843",
  "headline": "Ask HN: What can an engaged citizen do to contribute to the world?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "(Note: This is not a criticism-post although it might sound like it.)<p>What can an engaged citizen do to contribute to the world?<p>Sure, we can vote, we can protest (at least in North America), but what else can we do to help steer our society forward? What are some things that we, as ordinary people with bills to pay and mouths to feed, can do in our daily lives to contribute constructively towards positive social change?<p>Write a book? Make art? Make music?<p>Study science? Study culture? Research the world's problems? Innovate solutions?<p>Be a better parent, spouse, family member? A better boss, employee, colleague? A better friend, neighbor, stranger?<p>Listen more? Understand more? Love more? Take better care of yourself so you can be more present to the world and all the people in it?<p>These all sound great of course, but the key question is, of the ones that we can do, how do we make it significant and concrete enough to matter?<p>For example, how do we make actions like reading books and exchanging ideas on the internet <i>non-trivial</i>?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31036843",
  "sameAs": "https://news.ycombinator.com/item?id=31036843",
  "dateCreated": "2022-04-15T05:41:13.078Z",
  "datePublished": "2022-04-15T05:26:26.000Z",
  "dateModified": "2022-04-15T05:41:13.078Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 一个参与的公民可以做什么来为世界做出贡献？",
  "headline_zh-Hant": "Ask HN: 一個參與的公民可以做什麼來為世界做出貢獻？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "(注意：这不是一篇批评文章，尽管它听起来像。<p>一个参与的公民可以做什么来为世界做出贡献？<p>当然，我们可以投票，我们可以抗议（至少在北美），但我们还可以做什么来帮助引导我们的社会前进？作为需要支付账单、需要养家糊口的普通人，我们在日常生活中可以做哪些事情来为积极的社会变革做出建设性的贡献呢？搞艺术？做音乐？<p>学习科学？研究文化？研究世界的问题？创新解决方案？<p>做一个更好的父母、配偶、家庭成员？一个更好的老板、雇员、同事？一个更好的朋友、邻居、陌生人？<p>多听？更加理解？爱得更多？<p>这些听起来当然很好，但关键的问题是，在我们可以做的事情中，我们如何使它足够重要和具体？<p>例如，我们如何使像阅读书籍和在互联网上交流思想这样的行动变得<i>不琐碎</i>？",
  "description_zh-Hant": "(注意：這不是一篇批評文章，儘管它聽起來像。<p>一個參與的公民可以做什麼來為世界做出貢獻？<p>當然，我們可以投票，我們可以抗議（至少在北美），但我們還可以做什麼來幫助引導我們的社會前進？作為需要支付賬單、需要養家餬口的普通人，我們在日常生活中可以做哪些事情來為積極的社會變革做出建設性的貢獻呢？搞藝術？做音樂？<p>學習科學？研究文化？研究世界的問題？創新解決方案？<p>做一個更好的父母、配偶、家庭成員？一個更好的老闆、僱員、同事？一個更好的朋友、鄰居、陌生人？<p>多聽？更加理解？愛得更多？<p>這些聽起來當然很好，但關鍵的問題是，在我們可以做的事情中，我們如何使它足夠重要和具體？<p>例如，我們如何使像閱讀書籍和在互聯網上交流思想這樣的行動變得<i>不瑣碎</i>？"
}