{
  "@type": "NewsArticle",
  "identifier": "2022--07--22--en--askhn--HackerNews--NewsArticle--32193583",
  "url": "https://news.ycombinator.com/item?id=32193583",
  "headline": "Ask HN: Account terminated on Tumblr, zero contact",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "More than a week ago my girl's blog was terminated. She was kicked out of the session then at login got greeted with the stern message &quot;your account was terminated. You can contact support here&quot;. Or something along the lines. Well, support didn't come around answering all these days and she slipped into a reclusive episode, because in her major depression, she believed the blog was her only accomplishment in life. Yeah, the hellsite was known for supporting those in trouble, those lonely, those misunderstood. Until now, at least. On the other hand I've been (on my own tumblr) contacted in the last week by the regular amount of hookers (dozens) and they're all fine, spreading their porn and spam, against all the reports I ever did. But no, instead they had to terminate an active account with 9k followers, posting daily for the last three years original street photography and reblogging classical art, flowers and cats. Maybe also Tumblr is going the way of big social media, random automated moderation and zero humanity? The messages I got from other fellow tumblers tell me this was not a singular case, so looking from here and squinting a bit it seems like becoming a warmer home to hookers and crypto spam than to original creators - or to simple people trying to find a little bit of appreciation from strangers. Oh yes, I'm upset, upset for seeing her thrown out with the garbage, actually rather no, thrown out INSTEAD of the garbage. But is there something one can do to reach some human in Tumblr support? I'm level zero on Twitter so I tried to reach through engineering - which politely sent me back to support, and support doesn't bother replying (yes, I sent reminders). Ironically, when in the past I reported wrong button colors I had answers within two days...",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "soco",
    "url": "https://news.ycombinator.com/user?id=soco"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32193583",
  "sameAs": "https://news.ycombinator.com/item?id=32193583",
  "dateCreated": "2022-07-22T16:41:27.339Z",
  "datePublished": "2022-07-22T16:07:01.000Z",
  "dateModified": "2022-07-22T16:41:27.339Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: Tumblr上的账户被终止，零联系\n",
  "headline_zh-Hant": "Ask HN: Tumblr上的賬戶被終止，零聯繫\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "一个多星期前，我女儿的博客被终止了。她被踢出了会话，然后在登录时收到了严厉的信息&quot;你的账户被终止了。你可以在这里联系技术支持&quot;。或类似的信息。好吧，这些天来，支持服务没有得到回应，她陷入了隐居状态，因为在她的严重抑郁症中，她认为博客是她生活中的唯一成就。是的，这个地狱网站以支持那些陷入困境的人，那些孤独的人，那些被误解的人而闻名。至少到现在为止。另一方面，我（在我自己的tumblr上）在上周被常规数量的妓女（几十个）联系过，他们都很好，传播他们的色情和垃圾邮件，反对我曾经做过的所有报告。但是没有，相反，他们不得不终止一个拥有9千粉丝的活跃账户，在过去三年里每天发布原创的街头摄影，并转发古典艺术、鲜花和猫咪。也许Tumblr也在走大社交媒体的路子，随机自动审核和零人性？我从其他同胞那里得到的信息告诉我，这不是一个单一的案例，所以从这里看，稍稍眯起眼睛，它似乎变成了一个妓女和加密货币垃圾邮件的温暖的家，而不是原创者--或试图从陌生人那里找到一点点赞赏的简单的人。哦，是的，我很不高兴，不高兴看到她和垃圾一起被扔掉，其实不，是代替垃圾被扔掉。但是，有没有什么办法可以让人在Tumblr上得到一些支持？我在Twitter上的水平为零，所以我试图通过工程部联系--工程部礼貌地把我送回支持部，而支持部也懒得回复（是的，我发了提醒信）。具有讽刺意味的是，当我过去报告错误的按钮颜色时，我在两天内就得到了答复......\n",
  "description_zh-Hant": "一個多星期前，我女兒的博客被終止了。她被踢出了會話，然後在登錄時收到了嚴厲的信息&quot;你的賬戶被終止了。你可以在這裡聯繫技術支持&quot;。或類似的信息。好吧，這些天來，支持服務沒有得到回應，她陷入了隱居狀態，因為在她的嚴重抑鬱症中，她認為博客是她生活中的唯一成就。是的，這個地獄網站以支持那些陷入困境的人，那些孤獨的人，那些被誤解的人而聞名。至少到現在為止。另一方面，我（在我自己的tumblr上）在上週被常規數量的妓女（幾十個）聯繫過，他們都很好，傳播他們的色情和垃圾郵件，反對我曾經做過的所有報告。但是沒有，相反，他們不得不終止一個擁有9千粉絲的活躍賬戶，在過去三年裡每天發佈原創的街頭攝影，並轉發古典藝術、鮮花和貓咪。也許Tumblr也在走大社交媒體的路子，隨機自動審核和零人性？我從其他同胞那裡得到的信息告訴我，這不是一個單一的案例，所以從這裡看，稍稍眯起眼睛，它似乎變成了一個妓女和加密貨幣垃圾郵件的溫暖的家，而不是原創者--或試圖從陌生人那裡找到一點點讚賞的簡單的人。哦，是的，我很不高興，不高興看到她和垃圾一起被扔掉，其實不，是代替垃圾被扔掉。但是，有沒有什麼辦法可以讓人在Tumblr上得到一些支持？我在Twitter上的水平為零，所以我試圖通過工程部聯繫--工程部禮貌地把我送回支持部，而支持部也懶得回覆（是的，我發了提醒信）。具有諷刺意味的是，當我過去報告錯誤的按鈕顏色時，我在兩天內就得到了答覆......\n"
}