{
  "@type": "NewsArticle",
  "identifier": "2022--06--14--en--askhn--HackerNews--NewsArticle--31739200",
  "url": "https://news.ycombinator.com/item?id=31739200",
  "headline": "Ask HN: Am I misunderstanding quantum mechanics?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "What I've gathered from my limited reading and research is the following:<p>1. The universe is fundamentally infinite and continuous, both on a macro and micro scale (infinitely large, and infinitely divisible)<p>2. Observation on a scale currently available to humanity interprets the continuous and infinite as finite and quantifiable - some information is lost in the process. A piece of reality we call an electron is shot at an another one, and we have learned how to observe the displacement of those pieces.<p>3. Quantum superposition is nothing but a translation of the reality of continuous fields into our quantifiable domain.<p>4. Measuring collapses the probability fields in a sense that no other way of measuring is available for us other than interpreting the continuous as a quantifiable and losing information in the process.<p>5. By repeating measurements and mapping the distribution out, we can get a rough estimate of the field that is observable through the interaction that we are using for measuring.<p>How far off am I? \nWhat are some good resources to read up on to deepen my understanding of what we currently know?<p>Thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "dojitza1",
    "url": "https://news.ycombinator.com/user?id=dojitza1"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31739200",
  "sameAs": "https://news.ycombinator.com/item?id=31739200",
  "dateCreated": "2022-06-14T13:40:04.055Z",
  "datePublished": "2022-06-14T13:33:07.000Z",
  "dateModified": "2022-06-14T13:40:04.055Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我是不是对量子力学有误解？\n",
  "headline_zh-Hant": "Ask HN: 我是不是對量子力學有誤解？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我从我有限的阅读和研究中收集到的信息如下：<p>1. 宇宙从根本上说是无限和连续的，无论是在宏观还是微观上（无限大，无限可分）<p>2.在人类目前可用的规模上的观察，将连续和无限解释为有限和可量化的--在这个过程中会丢失一些信息。我们称之为电子的一块现实被射向另一块，而我们已经学会了如何观察这些碎片的位移。<p>3.量子叠加只不过是将连续场的现实转化为我们的可量化领域。<p>4.测量在某种意义上折叠了概率场，除了将连续解释为可量化并在此过程中失去信息外，我们没有其他测量方法。通过重复测量和绘制分布图，我们可以得到一个粗略的估计，即通过我们用于测量的相互作用可以观察到的场。<p>我有多大的偏差？\n有什么好的资源可供阅读，以加深我对我们目前所知的理解？\n",
  "description_zh-Hant": "我從我有限的閱讀和研究中收集到的信息如下：<p>1. 宇宙從根本上說是無限和連續的，無論是在宏觀還是微觀上（無限大，無限可分）<p>2.在人類目前可用的規模上的觀察，將連續和無限解釋為有限和可量化的--在這個過程中會丟失一些信息。我們稱之為電子的一塊現實被射向另一塊，而我們已經學會了如何觀察這些碎片的位移。<p>3.量子疊加只不過是將連續場的現實轉化為我們的可量化領域。<p>4.測量在某種意義上摺疊了概率場，除了將連續解釋為可量化並在此過程中失去信息外，我們沒有其他測量方法。通過重複測量和繪製分佈圖，我們可以得到一個粗略的估計，即通過我們用於測量的相互作用可以觀察到的場。<p>我有多大的偏差？\n有什麼好的資源可供閱讀，以加深我對我們目前所知的理解？\n"
}