{
  "@type": "NewsArticle",
  "identifier": "2022--04--21--en--askhn--HackerNews--NewsArticle--31108069",
  "url": "https://news.ycombinator.com/item?id=31108069",
  "headline": "Ask HN: What's your personal pet theory on how humanity manages to end itself?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Some of the discussion on a recent post about genetically modified mosquitos got me thinking about this again, so was curious on what HN thinks will end the world.<p>I honestly think eventually advancements in genetic engineering and biology will lead to more and more potent bioweapons until someone manages to make one that ends it all.<p>I've always had this thought in my mind since I was young but now personally seeing COVID spread across the globe in a matter of weeks/months has just reaffirmed this belief and I really think it's only a matter of time before someone bioengineers a virus to kill everyone on the planet. If something can supposedly spread from a wet market(or lab if that's more your speed) in China to the entire world through pure chance (or accident) how hard can it be to do it on purpose once the technology is mature and advanced enough?<p>But I'd love to hear HN's takes on this and your own theories on how we meet our self-inflicted extinction.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Zircom",
    "url": "https://news.ycombinator.com/user?id=Zircom"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31108069",
  "sameAs": "https://news.ycombinator.com/item?id=31108069",
  "dateCreated": "2022-04-21T11:29:00.825Z",
  "datePublished": "2022-04-21T11:26:33.000Z",
  "dateModified": "2022-04-21T11:29:00.825Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 关于人类如何设法结束自己，你的个人宠物理论是什么？",
  "headline_zh-Hant": "Ask HN: 關於人類如何設法結束自己，你的個人寵物理論是什麼？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "最近关于转基因蚊子的一些讨论让我再次思考这个问题，所以我很好奇HN认为什么会结束世界。<p>说实话，我认为遗传工程和生物学的进步最终会导致越来越多的生物武器，直到有人设法制造出一个结束一切的武器。 <p>我从小就有这样的想法，但现在亲眼看到COVID在几周/几个月内就蔓延到了全球，这再次证实了我的信念，我真的认为，有人通过生物工程制造病毒来杀死地球上的所有人只是时间问题。如果有些东西可以通过纯粹的机会（或意外）从中国的湿货市场（或实验室，如果那更适合你的速度）传播到整个世界，那么一旦技术足够成熟和先进，故意这样做会有多难呢？",
  "description_zh-Hant": "最近關於轉基因蚊子的一些討論讓我再次思考這個問題，所以我很好奇HN認為什麼會結束世界。<p>說實話，我認為遺傳工程和生物學的進步最終會導致越來越多的生物武器，直到有人設法制造出一個結束一切的武器。 <p>我從小就有這樣的想法，但現在親眼看到COVID在幾周/幾個月內就蔓延到了全球，這再次證實了我的信念，我真的認為，有人通過生物工程製造病毒來殺死地球上的所有人只是時間問題。如果有些東西可以通過純粹的機會（或意外）從中國的溼貨市場（或實驗室，如果那更適合你的速度）傳播到整個世界，那麼一旦技術足夠成熟和先進，故意這樣做會有多難呢？"
}