{
  "@type": "NewsArticle",
  "identifier": "2022--04--22--en--askhn--HackerNews--NewsArticle--31129262",
  "url": "https://news.ycombinator.com/item?id=31129262",
  "headline": "Ask HN: What else can I do with my burning desire to ask people questions?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Since I can't seem to stop unloading Ask HN's here, I'm starting to wonder if there are perhaps more constructive ways of channeling my burning desire of asking people questions, maybe like podcasts or interviews or something?<p>Come to think of it, I've always loved to dig professors' brains during their office hours way back in university and just get inspired by their passion for their subject. And whenever there were particularly interesting speakers at conferences, I would dream of introducing myself and talking to them to soak up their wisdom.<p>But for all these cases, not only was I reluctant to continue the conversations because I was shy and nervous about it all, but also because I didn't actually know what I wanted to ask them. I had no questions in my head for them. I just knew that they are wise people that I would like to learn from.<p>For the Ask HN questions, most of them are self-serving in that they are questions I personally am curious about, many of which just spawn naturally as I poke around HN and think about my own endeavors.<p>But with interviews/podcasts, I would think the focus would be different? There would be some theme, I'm sure, but of what? The subjects they are known for, sure, but that seems a bit narrow?<p>I don't really have much ideas here, because it's always just been a fantasy, so I never got down to figuring out which questions to ask. Or is it the other way around, that because I couldn't think of questions, I could never bring the thought into reality... (drawing blank)<p>Does anyone know how interviewers and podcasters decide on their questions? How do they go about inviting the interviewees anyway? I've looked into this before but didn't get anything constructive to work with.<p>And, beyond interviews and podcasts, are there other ways of tapping into this desire to ask people questions?<p>PS. Another note here, is that I'm completely lost for words or ideas when I talk to people <i>in person</i>. I only come up with good questions when I've had time alone to churn through it. So this constraints stuff for sure.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31129262",
  "sameAs": "https://news.ycombinator.com/item?id=31129262",
  "dateCreated": "2022-04-22T23:10:46.120Z",
  "datePublished": "2022-04-22T22:57:24.000Z",
  "dateModified": "2022-04-22T23:10:46.120Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我还有什么可以做的，我有向人提问的强烈愿望？",
  "headline_zh-Hant": "Ask HN: 我還有什麼可以做的，我有向人提問的強烈願望？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "既然我似乎无法停止在这里卸下 \"问号\"，我开始怀疑是否有更有建设性的方式来引导我向人们提问的强烈愿望，也许就像播客或访谈之类的？<p>仔细想想，在大学期间，我总是喜欢在教授的办公时间里挖掘他们的大脑，并从他们对自己主题的热情中获得启发。每当会议上有特别有趣的演讲者时，我就会梦想着介绍自己并与他们交谈，吸收他们的智慧。<p>但在所有这些情况下，我不仅不愿意继续交谈，因为我对这一切感到害羞和紧张，而且还因为我实际上不知道我想问他们什么。我的脑子里没有任何问题要问他们。<p>对于Ask HN的问题，大部分都是我自己的问题，因为它们是我个人很好奇的问题，其中许多问题是我在HN周围打探和思考自己的努力时自然产生的。我肯定会有一些主题，但是是什么？他们所熟知的主题，当然，但这似乎有点狭窄？<p>我在这里并没有什么想法，因为这一直都只是一个幻想，所以我从来没有去想过要问哪些问题。还是反过来说，因为我想不出问题，所以我永远无法将想法带入现实...... (drawing blank)<p>有谁知道采访者和播客如何决定他们的问题？他们到底是如何去邀请被采访者的？我以前也研究过这个问题，但没有得到任何有建设性的东西。<p>而且，除了采访和播客之外，还有没有其他方法可以挖掘出这种向人提问的欲望？这里还有一点，就是当我与人交谈时，我完全不知道该怎么说，也不知道该怎么想，<i>当面</i>。只有当我有时间独自翻阅时，我才会想出好的问题。因此，这种约束的东西是肯定的。",
  "description_zh-Hant": "既然我似乎無法停止在這裡卸下 \"問號\"，我開始懷疑是否有更有建設性的方式來引導我向人們提問的強烈願望，也許就像播客或訪談之類的？<p>仔細想想，在大學期間，我總是喜歡在教授的辦公時間裡挖掘他們的大腦，並從他們對自己主題的熱情中獲得啟發。每當會議上有特別有趣的演講者時，我就會夢想著介紹自己並與他們交談，吸收他們的智慧。<p>但在所有這些情況下，我不僅不願意繼續交談，因為我對這一切感到害羞和緊張，而且還因為我實際上不知道我想問他們什麼。我的腦子裡沒有任何問題要問他們。<p>對於Ask HN的問題，大部分都是我自己的問題，因為它們是我個人很好奇的問題，其中許多問題是我在HN周圍打探和思考自己的努力時自然產生的。我肯定會有一些主題，但是是什麼？他們所熟知的主題，當然，但這似乎有點狹窄？<p>我在這裡並沒有什麼想法，因為這一直都只是一個幻想，所以我從來沒有去想過要問哪些問題。還是反過來說，因為我想不出問題，所以我永遠無法將想法帶入現實...... (drawing blank)<p>有誰知道採訪者和播客如何決定他們的問題？他們到底是如何去邀請被採訪者的？我以前也研究過這個問題，但沒有得到任何有建設性的東西。<p>而且，除了採訪和播客之外，還有沒有其他方法可以挖掘出這種向人提問的慾望？這裡還有一點，就是當我與人交談時，我完全不知道該怎麼說，也不知道該怎麼想，<i>當面</i>。只有當我有時間獨自翻閱時，我才會想出好的問題。因此，這種約束的東西是肯定的。"
}