{
  "@type": "NewsArticle",
  "identifier": "2022--06--26--en--askhn--HackerNews--NewsArticle--31886907",
  "url": "https://news.ycombinator.com/item?id=31886907",
  "headline": "Ask HN: How on earth are you using your Apple computer with external displays?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I own four different Apple computers -- a 2017 MacBook Pro, an M1 MacBook Air, an M1 MacBook Pro, and most recently a maxed out Mac Studio. I also have had in that timespan three different Windows desktops that I have built and a ThinkPad running Windows or Linux depending on the mood.<p>I have spent countless dollars on cables and adapters in an attempt to find the magic combination. I have read DisplayPort specs, I know every brand of certified cable. I now know way more than I would ever care to know about DisplayPort and HDMI protocols. I have tried 4 different brands and models of monitor. For one of those models, I had three of the exact same model. All combinations work flawlessly with anything that is not one of the Apple devices. I have all but eliminated any of these components being the problem.<p>Depending on the device and the day I will get:<p>- Visual artifacts like snow, lines, flickering<p>- Failure to support native resolution on any high resolution monitors<p>- Failure to support high refresh rates<p>- Forced scaling, detecting monitor as a TV and using interlacing<p>- Most reliably of all, failure to wake from sleep without plugging/unplugging; doing a dance with power cycling my monitor or device until it finally works, or just giving up and logging into my Windows PC because today I can't use my Apple computer<p>It's never all at once, but it's always at least one thing. In the time of owning any of these devices, I have without exaggeration, not once had the expected experience of sitting down at my desk and starting my day without fighting my computer to work properly with my monitor.<p>Searching the internet, I can't be alone. All of the problems I have, as far as I can tell, other people experience. And as far as I can tell, no one has an answer. I'm at a breaking point after ordering this $4k desktop Mac Studio and waiting 3 months for it to arrive. I hoped that, being a device that requires an external display, they at least worked it out with this one.<p>They did not.<p>So how does the entire professional industry working with Apple computers manage to start their day, every day, like this? Am I insane? Is no one else dealing with this? Are you all just using the built in display? This has been going on for YEARS for me, across multiple generations of devices.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "n42",
    "url": "https://news.ycombinator.com/user?id=n42"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31886907",
  "sameAs": "https://news.ycombinator.com/item?id=31886907",
  "dateCreated": "2022-06-26T22:35:18.734Z",
  "datePublished": "2022-06-26T19:07:45.000Z",
  "dateModified": "2022-06-26T22:35:18.734Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 44
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 61
    }
  ],
  "headline_zh-Hans": "Ask HN: 你到底是如何使用你的苹果电脑与外部显示器的？\n",
  "headline_zh-Hant": "Ask HN: 你到底是如何使用你的蘋果電腦與外部顯示器的？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我拥有四台不同的苹果电脑--一台2017年的MacBook Pro、一台M1 MacBook Air、一台M1 MacBook Pro，以及最近的一台最大的Mac Studio。在这个时间段里，我还拥有三台自己制作的不同的Windows台式机，以及一台运行Windows或Linux的ThinkPad，这取决于我的心情。我读过DisplayPort的规格，我知道每个品牌的认证电缆。我现在对DisplayPort和HDMI协议的了解远远超过我所关心的。我已经尝试了4个不同品牌和型号的显示器。对于其中一个型号，我有三个完全相同的型号。所有的组合都能与任何不是苹果设备的东西完美地工作。我已经完全排除了这些组件是问题所在。 <p>取决于设备和我将得到的日子。 <p>- 视觉伪影，如雪花、线条、闪烁<p>- 无法支持任何高分辨率显示器的原始分辨率<p>- 无法支持高刷新率<p>- 强制缩放，将显示器检测为电视并使用隔行扫描<p>- 最可靠的是，无法从睡眠中唤醒，无需插拔插头。在我的显示器或设备的电源循环中跳舞，直到它最终工作，或者干脆放弃，登录我的Windows电脑，因为今天我不能使用我的苹果电脑<p>它从来没有一次过，但它总是至少有一件事。在拥有任何这些设备的时间里，毫不夸张地说，我没有一次有预期的经验，即坐在我的办公桌前开始我的一天，而不与我的电脑与我的显示器正常工作。<p>在互联网上搜索，我不可能是一个人。所有我遇到的问题，就我所知，其他人也都经历过。而据我所知，没有人有答案。在订购了这个价值4千美元的台式Mac Studio并等待了3个月后，我处于崩溃的边缘。我希望，作为一个需要外部显示器的设备，他们至少能解决这个问题。<p>他们没有。<p>那么，整个使用苹果电脑的专业行业是如何做到每天都这样开始他们的工作的？我是不是疯了？难道没有人处理这个问题吗？你们都只是在使用内置的显示器吗？对我来说，这种情况已经持续了好几年，跨越了好几代的设备。\n",
  "description_zh-Hant": "我擁有四臺不同的蘋果電腦--一臺2017年的MacBook Pro、一臺M1 MacBook Air、一臺M1 MacBook Pro，以及最近的一臺最大的Mac Studio。在這個時間段裡，我還擁有三臺自己製作的不同的Windows臺式機，以及一臺運行Windows或Linux的ThinkPad，這取決於我的心情。我讀過DisplayPort的規格，我知道每個品牌的認證電纜。我現在對DisplayPort和HDMI協議的瞭解遠遠超過我所關心的。我已經嘗試了4個不同品牌和型號的顯示器。對於其中一個型號，我有三個完全相同的型號。所有的組合都能與任何不是蘋果設備的東西完美地工作。我已經完全排除了這些組件是問題所在。 <p>取決於設備和我將得到的日子。 <p>- 視覺偽影，如雪花、線條、閃爍<p>- 無法支持任何高分辨率顯示器的原始分辨率<p>- 無法支持高刷新率<p>- 強制縮放，將顯示器檢測為電視並使用隔行掃描<p>- 最可靠的是，無法從睡眠中喚醒，無需插拔插頭。在我的顯示器或設備的電源循環中跳舞，直到它最終工作，或者乾脆放棄，登錄我的Windows電腦，因為今天我不能使用我的蘋果電腦<p>它從來沒有一次過，但它總是至少有一件事。在擁有任何這些設備的時間裡，毫不誇張地說，我沒有一次有預期的經驗，即坐在我的辦公桌前開始我的一天，而不與我的電腦與我的顯示器正常工作。<p>在互聯網上搜索，我不可能是一個人。所有我遇到的問題，就我所知，其他人也都經歷過。而據我所知，沒有人有答案。在訂購了這個價值4千美元的臺式Mac Studio並等待了3個月後，我處於崩潰的邊緣。我希望，作為一個需要外部顯示器的設備，他們至少能解決這個問題。<p>他們沒有。<p>那麼，整個使用蘋果電腦的專業行業是如何做到每天都這樣開始他們的工作的？我是不是瘋了？難道沒有人處理這個問題嗎？你們都只是在使用內置的顯示器嗎？對我來說，這種情況已經持續了好幾年，跨越了好幾代的設備。\n"
}