{
  "@type": "NewsArticle",
  "identifier": "2022--07--17--en--askhn--HackerNews--NewsArticle--32131497",
  "url": "https://news.ycombinator.com/item?id=32131497",
  "headline": "Ask HN: I need some advice from intelligent people on my situation",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "The following situation is at hand.<p>I am in my early 20s and I am “grinding” my way through life. I am pursuing different fields of interest like:<p>+ Investing<p>+ Practicing Martial Arts<p>+ Going to the gym<p>+ Studying AI (Distance learning university)<p>+ Reading business books (Right now – Ray Dalio – Principles)<p>I tried to involve people into my circle to go through this path with me. With more than 10 different people I tried to start something, every time something went wrong. People wouldn’t stick to the plan, or people would break loyalty for short term benefits while blending out the long-term outcomes (Me myself did mistakes also). Through a long time of self-reflection, I realized that my expectations in terms of work-ethic are very high. And this could be the thing why I can’t be with some types of people (I guess that in my close real-life environment there just isn’t that much potential to find – most of the people here can’t even get a basic school degree). Also, I am a very direct person, I’m not going to talk around your problems, and mine. They will be addressed immediately. Not caring about small talk is one of my “skills” also, if it is not somehow related to the goals that are set in place, my subconscious gets bored (I can’t really control that, if I try not to, it is hard).<p>So, for better clarification - the plan that I am following is:<p>1. Get money for moving out of mom’s apartment and starting my own business (In AI – with investment profits)<p>2. Creating a company in the field of artificial intelligence (don’t know the specific product or service yet)<p>3. And while doing that – maintaining Gym, MA, and book reading (self-improvement)<p>The most important one here is the actualization of the AI company.<p>These are a lot of questions, and it would be nice if somebody could give them a look:<p>+ So, I am here and asking you guys. Do you have any tips to find running mates or a small community with “smart” people that are believable and capable (Focus on: Business, AI, and self-improvement overall)?<p>+ Or what would you do in your early 20s if your endeavors would be similar as mine? Do you have any general suggestions to proceed better/more efficiently in these areas? (For e.g., good books, structured daily routines (which were beneficial for your progress and goals), networking strategies, tips on working effectively for a &quot;normal guy&quot; with big temptations but also huge ambitions.<p>+ How would you a structure a basic &quot;get-out-plan&quot; out of your mom's basement if you are hitting all these areas with the 20/80 principle? The money is by any means - simply put - too low, without a well-paying job.<p>+ Should I just patiently wait and follow my usual grind while studying and managing all these other areas with a 20 percent input (gym, reading self-development books etc.) or would you consider a smarter way to get out?<p>It would help me a lot to get thoughtful answers, thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "eupolin",
    "url": "https://news.ycombinator.com/user?id=eupolin"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32131497",
  "sameAs": "https://news.ycombinator.com/item?id=32131497",
  "dateCreated": "2022-07-17T21:43:36.439Z",
  "datePublished": "2022-07-17T21:27:39.000Z",
  "dateModified": "2022-07-17T21:43:36.439Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我需要聪明人对我的情况提供一些建议\n",
  "headline_zh-Hant": "Ask HN: 我需要聰明人對我的情況提供一些建議\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "以下是目前的情况。<p>我现在20岁出头，正在 \"磨 \"着我的人生道路。我在追求不同的兴趣领域，比如：<p>+ 投资<p>+ 练习武术<p>+ 去健身房<p>+ 学习人工智能（远程学习大学）<p>+ 阅读商业书籍（现在--雷-达里奥-原则）<p>我试图让人们加入我的圈子，和我一起走这条道路。我和10多个不同的人试图开始一些事情，但每次都出了问题。人们不会坚持计划，或者人们会为了短期利益打破忠诚度，而忽略了长期的结果（我自己也犯过错误）。通过长时间的自我反省，我意识到我对工作道德的要求非常高。这可能是我不能和某些类型的人在一起的原因（我想在我接近的现实生活环境中，没有那么多的潜力可言--这里的大多数人甚至连基本的学校学位都拿不到）。另外，我是一个非常直接的人，我不会绕着你的问题，和我的问题说话。它们将被立即解决。不在乎闲聊也是我的 \"技能 \"之一，如果它与设定的目标没有某种联系，我的潜意识就会感到厌烦（我真的无法控制，如果我努力不这样做，那就很难了）。<p>所以，为了更好地澄清--我所遵循的计划是：<p>1. 筹集资金搬出妈妈的公寓，开始我自己的生意（在人工智能领域--有投资利润）<p>2.在人工智能领域创建一个公司（还不知道具体的产品或服务）<p>3.在做这些的同时--保持健身房、MA和读书（自我提高）<p>这里最重要的是人工智能公司的实现。<p>这些是很多问题，如果有人能给他们看看就更好了：<p>所以，我在这里问你们。你有什么诀窍可以找到竞选伙伴或一个有 \"聪明人 \"的小社区，这些人都是可信的和有能力的（重点是：商业、人工智能和整体的自我提高）？<p>+ 或者，如果你的努力会和我类似，你会在20岁出头的时候做什么？你是否有任何一般性建议，以便在这些领域进行得更好/更有效？(例如，好书、结构化的日常生活（对你的进展和目标有益）、网络战略、对一个有巨大诱惑力但也有巨大野心的普通人来说有效工作的技巧。<p>+ 如果你用20/80原则来处理所有这些领域，你会如何构建一个基本的&quot;脱身计划&quot; 离开你妈妈的地下室？<p>+ 我是否应该耐心等待，在学习和管理所有这些其他领域的20%的投入（健身房、阅读自我发展书籍等）的同时，遵循我一贯的磨练，或者你会考虑一个更聪明的方法来摆脱困境？\n",
  "description_zh-Hant": "以下是目前的情況。<p>我現在20歲出頭，正在 \"磨 \"著我的人生道路。我在追求不同的興趣領域，比如：<p>+ 投資<p>+ 練習武術<p>+ 去健身房<p>+ 學習人工智能（遠程學習大學）<p>+ 閱讀商業書籍（現在--雷-達里奧-原則）<p>我試圖讓人們加入我的圈子，和我一起走這條道路。我和10多個不同的人試圖開始一些事情，但每次都出了問題。人們不會堅持計劃，或者人們會為了短期利益打破忠誠度，而忽略了長期的結果（我自己也犯過錯誤）。通過長時間的自我反省，我意識到我對工作道德的要求非常高。這可能是我不能和某些類型的人在一起的原因（我想在我接近的現實生活環境中，沒有那麼多的潛力可言--這裡的大多數人甚至連基本的學校學位都拿不到）。另外，我是一個非常直接的人，我不會繞著你的問題，和我的問題說話。它們將被立即解決。不在乎閒聊也是我的 \"技能 \"之一，如果它與設定的目標沒有某種聯繫，我的潛意識就會感到厭煩（我真的無法控制，如果我努力不這樣做，那就很難了）。<p>所以，為了更好地澄清--我所遵循的計劃是：<p>1. 籌集資金搬出媽媽的公寓，開始我自己的生意（在人工智能領域--有投資利潤）<p>2.在人工智能領域創建一個公司（還不知道具體的產品或服務）<p>3.在做這些的同時--保持健身房、MA和讀書（自我提高）<p>這裡最重要的是人工智能公司的實現。<p>這些是很多問題，如果有人能給他們看看就更好了：<p>所以，我在這裡問你們。你有什麼訣竅可以找到競選夥伴或一個有 \"聰明人 \"的小社區，這些人都是可信的和有能力的（重點是：商業、人工智能和整體的自我提高）？<p>+ 或者，如果你的努力會和我類似，你會在20歲出頭的時候做什麼？你是否有任何一般性建議，以便在這些領域進行得更好/更有效？(例如，好書、結構化的日常生活（對你的進展和目標有益）、網絡戰略、對一個有巨大誘惑力但也有巨大野心的普通人來說有效工作的技巧。<p>+ 如果你用20/80原則來處理所有這些領域，你會如何構建一個基本的&quot;脫身計劃&quot; 離開你媽媽的地下室？<p>+ 我是否應該耐心等待，在學習和管理所有這些其他領域的20%的投入（健身房、閱讀自我發展書籍等）的同時，遵循我一貫的磨練，或者你會考慮一個更聰明的方法來擺脫困境？\n"
}