{
  "@type": "NewsArticle",
  "identifier": "2022--06--21--en--askhn--HackerNews--NewsArticle--31818473",
  "url": "https://news.ycombinator.com/item?id=31818473",
  "headline": "Ask HN: Can I start a tech company with mandatory 2 month yearly sabbaticals?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I really believe people need time to unwind and explore all aspects of life and interests and tech companies right now might have the luxury to afford us the same.<p>Vacations are great, but never cut it fully. Importantly, unlimited pto never works in the workers favor for some reason.<p>One of the ideas I’ve been mulling is mandating a vacation and a long one at that. I’ve heard many industries already take a fairly long summer break in EU, so I suppose this is similar.<p>One worry I’ve heard is our work will be delayed due to this break but maybe it won’t? I feel rejuvenated good engineers would be more productive in 10 months than worn down ones in 12.<p>There’s also the practical logistics of running an always on service, but I feel like for most tech companies this should be doable with a skeleton support staff (even if that) especially if we freeze the code weeks before we leave work.<p>Would love anyones thoughts on how this might work and what the pitfalls would be (and also to ask if this would entice the best engineers as much as I believe).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "entityresq",
    "url": "https://news.ycombinator.com/user?id=entityresq"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31818473",
  "sameAs": "https://news.ycombinator.com/item?id=31818473",
  "dateCreated": "2022-06-21T02:12:15.583Z",
  "datePublished": "2022-06-21T01:04:49.000Z",
  "dateModified": "2022-06-21T02:12:15.583Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 8
    }
  ],
  "headline_zh-Hans": "Ask HN: 我可以创办一家科技公司，每年强制规定两个月的休假吗？\n",
  "headline_zh-Hant": "Ask HN: 我可以創辦一家科技公司，每年強制規定兩個月的休假嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我真的相信人们需要时间来放松和探索生活和兴趣的方方面面，而科技公司现在可能有能力为我们提供同样的服务。<p>休假是很好的，但从来没有完全削减。重要的是，由于某些原因，无限制的临时工从来没有对工人有利。<p>我一直在考虑的一个想法是强制规定假期，而且是长假期。我听说很多行业在欧盟已经有了相当长的暑假，所以我想这是类似的。<p>我听说的一个担心是我们的工作会因为这个假期而被推迟，但也许不会。我觉得恢复活力的优秀工程师在10个月内会比12个月内疲惫不堪的工程师更有生产力。<p>还有一个实际的物流问题，即运行一个永远在线的服务，但我觉得对于大多数科技公司来说，这应该是可以做到的，特别是如果我们在下班前几周冻结了代码（即使如此）。\n",
  "description_zh-Hant": "我真的相信人們需要時間來放鬆和探索生活和興趣的方方面面，而科技公司現在可能有能力為我們提供同樣的服務。<p>休假是很好的，但從來沒有完全削減。重要的是，由於某些原因，無限制的臨時工從來沒有對工人有利。<p>我一直在考慮的一個想法是強制規定假期，而且是長假期。我聽說很多行業在歐盟已經有了相當長的暑假，所以我想這是類似的。<p>我聽說的一個擔心是我們的工作會因為這個假期而被推遲，但也許不會。我覺得恢復活力的優秀工程師在10個月內會比12個月內疲憊不堪的工程師更有生產力。<p>還有一個實際的物流問題，即運行一個永遠在線的服務，但我覺得對於大多數科技公司來說，這應該是可以做到的，特別是如果我們在下班前幾周凍結了代碼（即使如此）。\n"
}