{
  "@type": "NewsArticle",
  "identifier": "2022--06--22--en--askhn--HackerNews--NewsArticle--31837626",
  "url": "https://news.ycombinator.com/item?id=31837626",
  "headline": "Ask HN: How to get relevant dev experience white being unable to switch?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I graduated in a CS-related field about a year ago and have been working in a  non-IT role as a consultant/project manager on digital transformation projects. What sounded like an exciting topic to work on for past me turned out to be an endless journey of crafting powerpoint presentations and fighting corporate bureaucracy (and loosing!). It has now come to the point where I hate standing up in the morning and going to work because I know that I will spend the majority of my day on things I would consider to be meaningless by any scale.<p>Last week I happened to find a Golang book I got as a present a few years ago and decided to work through it. While doing so I re-discovered much of the joy I had when working on programming related projects back in university. I am now at the point where I am considering working further to be able to switch my career at some point.<p>Problem is, I am pretty much locked in my current job. I moved places, my partner switched companies and I have other financial obligations that don't allow me to sacrifice signifiant amounts of my salary. The city I live in also does not have a lot of other potential companies to work for. The remote alternatives I found are either US only (I'm in Germany) or require 1-2 years of relevant experience which I obviously don't have.<p>This leaves me wondering, are there any good alternatives to gather the relevant experience that are also respected by employers or am I really out of luck here?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "UnhppyCnsltnt",
    "url": "https://news.ycombinator.com/user?id=UnhppyCnsltnt"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31837626",
  "sameAs": "https://news.ycombinator.com/item?id=31837626",
  "dateCreated": "2022-06-22T16:38:12.480Z",
  "datePublished": "2022-06-22T15:49:54.000Z",
  "dateModified": "2022-06-22T16:38:12.480Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何获得相关的开发经验白无法转换？\n",
  "headline_zh-Hant": "Ask HN: 如何獲得相關的開發經驗白無法轉換？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大约一年前，我毕业于CS相关专业，一直在非IT领域担任数字转型项目的顾问/项目经理。对于过去的我来说，听起来是一个令人兴奋的工作主题，但结果却是一个无休止的制作Powerpoint演示文稿和与企业官僚主义作斗争的旅程（而且是失败的！）。现在已经到了这样的地步：我讨厌早上站起来去上班，因为我知道我一天中的大部分时间都会花在我认为没有任何意义的事情上。<p>上周我偶然发现了一本几年前作为礼物送给我的Golang书，并决定把它读完。在这样做的时候，我重新发现了我在大学时从事编程相关项目时的许多乐趣。我现在正在考虑进一步工作，以便能够在某个时候转换我的职业。<p>问题是，我几乎被锁定在我目前的工作中。我搬了家，我的伙伴换了公司，我还有其他的经济责任，不允许我牺牲大量的工资。我居住的城市也没有很多其他潜在的公司可供工作。我找到的远程替代方案要么是美国的（我在德国），要么是需要1-2年的相关经验，而我显然没有。<p>这让我想知道，有没有什么好的替代方案来收集相关经验，同时也受到雇主的尊重，或者我在这里真的没有运气？\n",
  "description_zh-Hant": "大約一年前，我畢業於CS相關專業，一直在非IT領域擔任數字轉型項目的顧問/項目經理。對於過去的我來說，聽起來是一個令人興奮的工作主題，但結果卻是一個無休止的製作Powerpoint演示文稿和與企業官僚主義作鬥爭的旅程（而且是失敗的！）。現在已經到了這樣的地步：我討厭早上站起來去上班，因為我知道我一天中的大部分時間都會花在我認為沒有任何意義的事情上。<p>上週我偶然發現了一本幾年前作為禮物送給我的Golang書，並決定把它讀完。在這樣做的時候，我重新發現了我在大學時從事編程相關項目時的許多樂趣。我現在正在考慮進一步工作，以便能夠在某個時候轉換我的職業。<p>問題是，我幾乎被鎖定在我目前的工作中。我搬了家，我的夥伴換了公司，我還有其他的經濟責任，不允許我犧牲大量的工資。我居住的城市也沒有很多其他潛在的公司可供工作。我找到的遠程替代方案要麼是美國的（我在德國），要麼是需要1-2年的相關經驗，而我顯然沒有。<p>這讓我想知道，有沒有什麼好的替代方案來收集相關經驗，同時也受到僱主的尊重，或者我在這裡真的沒有運氣？\n"
}