{
  "@type": "NewsArticle",
  "identifier": "2022--07--16--en--askhn--HackerNews--NewsArticle--32121363",
  "url": "https://news.ycombinator.com/item?id=32121363",
  "headline": "Ask HN: Should I move to Silicon Valley or remain in my small city?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This might be a simple question to answer for some, but as someone without a substantial financial fallback it is a bit hard for me to decide. I could use some advice or anecdotes.<p>I live in a small city in California about 4 hours from San Francisco. I like living here, it is quiet and mostly farms and nice scenery. However, there's no tech scene here.<p>I listen to some podcasts or watch youtube videos where successful venture capitalists tell people they need to move to Silicon Valley in order to build a company. These are mostly videos from the 2010s, prior to covid and shift to remote workplaces. My aspiration is to build a company, and I want to know if it is necessary to be physically in SV to do that.<p>Is their advice still valid in 2022? I have been to the bay area a few times, and while I enjoyed the time spent with my friends eating at nice restaurants or going for hikes, the quality of life there seemed really low between the tiny living spaces and the overall unsafe vibe. I've been to Los Angeles and San Diego, and while they were also chaotic they seemed way more livable and surprisingly safer.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "moomoo11",
    "url": "https://news.ycombinator.com/user?id=moomoo11"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32121363",
  "sameAs": "https://news.ycombinator.com/item?id=32121363",
  "dateCreated": "2022-07-16T19:56:00.763Z",
  "datePublished": "2022-07-16T19:54:16.000Z",
  "dateModified": "2022-07-16T19:56:00.763Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该搬到硅谷还是继续留在我的小城市？\n",
  "headline_zh-Hant": "Ask HN: 我應該搬到硅谷還是繼續留在我的小城市？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "对有些人来说，这可能是一个简单的问题，但作为一个没有实质性经济后盾的人，我有点难以决定。我可以使用一些建议或轶事。<p>我住在加州的一个小城市，离旧金山约4小时车程。我喜欢住在这里，这里很安静，大部分是农场，风景不错。然而，这里没有科技氛围。<p>我听一些播客或看youtube视频，其中成功的风险投资家告诉人们，他们需要搬到硅谷才能建立一个公司。这些大多是2010年代的视频，在covid和向远程工作场所转变之前。我的愿望是建立一个公司，我想知道是否有必要亲自到硅谷来做这件事。<p>他们的建议在2022年仍然有效吗？我曾经去过海湾地区几次，虽然我很喜欢和朋友一起在漂亮的餐厅吃饭或去爬山的时光，但那里的生活质量似乎真的很低，因为居住空间狭小，而且整体氛围不安全。我去过洛杉矶和圣地亚哥，虽然它们也很混乱，但似乎更适合居住，而且出乎意料地安全。\n",
  "description_zh-Hant": "對有些人來說，這可能是一個簡單的問題，但作為一個沒有實質性經濟後盾的人，我有點難以決定。我可以使用一些建議或軼事。<p>我住在加州的一個小城市，離舊金山約4小時車程。我喜歡住在這裡，這裡很安靜，大部分是農場，風景不錯。然而，這裡沒有科技氛圍。<p>我聽一些播客或看youtube視頻，其中成功的風險投資家告訴人們，他們需要搬到硅谷才能建立一個公司。這些大多是2010年代的視頻，在covid和向遠程工作場所轉變之前。我的願望是建立一個公司，我想知道是否有必要親自到硅谷來做這件事。<p>他們的建議在2022年仍然有效嗎？我曾經去過海灣地區幾次，雖然我很喜歡和朋友一起在漂亮的餐廳吃飯或去爬山的時光，但那裡的生活質量似乎真的很低，因為居住空間狹小，而且整體氛圍不安全。我去過洛杉磯和聖地亞哥，雖然它們也很混亂，但似乎更適合居住，而且出乎意料地安全。\n"
}