{
  "@type": "NewsArticle",
  "identifier": "2022--06--06--en--askhn--HackerNews--NewsArticle--31647179",
  "url": "https://news.ycombinator.com/item?id=31647179",
  "headline": "Ask HN: What Is My Job?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "throwaway since I have no interest in my coworkers seeing this...<p>I have been at my current job for about 8 years. Throughout that time what I have done has morphed and I am having trouble knowing what sort of job to pursue in my search for the next one. What I do on an average week is the following:<p>- Manage a small team of PMs that manage 2 different external design and development agencies\n- Review data from surveys, tests, analytics and use that inform basic UX work that I do, that then a contractor then extrapolates to proper UX, UI and Design files\n- Develop POC work to prove out product ideas or UX approaches. Basic stuff in SvelteKit, Handlebars, etc..\n- Push the company forward in moving from monolithic CMSs to headless. Push UX approaches based on research and re-susablity. I have proven success with this model bringing in 4-5MM in new revenue via this tech stack\n- Billing, Coaching, Roadmap Planning, Interviewing, etc..<p>I have about 18 years of work experience in digital. Mainly on the Project Manager, Product Manager and UX side. I enjoy being multi-faceted. Where I can think, design, pitch and prototype an idea before having my team develop it and then report on its success against predefined OKRs.<p>Given all of this, what job title, or type of job should I look at? Any advice is welcome!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway303293",
    "url": "https://news.ycombinator.com/user?id=throwaway303293"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31647179",
  "sameAs": "https://news.ycombinator.com/item?id=31647179",
  "dateCreated": "2022-06-06T23:25:48.279Z",
  "datePublished": "2022-06-06T22:23:55.000Z",
  "dateModified": "2022-06-06T23:25:48.279Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我的工作是什么？\n",
  "headline_zh-Hant": "Ask HN: 我的工作是什麼？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>我在目前的工作岗位上已经工作了大约8年。在这段时间里，我所做的事情已经发生了变化，我很难知道在寻找下一份工作时应该追求什么样的工作。我每周的工作内容如下：<p>- 管理一个由PM组成的小团队，管理两个不同的外部设计和开发机构\n- 审查来自调查、测试、分析的数据，并利用这些数据为我所做的基本用户体验工作提供信息，然后由承包商推断出适当的用户体验、用户界面和设计文件。\n- 开发POC工作，以证明产品理念或用户体验方法。在SvelteKit、Handlebars等方面的基本工作。\n- 推动公司从单一的CMSs向无头化发展。推动基于研究和可重用性的用户体验方法。我已经证明了这种模式的成功，通过这种技术栈带来了4-5百万的新收入。\n- <p>我在数字领域有18年的工作经验。主要是项目经理、产品经理和用户体验方面的工作。我喜欢做多面手。我可以在让我的团队开发一个想法之前，对其进行思考、设计、推介和原型化，然后根据预先定义的OKRs报告其成功。欢迎提出任何建议。\n",
  "description_zh-Hant": "<p>我在目前的工作崗位上已經工作了大約8年。在這段時間裡，我所做的事情已經發生了變化，我很難知道在尋找下一份工作時應該追求什麼樣的工作。我每週的工作內容如下：<p>- 管理一個由PM組成的小團隊，管理兩個不同的外部設計和開發機構\n- 審查來自調查、測試、分析的數據，並利用這些數據為我所做的基本用戶體驗工作提供信息，然後由承包商推斷出適當的用戶體驗、用戶界面和設計文件。\n- 開發POC工作，以證明產品理念或用戶體驗方法。在SvelteKit、Handlebars等方面的基本工作。\n- 推動公司從單一的CMSs向無頭化發展。推動基於研究和可重用性的用戶體驗方法。我已經證明了這種模式的成功，通過這種技術棧帶來了4-5百萬的新收入。\n- <p>我在數字領域有18年的工作經驗。主要是項目經理、產品經理和用戶體驗方面的工作。我喜歡做多面手。我可以在讓我的團隊開發一個想法之前，對其進行思考、設計、推介和原型化，然後根據預先定義的OKRs報告其成功。歡迎提出任何建議。\n"
}