{
  "@type": "NewsArticle",
  "identifier": "2022--07--06--en--askhn--HackerNews--NewsArticle--32006069",
  "url": "https://news.ycombinator.com/item?id=32006069",
  "headline": "Ask HN: How do you modify functions over 1000 lines long?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I recently started working at a startup whose code was developed under very intense business pressure. This combined with the attitude towards code needing to &quot;work&quot; and not code needing to be qualitative has lead to a messy codebase. One can argue that at least if the code _does_ work then it's ok, but we're dealing with many errors daily. Luckily we do have sentry and continuous deployment set-up (no CI though), so these errors can be fixed quickly when they are seen.<p>Needless to say, we don't have any tests.<p>The code is messy in most places, not all. We're working on improving the codebase, but I still feel like I'm not very well equipped to work in functions that has 10s of database queries, over 100 variables, nested if-statements, and if-statements with 5 or more checks all over the place.<p>I'm trying to learn testing, but under these circumstances it's still kind of difficult.<p>The positive side is that I do get a lot of time to read, research and learn, and I do get the freedom to try things out if they provide some form of benefit for us.<p>I consider myself a medior in terms of experience, this is my second job in programming.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "azeirah",
    "url": "https://news.ycombinator.com/user?id=azeirah"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32006069",
  "sameAs": "https://news.ycombinator.com/item?id=32006069",
  "dateCreated": "2022-07-06T20:26:51.882Z",
  "datePublished": "2022-07-06T20:03:21.000Z",
  "dateModified": "2022-07-06T20:26:51.882Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何修改超过1000行的函数？\n",
  "headline_zh-Hant": "Ask HN: 如何修改超過1000行的函數？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我最近开始在一家创业公司工作，该公司的代码是在非常大的商业压力下开发的。这种情况加上对代码需要 \"工作 \"而不是代码需要定性的态度，导致了混乱的代码库。人们可以争辩说，至少如果代码能够工作，那就可以了，但我们每天都在处理许多错误。幸运的是，我们有sentry和持续部署设置（虽然没有CI），所以这些错误可以在看到时迅速修复。<p>不用说，我们没有任何测试。<p>代码在大多数地方是混乱的，而不是全部。我们正在努力改进代码库，但我仍然觉得我不太适合在有10多个数据库查询、100多个变量、嵌套的if语句和到处都是5个以上检查的if语句的函数中工作。<p>我正在努力学习测试，但在这种情况下，还是有点困难。 <p>积极的一面是，我确实有很多时间来阅读、研究和学习，而且我确实可以自由地尝试一些东西，如果它们能给我们带来某种形式的好处的话。<p>就经验而言，我认为自己是一个中级人员，这是我在编程方面的第二份工作。\n",
  "description_zh-Hant": "我最近開始在一家創業公司工作，該公司的代碼是在非常大的商業壓力下開發的。這種情況加上對代碼需要 \"工作 \"而不是代碼需要定性的態度，導致了混亂的代碼庫。人們可以爭辯說，至少如果代碼能夠工作，那就可以了，但我們每天都在處理許多錯誤。幸運的是，我們有sentry和持續部署設置（雖然沒有CI），所以這些錯誤可以在看到時迅速修復。<p>不用說，我們沒有任何測試。<p>代碼在大多數地方是混亂的，而不是全部。我們正在努力改進代碼庫，但我仍然覺得我不太適合在有10多個數據庫查詢、100多個變量、嵌套的if語句和到處都是5個以上檢查的if語句的函數中工作。<p>我正在努力學習測試，但在這種情況下，還是有點困難。 <p>積極的一面是，我確實有很多時間來閱讀、研究和學習，而且我確實可以自由地嘗試一些東西，如果它們能給我們帶來某種形式的好處的話。<p>就經驗而言，我認為自己是一箇中級人員，這是我在編程方面的第二份工作。\n"
}