{
  "@type": "NewsArticle",
  "identifier": "2022--07--14--en--askhn--HackerNews--NewsArticle--32100524",
  "url": "https://news.ycombinator.com/item?id=32100524",
  "headline": "Ask HN: What makes you optimistic about the future?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I feel like we are living in uniquely pessimistic times, at least when compared to the last ~70 years. The world order is being challenged, and not for the better. Massive geopolitcal problems are ahead with no good prospects - continuing Russian aggression in Europe, looming aggression in Taiwan, gloomy prospects over Iran nuclear situation. The US may well see a new civil war in the next few decades. Demographics, particularly in Europe, are not looking good. There are climate change risks to look forward to. Deglobalisation will lead to less global economic efficiency/prosperity. Tech advancement appears to have stagnated, and in any case the dream of technological innovation making tomorrow better has been replaced with the reality of tech making a lot of our lives worse, disconnecting people, pitting people against each other, hijacking our attention.  Culturally, we seem to be getting worse at getting along with each other. Generally, we seem to have given up on making things better overall, and instead just focus on trying to prevent bad/worse outcomes. I can't remember when I last saw someone outline a positive vision of the world we are building with a rough idea of how to get there - mostly, anything referring to the future is some cyberpunk dystopia.<p>Given all the above, what makes you optimistic about the future? Why do you believe that the world of tomorrow will be better than the world of today? What do you look forward to in the world of the future?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "agent008t",
    "url": "https://news.ycombinator.com/user?id=agent008t"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32100524",
  "sameAs": "https://news.ycombinator.com/item?id=32100524",
  "dateCreated": "2022-07-14T19:41:53.622Z",
  "datePublished": "2022-07-14T19:31:57.000Z",
  "dateModified": "2022-07-14T19:41:53.622Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 是什么让你对未来感到乐观？\n",
  "headline_zh-Hant": "Ask HN: 是什麼讓你對未來感到樂觀？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我觉得我们正生活在一个独特的悲观时代，至少与过去70年相比是这样。世界秩序正在受到挑战，而且不是向好的方向发展。大量的地缘问题摆在面前，没有好的前景--俄罗斯在欧洲的持续侵略，台湾的迫在眉睫的侵略，伊朗核局势的黯淡前景。美国很可能在未来几十年内发生新的内战。人口统计学，特别是在欧洲，前景并不乐观。气候变化的风险值得期待。全球化将导致全球经济效率/繁荣的下降。技术进步似乎已经停滞不前，无论如何，技术创新使明天更美好的梦想已经被现实所取代，技术使我们的很多生活变得更糟，使人们失去联系，使人们相互对立，劫持了我们的注意力。 在文化上，我们似乎在彼此相处方面越来越差。一般来说，我们似乎已经放弃了让事情变得更好，而只是专注于试图防止糟糕/更糟糕的结果。我不记得我最后一次看到有人对我们正在建设的世界勾勒出一个积极的愿景，并对如何到达那里有一个粗略的想法--大多数情况下，任何提到未来的东西都是一些赛博朋克的二维码。<p>鉴于上述情况，是什么让你对未来感到乐观？为什么你相信明天的世界会比今天的世界更好？你对未来的世界有什么期待？\n",
  "description_zh-Hant": "我覺得我們正生活在一個獨特的悲觀時代，至少與過去70年相比是這樣。世界秩序正在受到挑戰，而且不是向好的方向發展。大量的地緣問題擺在面前，沒有好的前景--俄羅斯在歐洲的持續侵略，臺灣的迫在眉睫的侵略，伊朗核局勢的黯淡前景。美國很可能在未來幾十年內發生新的內戰。人口統計學，特別是在歐洲，前景並不樂觀。氣候變化的風險值得期待。全球化將導致全球經濟效率/繁榮的下降。技術進步似乎已經停滯不前，無論如何，技術創新使明天更美好的夢想已經被現實所取代，技術使我們的很多生活變得更糟，使人們失去聯繫，使人們相互對立，劫持了我們的注意力。 在文化上，我們似乎在彼此相處方面越來越差。一般來說，我們似乎已經放棄了讓事情變得更好，而只是專注於試圖防止糟糕/更糟糕的結果。我不記得我最後一次看到有人對我們正在建設的世界勾勒出一個積極的願景，並對如何到達那裡有一個粗略的想法--大多數情況下，任何提到未來的東西都是一些賽博朋克的二維碼。<p>鑑於上述情況，是什麼讓你對未來感到樂觀？為什麼你相信明天的世界會比今天的世界更好？你對未來的世界有什麼期待？\n"
}