{
  "@type": "NewsArticle",
  "identifier": "2022--06--13--en--askhn--HackerNews--NewsArticle--31733165",
  "url": "https://news.ycombinator.com/item?id=31733165",
  "headline": "Ask HN: Model Business as Markov Chains?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Is there an easy tool to sketch a business model as Markov Chains, estimate probabilities, uncertainties and starting values, and run Monte Carlo simulations to visualise the probability space of the outcomes given the input?<p>This could be immensely valuable to check your overall understanding of your market. Are your mental models in sync with your assumptions about the economy’s fundamentals and the underlying mechanisms of cause and effect? If your micro-models don’t add up to your macro-projections, you’re either having delusional dreams about the future OR your everyday decision making is impaired due to flawed models.<p>Such a simple model could give answers to highly complex questions, e.g.: how much additional money do we need to raise when inflation hits our input factors with 10%, while we limit our price hikes to 6.5%? What if our most important channel for leads gets 100% more expensive and 10% less effective? \nWhat I want is a mathematical model of cause and effect, written in the language of probabilities, translating micro-estimations into tangible long-term projections.<p>Financial planning via Excel sucks. This is what we need - or don’t we?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "nkmnz",
    "url": "https://news.ycombinator.com/user?id=nkmnz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31733165",
  "sameAs": "https://news.ycombinator.com/item?id=31733165",
  "dateCreated": "2022-06-13T23:56:57.761Z",
  "datePublished": "2022-06-13T23:55:22.000Z",
  "dateModified": "2022-06-13T23:56:57.761Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 将企业作为马尔可夫链的模型？\n",
  "headline_zh-Hant": "Ask HN: 將企業作為馬爾可夫鏈的模型？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "是否有一个简单的工具可以将商业模型勾勒成马尔科夫链，估计概率、不确定性和起始值，并运行蒙特卡洛模拟，以可视化输入结果的概率空间？你的心智模型是否与你对经济基本面和因果关系的基本机制的假设相一致？如果你的微观模型与你的宏观预测不一致，你要么对未来有妄想，要么你的日常决策由于模型的缺陷而受到影响。<p>这样一个简单的模型可以为高度复杂的问题提供答案，例如：当通货膨胀率达到10%，而我们的价格涨幅限制在6.5%时，我们需要增加多少钱？如果我们最重要的销售渠道的成本提高了100%，而效果却降低了10%，怎么办？\n我想要的是一个因果关系的数学模型，用概率的语言来写，把微观的估计转化为具体的长期预测。这就是我们需要的--或者说我们不需要？\n",
  "description_zh-Hant": "是否有一個簡單的工具可以將商業模型勾勒成馬爾科夫鏈，估計概率、不確定性和起始值，並運行蒙特卡洛模擬，以可視化輸入結果的概率空間？你的心智模型是否與你對經濟基本面和因果關係的基本機制的假設相一致？如果你的微觀模型與你的宏觀預測不一致，你要麼對未來有妄想，要麼你的日常決策由於模型的缺陷而受到影響。<p>這樣一個簡單的模型可以為高度複雜的問題提供答案，例如：當通貨膨脹率達到10%，而我們的價格漲幅限制在6.5%時，我們需要增加多少錢？如果我們最重要的銷售渠道的成本提高了100%，而效果卻降低了10%，怎麼辦？\n我想要的是一個因果關係的數學模型，用概率的語言來寫，把微觀的估計轉化為具體的長期預測。這就是我們需要的--或者說我們不需要？\n"
}