{
  "@type": "NewsArticle",
  "identifier": "2022--07--29--en--askhn--HackerNews--NewsArticle--32276126",
  "url": "https://news.ycombinator.com/item?id=32276126",
  "headline": "Ask HN: How to value your skills as a (former) sole proprietor?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, some quick context: I am 22, no college education, entirely self taught. Started coding when I was 15, spent an average of 30~ hours a week coding since then. I have been writing in TypeScript for about a year now, and it’s my most frequently used language as of late. Other than that, I have been writing JS code for about 3-4 years, Python for the same, as well as Java.<p>Anyways, back in 2019, I was enrolled in College for some courses. I had a few “side hustles” that played off my tech skills back then. One of those side hustles revolves around video games. When lockdown and quarantines hit early that year, my video game side hustle turned into a video game business due to all the extra demand from people staying at home.<p>I ended up dropping out of college to pursue this, and I don’t regret doing this— I was in school for something non-STEM/tech as I wasn’t confident that this was what I wanted to do with my career back then. I made a great deal of money from that little business, and I managed to not let it get to my head too much and put most of it into savings.<p>So, long story short, my business looks like it’s going to have to come to an end soon. I have enough saved to live for a few years without issue but ideally I’d like to have a job lined up to not have to eat into my savings when it comes time to pull the plug.<p>The issue is: all of my commercial / for-pay coding I have done has been for myself. I don’t have much in the way of a portfolio, as most of what I worked on was for my business, and not fit for public display (eg server side code, or Uber specific solutions/projects, or even possible publicity issues if I end up selling my company and cashing out).<p>I know that I am talented, I wouldn’t have been able to survive and run my business solo for so long if not. It’s just that due to the nature of my work (I had no employees, my business didn’t have much of a public presence), I have little proof of what I am capable of, and hardly any references.<p>Should I intentionally take whatever low hanging fruit I can get, or should I aim for the stars and settle for nothing less? I have maybe another 1-3 months of predictably OK revenue left with my business. After that I’ll have to start using my savings.<p>Thanks HN",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jknutson",
    "url": "https://news.ycombinator.com/user?id=jknutson"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32276126",
  "sameAs": "https://news.ycombinator.com/item?id=32276126",
  "dateCreated": "2022-07-29T12:54:59.135Z",
  "datePublished": "2022-07-29T12:39:57.000Z",
  "dateModified": "2022-07-29T12:54:59.135Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何评价你作为（前）独资经营者的技能？\n",
  "headline_zh-Hant": "Ask HN: 如何評價你作為（前）獨資經營者的技能？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，一些快速的背景。我今年22岁，没有受过大学教育，完全是自学。我15岁开始编码，从那时起，平均每周花30~小时编码。我使用TypeScript写了大约一年，这是我最近最常使用的语言。除此之外，我写JS代码大约有3-4年，Python也是如此，还有Java。<p>不管怎样，在2019年，我在大学里学习一些课程。那时我有一些 \"副业\"，利用我的技术技能。其中一项副业是围绕视频游戏展开的。当那年年初封锁和隔离的时候，我的视频游戏副业变成了视频游戏业务，因为所有留在家里的人都有额外的需求。<p>我最后从大学辍学来追求这个，我不后悔这样做--我在学校学的是非科技/技术，因为我当时没有信心这就是我想做的事业。我从那笔小生意中赚了很多钱，而且我设法不让它对我的头脑造成太大影响，并把大部分钱存入储蓄。<p>所以，长话短说，我的生意看起来很快就要结束了。我有足够的储蓄，可以顺利地生活几年，但理想的情况是，我希望能有一份工作，当我要拔掉插头的时候，不必吃我的储蓄。<p>问题是：我所做的所有商业/有偿编码都是为自己做的。我没有什么作品集，因为我所做的大部分工作都是为了我的生意，不适合公开展示（例如服务器端代码，或Uber特定的解决方案/项目，甚至可能的宣传问题，如果我最终出售我的公司并兑现）。<p>我知道我很有天赋，如果不是这样，我无法生存并独自经营我的生意这么久。只是由于我的工作性质（我没有雇员，我的企业没有什么公众形象），我几乎没有证据证明我的能力，也几乎没有任何参考资料。<p>我是否应该故意采取任何我可以得到的低垂的水果，或者我应该瞄准星星，不惜一切代价？我的业务可能还剩下1-3个月的可预测的收入。在那之后，我将不得不开始使用我的储蓄。<p>谢谢 HN\n",
  "description_zh-Hant": "嗨，HN，一些快速的背景。我今年22歲，沒有受過大學教育，完全是自學。我15歲開始編碼，從那時起，平均每週花30~小時編碼。我使用TypeScript寫了大約一年，這是我最近最常使用的語言。除此之外，我寫JS代碼大約有3-4年，Python也是如此，還有Java。<p>不管怎樣，在2019年，我在大學裡學習一些課程。那時我有一些 \"副業\"，利用我的技術技能。其中一項副業是圍繞視頻遊戲展開的。當那年年初封鎖和隔離的時候，我的視頻遊戲副業變成了視頻遊戲業務，因為所有留在家裡的人都有額外的需求。<p>我最後從大學輟學來追求這個，我不後悔這樣做--我在學校學的是非科技/技術，因為我當時沒有信心這就是我想做的事業。我從那筆小生意中賺了很多錢，而且我設法不讓它對我的頭腦造成太大影響，並把大部分錢存入儲蓄。<p>所以，長話短說，我的生意看起來很快就要結束了。我有足夠的儲蓄，可以順利地生活幾年，但理想的情況是，我希望能有一份工作，當我要拔掉插頭的時候，不必吃我的儲蓄。<p>問題是：我所做的所有商業/有償編碼都是為自己做的。我沒有什麼作品集，因為我所做的大部分工作都是為了我的生意，不適合公開展示（例如服務器端代碼，或Uber特定的解決方案/項目，甚至可能的宣傳問題，如果我最終出售我的公司並兌現）。<p>我知道我很有天賦，如果不是這樣，我無法生存並獨自經營我的生意這麼久。只是由於我的工作性質（我沒有僱員，我的企業沒有什麼公眾形象），我幾乎沒有證據證明我的能力，也幾乎沒有任何參考資料。<p>我是否應該故意採取任何我可以得到的低垂的水果，或者我應該瞄準星星，不惜一切代價？我的業務可能還剩下1-3個月的可預測的收入。在那之後，我將不得不開始使用我的儲蓄。<p>謝謝 HN\n"
}