{
  "@type": "NewsArticle",
  "identifier": "2022--07--12--en--askhn--HackerNews--NewsArticle--32075183",
  "url": "https://news.ycombinator.com/item?id=32075183",
  "headline": "Ask HN: Why are property limits so fuzzy in North American suburbs?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Coming from South America, I'm used to residential lots having well-defined property limits. In the larger, denser cities, this usually means huge walls. But even in gated communities in the outskirts of town, where neither density nor safety is an issue, lots - including the front yard - are well defined by small fences or hedges.<p>I live in a suburb in metro Vancouver (Canada), but the same goes for the US. I'm kind of surprised at how fuzzy the lot limits are. Some examples:<p>* Sidewalks typically merge with the front lawn; there is no visible property limit.<p>* Neighboring lots usually are not fenced; random shrubbery or just grass separates lots. What if I want to plant a different tree there? Or my neighbor wants to pave it?<p>* There's a laundry pole in my neighbor's lot. It connects both to his and my house. I find this weirdest of all. Who owns it? What if he doesn't like the pole and wants to take it down?<p>Canadians and Americans probably won't find anything unusual in the examples above, but its all a bit odd from a foreigner's perspective.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "lbrito",
    "url": "https://news.ycombinator.com/user?id=lbrito"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32075183",
  "sameAs": "https://news.ycombinator.com/item?id=32075183",
  "dateCreated": "2022-07-12T20:29:06.178Z",
  "datePublished": "2022-07-12T20:25:30.000Z",
  "dateModified": "2022-07-12T20:29:06.178Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么北美郊区的财产限制如此模糊？\n",
  "headline_zh-Hant": "Ask HN: 為什麼北美郊區的財產限制如此模糊？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我来自南美，习惯于住宅地段有明确的财产界限。在更大、更密集的城市，这通常意味着巨大的墙。但即使是在城郊的封闭式社区，那里的密度和安全都不是问题，地段--包括前院--都由小栅栏或树篱明确界定。我对地段限制的模糊程度感到有点惊讶。一些例子：<p>*人行道通常与前面的草坪合并；没有明显的财产限制。<p>*相邻的地段通常没有围栏；随机的灌木或只是草地将地段分开。如果我想在那里种一棵不同的树怎么办？或者我的邻居想在那里铺路？<p>* 我邻居的地块上有一根洗衣杆。它既连接着他的房子，也连接着我的房子。我觉得这是最奇怪的。谁拥有它？如果他不喜欢这根杆子，想把它拆掉怎么办？<p>加拿大人和美国人可能不会觉得上面的例子有什么不寻常，但从一个外国人的角度来看，这一切都有点奇怪。\n",
  "description_zh-Hant": "我來自南美，習慣於住宅地段有明確的財產界限。在更大、更密集的城市，這通常意味著巨大的牆。但即使是在城郊的封閉式社區，那裡的密度和安全都不是問題，地段--包括前院--都由小柵欄或樹籬明確界定。我對地段限制的模糊程度感到有點驚訝。一些例子：<p>*人行道通常與前面的草坪合併；沒有明顯的財產限制。<p>*相鄰的地段通常沒有圍欄；隨機的灌木或只是草地將地段分開。如果我想在那裡種一棵不同的樹怎麼辦？或者我的鄰居想在那裡鋪路？<p>* 我鄰居的地塊上有一根洗衣杆。它既連接著他的房子，也連接著我的房子。我覺得這是最奇怪的。誰擁有它？如果他不喜歡這根杆子，想把它拆掉怎麼辦？<p>加拿大人和美國人可能不會覺得上面的例子有什麼不尋常，但從一個外國人的角度來看，這一切都有點奇怪。\n"
}