{
  "@type": "NewsArticle",
  "identifier": "2022--04--19--en--askhn--HackerNews--NewsArticle--31080090",
  "url": "https://news.ycombinator.com/item?id=31080090",
  "headline": "Ask HN: GNU/Linux Distro for a Baby",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "My friend (not from HN crowd) has a baby less then 1yo and I help them both a little. My focus is introducing kid to Liberal Arts and English and one more thing: as we all know, that age is old enough to introduce a person to computers. My requirement is x86 with GNU/Linux, hardware is not interesting part of problem but definitely it will be super cheap - so it easily may be not 64bit.<p>The goals the computer will perform:<p>1. Run some easy-peasy courses from Khan Academy or similar (if someone pays their Internet access)<p>2. Listen to some pre-downloaded videos from yt and censored music from pirate trackers.<p>3. Learn some CLI utilites. The first I think will be GNU Units, second must be some text editor.<p>4. First PL, it must be not my choice but the kid's one.<p>Please help me to chose distro literally for babies. No bloatware, no autoupdater and if possible no GUI. Browser with mouse and maybe some typing courses requires GUI, but at least browser may be called from CLI.<p>No childish crap like cartoon pictures or whatever else considered to be enough childish. Nowadays all childish stuff like &quot;yt for kids&quot; obvious is as euphemism of &quot;yt for idiots&quot; and I am going to resist that malculture as long as possible.<p>No need of autoupdate because of absolutely no fear to catch malware, I think the computer will rather be destroyed physically than pwned. The only update needed is maybe some certs for https security theatre to let the Khan Academy work in future without changing much in OS.<p>Also I want the simplest file set possible, I mean as less files on /dev/sda as possible. Sorry if I ask something silly, I hope the goal is defined correctly.<p>If such distro does not exist please give me advices from what distro to start, what may be removed and how to remove that if complicated. I hope I have some time for tinkering with building a new distro, but I would prefer not to do a lot of that job. Of course I am going to spend at least 7h weekly for that teaching.<p>I am absolutely not a power-user of any UNIX utilites or Linux distros so I have some hesitations of which free and open source programs to install and what free and open-source software to avoid for making the system as learnable as possible and as not-gameable as possible also.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "eimrine",
    "url": "https://news.ycombinator.com/user?id=eimrine"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31080090",
  "sameAs": "https://news.ycombinator.com/item?id=31080090",
  "dateCreated": "2022-04-19T06:14:35.522Z",
  "datePublished": "2022-04-19T06:01:47.000Z",
  "dateModified": "2022-04-19T06:14:35.522Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为宝宝准备的GNU/Linux发行版",
  "headline_zh-Hant": "Ask HN: 為寶寶準備的GNU/Linux發行版",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的朋友（不是来自HN的人群）有一个不到一岁的孩子，我帮助他们两个一点点。我的重点是向孩子介绍文科和英语，还有一件事：我们都知道，这个年龄段的孩子足以让人接触电脑。我的要求是X86和GNU/Linux，硬件不是问题的关键，但肯定是超级便宜的--所以它很可能不是64位的。<p>1.运行一些来自可汗学院或类似的简单课程（如果有人支付他们的上网费用的话）<p>2.听一些预先下载的yt视频和来自盗版跟踪器的审查音乐。<p>3.学习一些CLI工具。第一个我认为是GNU Units，第二个必须是一些文本编辑器。<p>4.第一个PL，必须不是我的选择，而是孩子的选择。<p>请帮助我选择真正适合婴儿的发行版。没有臃肿的软件，没有自动更新程序，如果可能的话，没有图形用户界面。使用鼠标的浏览器和一些打字课程需要GUI，但至少可以通过CLI调用浏览器。<p>没有像卡通图片或其他被认为足够幼稚的东西。现在所有幼稚的东西，如&quot;yt for kids&quot;显然是&quot;yt for idiots&quot;的委婉说法，我将尽可能地抵制这种不良文化。<p>不需要自动更新，因为绝对不担心抓到恶意软件，我认为电脑宁愿被物理破坏也不会被破坏。唯一需要更新的也许是一些https安全剧院的证书，以便让可汗学院在未来的工作中不需要改变太多的操作系统。<p>此外，我想要尽可能简单的文件集，我的意思是/dev/sda上的文件尽可能少。如果我问了一些愚蠢的问题，请原谅，我希望目标定义是正确的。<p>如果这样的发行版不存在，请给我建议，从什么发行版开始，什么可能被删除，如果复杂的话如何删除。我希望我有一些时间来修补建立一个新的发行版，但我希望不要做很多这样的工作。<p>我绝对不是任何UNIX工具或Linux发行版的高级用户，所以我有些犹豫，不知道应该安装哪些免费和开源的程序，也不知道应该避免哪些免费和开源的软件，以使系统尽可能的易学，也尽可能的不游戏。",
  "description_zh-Hant": "我的朋友（不是來自HN的人群）有一個不到一歲的孩子，我幫助他們兩個一點點。我的重點是向孩子介紹文科和英語，還有一件事：我們都知道，這個年齡段的孩子足以讓人接觸電腦。我的要求是X86和GNU/Linux，硬件不是問題的關鍵，但肯定是超級便宜的--所以它很可能不是64位的。<p>1.運行一些來自可汗學院或類似的簡單課程（如果有人支付他們的上網費用的話）<p>2.聽一些預先下載的yt視頻和來自盜版跟蹤器的審查音樂。<p>3.學習一些CLI工具。第一個我認為是GNU Units，第二個必須是一些文本編輯器。<p>4.第一個PL，必須不是我的選擇，而是孩子的選擇。<p>請幫助我選擇真正適合嬰兒的發行版。沒有臃腫的軟件，沒有自動更新程序，如果可能的話，沒有圖形用戶界面。使用鼠標的瀏覽器和一些打字課程需要GUI，但至少可以通過CLI調用瀏覽器。<p>沒有像卡通圖片或其他被認為足夠幼稚的東西。現在所有幼稚的東西，如&quot;yt for kids&quot;顯然是&quot;yt for idiots&quot;的委婉說法，我將盡可能地抵制這種不良文化。<p>不需要自動更新，因為絕對不擔心抓到惡意軟件，我認為電腦寧願被物理破壞也不會被破壞。唯一需要更新的也許是一些https安全劇院的證書，以便讓可汗學院在未來的工作中不需要改變太多的操作系統。<p>此外，我想要儘可能簡單的文件集，我的意思是/dev/sda上的文件儘可能少。如果我問了一些愚蠢的問題，請原諒，我希望目標定義是正確的。<p>如果這樣的發行版不存在，請給我建議，從什麼發行版開始，什麼可能被刪除，如果複雜的話如何刪除。我希望我有一些時間來修補建立一個新的發行版，但我希望不要做很多這樣的工作。<p>我絕對不是任何UNIX工具或Linux發行版的高級用戶，所以我有些猶豫，不知道應該安裝哪些免費和開源的程序，也不知道應該避免哪些免費和開源的軟件，以使系統儘可能的易學，也儘可能的不遊戲。"
}