{
  "@type": "NewsArticle",
  "identifier": "2022--07--09--en--askhn--HackerNews--NewsArticle--32038044",
  "url": "https://news.ycombinator.com/item?id=32038044",
  "headline": "Ask HN: Are you on-call after business hours?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm a software engineer with 20 years experience, 8 years at my current employer. I am happy with my position and employer. That is until recently. I was notified I would have to start taking a week long 24/7 on-call rotation with 5 other team members. So, I am on-call 1 week out of 6 weeks. The alerts are generated from DataDog/New Relic monitors. I have never handled on-call after hours and I'm not excited to start at this point in my career with many family obligations and a desire for clear work/life boundaries. I was offered no additional compensation for the added responsibilities. I find being on-call invasive and disruptive, not only for me but also my family. When on-call, I sleep in a separate room from my wife so that her sleep is not disrupted. I also have a hard time falling asleep knowing that an alert could go off at any time.<p>I'm curious to hear how common this is in the industry. Are you on-call? Was it part of your initial hire responsibilities or added later? Did you receive any compensation for your duties? Am I going to be in the same situation if I change jobs/companies?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cad1",
    "url": "https://news.ycombinator.com/user?id=cad1"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32038044",
  "sameAs": "https://news.ycombinator.com/item?id=32038044",
  "dateCreated": "2022-07-09T18:50:02.703Z",
  "datePublished": "2022-07-09T18:40:03.000Z",
  "dateModified": "2022-07-09T18:50:02.703Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你是否在工作时间以外随叫随到？\n",
  "headline_zh-Hant": "Ask HN: 你是否在工作時間以外隨叫隨到？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一名有20年经验的软件工程师，在我目前的雇主那里工作了8年。我对我的职位和雇主都很满意。直到最近。我被通知要开始和其他5个团队成员一起参加为期一周的24/7轮流值班。因此，我在6周中有1周要待命。警报是由DataDog/New Relic监控器产生的。我从来没有处理过下班后的待命工作，而且在我职业生涯的这个阶段，我对开始工作并不感到兴奋，因为我有许多家庭义务，并希望有明确的工作/生活界限。我没有因为增加的责任而得到额外的补偿。我发现待命工作不仅对我，而且对我的家人都是一种侵扰和破坏。在待命时，我和我妻子睡在一个单独的房间里，这样她的睡眠就不会受到干扰。我也很难入睡，因为我知道警报随时可能响起。<p>我很想知道这种情况在业内有多普遍。你是否随叫随到？它是你最初雇用职责的一部分还是后来增加的？你是否因为你的职责而得到任何补偿？如果我换了工作/公司，是否也会遇到同样的情况？\n",
  "description_zh-Hant": "我是一名有20年經驗的軟件工程師，在我目前的僱主那裡工作了8年。我對我的職位和僱主都很滿意。直到最近。我被通知要開始和其他5個團隊成員一起參加為期一週的24/7輪流值班。因此，我在6週中有1周要待命。警報是由DataDog/New Relic監控器產生的。我從來沒有處理過下班後的待命工作，而且在我職業生涯的這個階段，我對開始工作並不感到興奮，因為我有許多家庭義務，並希望有明確的工作/生活界限。我沒有因為增加的責任而得到額外的補償。我發現待命工作不僅對我，而且對我的家人都是一種侵擾和破壞。在待命時，我和我妻子睡在一個單獨的房間裡，這樣她的睡眠就不會受到干擾。我也很難入睡，因為我知道警報隨時可能響起。<p>我很想知道這種情況在業內有多普遍。你是否隨叫隨到？它是你最初僱用職責的一部分還是後來增加的？你是否因為你的職責而得到任何補償？如果我換了工作/公司，是否也會遇到同樣的情況？\n"
}