{
  "@type": "NewsArticle",
  "identifier": "2022--04--27--en--askhn--HackerNews--NewsArticle--31182149",
  "url": "https://news.ycombinator.com/item?id=31182149",
  "headline": "Ask HN: Am I an arrogant or am I surrounded by incompetent people?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've generally stuck to the mantra in life that &quot;If it smells like shit everywhere you walk, check your shoes&quot;. I'm currently a Junior in college - I've had an internship at Amazon last summer and now, for my final summer I have an internship at Google.<p>I go to a state school not really known for CS, although we have a huge CS undergraduate body. A lot of classes in CS require group work - which for the most part, I think is really helpful since most engineering in industry is done in teams.<p>I've had 3 classes where the majority of the grade is made up by projects, and many classes where we do many projects. In each class, I've had to carry the bulk (~90%?) of the workload - half the groups don't know how to code (mostly webapps), and the other half don't care to try.<p>I've tried many approaches - I find that if I recommend tech stacks that I'm comfortable with, most people won't care enough to learn them, but when I let others select, the project ends up as a steaming pile of garbage that doesn't work, and requires a rewrite the week before it's due.<p>School Groups that are lacking are not the exception, they're the rule - I haven't had a group be able to get anything that's runnable without almost taking over.<p>I thought that when I got to Amazon, things would be different: highly motivated people working on exceptional software. But the webapp I was working on (internal) was poorly held together, and the frontend had literally no tests and no way to get mock data locally - i.e. the engineers working on it were just guessing about the shapes of the DTO's, pushing to their personal deployment of the app, and then testing in the cloud before pushing to production. The feedback loop was brutal.<p>I really try my hardest to do the best with what I have - I've never lost my cool and always try to have a cheery attitude. But when I sat down and git pulled what our group had been working on, and there were compile time errors in the main branch, sometimes I wonder if I'm just holding my peers to standards that are too high? Is it too much to expect tests? Is it too much to expect to be able to test full stack locally?<p>I'm beginning to think that I just need a reality check on what standards to hold others to - but at the same time, I can't help but wonder how some of my peers are passing classes or getting hired.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "AmIAnElitist",
    "url": "https://news.ycombinator.com/user?id=AmIAnElitist"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31182149",
  "sameAs": "https://news.ycombinator.com/item?id=31182149",
  "dateCreated": "2022-04-27T16:51:26.298Z",
  "datePublished": "2022-04-27T16:30:52.000Z",
  "dateModified": "2022-04-27T16:51:26.298Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我是一个傲慢的人，还是我身边有很多无能的人？",
  "headline_zh-Hant": "Ask HN: 我是一個傲慢的人，還是我身邊有很多無能的人？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在生活中一般都坚持这样的口号：&quot;如果你走到哪里都有屎的味道，那就检查你的鞋子&quot;。我目前是一名大三学生--去年夏天我在亚马逊实习，现在，在我的最后一个夏天，我在谷歌实习。<p>我就读于一所州立学校，虽然我们有一个庞大的CS本科生群体，但并不是真的以CS闻名。很多CS课程都需要小组工作--在大多数情况下，我认为这真的很有帮助，因为工业界的大多数工程都是在团队中完成的。<p>我有3门课的大部分成绩是由项目构成的，还有很多课我们做了很多项目。在每个班级中，我都不得不承担大部分（约90%？）的工作量--一半的小组不知道如何编码（主要是webapps），而另一半则不屑于尝试。<p>我试过很多方法--我发现如果我推荐我熟悉的技术栈，大多数人都不会在意去学习它们，但当我让其他人选择时，项目最终会变成一堆不工作的垃圾，并且需要在到期前一周重写。 <p>缺乏的学校小组不是例外，它们是规则--我还没有一个小组能够在不几乎接管的情况下得到任何可运行的东西。<p>我以为当我到了亚马逊，情况会有所不同：高度积极的人在做卓越的软件。但是，我所工作的网络应用（内部）的稳定性很差，而且前端几乎没有测试，也没有办法在本地获得模拟数据--也就是说，从事这项工作的工程师只是在猜测DTO的形状，推送到他们个人的应用部署中，然后在推送到生产之前在云中进行测试。<p>我真的很努力地把我所拥有的东西做到最好--我从来没有失去过我的冷静，总是努力保持一种愉快的态度。但是，当我坐下来，用git调出我们小组一直在做的工作时，主分支中出现了编译错误，有时我就会想，是不是我对同行的标准太高了？期待测试是不是太过分了？<p>我开始想，我只是需要一个现实的检查，以什么样的标准来要求别人--但与此同时，我不禁要问，我的一些同行是如何通过课程或被雇用的。",
  "description_zh-Hant": "我在生活中一般都堅持這樣的口號：&quot;如果你走到哪裡都有屎的味道，那就檢查你的鞋子&quot;。我目前是一名大三學生--去年夏天我在亞馬遜實習，現在，在我的最後一個夏天，我在谷歌實習。<p>我就讀於一所州立學校，雖然我們有一個龐大的CS本科生群體，但並不是真的以CS聞名。很多CS課程都需要小組工作--在大多數情況下，我認為這真的很有幫助，因為工業界的大多數工程都是在團隊中完成的。<p>我有3門課的大部分成績是由項目構成的，還有很多課我們做了很多項目。在每個班級中，我都不得不承擔大部分（約90%？）的工作量--一半的小組不知道如何編碼（主要是webapps），而另一半則不屑於嘗試。<p>我試過很多方法--我發現如果我推薦我熟悉的技術棧，大多數人都不會在意去學習它們，但當我讓其他人選擇時，項目最終會變成一堆不工作的垃圾，並且需要在到期前一週重寫。 <p>缺乏的學校小組不是例外，它們是規則--我還沒有一個小組能夠在不幾乎接管的情況下得到任何可運行的東西。<p>我以為當我到了亞馬遜，情況會有所不同：高度積極的人在做卓越的軟件。但是，我所工作的網絡應用（內部）的穩定性很差，而且前端幾乎沒有測試，也沒有辦法在本地獲得模擬數據--也就是說，從事這項工作的工程師只是在猜測DTO的形狀，推送到他們個人的應用部署中，然後在推送到生產之前在雲中進行測試。<p>我真的很努力地把我所擁有的東西做到最好--我從來沒有失去過我的冷靜，總是努力保持一種愉快的態度。但是，當我坐下來，用git調出我們小組一直在做的工作時，主分支中出現了編譯錯誤，有時我就會想，是不是我對同行的標準太高了？期待測試是不是太過分了？<p>我開始想，我只是需要一個現實的檢查，以什麼樣的標準來要求別人--但與此同時，我不禁要問，我的一些同行是如何通過課程或被僱用的。"
}