{
  "@type": "NewsArticle",
  "identifier": "2022--07--12--en--askhn--HackerNews--NewsArticle--32065296",
  "url": "https://news.ycombinator.com/item?id=32065296",
  "headline": "Ask HN: How am I suppose to master software engineering?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello all,<p>Curious how, as a junior engineer, I should be growing and building my skills.  I have always been pretty committed to what I do, but lately I feel a weird struggle with not really knowing the right path forward.<p>With my job, I feel like I am doing new things every day and a lot of random busy work with internal tools. What I do and what I need to learn seems to change often.<p>When you train for say sports, you go to practice and you do the same drills or lift weights, and over time your skills get better and you get bigger.  But that's because you are doing those specific things over and over.  You wouldn't get bigger if you lifted weights 3 times a week in March, then stopped for 6 months, then did once every week in August, then stopped again.<p>Even outside of work I have tried to improve my programming, but I feel like there is so much to do.  I want to learn how say certain applications work, then how to write good code when making those apps, then the larger system design decisions, then how other apps work that are not like it.  I could spend time learning system design for a while, but then my other skills will get rusty.<p>I just feel overloaded and I don't feel like I can master engineering or programmer if my skills and time are spread among so many things.<p>What even is a master software engineer? What should my long-term goal be as a software engineer?  My goal was always to get a good job, now I am here and I am not sure what the next milestone is.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "3a2d29",
    "url": "https://news.ycombinator.com/user?id=3a2d29"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32065296",
  "sameAs": "https://news.ycombinator.com/item?id=32065296",
  "dateCreated": "2022-07-12T04:12:37.797Z",
  "datePublished": "2022-07-12T03:38:05.000Z",
  "dateModified": "2022-07-12T04:12:37.797Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该如何掌握软件工程呢？\n",
  "headline_zh-Hant": "Ask HN: 我應該如何掌握軟件工程呢？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>我很好奇，作为一名初级工程师，我应该如何成长和培养自己的技能。 我一直对自己的工作非常投入，但最近我感到一种奇怪的挣扎，不知道该如何前进。<p>在我的工作中，我觉得我每天都在做新的事情，而且有很多随机的繁忙工作与内部工具。我所做的和我需要学习的东西似乎经常改变。<p>当你为说体育训练时，你去练习，你做同样的练习或举重，随着时间的推移，你的技能变得更好，你变得更大。 但那是因为你在不断地做这些具体的事情。 如果你在3月份每周举重3次，然后停了6个月，然后在8月份每周举一次，然后又停了，你是不会变大的。<p>甚至在工作之外，我也试图改善我的编程，但我觉得有很多事情要做。 我想学习说某些应用程序如何工作，然后在制作这些应用程序时如何写好代码，然后是更大的系统设计决策，然后是其他不一样的应用程序如何工作。 我可以花时间学习系统设计一段时间，但这样我的其他技能就会变得生疏。<p>我只是觉得自己的工作量太大，如果我的技能和时间分散在这么多事情上，我觉得我无法成为工程或程序员大师。<p>究竟什么是软件工程师大师？作为一名软件工程师，我的长期目标应该是什么？ 我的目标一直是找到一份好工作，现在我在这里，我不确定下一个里程碑是什么。\n",
  "description_zh-Hant": "大家好，<p>我很好奇，作為一名初級工程師，我應該如何成長和培養自己的技能。 我一直對自己的工作非常投入，但最近我感到一種奇怪的掙扎，不知道該如何前進。<p>在我的工作中，我覺得我每天都在做新的事情，而且有很多隨機的繁忙工作與內部工具。我所做的和我需要學習的東西似乎經常改變。<p>當你為說體育訓練時，你去練習，你做同樣的練習或舉重，隨著時間的推移，你的技能變得更好，你變得更大。 但那是因為你在不斷地做這些具體的事情。 如果你在3月份每週舉重3次，然後停了6個月，然後在8月份每週舉一次，然後又停了，你是不會變大的。<p>甚至在工作之外，我也試圖改善我的編程，但我覺得有很多事情要做。 我想學習說某些應用程序如何工作，然後在製作這些應用程序時如何寫好代碼，然後是更大的系統設計決策，然後是其他不一樣的應用程序如何工作。 我可以花時間學習系統設計一段時間，但這樣我的其他技能就會變得生疏。<p>我只是覺得自己的工作量太大，如果我的技能和時間分散在這麼多事情上，我覺得我無法成為工程或程序員大師。<p>究竟什麼是軟件工程師大師？作為一名軟件工程師，我的長期目標應該是什麼？ 我的目標一直是找到一份好工作，現在我在這裡，我不確定下一個里程碑是什麼。\n"
}