{
  "@type": "NewsArticle",
  "identifier": "2022--07--30--en--askhn--HackerNews--NewsArticle--32289842",
  "url": "https://news.ycombinator.com/item?id=32289842",
  "headline": "Ask HN: Locked out of Amazon accounts for a month",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Suddenly Amazon Shopping asked me to change my password. I got authenticated, including with my 2FA, and picked a new password, but I keep getting server errors that something went wrong and asking me to retry later. I attempted on different browsers, the mobile app, incognito mode, etc. I kept trying this for weeks, hoping somebody would attend to the logging errors. Finally, I opened a ticket with Amazon Shopping, which has not been worked on for a month after being on the phone with them twice. Yesterday, I tried to use my AWS account and have a support plan for it but encountered the same issue. My IAM users and root user also experiences the same problems, and a password reset is mandated without explaining why. For whatever reason, Amazon has flagged all my accounts and IAM users as needing a password reset, and their password reset system does not work, and I'm locked out of everywhere! Their support pretends that they care, but nothing has changed! At least I managed to ask them to refund my Prime subscription, which I cannot use - I can't tell if it got canceled as I got no emails confirming that. I need a purchase receipt - I don't have access to them for the same reason. This is turning into a huge nightmare. I cannot do anything with my useless support subscriptions as, obviously, to get a good case into the system, you need to be able to log in. I pinged their Twitter support, and they again pretended they cared, but nothing different happened. I can't even cancel the useless support subscription.<p>I am pretty sure this is some software change issue, given how old my Amazon Shopping and AWS accounts are. They've flagged my account for some reason, although I have received no notification about this.<p>Given how much of my online shopping life relied on Amazon Shopping and AWS, which, even with paid support nowadays, seems useless, this is not acceptable for a modern technology company! I tried purchasing certain products directly, but many manufacturers work exclusively with Amazon.<p>At the end of the day, Amazon is losing revenue, not me. And sends a clear message that something's wrong with their system, which used to provide quality support and considered the logging process sacred - we all know the original Amazon Shopping, which even allowed people to create multiple accounts with the same email so that they can still complete their purchases. This is no longer the chase! A forced password reset goes against what made them big!<p>I am looking into alternatives such as Walmart+ and Amazon will lose loyal customers spending thousands every month. For supplements, for example, I'm trying to move my business to iHerb - I've already canceled all my Subscribe &amp; Save subscriptions thru their customer service (that they can handle, but they can't remove the requirement to reset the password).",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "nikolay",
    "url": "https://news.ycombinator.com/user?id=nikolay"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32289842",
  "sameAs": "https://news.ycombinator.com/item?id=32289842",
  "dateCreated": "2022-07-30T20:25:58.364Z",
  "datePublished": "2022-07-30T20:09:37.000Z",
  "dateModified": "2022-07-30T20:25:58.364Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 被锁在亚马逊账户外一个月\n",
  "headline_zh-Hant": "Ask HN: 被鎖在亞馬遜賬戶外一個月\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "突然间，亚马逊购物要求我修改密码。我得到了认证，包括我的2FA，并选择了一个新的密码，但我一直收到服务器错误，说出了问题，要求我以后重试。我在不同的浏览器、手机应用、隐身模式等尝试。我一直尝试了好几个星期，希望有人能关注一下记录错误的问题。最后，我在亚马逊购物网站上开了一张票，在与他们通了两次电话后，一个月来一直没有得到处理。昨天，我试图使用我的AWS账户，并有一个支持计划，但遇到了同样的问题。我的IAM用户和根用户也遇到了同样的问题，而且强制要求重新设置密码，却没有解释原因。不管什么原因，亚马逊把我所有的账户和IAM用户都标记为需要重新设置密码，而他们的密码重置系统却不起作用，我被锁在任何地方！他们的支持人员假装关心我。他们的支持假装他们很关心，但没有任何改变！他们的密码重置系统不工作，我被锁在任何地方！他们的支持假装他们很关心，但没有任何改变 至少我设法要求他们退还我的Prime套餐，我不能使用它--我无法判断它是否被取消了，因为我没有收到确认的电子邮件。我需要一张购买收据--由于同样的原因，我无法获得它们。这正在变成一个巨大的噩梦。我不能用我无用的支持订阅做任何事情，因为，很明显，要想把一个好的案例纳入系统，你需要能够登录。我呼唤他们的Twitter支持，他们再次假装关心，但没有任何不同的情况发生。我甚至不能取消无用的支持订阅。<p>鉴于我的亚马逊购物和AWS账户有多老，我非常确定这是一些软件变更问题。<p>鉴于我的网上购物生活有多么依赖亚马逊购物和AWS，即使现在有付费支持，似乎也没有用，这对一家现代技术公司来说是不可接受的！我试着直接购买某些产品，但没有任何变化。我试着直接购买某些产品，但许多制造商只与亚马逊合作。<p>在一天结束时，亚马逊正在失去收入，而不是我。并发出了一个明确的信息，那就是他们的系统出了问题，他们曾经提供高质量的支持，并认为登录过程是神圣的--我们都知道最初的亚马逊购物，甚至允许人们用同一个电子邮件创建多个账户，这样他们仍然可以完成他们的购买。这已经不再是追寻的目标了! 强制重置密码违背了使他们成为大公司的原因！<p>我正在寻找替代方案，如沃尔玛+，亚马逊将失去每个月消费数千美元的忠实客户。以保健品为例，我正试图将我的业务转移到iHerb - 我已经通过他们的客户服务取消了我所有的Subscribe &amp; Save订阅（他们可以处理，但他们不能取消重置密码的要求）。\n",
  "description_zh-Hant": "突然間，亞馬遜購物要求我修改密碼。我得到了認證，包括我的2FA，並選擇了一個新的密碼，但我一直收到服務器錯誤，說出了問題，要求我以後重試。我在不同的瀏覽器、手機應用、隱身模式等嘗試。我一直嘗試了好幾個星期，希望有人能關注一下記錄錯誤的問題。最後，我在亞馬遜購物網站上開了一張票，在與他們通了兩次電話後，一個月來一直沒有得到處理。昨天，我試圖使用我的AWS賬戶，並有一個支持計劃，但遇到了同樣的問題。我的IAM用戶和根用戶也遇到了同樣的問題，而且強制要求重新設置密碼，卻沒有解釋原因。不管什麼原因，亞馬遜把我所有的賬戶和IAM用戶都標記為需要重新設置密碼，而他們的密碼重置系統卻不起作用，我被鎖在任何地方！他們的支持人員假裝關心我。他們的支持假裝他們很關心，但沒有任何改變！他們的密碼重置系統不工作，我被鎖在任何地方！他們的支持假裝他們很關心，但沒有任何改變 至少我設法要求他們退還我的Prime套餐，我不能使用它--我無法判斷它是否被取消了，因為我沒有收到確認的電子郵件。我需要一張購買收據--由於同樣的原因，我無法獲得它們。這正在變成一個巨大的噩夢。我不能用我無用的支持訂閱做任何事情，因為，很明顯，要想把一個好的案例納入系統，你需要能夠登錄。我呼喚他們的Twitter支持，他們再次假裝關心，但沒有任何不同的情況發生。我甚至不能取消無用的支持訂閱。<p>鑑於我的亞馬遜購物和AWS賬戶有多老，我非常確定這是一些軟件變更問題。<p>鑑於我的網上購物生活有多麼依賴亞馬遜購物和AWS，即使現在有付費支持，似乎也沒有用，這對一家現代技術公司來說是不可接受的！我試著直接購買某些產品，但沒有任何變化。我試著直接購買某些產品，但許多製造商只與亞馬遜合作。<p>在一天結束時，亞馬遜正在失去收入，而不是我。併發出了一個明確的信息，那就是他們的系統出了問題，他們曾經提供高質量的支持，並認為登錄過程是神聖的--我們都知道最初的亞馬遜購物，甚至允許人們用同一個電子郵件創建多個賬戶，這樣他們仍然可以完成他們的購買。這已經不再是追尋的目標了! 強制重置密碼違背了使他們成為大公司的原因！<p>我正在尋找替代方案，如沃爾瑪+，亞馬遜將失去每個月消費數千美元的忠實客戶。以保健品為例，我正試圖將我的業務轉移到iHerb - 我已經通過他們的客戶服務取消了我所有的Subscribe &amp; Save訂閱（他們可以處理，但他們不能取消重置密碼的要求）。\n"
}