{
  "@type": "NewsArticle",
  "identifier": "2022--08--02--en--askhn--HackerNews--NewsArticle--32315666",
  "url": "https://news.ycombinator.com/item?id=32315666",
  "headline": "Ask HN: Do you ever use GPT-3 in anger?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I was frustrated while writing a google search query that would get me the answer to a specific but mildly nuanced question before it hit me. I could just pose the question in the openai playground and then fact-check the answer.<p>This proved to be a much better experience than 30 seconds prior when I was just landing on fishing jargon dictionaries that I'd skim only to not find what I wanted. Those and the generic SEO gaming type articles that plaster the first page of most search engine results these days.<p>It was so much better that I might just start allocating 0.25USD per month to &quot;nicer knowledge surfing&quot; or something using GPT-3 instead of my own google-fu. And for the curious, here's what I wanted to know:<p>Question: what is the process of preparing fish, done after they are caught, but before they are available for sale in the marketplace called?\nAnswer: The process of preparing fish, done after they are caught, but before they are available for sale in the marketplace is known as fish processing.<p>I can imagine that session turning into a rabbit hole of wikipedian proportion very quickly if I didn't just want an immediate answer to my question.<p>EDIT: apparently I don't know how to spell wiki",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tepitoperrito",
    "url": "https://news.ycombinator.com/user?id=tepitoperrito"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32315666",
  "sameAs": "https://news.ycombinator.com/item?id=32315666",
  "dateCreated": "2022-08-02T06:42:55.327Z",
  "datePublished": "2022-08-02T06:16:30.000Z",
  "dateModified": "2022-08-02T06:42:55.327Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你曾经在愤怒的时候使用过GPT-3吗？\n",
  "headline_zh-Hant": "Ask HN: 你曾經在憤怒的時候使用過GPT-3嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在写谷歌搜索查询的时候感到很沮丧，因为它能让我在一个具体但有轻微细微差别的问题上得到答案。我可以在openai游乐场里提出问题，然后对答案进行事实核查。<p>事实证明，这比之前30秒的体验要好得多，当时我只是登陆了钓鱼的专业术语词典，我略过了这些词典，却没有找到我想要的东西。<p>它是如此的好，以至于我可能会开始每月拨出0.25美元用于&quot;更好的知识冲浪&quot;或其他使用GPT-3而不是我自己的google-fu。对于好奇的人来说，这是我想知道的：<p>问题：鱼被捕获后，但在市场上可以出售之前，准备鱼的过程叫什么？\n回答：\"是的。<p>我可以想象，如果我不是想立即得到问题的答案，这个会议很快就会变成一个维基比例的兔子洞。<p>编辑：显然我不知道如何拼写维基\n",
  "description_zh-Hant": "我在寫谷歌搜索查詢的時候感到很沮喪，因為它能讓我在一個具體但有輕微細微差別的問題上得到答案。我可以在openai遊樂場裡提出問題，然後對答案進行事實核查。<p>事實證明，這比之前30秒的體驗要好得多，當時我只是登陸了釣魚的專業術語詞典，我略過了這些詞典，卻沒有找到我想要的東西。<p>它是如此的好，以至於我可能會開始每月撥出0.25美元用於&quot;更好的知識衝浪&quot;或其他使用GPT-3而不是我自己的google-fu。對於好奇的人來說，這是我想知道的：<p>問題：魚被捕獲後，但在市場上可以出售之前，準備魚的過程叫什麼？\n回答：\"是的。<p>我可以想象，如果我不是想立即得到問題的答案，這個會議很快就會變成一個維基比例的兔子洞。<p>編輯：顯然我不知道如何拼寫維基\n"
}