{
  "@type": "NewsArticle",
  "identifier": "2022--06--18--en--askhn--HackerNews--NewsArticle--31788173",
  "url": "https://news.ycombinator.com/item?id=31788173",
  "headline": "Ask HN: Is there professional SaaS feasibility analysis services?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN<p>When looking to start up some sort of business or startup, one thing that comes up is to do a &quot;feasibility analysis&quot; before you invest heavily in making the business go: that is, how feasible is the business? how profitable could it be? how many people are looking for this type of product.. etc.<p>When I look on google for &quot;SaaS feasibility analysis&quot;, I can see many results on conducting one yourself, but is there anyone that can do this as a service that I can pay for? Not only do I feel like I could easily fall victim of my own confirmation bias, but I also want to save a little bit of my own time, and be able to write down some ideas to send them off and a get a report that I can reflect upon later.<p>I've recently been reading &quot;start small stay small&quot; by Rob Walling, and he suggests at minimum doing some search terms and keyword analysis to see how often other people google for these type of things, and how you could show up on the web easier in a niche; there's software that can do this for you, or you can spreadsheet this up yourself. Many of the software items seem either abandonware or be wanting to tie in to an already running business..<p>Is setting some tracking analytics on a landing page and email lists the only way to do a feasibility analysis for SaaS ? is it possible to find a professional service that can really do a deep dive on the idea for me?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "drekipus",
    "url": "https://news.ycombinator.com/user?id=drekipus"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31788173",
  "sameAs": "https://news.ycombinator.com/item?id=31788173",
  "dateCreated": "2022-06-18T08:48:55.381Z",
  "datePublished": "2022-06-18T08:29:48.000Z",
  "dateModified": "2022-06-18T08:48:55.381Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 是否有专业的SaaS可行性分析服务？\n",
  "headline_zh-Hant": "Ask HN: 是否有專業的SaaS可行性分析服務？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嘿，HN<p>当你想创办某种企业或创业公司时，有一件事是在你大量投资使企业发展之前，要做一个&quot;可行性分析&quot;：也就是说，这项业务的可行性如何？ 能有多大的利润？有多少人在寻找这种类型的产品......等等。<p>当我在谷歌上寻找&quot;SaaS可行性分析&quot;时，我可以看到许多关于自己进行可行性分析的结果，但是有没有人可以作为一项服务来做，我可以为之付费？我不仅觉得我很容易成为自己确认偏见的受害者，而且我还想节省一点自己的时间，能够写下一些想法，把它们送出去，并得到一份报告，让我以后可以反思。 <p>我最近在读Rob Walling写的&quot;start small stay small&quot;，他建议至少要做一些搜索词和关键词分析，看看其他人在谷歌上搜索这些类型的东西的频率，以及你如何在网络上更容易显示出一个利基；有软件可以为你做这个，或者你可以自己制作电子表格。许多软件项目似乎要么是废弃软件，要么是想与已经运行的业务结合起来。<p>在登陆页面和电子邮件列表上设置一些跟踪分析，是为SaaS做可行性分析的唯一方法吗？ 是否有可能找到一种专业服务，可以真正为我做一个深入的想法？\n",
  "description_zh-Hant": "嘿，HN<p>當你想創辦某種企業或創業公司時，有一件事是在你大量投資使企業發展之前，要做一個&quot;可行性分析&quot;：也就是說，這項業務的可行性如何？ 能有多大的利潤？有多少人在尋找這種類型的產品......等等。<p>當我在谷歌上尋找&quot;SaaS可行性分析&quot;時，我可以看到許多關於自己進行可行性分析的結果，但是有沒有人可以作為一項服務來做，我可以為之付費？我不僅覺得我很容易成為自己確認偏見的受害者，而且我還想節省一點自己的時間，能夠寫下一些想法，把它們送出去，並得到一份報告，讓我以後可以反思。 <p>我最近在讀Rob Walling寫的&quot;start small stay small&quot;，他建議至少要做一些搜索詞和關鍵詞分析，看看其他人在谷歌上搜索這些類型的東西的頻率，以及你如何在網絡上更容易顯示出一個利基；有軟件可以為你做這個，或者你可以自己製作電子表格。許多軟件項目似乎要麼是廢棄軟件，要麼是想與已經運行的業務結合起來。<p>在登陸頁面和電子郵件列表上設置一些跟蹤分析，是為SaaS做可行性分析的唯一方法嗎？ 是否有可能找到一種專業服務，可以真正為我做一個深入的想法？\n"
}