{
  "@type": "NewsArticle",
  "identifier": "2022--04--23--en--askhn--HackerNews--NewsArticle--31139586",
  "url": "https://news.ycombinator.com/item?id=31139586",
  "headline": "Ask HN: How to overcome fear of the unknown when applying to jobs",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been a developer at a pretty major American defence company (though i'm from and based in England) for around 3 years (2 years as a graduate/mid level developer, 1 year as a senior). They've been alright, for learning, have a ton of on hands experience with AWS/Kubernetes/messaging systems/multiple languages, but they don't really pay to the going market rate for a senior developer in the UK.<p>I'm looking at applying elsewhere and I have ambitions to move to one of the larger tech companies. I applied to one of the major startup fin-tech companies in the UK not too long ago, interview process went pretty well, got to stage 5/6 and did very well in technical discussions (discussed messaging systems, transaction integrity with multiple approaches etc), however fell short in the programming task (a program heavily focused on a certain aspect of programming, something I didn't have a massive amount of experience with so got tripped up when trying to convey the intricate details of what exactly the program was doing, though it was completely functional).<p>Since then, I've improved massively in that part of my skill set, however it has left me with a feeling/fear that I could apply to another company and face the same problem of getting tripped up by a single thing where my knowledge isn't up to scratch, despite my pretty abundant knowledge in other areas. Is this something commonly experienced and if so what can remedy it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "adecentcoder",
    "url": "https://news.ycombinator.com/user?id=adecentcoder"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31139586",
  "sameAs": "https://news.ycombinator.com/item?id=31139586",
  "dateCreated": "2022-04-23T23:31:36.671Z",
  "datePublished": "2022-04-23T23:11:41.000Z",
  "dateModified": "2022-04-23T23:31:36.671Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何克服申请工作时对未知的恐惧",
  "headline_zh-Hant": "Ask HN: 如何克服申請工作時對未知的恐懼",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在一家相当大的美国国防公司（虽然我来自英国）做了三年左右的开发人员（两年是毕业生/中级开发人员，一年是高级开发人员）。他们还不错，可以学习，在AWS/Kubernetes/Messaging系统/多种语言方面有大量的实战经验，但他们的工资并没有达到英国高级开发者的市场价格。不久前，我申请了英国一家主要的初创金融科技公司，面试过程相当顺利，进入了第5/6阶段，在技术讨论中表现得非常好（讨论了消息系统、多种方法的交易完整性等），但在编程任务中失败了（一个严重关注编程某方面的程序，我没有大量的经验，所以在试图表达程序到底在做什么的复杂细节时被绊倒了，尽管它是完全正常的）。 <p>从那时起，我在这部分技能上有了很大的提高，但这让我感到/害怕，我可能会申请到另一家公司，并面临同样的问题，即尽管我在其他领域有相当丰富的知识，但还是会被一件事情绊倒。这种情况是否普遍存在，如果是，有什么可以补救？",
  "description_zh-Hant": "我在一家相當大的美國國防公司（雖然我來自英國）做了三年左右的開發人員（兩年是畢業生/中級開發人員，一年是高級開發人員）。他們還不錯，可以學習，在AWS/Kubernetes/Messaging系統/多種語言方面有大量的實戰經驗，但他們的工資並沒有達到英國高級開發者的市場價格。不久前，我申請了英國一家主要的初創金融科技公司，面試過程相當順利，進入了第5/6階段，在技術討論中表現得非常好（討論了消息系統、多種方法的交易完整性等），但在編程任務中失敗了（一個嚴重關注編程某方面的程序，我沒有大量的經驗，所以在試圖表達程序到底在做什麼的複雜細節時被絆倒了，儘管它是完全正常的）。 <p>從那時起，我在這部分技能上有了很大的提高，但這讓我感到/害怕，我可能會申請到另一家公司，並面臨同樣的問題，即儘管我在其他領域有相當豐富的知識，但還是會被一件事情絆倒。這種情況是否普遍存在，如果是，有什麼可以補救？"
}