{
  "@type": "NewsArticle",
  "identifier": "2022--04--19--en--askhn--HackerNews--NewsArticle--31078931",
  "url": "https://news.ycombinator.com/item?id=31078931",
  "headline": "Ask HN: What ToDo features feel bad?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Full disclosure - I'm making a ToDo application as a rite of passage as I approach 10 years of teaching myself to program (thanks Peter Novig).<p>These ToDo features make me feel bad:<p>1) Ever expanding lists that put me in a defeatist mindset and distract me from what's urgent and important...\n2) Analysis paralysis when prioritizing.<p>I like to track all the things. Currently I'm using WorkFlowy to record every thought and whim worth writing down, but it's becoming unwieldy and distracts my thoughts when I start down branches to enter some new information.<p>When it comes to prioritizing tasks, I can never seem to feel like I'm doing the right thing at the right time and maybe that says something more about me than the application, I'm quite the idealist and more of an inductive than deductive reasoner. I have to have a &quot;why&quot; in all I do.<p>Perhaps one solution is some kind of anti ToDo application that just keeps tracks of what you did and reminds you of your moral compasses, and maybe holds you to them in some kind of peer pressure way based on your public commitments? Or maybe it's just straight social altogether? But then help vampirism...<p>I've seen other applications that outsource management consulting which I love, and am toying with the idea of using an AI or some kind of moral compass mechanism, but tbh that kind of scares me - like I don't want to train some soulless machine to dictate to me what I ought to be doing, morally. Maybe I'm over thinking this. Maybe I should just do some stupid MVC ToDo app and let it grow cobwebs on GitHub. Penny for your thoughts - I want to at least make something that's enjoyable.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "atriarch",
    "url": "https://news.ycombinator.com/user?id=atriarch"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31078931",
  "sameAs": "https://news.ycombinator.com/item?id=31078931",
  "dateCreated": "2022-04-19T02:47:36.026Z",
  "datePublished": "2022-04-19T01:39:38.000Z",
  "dateModified": "2022-04-19T02:47:36.026Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 哪些ToDo功能感觉不好？",
  "headline_zh-Hant": "Ask HN: 哪些ToDo功能感覺不好？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "完全公开--我正在制作一个ToDo应用程序，作为我接近10年来教自己编程的一种仪式（感谢Peter Novig）。<p>这些ToDo功能让我感觉很糟糕：<p>1）不断扩大的列表使我处于失败主义的心态，并分散我对紧急和重要事情的注意力。\n2）在确定优先次序时出现分析瘫痪。<p>我喜欢跟踪所有的事情。目前我正在使用WorkFlowy来记录每一个值得写下的想法和奇思妙想，但是当我开始向下分支输入一些新的信息时，它变得不容易操作，并分散了我的注意力。<p>当涉及到确定任务的优先次序时，我似乎永远无法感觉到我在正确的时间做正确的事情，也许这说明我比应用程序更适合，我是一个相当理想主义者，更像是一个归纳推理者而不是推理者。<p>也许一个解决方案是某种反ToDo应用程序，它只是跟踪你所做的事情，并提醒你的道德指南针，也许以某种基于你公开承诺的同行压力的方式让你遵守它们？或者，也许它只是直接的社交而已？<p>我已经看到了其他外包管理咨询的应用，我很喜欢，并且正在玩弄使用人工智能或某种道德指南针机制的想法，但总的来说，这有点让我害怕--就像我不想训练一些没有灵魂的机器来告诉我，我应该在道德上做什么。也许我想多了。也许我应该做一些愚蠢的MVC ToDo应用，让它在GitHub上长出蜘蛛网。谢谢你的想法--我希望至少能做出一些令人愉快的东西。",
  "description_zh-Hant": "完全公開--我正在製作一個ToDo應用程序，作為我接近10年來教自己編程的一種儀式（感謝Peter Novig）。<p>這些ToDo功能讓我感覺很糟糕：<p>1）不斷擴大的列表使我處於失敗主義的心態，並分散我對緊急和重要事情的注意力。\n2）在確定優先次序時出現分析癱瘓。<p>我喜歡跟蹤所有的事情。目前我正在使用WorkFlowy來記錄每一個值得寫下的想法和奇思妙想，但是當我開始向下分支輸入一些新的信息時，它變得不容易操作，並分散了我的注意力。<p>當涉及到確定任務的優先次序時，我似乎永遠無法感覺到我在正確的時間做正確的事情，也許這說明我比應用程序更適合，我是一個相當理想主義者，更像是一個歸納推理者而不是推理者。<p>也許一個解決方案是某種反ToDo應用程序，它只是跟蹤你所做的事情，並提醒你的道德指南針，也許以某種基於你公開承諾的同行壓力的方式讓你遵守它們？或者，也許它只是直接的社交而已？<p>我已經看到了其他外包管理諮詢的應用，我很喜歡，並且正在玩弄使用人工智能或某種道德指南針機制的想法，但總的來說，這有點讓我害怕--就像我不想訓練一些沒有靈魂的機器來告訴我，我應該在道德上做什麼。也許我想多了。也許我應該做一些愚蠢的MVC ToDo應用，讓它在GitHub上長出蜘蛛網。謝謝你的想法--我希望至少能做出一些令人愉快的東西。"
}