{
  "@type": "NewsArticle",
  "identifier": "2022--04--20--en--askhn--HackerNews--NewsArticle--31094899",
  "url": "https://news.ycombinator.com/item?id=31094899",
  "headline": "Ask HN: Why aren't price comparison websites big in the US?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "One thing I noticed and that I haven't been able to completely make sense of is why there aren't any big price comparison portals that serve the U.S. market.<p>I'm from Switzerland. One of the first use cases of the internet for me was to use the local price comparison site comparis.ch to get the best deals on services like health insurance or broadband packages. Comparis is a hugely popular website in Switzerland. And that's despite that fact that it's much wealthier compared to say, Germany (where idealo.de is the dominant price comparison portal).<p>My understanding is that there are a lot niche comparison websites, such as CamelCamelCamel for setting price alerts on Amazon. There are also aggregators for travel and other verticals. However, there appears to be no one particular dominant one-stop type of portal offering comparisons across all kinds of product and service categories like Comparis or Idealo.<p>I do understand that the United States has one of the highest average incomes worldwide and the people there are more willing to part with their money than consumers in other places. However, there must still be a sizable addressable market here, just like there is in Switzerland, which is also a wealthy country. And yet, no dominant price comparison portal has emerged yet. Why is that?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jn31415",
    "url": "https://news.ycombinator.com/user?id=jn31415"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31094899",
  "sameAs": "https://news.ycombinator.com/item?id=31094899",
  "dateCreated": "2022-04-20T10:34:48.302Z",
  "datePublished": "2022-04-20T10:31:04.000Z",
  "dateModified": "2022-04-20T10:34:48.302Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么价格比较网站在美国不大？",
  "headline_zh-Hant": "Ask HN: 為什麼價格比較網站在美國不大？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我注意到的一件事是，为什么没有任何大型的价格比较门户网站为美国市场提供服务，而我还没有完全弄明白。对我来说，互联网的第一个使用案例是使用当地的价格比较网站comparis.ch，以获得健康保险或宽带套餐等服务的最佳交易。比较网在瑞士是一个非常受欢迎的网站。<p>我的理解是，有很多小众的比较网站，例如CamelCamelCamel可以在亚马逊上设置价格提醒。也有针对旅游和其他垂直领域的聚合网站。然而，似乎没有一个特别占主导地位的一站式门户，像Comparis或Idealo那样提供各种产品和服务类别的比较。<p>我确实理解，美国是全球平均收入最高的国家之一，那里的人们比其他地方的消费者更愿意拿出钱来。然而，这里肯定仍有一个可满足的市场，就像瑞士一样，它也是一个富裕的国家。然而，目前还没有出现占主导地位的价格比较门户。这是为什么呢？",
  "description_zh-Hant": "我注意到的一件事是，為什麼沒有任何大型的價格比較門戶網站為美國市場提供服務，而我還沒有完全弄明白。對我來說，互聯網的第一個使用案例是使用當地的價格比較網站comparis.ch，以獲得健康保險或寬帶套餐等服務的最佳交易。比較網在瑞士是一個非常受歡迎的網站。<p>我的理解是，有很多小眾的比較網站，例如CamelCamelCamel可以在亞馬遜上設置價格提醒。也有針對旅遊和其他垂直領域的聚合網站。然而，似乎沒有一個特別占主導地位的一站式門戶，像Comparis或Idealo那樣提供各種產品和服務類別的比較。<p>我確實理解，美國是全球平均收入最高的國家之一，那裡的人們比其他地方的消費者更願意拿出錢來。然而，這裡肯定仍有一個可滿足的市場，就像瑞士一樣，它也是一個富裕的國家。然而，目前還沒有出現占主導地位的價格比較門戶。這是為什麼呢？"
}