{
  "@type": "NewsArticle",
  "identifier": "2022--06--10--en--askhn--HackerNews--NewsArticle--31689201",
  "url": "https://news.ycombinator.com/item?id=31689201",
  "headline": "Ask HN: Has anyone had the decked stacked against them in arbitration?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "With respect to the arbitration terms found in any given Terms of Service, there are two competing ideas I've seen a lot on HN recently:<p>1) Those asserting arbitration is a scam or otherwise unfair. The company whose TOS you've signed is the one paying the arbitrator, after all. This system is designed for you to lose.<p>2) Those with personal anecdotes about going through arbitration, who had a decent-at-worst experience, and ended up winning.<p>If there's one thing I've learned from the internet, it's that positive outcomes generate a light breeze, but negative outcomes generate a storm. If arbitration was inherently unfair -- at least as often as we seem to tell ourselves -- I'd think I'd see more anecdotes about it. So far I've seen zero. Maybe that's just &quot;luck&quot;, but I figured I'd ask, directly to the community whose discussions about it prompted to this question.<p>Disclaimer: I'm not a fan of the de-facto forced arbitration imposed on anyone who doesn't want to (or can't) run their own email server, etc. I've been deeply dismayed by the last few SCOTUS decisions on this subject. And yet I haven't come across an anecdote of anyone getting boned. Indeed, in my own social circle I know 2 folks who have been through such arbitration. They both assumed the deck was stacked against them, and they both emerged victorious.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "puglr",
    "url": "https://news.ycombinator.com/user?id=puglr"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31689201",
  "sameAs": "https://news.ycombinator.com/item?id=31689201",
  "dateCreated": "2022-06-10T02:11:47.863Z",
  "datePublished": "2022-06-10T02:10:20.000Z",
  "dateModified": "2022-06-10T02:11:47.863Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 有谁在仲裁中遇到过不利于他们的情况？\n",
  "headline_zh-Hant": "Ask HN: 有誰在仲裁中遇到過不利於他們的情況？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "关于任何特定服务条款中的仲裁条款，我最近在HN上经常看到两种相互竞争的观点：<p>1）那些声称仲裁是一个骗局或其他不公平的观点。毕竟，你所签署的服务条款的公司是支付仲裁员的公司。<p>2）那些有关于通过仲裁的个人轶事的人，他们有一个体面的最差的经验，并最终获胜。<p>如果有一件事是我从互联网上学到的，那就是积极的结果会产生微风，但消极的结果会产生风暴。如果仲裁本身是不公平的--至少像我们似乎经常告诉自己的那样--我想我会看到更多关于它的轶事。到目前为止，我看到的是零。也许这只是运气，但我想我应该问一下，直接向社区提出这个问题的讨论。<p>免责声明：我不喜欢把事实上的强制仲裁强加给任何不想（或不能）运行自己的电子邮件服务器的人，等等。我对上海合作组织在这个问题上的最后几个决定深感失望。然而，我还没有遇到过任何一个人被干掉的轶事。事实上，在我自己的社交圈中，我认识两个经历过这种仲裁的人。他们都认为牌局对他们不利，而他们都取得了胜利。\n",
  "description_zh-Hant": "關於任何特定服務條款中的仲裁條款，我最近在HN上經常看到兩種相互競爭的觀點：<p>1）那些聲稱仲裁是一個騙局或其他不公平的觀點。畢竟，你所簽署的服務條款的公司是支付仲裁員的公司。<p>2）那些有關於通過仲裁的個人軼事的人，他們有一個體面的最差的經驗，並最終獲勝。<p>如果有一件事是我從互聯網上學到的，那就是積極的結果會產生微風，但消極的結果會產生風暴。如果仲裁本身是不公平的--至少像我們似乎經常告訴自己的那樣--我想我會看到更多關於它的軼事。到目前為止，我看到的是零。也許這只是運氣，但我想我應該問一下，直接向社區提出這個問題的討論。<p>免責聲明：我不喜歡把事實上的強制仲裁強加給任何不想（或不能）運行自己的電子郵件服務器的人，等等。我對上海合作組織在這個問題上的最後幾個決定深感失望。然而，我還沒有遇到過任何一個人被幹掉的軼事。事實上，在我自己的社交圈中，我認識兩個經歷過這種仲裁的人。他們都認為牌局對他們不利，而他們都取得了勝利。\n"
}