{
  "@type": "NewsArticle",
  "identifier": "2022--04--27--en--askhn--HackerNews--NewsArticle--31184114",
  "url": "https://news.ycombinator.com/item?id=31184114",
  "headline": "Ask HN: Devise a Civilizational Model",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I was thinking about the latest human folly and in an uber objective mode of not trying to paint one or the other as 'evil incarnate' happened on the conclusion that the core issue is fundamentally that of a deficient working model for civilization (as a unit) and composition of these units into a larger harmonious whole. That doesn't predictably periodically descends into warfare.<p>The basic idea that drove policy in the last century (and this century was supposed to be the proof of the idea) was that (a) civilization units have core, not necessarily physical, centers; and (b) trade between these units is how they compose to higher harmonious forms.<p>So, there are 2 fronts to innovate here. One is the unit model. Is it possible for example to have a stripped down version of what constitutes a civilization (think micro kernel) and then have global level integration? What are the components of the stripped core model? Can there be symbiotic types? Binary or higher order partial civilizations that collectively become one? I think possibly historic Europe qualifies for that with its mix of Latin, German, etc. that naturally fall under an umbrella of European. These forms seem to require one unifying shared element, here the Church.<p>The second front is how these units compose. Warfare, trade, cultural exchange. Also population exchanges are a historic specimen of inter-unit interactions. So Q here is, given that the 20th century emphasis on 'trade' as the singular most important dimension is now shown to be false, and some units are resorting to 'warfare' to affect changes in global order, is there actually a solution to this problem short of supremacy of a victorious unit? If you take a moralist stance, you'll need to answer questions such as 'is it OK for liberal civilizations to interact with authoritarian ones?'.<p>As a kind of a third rail there is the fact that availability of certain technologies provide a sort of ground level constraint to any consideration since even disputes involving other 3rd parties can have very local detrimental effects.<p>So is there a compositional solution or are we destined to duke it out for a final round?<p>[p.s. things like 'ritualized warfare' for example are on the table.]",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "eternalban",
    "url": "https://news.ycombinator.com/user?id=eternalban"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31184114",
  "sameAs": "https://news.ycombinator.com/item?id=31184114",
  "dateCreated": "2022-04-27T18:56:34.072Z",
  "datePublished": "2022-04-27T18:46:03.000Z",
  "dateModified": "2022-04-27T18:56:34.072Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 设计一个文明模式",
  "headline_zh-Hant": "Ask HN: 設計一個文明模式",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在思考人类最近的愚蠢行为，并以一种超级客观的方式，不试图将其中一个或另一个描绘成 \"邪恶的化身\"，而得出的结论是，核心问题从根本上说是文明（作为一个单位）的工作模式存在缺陷，并将这些单位组成一个更大的和谐的整体。<p>上个世纪推动政策的基本想法（本世纪应该是对这一想法的证明）是：（a）文明单位有核心，不一定是物理中心；（b）这些单位之间的贸易是它们组成更高和谐形式的方式。一个是单位模式。例如，是否有可能拥有一个构成文明的精简版（考虑微观内核），然后进行全球层面的整合？剥离的核心模型的组成部分是什么？能否有共生的类型？二元或更高阶的部分文明，共同成为一个整体？我认为历史上的欧洲可能有资格这样做，它混合了拉丁语、德语等，自然属于欧洲的范畴。这些形式似乎需要一个统一的共享元素，这里就是教会。<p>第二个方面是这些单位如何组成。战争、贸易、文化交流。另外，人口交流也是单位间互动的一个历史标本。那么问题来了，鉴于20世纪强调 \"贸易 \"是唯一最重要的维度，现在被证明是错误的，而且一些单位正在诉诸 \"战争 \"来影响全球秩序的变化，除了一个胜利单位的至高无上之外，是否真的有办法解决这个问题？如果你采取道德主义的立场，你将需要回答诸如 \"自由主义文明与专制主义文明的互动可以吗？\"等问题。<p>作为一种第三条轨道，某些技术的可用性为任何考虑提供了某种地面限制，因为即使涉及其他第三方的争端也会产生非常局部的不利影响。 <p>那么，是否有一个组合式的解决方案，或者我们注定要在最后一轮中决出胜负？<p>[p.s. 比如像'仪式化的战争'这样的东西就在桌面上。］",
  "description_zh-Hant": "我在思考人類最近的愚蠢行為，並以一種超級客觀的方式，不試圖將其中一個或另一個描繪成 \"邪惡的化身\"，而得出的結論是，核心問題從根本上說是文明（作為一個單位）的工作模式存在缺陷，並將這些單位組成一個更大的和諧的整體。<p>上個世紀推動政策的基本想法（本世紀應該是對這一想法的證明）是：（a）文明單位有核心，不一定是物理中心；（b）這些單位之間的貿易是它們組成更高和諧形式的方式。一個是單位模式。例如，是否有可能擁有一個構成文明的精簡版（考慮微觀內核），然後進行全球層面的整合？剝離的核心模型的組成部分是什麼？能否有共生的類型？二元或更高階的部分文明，共同成為一個整體？我認為歷史上的歐洲可能有資格這樣做，它混合了拉丁語、德語等，自然屬於歐洲的範疇。這些形式似乎需要一個統一的共享元素，這裡就是教會。<p>第二個方面是這些單位如何組成。戰爭、貿易、文化交流。另外，人口交流也是單位間互動的一個歷史標本。那麼問題來了，鑑於20世紀強調 \"貿易 \"是唯一最重要的維度，現在被證明是錯誤的，而且一些單位正在訴諸 \"戰爭 \"來影響全球秩序的變化，除了一個勝利單位的至高無上之外，是否真的有辦法解決這個問題？如果你採取道德主義的立場，你將需要回答諸如 \"自由主義文明與專制主義文明的互動可以嗎？\"等問題。<p>作為一種第三條軌道，某些技術的可用性為任何考慮提供了某種地面限制，因為即使涉及其他第三方的爭端也會產生非常局部的不利影響。 <p>那麼，是否有一個組合式的解決方案，或者我們註定要在最後一輪中決出勝負？<p>[p.s. 比如像'儀式化的戰爭'這樣的東西就在桌面上。］"
}