{
  "@type": "NewsArticle",
  "identifier": "2022--07--23--en--askhn--HackerNews--NewsArticle--32205435",
  "url": "https://news.ycombinator.com/item?id=32205435",
  "headline": "Ask HN: What have been your California Consumer Privacy Act (CCPA) experiences?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm curious about others' experience with California Consumer Privacy Act (CCPA) compliance.  And, if my understanding of the protections of the act are incorrect, and it does not, in fact, prevent continued retention and selling of personal data after a CCPA request has been lodged (i.e., it contains giant loopholes that negate any real protection by the act).<p>At the end of February, I visited a government site that asked me security questions that I had not provided answers to.  My account was locked because I answered the questions &quot;wrong&quot;.  The site's support responded, to a query, that they sourced the questions and answers from LexisNexis.<p>I wanted to avoid such issues in the future, so using the LexisNexis CCPA request web form, I checked the boxes on all three of, request a) a copy of the data they had collected, b) they not sell my data, and c) they delete the data they already had collected.  In early March, I got confirmation of my request and an extensive report of the data they had collected on me.<p>The data was extremely unreliable containing many errors.  It was no wonder I could not answer the security questions &quot;correctly&quot;.<p>In mid July, I had to use that government web site again, and was again prompted with security questions I had not provided answers for (this time, however, I was able to answer the questions &quot;correctly&quot; using the CCPA report as an answer key).  I contacted the site again, and they confirmed that the questions and answers were exclusively sourced from LexisNexis, and that they did not cache / store any of this information-- that the website queries LexisNexis in real time at the time the questions are posed to the visitor.<p>This seems to indicate that LexisNexis did not, in fact delete my data, and Lexis Nexis is continuing to sell my data.<p>If you have placed CCPA requests, what have been your experiences?  And, were my expectations that the CCPA would prevent LexisNexis from continuing to retain and sell my data not in line with what the CCPA actually provides?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "sillystuff",
    "url": "https://news.ycombinator.com/user?id=sillystuff"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32205435",
  "sameAs": "https://news.ycombinator.com/item?id=32205435",
  "dateCreated": "2022-07-23T17:36:13.738Z",
  "datePublished": "2022-07-23T17:25:45.000Z",
  "dateModified": "2022-07-23T17:36:13.738Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 您在《加州消费者隐私法》（CCPA）方面有哪些经验？\n",
  "headline_zh-Hant": "Ask HN: 您在《加州消費者隱私法》（CCPA）方面有哪些經驗？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我很好奇其他人在遵守《加州消费者隐私法》（CCPA）方面的经验。 而且，如果我对该法案的保护措施的理解是不正确的，而且它实际上并不阻止在提出CCPA请求后继续保留和出售个人数据（即它包含巨大的漏洞，否定了该法案的任何真正保护）。<p>在二月底，我访问了一个政府网站，该网站要求我回答我没有提供的安全问题。 我的账户被锁定，因为我回答了错误的问题。 <p>我想在未来避免这样的问题，所以使用LexisNexis CCPA请求的网络表格，我勾选了所有三个选项，要求a）他们收集的数据的副本，b）他们不出售我的数据，以及c）他们删除已经收集的数据。 3月初，我收到了对我请求的确认，以及一份关于他们收集的我的数据的广泛报告。<p>这些数据极其不可靠，包含许多错误。 <p>7月中旬，我不得不再次使用该政府网站，并再次被提示我没有提供答案的安全问题（不过这一次，我能够使用CCPA报告作为答案钥匙来回答这些问题）。 我再次联系了该网站，他们确认这些问题和答案完全来自LexisNexis，而且他们没有缓存/存储任何这些信息--网站在向访问者提出问题时实时查询LexisNexis。<p>这似乎表明LexisNexis事实上没有删除我的数据，而且LexisNexis继续出售我的数据。 还有，我以为CCPA会阻止LexisNexis继续保留和出售我的数据，这是否与CCPA的实际规定不一致？\n",
  "description_zh-Hant": "我很好奇其他人在遵守《加州消費者隱私法》（CCPA）方面的經驗。 而且，如果我對該法案的保護措施的理解是不正確的，而且它實際上並不阻止在提出CCPA請求後繼續保留和出售個人數據（即它包含巨大的漏洞，否定了該法案的任何真正保護）。<p>在二月底，我訪問了一個政府網站，該網站要求我回答我沒有提供的安全問題。 我的賬戶被鎖定，因為我回答了錯誤的問題。 <p>我想在未來避免這樣的問題，所以使用LexisNexis CCPA請求的網絡表格，我勾選了所有三個選項，要求a）他們收集的數據的副本，b）他們不出售我的數據，以及c）他們刪除已經收集的數據。 3月初，我收到了對我請求的確認，以及一份關於他們收集的我的數據的廣泛報告。<p>這些數據極其不可靠，包含許多錯誤。 <p>7月中旬，我不得不再次使用該政府網站，並再次被提示我沒有提供答案的安全問題（不過這一次，我能夠使用CCPA報告作為答案鑰匙來回答這些問題）。 我再次聯繫了該網站，他們確認這些問題和答案完全來自LexisNexis，而且他們沒有緩存/存儲任何這些信息--網站在向訪問者提出問題時實時查詢LexisNexis。<p>這似乎表明LexisNexis事實上沒有刪除我的數據，而且LexisNexis繼續出售我的數據。 還有，我以為CCPA會阻止LexisNexis繼續保留和出售我的數據，這是否與CCPA的實際規定不一致？\n"
}