{
  "@type": "NewsArticle",
  "identifier": "2022--08--02--en--askhn--HackerNews--NewsArticle--32319822",
  "url": "https://news.ycombinator.com/item?id=32319822",
  "headline": "Ask HN: Does anyone values code quality at all?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Throwaway account, for obvious reasons.<p>I've been a software engineer for 17 years now. Most of that time, I've worked for a large IT Consultancy, where I joined many many projects in Fortune 100 companies to build systems that either supported critical operation or where customer facing - like ATM, transactional security, etc. On those projects, software quality was mediocre at best, despise all my efforts. It just wasn't a priority to build good, maintanable software. Priority was either management - like have effective communication with the client and making good projections or achieving mad deadlines (because less time meant better prices meant more projects).<p>So, I spend most of my adult life frustrated with the status quo, fighting the current (and loosing) and hoping to someday find a better place to work. Recently, several opportunities in Big Tech started showing up, something that wasn't possible (or was ridiculously hard) before given that I live in a third world country. I took my time, crammed a lot for the tests, and got a job at one of those companies.<p>So here I am at my dream company, working on my first project, expecting to finally have a place where I can learn from people instead of teaching, where I can see how some of the best software in the world is built...<p>...only to find out that this is the pretty much the same as everywhere else I've been. Software is poorly designed, poorly documented, terribly maintained, suffering from code rot after years of patching functionality without care for best practices. Code is procedural (despite being written in an OO language), things aren't automated (CI/CD here is worse than my previous jobs), and people don't seem to care.<p>Is there a place where code quality is important?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kljasdlkj",
    "url": "https://news.ycombinator.com/user?id=kljasdlkj"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32319822",
  "sameAs": "https://news.ycombinator.com/item?id=32319822",
  "dateCreated": "2022-08-02T15:48:35.701Z",
  "datePublished": "2022-08-02T15:28:20.000Z",
  "dateModified": "2022-08-02T15:48:35.701Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 是否有人重视代码质量？\n",
  "headline_zh-Hant": "Ask HN: 是否有人重視代碼質量？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "<p>我成为一名软件工程师已经17年了。其中大部分时间，我在一家大型IT咨询公司工作，在那里我参加了许多财富100强公司的项目，建立支持关键操作或面向客户的系统--如ATM、交易安全等。在这些项目中，软件质量充其量是平庸的，对我所有的努力嗤之以鼻。建立良好的、可维护的软件并不是优先事项。优先考虑的是管理--比如与客户进行有效的沟通，做出好的预测，或者实现疯狂的最后期限（因为更少的时间意味着更好的价格意味着更多的项目）。<p>所以，我成年后的大部分时间都在为现状感到沮丧，与现状作斗争（并且失败了），希望有一天能找到一个更好的工作场所。最近，大科技公司的几个机会开始出现，鉴于我住在第三世界国家，这在以前是不可能的（或者说是难得很）。我花了点时间，为考试补习了很多东西，并在其中一家公司找到了工作。<p>于是我来到了我梦想中的公司，从事我的第一个项目，期望终于有一个可以向人学习而不是教书的地方，在那里我可以看到世界上一些最好的软件是如何建立的......<p>...但我发现这和我去过的其他地方几乎都一样。软件的设计很差，文档很差，维护得很糟糕，在多年的功能修补中，没有注意到最佳实践，因而遭受了代码腐烂。代码是程序化的（尽管是用OO语言编写的），事情没有自动化（这里的CI/CD比我以前的工作更糟糕），而且人们似乎并不关心。\n",
  "description_zh-Hant": "<p>我成為一名軟件工程師已經17年了。其中大部分時間，我在一家大型IT諮詢公司工作，在那裡我參加了許多財富100強公司的項目，建立支持關鍵操作或面向客戶的系統--如ATM、交易安全等。在這些項目中，軟件質量充其量是平庸的，對我所有的努力嗤之以鼻。建立良好的、可維護的軟件並不是優先事項。優先考慮的是管理--比如與客戶進行有效的溝通，做出好的預測，或者實現瘋狂的最後期限（因為更少的時間意味著更好的價格意味著更多的項目）。<p>所以，我成年後的大部分時間都在為現狀感到沮喪，與現狀作鬥爭（並且失敗了），希望有一天能找到一個更好的工作場所。最近，大科技公司的幾個機會開始出現，鑑於我住在第三世界國家，這在以前是不可能的（或者說是難得很）。我花了點時間，為考試補習了很多東西，並在其中一家公司找到了工作。<p>於是我來到了我夢想中的公司，從事我的第一個項目，期望終於有一個可以向人學習而不是教書的地方，在那裡我可以看到世界上一些最好的軟件是如何建立的......<p>...但我發現這和我去過的其他地方几乎都一樣。軟件的設計很差，文檔很差，維護得很糟糕，在多年的功能修補中，沒有注意到最佳實踐，因而遭受了代碼腐爛。代碼是程序化的（儘管是用OO語言編寫的），事情沒有自動化（這裡的CI/CD比我以前的工作更糟糕），而且人們似乎並不關心。\n"
}