{
  "@type": "NewsArticle",
  "identifier": "2022--06--08--en--askhn--HackerNews--NewsArticle--31674354",
  "url": "https://news.ycombinator.com/item?id=31674354",
  "headline": "Ask HN: Help) Twitter Account/Trademark",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Time and time again I have seen appeals to the HN community for help on some type of customer service issue in the tech industry to great effect, I am asking for that help.<p>In short, this year I became the owner of a (once famous) trademark.  The Twitter account matching the trademark is suspended/not in use.  My goal is to obtain the Twitter account that matches my TM for obvious branding purposes and to generally protect the goodwill of the TM.<p>Twitter has an online process to report alleged TM infringement and request the account.  I used the same without success, the Twitter response was that the account was suspended, thus not infringing, and otherwise declined to give me to have the suspended account/handle.  In my opinion, while not classic TM infringement, a suspended Twitter account does in fact cause the same type of damages to the goodwill of my TM and brand as that of ordinary TM infringement.  Moreover, it seems reasonable that the public would likely think that the TM holder (me) violated Twitter’s TOS/engaged in suspicious activity resulting in a suspension, and that perception naturally causes harm to the goodwill of my mark/brand.<p>I have an obvious bias as the TM holder, but my opinion is they should give me the handle that matches my TM. The account is suspended anyway, it has been for years, thus there is no harm or loss anyone else by giving the TM holder the account/handle.<p>Ultimately I think this amounts to a customer service issue, but one that needs a little public support to get any attention.  I have no expectations randomly posting to HN asking for help, but I’ve seen it move mountains in the past.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwawaycities",
    "url": "https://news.ycombinator.com/user?id=throwawaycities"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31674354",
  "sameAs": "https://news.ycombinator.com/item?id=31674354",
  "dateCreated": "2022-06-08T21:22:28.894Z",
  "datePublished": "2022-06-08T21:18:56.000Z",
  "dateModified": "2022-06-08T21:22:28.894Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 帮助）Twitter账户/商标\n",
  "headline_zh-Hant": "Ask HN: 幫助）Twitter賬戶/商標\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我一次又一次地看到有人呼吁HN社区就科技行业的某种客户服务问题提供帮助，效果很好，我正在请求这种帮助。<p>简而言之，今年我成为了一个（曾经很有名的）商标的所有者。 与该商标相匹配的Twitter账户被暂停/不在使用。 我的目标是获得与我的TM相匹配的Twitter账户，以达到明显的品牌推广目的，并从总体上保护TM的商誉。<p>Twitter有一个在线程序来报告涉嫌TM侵权并要求获得该账户。 我使用了同样的方法，但没有成功，Twitter的回应是，该账户已被暂停，因此没有侵权，并在其他方面拒绝给我拥有暂停的账户/手柄。 在我看来，虽然不是典型的TM侵权，但被暂停的Twitter账户事实上对我的TM和品牌的商誉造成了与普通TM侵权相同类型的损害。 此外，公众可能会认为TM持有人（我）违反了Twitter的服务条款/参与了可疑的活动，从而导致账户被暂停，这种看法自然会对我的商标/品牌的商誉造成损害。<p>作为TM持有人，我有一个明显的偏见，但我认为他们应该给我一个与我的TM相符的手柄。<p>最终，我认为这相当于一个客户服务问题，但它需要一点公众支持才能得到关注。 我不期望随意在HN上发帖寻求帮助，但我已经看到它在过去移动山。\n",
  "description_zh-Hant": "我一次又一次地看到有人呼籲HN社區就科技行業的某種客戶服務問題提供幫助，效果很好，我正在請求這種幫助。<p>簡而言之，今年我成為了一個（曾經很有名的）商標的所有者。 與該商標相匹配的Twitter賬戶被暫停/不在使用。 我的目標是獲得與我的TM相匹配的Twitter賬戶，以達到明顯的品牌推廣目的，並從總體上保護TM的商譽。<p>Twitter有一個在線程序來報告涉嫌TM侵權並要求獲得該賬戶。 我使用了同樣的方法，但沒有成功，Twitter的迴應是，該賬戶已被暫停，因此沒有侵權，並在其他方面拒絕給我擁有暫停的賬戶/手柄。 在我看來，雖然不是典型的TM侵權，但被暫停的Twitter賬戶事實上對我的TM和品牌的商譽造成了與普通TM侵權相同類型的損害。 此外，公眾可能會認為TM持有人（我）違反了Twitter的服務條款/參與了可疑的活動，從而導致賬戶被暫停，這種看法自然會對我的商標/品牌的商譽造成損害。<p>作為TM持有人，我有一個明顯的偏見，但我認為他們應該給我一個與我的TM相符的手柄。<p>最終，我認為這相當於一個客戶服務問題，但它需要一點公眾支持才能得到關注。 我不期望隨意在HN上發帖尋求幫助，但我已經看到它在過去移動山。\n"
}