{
  "@type": "NewsArticle",
  "identifier": "2022--06--27--en--askhn--HackerNews--NewsArticle--31897435",
  "url": "https://news.ycombinator.com/item?id=31897435",
  "headline": "Ask HN: Start a Startup or Join One?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a former FANG software engineer who left his job a few months ago to take a sabbatical.<p>I have always wanted to do a startup but recently I am opening up to the idea of joining a startup. Primarily because :-<p>1. Through working for a few years I now know some promising early startups run by people I like &amp; respect<p>2. I would learn from them and would get to build a lot<p>3. Have some structure in life, the problem statement would be decided and early on I can be pure execution as I increase ownership<p>4. They're in a space that I am interested in but don't understand, so would learn about the domain name.<p>At the same side on the startup side<p>1. I don't have a co-founder<p>2. I have ideas that I am interested in but I don't have something that I want to commit 10 years to. I have some ideas in which I see quick revenue but don't see them IPO'ing while others are bigger longer term but seem like a struggle to start.<p>3. If things work out the financial upside is massive compared to an early employee. At seed / series A startups I'd have to be lucky to get anything over a few percentage points of equity.<p>Overall, when I had joining big tech (or a hedge-fund), startup or starting one as options the first option &quot;big tech&quot; seemed like the easiest thing to do. Now joining one seems like the easiest thing to do.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "break_the_bank",
    "url": "https://news.ycombinator.com/user?id=break_the_bank"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31897435",
  "sameAs": "https://news.ycombinator.com/item?id=31897435",
  "dateCreated": "2022-06-27T17:14:13.275Z",
  "datePublished": "2022-06-27T17:03:41.000Z",
  "dateModified": "2022-06-27T17:14:13.275Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 开始创业还是加入创业公司？\n",
  "headline_zh-Hant": "Ask HN: 開始創業還是加入創業公司？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一名前方正软件工程师，几个月前离职休养。<p>我一直想做创业公司，但最近我开始接受加入创业公司的想法。主要是因为：-<p>1. 通过几年的工作，我现在知道了一些有前途的早期创业公司，这些公司由我喜欢和尊重的人经营<p>2.我将从他们身上学到很多东西<p>3.在生活中有一些结构，问题陈述将被决定，在早期我可以纯粹的执行，因为我增加了所有权<p>4.他们在一个我感兴趣但不了解的空间，所以会学习域名。<p>在创业公司方面也是如此<p>1. 我没有联合创始人<p>2.我有一些我感兴趣的想法，但我没有一些我想投入10年的东西。我有一些想法，我看到了快速的收入，但不认为他们会IPO，而其他的想法则是更长远的，但似乎是一个艰难的开始。<p>3.如果事情成功了，与早期员工相比，经济上的好处是巨大的。<p>总的来说，当我把加入大型科技公司（或对冲基金）、创业公司或创办公司作为选项时，第一个选项&quot;大型科技公司&quot;似乎是最容易做的事情。现在，加入一个公司似乎是最容易做的事情。\n",
  "description_zh-Hant": "我是一名前方正軟件工程師，幾個月前離職休養。<p>我一直想做創業公司，但最近我開始接受加入創業公司的想法。主要是因為：-<p>1. 通過幾年的工作，我現在知道了一些有前途的早期創業公司，這些公司由我喜歡和尊重的人經營<p>2.我將從他們身上學到很多東西<p>3.在生活中有一些結構，問題陳述將被決定，在早期我可以純粹的執行，因為我增加了所有權<p>4.他們在一個我感興趣但不瞭解的空間，所以會學習域名。<p>在創業公司方面也是如此<p>1. 我沒有聯合創始人<p>2.我有一些我感興趣的想法，但我沒有一些我想投入10年的東西。我有一些想法，我看到了快速的收入，但不認為他們會IPO，而其他的想法則是更長遠的，但似乎是一個艱難的開始。<p>3.如果事情成功了，與早期員工相比，經濟上的好處是巨大的。<p>總的來說，當我把加入大型科技公司（或對沖基金）、創業公司或創辦公司作為選項時，第一個選項&quot;大型科技公司&quot;似乎是最容易做的事情。現在，加入一個公司似乎是最容易做的事情。\n"
}