{
  "@type": "NewsArticle",
  "identifier": "2022--06--20--en--askhn--HackerNews--NewsArticle--31810471",
  "url": "https://news.ycombinator.com/item?id=31810471",
  "headline": "Ask HN: I shut down my company, now I need a job",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Two weeks ago, I announced (https://news.ycombinator.com/item?id=31598978) that I was shutting down my companies, 70 Million Jobs and Commissary Club (companies that helped the formerly incarcerated get on with their lives). The overwhelming volume of support I received just through Bookface and Hacker News stunned me; my heart overflowed with pride and gratitude.<p>Now I am facing another challenge: I need a job. I’ve spoken with many recruiters and HR professionals, along with people who are interested in either acquiring my company(s), funding them or just want to make themselves available for a chat. I’ve received offers for leadership positions at nonprofits, but I haven’t yet discovered the right fit. Maybe I love the startup life too much. Maybe my criminal record hurts my chances. (Maybe!?!) Maybe my age is a deterrent.<p>Before I accept a position that doesn’t thrill me, I thought I’d get the word out to the YC community. Perhaps your company has—or has been considering—beginning a foundation or some other mission-based, social impact endeavor. Perhaps you need to hire lots of folks for your work force and want to seriously access the largely ignored 70 million Americans with records. I can help.<p>What else am I very good at? Business development, sales training and management.<p>Please note: I’m not very technical.<p>If you’ve got ideas, I’d love to hear them. Thanks for your time and consideration.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "RBBronson123",
    "url": "https://news.ycombinator.com/user?id=RBBronson123"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31810471",
  "sameAs": "https://news.ycombinator.com/item?id=31810471",
  "dateCreated": "2022-06-20T14:56:44.141Z",
  "datePublished": "2022-06-20T14:02:51.000Z",
  "dateModified": "2022-06-20T14:56:44.141Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 42
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 8
    }
  ],
  "headline_zh-Hans": "Ask HN: 我关闭了我的公司，现在我需要一份工作\n",
  "headline_zh-Hant": "Ask HN: 我關閉了我的公司，現在我需要一份工作\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "两周前，我宣布（https://news.ycombinator.com/item?id=31598978），我将关闭我的公司--7000万个工作机会和小卖部俱乐部（帮助以前被监禁的人继续生活的公司）。仅仅通过Bookface和Hacker News，我就收到了大量的支持，这让我惊呆了；我的心中溢满了自豪和感激。<p>现在，我面临着另一个挑战：我需要一份工作。我已经和许多招聘人员和人力资源专家谈过，还有一些人对收购我的公司、为它们提供资金或只是想和我聊天感兴趣。我已经收到了非营利组织的领导职位邀请，但我还没有发现合适的人选。也许我太喜欢创业公司的生活了。也许我的犯罪记录损害了我的机会。(<p>在我接受一个并不令我兴奋的职位之前，我想我应该向YC社区发布这个消息。也许你的公司已经--或者一直在考虑--开始建立一个基金会或其他一些基于任务的社会影响的努力。也许你需要为你的工作队伍雇用大量的人，并想认真地接触那些基本上被忽视的、有记录的7000万美国人。我可以提供帮助。<p>我还擅长什么？业务发展、销售培训和管理。<p>请注意：我的技术水平不高。<p>如果你有想法，我很想听听。谢谢你的时间和考虑。\n",
  "description_zh-Hant": "兩週前，我宣佈（https://news.ycombinator.com/item?id=31598978），我將關閉我的公司--7000萬個工作機會和小賣部俱樂部（幫助以前被監禁的人繼續生活的公司）。僅僅通過Bookface和Hacker News，我就收到了大量的支持，這讓我驚呆了；我的心中溢滿了自豪和感激。<p>現在，我面臨著另一個挑戰：我需要一份工作。我已經和許多招聘人員和人力資源專家談過，還有一些人對收購我的公司、為它們提供資金或只是想和我聊天感興趣。我已經收到了非營利組織的領導職位邀請，但我還沒有發現合適的人選。也許我太喜歡創業公司的生活了。也許我的犯罪記錄損害了我的機會。(<p>在我接受一個並不令我興奮的職位之前，我想我應該向YC社區發佈這個消息。也許你的公司已經--或者一直在考慮--開始建立一個基金會或其他一些基於任務的社會影響的努力。也許你需要為你的工作隊伍僱用大量的人，並想認真地接觸那些基本上被忽視的、有記錄的7000萬美國人。我可以提供幫助。<p>我還擅長什麼？業務發展、銷售培訓和管理。<p>請注意：我的技術水平不高。<p>如果你有想法，我很想聽聽。謝謝你的時間和考慮。\n"
}