{
  "@type": "NewsArticle",
  "identifier": "2022--04--28--en--askhn--HackerNews--NewsArticle--31189307",
  "url": "https://news.ycombinator.com/item?id=31189307",
  "headline": "Ask HN: How to interpret mathematics in terms of deep learning models?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Ok. First, let me introduce myself.<p>I am a master's student in Computer Science, in US. I had a lecture on speech recognition today in my machine learning class. It was a good lecture and mostly focused on first principles and basic concepts related to learning speech recognition. Then comes the devil, neural networks jargon, and architecture(LSTM, RNN, Transformers). Till now, all these things make sense to me.<p>I came back home and gave a thought to everything I learned today. My question is why did we study first principles(like phonetics, n-grams, and all) when deep learning models and all are able to learn patterns themselves. In technical terms, my question is how do we interpret problems, mathematical modeling, and intuition derived from first principles and models in terms of deep learning models and architecture? Because mathematical intuition behind deep learning models looks completely different to me. So, is it just the game of input-output-losses? If possible, if anyone can give me a very classic example of how did you conclude what the deep learning model would look like?<p>I would ask this question my professor next week. But HN is kind of my professor, so asking here. :P<p>Thanks!!!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "starboyy",
    "url": "https://news.ycombinator.com/user?id=starboyy"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31189307",
  "sameAs": "https://news.ycombinator.com/item?id=31189307",
  "dateCreated": "2022-04-28T06:28:24.201Z",
  "datePublished": "2022-04-28T06:23:36.000Z",
  "dateModified": "2022-04-28T06:28:24.201Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何用深度学习模型来解释数学？",
  "headline_zh-Hant": "Ask HN: 如何用深度學習模型來解釋數學？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "好的。首先，让我介绍一下自己。<p>我是美国计算机科学专业的硕士生。今天我在我的机器学习课上有一个关于语音识别的讲座。这是一个很好的讲座，主要侧重于与学习语音识别有关的第一原理和基本概念。然后是魔鬼、神经网络的行话和架构（LSTM、RNN、变形金刚）。直到现在，所有这些东西对我来说都是有意义的。<p>我回到家里，对今天学到的一切进行了思考。我的问题是，既然深度学习模型和所有的人都能自己学习模式，为什么我们还要研究第一原理（比如语音学、n-grams，以及所有的）。用技术术语来说，我的问题是我们如何用深度学习模型和架构来解释问题、数学建模和从第一原理和模型中得出的直觉？因为深度学习模型背后的数学直觉在我看来是完全不同的。那么，这只是输入-输出-损失的游戏吗？如果可能的话，如果谁能给我一个非常经典的例子，说明你是如何得出深度学习模型的结论的？<p>我下周会问这个问题我的教授。但HN算是我的教授，所以在这里问。 :P<p>谢谢!",
  "description_zh-Hant": "好的。首先，讓我介紹一下自己。<p>我是美國計算機科學專業的碩士生。今天我在我的機器學習課上有一個關於語音識別的講座。這是一個很好的講座，主要側重於與學習語音識別有關的第一原理和基本概念。然後是魔鬼、神經網絡的行話和架構（LSTM、RNN、變形金剛）。直到現在，所有這些東西對我來說都是有意義的。<p>我回到家裡，對今天學到的一切進行了思考。我的問題是，既然深度學習模型和所有的人都能自己學習模式，為什麼我們還要研究第一原理（比如語音學、n-grams，以及所有的）。用技術術語來說，我的問題是我們如何用深度學習模型和架構來解釋問題、數學建模和從第一原理和模型中得出的直覺？因為深度學習模型背後的數學直覺在我看來是完全不同的。那麼，這只是輸入-輸出-損失的遊戲嗎？如果可能的話，如果誰能給我一個非常經典的例子，說明你是如何得出深度學習模型的結論的？<p>我下週會問這個問題我的教授。但HN算是我的教授，所以在這裡問。 :P<p>謝謝!"
}