{
  "@type": "NewsArticle",
  "identifier": "2022--08--08--en--askhn--HackerNews--NewsArticle--32384155",
  "url": "https://news.ycombinator.com/item?id=32384155",
  "headline": "Ask HN: Career Advice",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm working on the same company from nearly 3 years as Senior Software Engineer, around 2 years ago I started having talks with the manager of that time to move to a Lead position, made various plans and one of them was to do something significant for the company. I had an idea in mind on how to improve the architecture of the frontend part of the company application, I expose the idea to a couple of colleagues, and with some brainstorming the idea becomes a presentation, I present the presentation first to the manager then to the CTO. Fast forward 6 months and a team was created to make this idea a reality, in few words the project is to transform the frontend from a big monolith into micro-frontends, the project includes creating tools to make that happen, a proof-of-concept split of the monolith, and best practices to keep everything working properly and tidy.<p>The created team at the beginning was composed by: 1 developer ( myself ), 1 product owner, 1 scrum master and 1 manager. As I joined this new team I had to change manager. The promise was that more developers will join the team in the future. After 2 months two developers join the team, one month after the leave the company for reasons unrelated to the work being done ( one of the developer wanted to become a doctor, the other was his best friend and followed ). Two months later another developer join the team, he leaves the company after 2 months because the job was too hard compared to the previous team. Another six months pass and new hire joins the team, this was 5 months ago.<p>During this one year and half I had constant talks with my new manager about the Lead position ( that then became Staff Engineer position ), all that happen were talks talks and only talks, no action whatsover. The justification for the impossibility to move that position is that I need to show managerial skill over a big number of developers and unfortunately my team is composed by only two developers and the other teams grew very independent from us, and the reason why other teams are independent is because we did a good job at documenting everything and setting up the tools and the new micro-frontends so best practices are natural to follow, at the beginning the other teams did approach us with questions and need for direction but in the last 4 months this has become very very rare.<p>The worst part is that everyone in my previous team had a promotion, all the juniors are now Mid or Senior, and the other Senior developer is now Lead ( we were only two senior in the previous team 1 year and half ago ).<p>I honestly don't know what to do anymore, I feel like I hit a brick wall, I talk about this with my manager every two weeks and he always says something will be done. Work has become de-motivating, I ended up in the team that does one of the hardest work in the company and that every other team now depends on, and this has only set me back. I tried to move back to the previous team but they don't let me because I'm the person with the highest knowledge of how the architecture of the app and it's inner workings.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "maury91",
    "url": "https://news.ycombinator.com/user?id=maury91"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32384155",
  "sameAs": "https://news.ycombinator.com/item?id=32384155",
  "dateCreated": "2022-08-08T11:22:12.616Z",
  "datePublished": "2022-08-08T11:03:38.000Z",
  "dateModified": "2022-08-08T11:22:12.616Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 职业建议\n",
  "headline_zh-Hant": "Ask HN: 職業建議\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在同一家公司工作了近3年，担任高级软件工程师，大约2年前，我开始与当时的经理会谈，希望转到一个领导职位，制定了各种计划，其中之一是为公司做一些重要的事情。我有一个想法，就是如何改进公司应用程序的前端部分的架构，我把这个想法告诉了几个同事，经过一番头脑风暴，这个想法变成了一个演示文稿，我把这个演示文稿先交给经理，然后再交给CTO。在6个月的时间里，我们创建了一个团队来实现这个想法，简而言之，这个项目是将前端从一个大的单片机转变为微前端，这个项目包括创建工具来实现这一目标，对单片机进行概念验证，以及保持一切正常工作和整洁的最佳实践。1名开发人员（我自己）、1名产品负责人、1名Scrum Master和1名经理。由于我加入了这个新的团队，我不得不更换经理。承诺是将来会有更多的开发人员加入团队。两个月后，两名开发人员加入了团队，一个月后，他们因与工作无关的原因离开了公司（其中一名开发人员想成为一名医生，另一名是他最好的朋友，并跟随他）。两个月后，另一个开发人员加入团队，两个月后他离开了公司，因为与之前的团队相比，工作太难了。<p>在这一年半的时间里，我和我的新经理就领导职位（后来变成了员工工程师职位）进行了不断的会谈，所发生的一切都是会谈，只有会谈，没有任何行动。不可能调动这个职位的理由是，我需要展示对大量开发人员的管理技能，不幸的是，我的团队只有两个开发人员，而其他的团队都非常独立于我们，而其他团队之所以独立，是因为我们在记录一切、建立工具和新的微前端方面做得很好，所以最佳实践是很自然的。 <p>最糟糕的是，我以前的团队中的每个人都得到了晋升，所有的初级人员现在都成了中级或高级人员，而另一个高级开发人员现在成了领导（一年半前我们的团队中只有两个高级人员）。<p>说实话，我不知道该怎么办了，我觉得我遇到了一堵砖墙，我每两周和我的经理谈论这个问题，他总是说会有办法。工作已经变得没有动力了，我最终进入了公司里做得最辛苦的一个团队，现在其他每个团队都依赖这个团队，而这只会让我退步。我试图调回以前的团队，但他们不允许我这样做，因为我是对应用程序的架构和内部运作有最深入了解的人。\n",
  "description_zh-Hant": "我在同一家公司工作了近3年，擔任高級軟件工程師，大約2年前，我開始與當時的經理會談，希望轉到一個領導職位，制定了各種計劃，其中之一是為公司做一些重要的事情。我有一個想法，就是如何改進公司應用程序的前端部分的架構，我把這個想法告訴了幾個同事，經過一番頭腦風暴，這個想法變成了一個演示文稿，我把這個演示文稿先交給經理，然後再交給CTO。在6個月的時間裡，我們創建了一個團隊來實現這個想法，簡而言之，這個項目是將前端從一個大的單片機轉變為微前端，這個項目包括創建工具來實現這一目標，對單片機進行概念驗證，以及保持一切正常工作和整潔的最佳實踐。1名開發人員（我自己）、1名產品負責人、1名Scrum Master和1名經理。由於我加入了這個新的團隊，我不得不更換經理。承諾是將來會有更多的開發人員加入團隊。兩個月後，兩名開發人員加入了團隊，一個月後，他們因與工作無關的原因離開了公司（其中一名開發人員想成為一名醫生，另一名是他最好的朋友，並跟隨他）。兩個月後，另一個開發人員加入團隊，兩個月後他離開了公司，因為與之前的團隊相比，工作太難了。<p>在這一年半的時間裡，我和我的新經理就領導職位（後來變成了員工工程師職位）進行了不斷的會談，所發生的一切都是會談，只有會談，沒有任何行動。不可能調動這個職位的理由是，我需要展示對大量開發人員的管理技能，不幸的是，我的團隊只有兩個開發人員，而其他的團隊都非常獨立於我們，而其他團隊之所以獨立，是因為我們在記錄一切、建立工具和新的微前端方面做得很好，所以最佳實踐是很自然的。 <p>最糟糕的是，我以前的團隊中的每個人都得到了晉升，所有的初級人員現在都成了中級或高級人員，而另一個高級開發人員現在成了領導（一年半前我們的團隊中只有兩個高級人員）。<p>說實話，我不知道該怎麼辦了，我覺得我遇到了一堵磚牆，我每兩週和我的經理談論這個問題，他總是說會有辦法。工作已經變得沒有動力了，我最終進入了公司裡做得最辛苦的一個團隊，現在其他每個團隊都依賴這個團隊，而這隻會讓我退步。我試圖調回以前的團隊，但他們不允許我這樣做，因為我是對應用程序的架構和內部運作有最深入瞭解的人。\n"
}