{
  "@type": "NewsArticle",
  "identifier": "2022--06--21--en--askhn--HackerNews--NewsArticle--31824248",
  "url": "https://news.ycombinator.com/item?id=31824248",
  "headline": "Ask HN: What is the difference between SDE-2 vs. SDE-3 at Amazon?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have been writing Fullstack javascript since 2018. I currently am an instructor at a Fullstack js bootcamp lecturing and engineering. I have experience with front end frameworks/vanilla dom, node, express, postgres/mongo, docker, aws (only ebs), ci/cd, and am very comfortable in a Linux terminal. While I enjoy lecturing at the bootcamp, I’m looking for something with a more competitive salary.<p>I started applying for a role at Amazon and a recruiter reached out before I could even finish it on their portal. They are looking to interview me for an SDE-2 role. It looks like there’s quite the jump in average total comp at Amazon when going from SDE-2 to 3. I have been applying to senior roles for my applications to non-faang companies. Any insights as to whether or not it’s wise to push for sde3 here or just go through with the sde2 application would be greatly appreciated. Part of the background here is that many of the students at the bootcamp I work at get roles as sde2 at Amazon and similar, so I’m not sure if my desire for a senior role at a faang is justified even though I have more years of experience than them — could use some clarity here as I can’t determine if I’m over/undervaluing myself/experience.<p>Some other background is that I’m lucky enough to be a leetcode grinder for pleasure, but only really have what I would call a passing knowledge of system design. Happy to provide any other info that would be helpful here.<p>Side note: I’m not at all attached to my Amazon application, but it seems like the right vessel for me to use to make this post and better gauge where I’m at.<p>Thanks",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "LecroJS",
    "url": "https://news.ycombinator.com/user?id=LecroJS"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31824248",
  "sameAs": "https://news.ycombinator.com/item?id=31824248",
  "dateCreated": "2022-06-21T14:28:11.796Z",
  "datePublished": "2022-06-21T14:21:28.000Z",
  "dateModified": "2022-06-21T14:28:11.796Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 亚马逊的SDE-2与SDE-3之间有什么区别？\n",
  "headline_zh-Hant": "Ask HN: 亞馬遜的SDE-2與SDE-3之間有什麼區別？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "自2018年以来，我一直在编写Fullstack javascript。我目前是一个Fullstack js训练营的讲师，负责授课和工程。我对前端框架/vanilla dom、node、express、postgres/mongo、docker、aws（仅ebs）、ci/cd都有经验，在Linux终端上也非常自如。虽然我很喜欢在训练营讲课，但我想找一份薪水更有竞争力的工作。<p>我开始申请亚马逊的一个职位，在我还没有在他们的门户网站上完成之前，就有招聘人员主动联系我。他们想让我面试一个SDE-2的职位。看起来在亚马逊，从SDE-2到3的平均总薪酬有相当大的跳跃。如果有任何关于在这里推动SDE3或直接申请SDE2是否明智的见解，我们将不胜感激。我的部分背景是，我所在的训练营的许多学生都在亚马逊和类似的公司获得了sde2的职位，所以我不确定我是否有理由希望在一家公司获得高级职位，尽管我比他们有更多年的经验--我需要一些澄清，因为我无法确定我是否过度/低估了自己/经验。<p>另外一些背景是，我很幸运能够成为一名乐于学习的代码研磨者，但我真的只有所谓的系统设计的知识。<p>附带说明：我完全不重视我的亚马逊应用程序，但它似乎是我用来发布这个帖子和更好地衡量我所处位置的合适容器。\n",
  "description_zh-Hant": "自2018年以來，我一直在編寫Fullstack javascript。我目前是一個Fullstack js訓練營的講師，負責授課和工程。我對前端框架/vanilla dom、node、express、postgres/mongo、docker、aws（僅ebs）、ci/cd都有經驗，在Linux終端上也非常自如。雖然我很喜歡在訓練營講課，但我想找一份薪水更有競爭力的工作。<p>我開始申請亞馬遜的一個職位，在我還沒有在他們的門戶網站上完成之前，就有招聘人員主動聯繫我。他們想讓我面試一個SDE-2的職位。看起來在亞馬遜，從SDE-2到3的平均總薪酬有相當大的跳躍。如果有任何關於在這裡推動SDE3或直接申請SDE2是否明智的見解，我們將不勝感激。我的部分背景是，我所在的訓練營的許多學生都在亞馬遜和類似的公司獲得了sde2的職位，所以我不確定我是否有理由希望在一家公司獲得高級職位，儘管我比他們有更多年的經驗--我需要一些澄清，因為我無法確定我是否過度/低估了自己/經驗。<p>另外一些背景是，我很幸運能夠成為一名樂於學習的代碼研磨者，但我真的只有所謂的系統設計的知識。<p>附帶說明：我完全不重視我的亞馬遜應用程序，但它似乎是我用來發布這個帖子和更好地衡量我所處位置的合適容器。\n"
}