{
  "@type": "NewsArticle",
  "identifier": "2022--06--25--en--askhn--HackerNews--NewsArticle--31874053",
  "url": "https://news.ycombinator.com/item?id=31874053",
  "headline": "Ask HN: Need some advice about my SaaS",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Long time reader, and read HN many times a day. Feel like it’s time to get some advice about my situation.<p>I’ve wanted to run a company for years, and finally bit the bullet and left a very successful startup where I was the VP of Engineering. COVID hit a week after I left!<p>I wanted to build a product company, but wanted control of my destiny and to be able to do it on my terms and without the risk of my IP being taken (contract with employer at the time)<p>I started a company and was offering consulting services to bootstrap the product side. Two years of consulting success later the wheels started to slow as I got tired of hustling so hard. We launched a product and get great feedback for it, but it’s been a limited commercial success. (https://www.pearler.ai)<p>I’ve been chasing a big enterprise client and they have helped us to refine the product dramatically- it seems like it’s going to come together but it feels like too little too late. I guess I’m just a bit burnt out.<p>I’ve stopped all the consulting services and taken a day job. I own all of the company and it’s just me now (after having nearly ten people working in the company). I feel like the company is well setup (legally and financially), and I have the skills to lead and run a company. Just I feel stuck in the chasm of low revenue from Product. We’ve had investors interested but I’ve never sought external capital because I don’t feel confident enough in its prospects. It feels unfair to put someone else’s capital on the line until it’s a confirmed success? I think that’s holding me back.<p>The product is a typical SaaS product but is still small revenue ($1000 MRR)<p>I think what I’ve been missing is a co-founder that can help with marketing, customer demos, helping with website and organic content to bring in more customers.<p>We get great feedback but I’ve always been time poor and never been able to go all-in. I feel a bit stuck.<p>Thanks in advance for your thoughts!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "robingarnham",
    "url": "https://news.ycombinator.com/user?id=robingarnham"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31874053",
  "sameAs": "https://news.ycombinator.com/item?id=31874053",
  "dateCreated": "2022-06-25T10:26:38.149Z",
  "datePublished": "2022-06-25T10:22:24.000Z",
  "dateModified": "2022-06-25T10:26:38.149Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 需要一些关于我的SaaS的建议\n",
  "headline_zh-Hant": "Ask HN: 需要一些關於我的SaaS的建議\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个长期的读者，每天都会读很多遍HN。<p>我多年来一直想经营一家公司，最后咬咬牙离开了一家非常成功的创业公司，在那里我是工程部的副总裁。COVID在我离开后的一个星期就出现了！<p>我想建立一个产品公司，但我想控制自己的命运，并且能够按照自己的条件来做，而没有知识产权被剥夺的风险（当时与雇主签订的合同）<p>我创办了一家公司，并提供咨询服务来引导产品方面。两年的咨询成功后，由于我厌倦了拼命工作，轮子开始变慢。我们推出了一个产品，并得到了很好的反馈，但它的商业成功很有限。(https://www.pearler.ai)<p>我一直在追逐一个大的企业客户，他们帮助我们极大地完善了产品--看起来它将会实现，但感觉太少太晚了。我想我只是有点累了。<p>我已经停止了所有的咨询服务，并做了一份日常工作。我拥有所有的公司，现在只有我一个人（在有近十个人在公司工作之后）。我觉得公司设置得很好（法律上和财务上），而且我有领导和管理公司的技能。只是我觉得陷入了产品收入低的鸿沟。有投资者对我们感兴趣，但我从未寻求外部资本，因为我对它的前景没有足够的信心。在确认成功之前，把别人的资金放在生产线上，这感觉不公平？<p>产品是一个典型的SaaS产品，但仍然是小规模的收入（1000美元的MRR）。<p>我认为我一直缺少的是一个联合创始人，他可以帮助营销，客户演示，帮助网站和有机内容带来更多的客户。<p>我们得到了很好的反馈，但我总是时间不够，从来没有能够全身心投入。我觉得有点卡住了。<p>提前感谢您的想法\n",
  "description_zh-Hant": "我是一個長期的讀者，每天都會讀很多遍HN。<p>我多年來一直想經營一家公司，最後咬咬牙離開了一家非常成功的創業公司，在那裡我是工程部的副總裁。COVID在我離開後的一個星期就出現了！<p>我想建立一個產品公司，但我想控制自己的命運，並且能夠按照自己的條件來做，而沒有知識產權被剝奪的風險（當時與僱主簽訂的合同）<p>我創辦了一家公司，並提供諮詢服務來引導產品方面。兩年的諮詢成功後，由於我厭倦了拼命工作，輪子開始變慢。我們推出了一個產品，並得到了很好的反饋，但它的商業成功很有限。(https://www.pearler.ai)<p>我一直在追逐一個大的企業客戶，他們幫助我們極大地完善了產品--看起來它將會實現，但感覺太少太晚了。我想我只是有點累了。<p>我已經停止了所有的諮詢服務，並做了一份日常工作。我擁有所有的公司，現在只有我一個人（在有近十個人在公司工作之後）。我覺得公司設置得很好（法律上和財務上），而且我有領導和管理公司的技能。只是我覺得陷入了產品收入低的鴻溝。有投資者對我們感興趣，但我從未尋求外部資本，因為我對它的前景沒有足夠的信心。在確認成功之前，把別人的資金放在生產線上，這感覺不公平？<p>產品是一個典型的SaaS產品，但仍然是小規模的收入（1000美元的MRR）。<p>我認為我一直缺少的是一個聯合創始人，他可以幫助營銷，客戶演示，幫助網站和有機內容帶來更多的客戶。<p>我們得到了很好的反饋，但我總是時間不夠，從來沒有能夠全身心投入。我覺得有點卡住了。<p>提前感謝您的想法\n"
}