{
  "@type": "NewsArticle",
  "identifier": "2022--04--20--en--askhn--HackerNews--NewsArticle--31101899",
  "url": "https://news.ycombinator.com/item?id=31101899",
  "headline": "Ask HN: How can we improve diagnosis and treatment of chronic health conditions?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I'm in my late 30s, and over the last 10+ years I've grown increasingly pessimistic about the quality of care for chronic and degenerative conditions in the U.S. I'm reasonably well now, but I've had a number of issues I've had trouble shaking over the years. Things that are pretty common among my peers and others I talk to, like sleep issues, anxiety, depression, fatigue, digestive issues, autoimmune conditions, etc. Low grade stuff you can live with, but that bugs you for years while reducing quality of life. Doctors like to give vague sounding terms to these kind of things so they can convince the patient they know what the hell they're doing, like IBS and major depressive disorder.<p>But from what I've seen via personal experience, hearing from friends and family, and from reading countless reports online, doctors don't have a good handle on treating these chronic conditions. In fact, I'd say our treatment of chronic and degenerative disease is downright barbaric. And it doesn't matter if you go the conventional medicine route or alternative, it's a very crude system of diagnosis and treatment, barely better than guess and check with various interventions.<p>I group diagnosis and treatment into three different paths. 1) A normal doctor does a minimum number of tests, and prescribes pharmaceuticals, surgeries, and rarely lifestyle changes. 2) An alternative practitioner (naturopath, acupuncturist, etc.) does a minimal amount of testing and recommends herbs, supplements, body work, good vibes, and maybe lifestyle changes. 3) There's also the self care route, where patients research their own condition and experiment with various supplements and lifestyle interventions. This is likely to rarely be successful, but sometimes patients will crack a condition that doctors have failed, because they stumble upon a tough to find root cause after months or years of self experimentation.<p>Given the state of technology in the world, why is the route of diagnosis and treatment for so many conditions so poor. Why do we think it's acceptable to give people vague sounding diagnoses like IBS and major depressive disorder, that do nothing to get at what's actually causing the symptoms. Why don't doctors do way more tests to better diagnose what is actually causing these mystery syndromes?<p>I've personally found a number of nutrient excess and deficiency issues in myself, based on my own research and ordering my own labs online. These are things I was never tested for after 10+ years of seeing different doctors and naturopaths. I discovered I had high iron, a common cause of degenerative disease, and started donating blood. I discovered my zinc was low, while my copper was moderate, which is correlated with digestive issues and various mental health issues.<p>While this is definitely a rant (I'm frustrated and saddened), I also want to figure out how to improve things. I feel like we have the technology, it's just not being properly applied. As someone who's retired from tech, this is the kind of problem I'd love to sink my teeth into, but it feels too big and impossible. Is anyone around here working on this kind of stuff?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "yourabstraction",
    "url": "https://news.ycombinator.com/user?id=yourabstraction"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31101899",
  "sameAs": "https://news.ycombinator.com/item?id=31101899",
  "dateCreated": "2022-04-20T19:50:07.939Z",
  "datePublished": "2022-04-20T19:41:03.000Z",
  "dateModified": "2022-04-20T19:50:07.939Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我们怎样才能改善慢性健康状况的诊断和治疗？",
  "headline_zh-Hant": "Ask HN: 我們怎樣才能改善慢性健康狀況的診斷和治療？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我已经30多岁了，在过去的10多年里，我对美国的慢性病和退行性疾病的护理质量越来越悲观。这些问题在我的同龄人和与我交谈的其他人中相当普遍，如睡眠问题、焦虑、抑郁、疲劳、消化系统问题、自身免疫性疾病等。你可以忍受的低级别的东西，但会困扰你多年，同时降低生活质量。医生们喜欢给这些东西加上一些听起来很模糊的术语，这样他们就能让病人相信他们知道自己到底在做什么，比如肠胃炎和重度抑郁症。<p>但从我通过个人经验、从朋友和家人那里听到的以及从网上看到的无数报告来看，医生对治疗这些慢性病没有很好的把握。事实上，我想说我们对慢性和退行性疾病的治疗简直是野蛮的。而且不管你走的是传统医学路线还是替代疗法，这都是一个非常粗糙的诊断和治疗系统，勉强比猜测和检查各种干预措施要好。<p>我把诊断和治疗分为三个不同的路径。1）普通医生做最低数量的检查，并开出药品、手术，很少改变生活方式。2）另类医生（自然疗法、针灸师等）做最低数量的测试，并推荐草药、补充剂、身体工作、好的氛围，也许还有生活方式的改变。3）还有一种自我护理的途径，即病人研究自己的病情，并尝试各种补充剂和生活方式的干预。这很可能很少成功，但有时病人会破解医生未能解决的病症，因为他们在数月或数年的自我实验后，偶然发现了一个难以找到的根源。<p>鉴于世界上的技术状况，为什么这么多病症的诊断和治疗途径如此糟糕。为什么我们认为给人们提供听起来很模糊的诊断是可以接受的，如肠易激综合征和重度抑郁症，而这些诊断对解决导致这些症状的实际问题毫无帮助。为什么医生不做更多的测试来更好地诊断是什么原因导致了这些神秘的综合症？<p>根据我自己的研究和在网上订购自己的实验室，我个人发现了一些营养素过剩和缺乏的问题。这些都是我在看了10多年不同的医生和自然疗法后从未被检测过的东西。我发现自己有高铁，这是导致退化性疾病的一个常见原因，于是开始献血。我发现我的锌含量很低，而我的铜含量适中，这与消化系统问题和各种心理健康问题有关。<p>虽然这绝对是一种咆哮（我很沮丧和难过），但我也想弄清楚如何改善事情。我觉得我们有技术，只是没有被正确应用。作为一个从技术领域退休的人，我很想沉下心来解决这个问题，但感觉这个问题太大，不可能。这里有人在研究这种东西吗？",
  "description_zh-Hant": "我已經30多歲了，在過去的10多年裡，我對美國的慢性病和退行性疾病的護理質量越來越悲觀。這些問題在我的同齡人和與我交談的其他人中相當普遍，如睡眠問題、焦慮、抑鬱、疲勞、消化系統問題、自身免疫性疾病等。你可以忍受的低級別的東西，但會困擾你多年，同時降低生活質量。醫生們喜歡給這些東西加上一些聽起來很模糊的術語，這樣他們就能讓病人相信他們知道自己到底在做什麼，比如腸胃炎和重度抑鬱症。<p>但從我通過個人經驗、從朋友和家人那裡聽到的以及從網上看到的無數報告來看，醫生對治療這些慢性病沒有很好的把握。事實上，我想說我們對慢性和退行性疾病的治療簡直是野蠻的。而且不管你走的是傳統醫學路線還是替代療法，這都是一個非常粗糙的診斷和治療系統，勉強比猜測和檢查各種干預措施要好。<p>我把診斷和治療分為三個不同的路徑。1）普通醫生做最低數量的檢查，並開出藥品、手術，很少改變生活方式。2）另類醫生（自然療法、針灸師等）做最低數量的測試，並推薦草藥、補充劑、身體工作、好的氛圍，也許還有生活方式的改變。3）還有一種自我護理的途徑，即病人研究自己的病情，並嘗試各種補充劑和生活方式的干預。這很可能很少成功，但有時病人會破解醫生未能解決的病症，因為他們在數月或數年的自我實驗後，偶然發現了一個難以找到的根源。<p>鑑於世界上的技術狀況，為什麼這麼多病症的診斷和治療途徑如此糟糕。為什麼我們認為給人們提供聽起來很模糊的診斷是可以接受的，如腸易激綜合徵和重度抑鬱症，而這些診斷對解決導致這些症狀的實際問題毫無幫助。為什麼醫生不做更多的測試來更好地診斷是什麼原因導致了這些神秘的綜合症？<p>根據我自己的研究和在網上訂購自己的實驗室，我個人發現了一些營養素過剩和缺乏的問題。這些都是我在看了10多年不同的醫生和自然療法後從未被檢測過的東西。我發現自己有高鐵，這是導致退化性疾病的一個常見原因，於是開始獻血。我發現我的鋅含量很低，而我的銅含量適中，這與消化系統問題和各種心理健康問題有關。<p>雖然這絕對是一種咆哮（我很沮喪和難過），但我也想弄清楚如何改善事情。我覺得我們有技術，只是沒有被正確應用。作為一個從技術領域退休的人，我很想沉下心來解決這個問題，但感覺這個問題太大，不可能。這裡有人在研究這種東西嗎？"
}