{
  "@type": "NewsArticle",
  "identifier": "2022--06--14--en--askhn--HackerNews--NewsArticle--31745865",
  "url": "https://news.ycombinator.com/item?id=31745865",
  "headline": "Ask HN: How to ensure I don't let my parents down and do the best I can?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN, \nI’d like to preface my question with saying I acknowledge that I am a very privileged individual who’s lucky he has supportive family and friends to have the luxury of pursuing my dreams and people looking out for me<p>I’m currently in 11th grade and have high ambitions of pursuing my higher education abroad preferably in the US. I’ve had this dream since childhood and this incentivised me to always work hard in class in do my best alongside various activities. Recently I’ve been discussing finances, profile strength, and the like with my parents. My parents are extremely supportive of me and always want to provide me with the best of their resources they’re capable of providing. This includes: finding the best academic tutors for me, paying for summer programs and many more similar activities.<p>Regarding college applications we were looking for college counsellors and services that would help increase my chances and further work towards achieving my goal. With this being said, we looked at a few ranging from over 5 thousand dollars to 16 thousand dollars being the maximum. Keep in mind these programs are way above what my family would be comfortable providing with and the kids attending here usually have parents who are in the C - Level in large companies and the upper class income bracket. No-one I know in my immediate friend group is paying remotely close to this amount and are looking for cheaper/affordable options which are more flexible. I even have a younger brother who’s also probably going to study in the US considering the fact he’s a US citizen.<p>It comes as no surprise as the higher the prices of the counselling sessions go, the better results they usually have to the top colleges, sometimes even providing substatial aid to applicants  from an overrepresented country(India, China,etc). They generally have better tried and tested strategies and have people on the inside who have insight the average applicant here has no chance of knowing about.<p>I should also add my father also had a pretty unique experience regarding college as he was initially a mining engineer but felt it wasn’t for him and asked his father for money to change majors and my grandfather trusted him, giving him his money he’d saved for retirement with the trust that he knew he son would use it for good and it Paid off since my dad can now take care of him and live together<p>Anyways after meeting all of them and thinking about it, my father, who’s always been searching painlessly for the best resources to me staying until two am to find the best person who can mentor me; has agreed to go for the most expensive and well known one there is. While I felt grateful and acknowledge the fact that im so so lucky and privileged to have such supportive parents, who’ve even told me that they’re fine if nothing works out and I have to pull out my plan B and not to take stress. It has been gnawing my mind on how I can truly take every single opportunity that will handed to me and I don’t want to ever ‘waste’ any of this and feel guilty that they’re spending their hard earned money on me. They’re taking every humanly possible step they can to see me succeed and I don’t want to fail them even in the slightest.<p>How do I ensure that I do everything I possibly can in my hands to make sure my parents sacrifice doesn’t go in vain, and also don’t stay stressed 24/7 thinking about the fear of failure? Any advice would be much appreciated<p>TLDR; Parents risking almost all they’ve got to maximise my shot at college applications, how to succeed, not let them down and not be haunted by the possibility of failure.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Utkarsh_Mood",
    "url": "https://news.ycombinator.com/user?id=Utkarsh_Mood"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31745865",
  "sameAs": "https://news.ycombinator.com/item?id=31745865",
  "dateCreated": "2022-06-14T20:59:14.636Z",
  "datePublished": "2022-06-14T20:49:04.000Z",
  "dateModified": "2022-06-14T20:59:14.636Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何确保我不会让父母失望，并尽我所能？\n",
  "headline_zh-Hant": "Ask HN: 如何確保我不會讓父母失望，並盡我所能？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN。\n我想在提问前说，我承认我是一个非常幸运的人，他有支持我的家人和朋友，可以奢侈地追求我的梦想，并且有人为我着想<p>我现在读11年级，有很高的野心，希望在国外最好是在美国继续接受高等教育。我从小就有这个梦想，这激励着我在各种活动中始终努力学习，尽我所能。最近，我一直在与我的父母讨论财务问题、档案实力等问题。我的父母非常支持我，总是想为我提供他们所能提供的最好的资源。这包括：为我寻找最好的学术导师，支付暑期课程和更多类似的活动。<p>关于大学申请，我们正在寻找大学辅导员和服务，这将有助于增加我的机会，并进一步努力实现我的目标。说到这里，我们看了一些从5千多美元到1.6万美元是最高的。请记住，这些项目远远高于我的家庭所能提供的，而且在这里上学的孩子的父母通常都是大公司的C级人员和上层社会的收入。在我的朋友圈里，我认识的人都没有支付接近这个数额的费用，他们都在寻找更便宜/更实惠的选择，更灵活。我甚至有一个弟弟，考虑到他是美国公民，他也可能会去美国读书。<p>这并不奇怪，因为咨询课程的价格越高，他们通常对顶级大学的结果越好，有时甚至为来自超比例国家（印度、中国等）的申请人提供实质性的援助。他们通常有更好的经过测试的策略，并且有内部人员，他们的洞察力是这里的普通申请人没有机会了解的。 <p>我还应该补充一点，我父亲在上大学方面也有相当独特的经历，因为他最初是一名采矿工程师，但觉得这不适合他，于是向他父亲要钱换专业，我祖父信任他。我的祖父信任他，把他为退休而存的钱给了他，他知道他的儿子会把钱用在刀刃上，而这一切都得到了回报，因为我父亲现在可以照顾他并生活在一起<p>无论如何，在与他们所有人见面并考虑之后，我的父亲，一直在不遗余力地寻找最好的资源给我，一直到凌晨两点才找到可以指导我的最佳人选。他同意选择最昂贵和最知名的一个。当我对有这样支持我的父母感到感激和认可时，他们甚至告诉我，如果没有什么结果，我必须拿出我的B计划，他们也会很好，不要承受压力。我一直在想，我如何才能真正抓住每一个递给我的机会，我不想'浪费'任何一个机会，也不想因为他们在我身上花了辛苦赚来的钱而感到内疚。他们正在采取一切可能的措施来见证我的成功，我不想让他们失望，哪怕是一丁点。<p>我如何确保我所做的一切，以确保我父母的牺牲不会白费，同时也不会因为害怕失败而24小时保持压力？任何建议都非常感谢<p>TLDR; 父母冒着他们几乎所有的风险来最大限度地提高我申请大学的机会，如何成功，不让他们失望，不被失败的可能性所困扰。\n",
  "description_zh-Hant": "嗨，HN。\n我想在提問前說，我承認我是一個非常幸運的人，他有支持我的家人和朋友，可以奢侈地追求我的夢想，並且有人為我著想<p>我現在讀11年級，有很高的野心，希望在國外最好是在美國繼續接受高等教育。我從小就有這個夢想，這激勵著我在各種活動中始終努力學習，盡我所能。最近，我一直在與我的父母討論財務問題、檔案實力等問題。我的父母非常支持我，總是想為我提供他們所能提供的最好的資源。這包括：為我尋找最好的學術導師，支付暑期課程和更多類似的活動。<p>關於大學申請，我們正在尋找大學輔導員和服務，這將有助於增加我的機會，並進一步努力實現我的目標。說到這裡，我們看了一些從5千多美元到1.6萬美元是最高的。請記住，這些項目遠遠高於我的家庭所能提供的，而且在這裡上學的孩子的父母通常都是大公司的C級人員和上層社會的收入。在我的朋友圈裡，我認識的人都沒有支付接近這個數額的費用，他們都在尋找更便宜/更實惠的選擇，更靈活。我甚至有一個弟弟，考慮到他是美國公民，他也可能會去美國讀書。<p>這並不奇怪，因為諮詢課程的價格越高，他們通常對頂級大學的結果越好，有時甚至為來自超比例國家（印度、中國等）的申請人提供實質性的援助。他們通常有更好的經過測試的策略，並且有內部人員，他們的洞察力是這裡的普通申請人沒有機會了解的。 <p>我還應該補充一點，我父親在上大學方面也有相當獨特的經歷，因為他最初是一名採礦工程師，但覺得這不適合他，於是向他父親要錢換專業，我祖父信任他。我的祖父信任他，把他為退休而存的錢給了他，他知道他的兒子會把錢用在刀刃上，而這一切都得到了回報，因為我父親現在可以照顧他並生活在一起<p>無論如何，在與他們所有人見面並考慮之後，我的父親，一直在不遺餘力地尋找最好的資源給我，一直到凌晨兩點才找到可以指導我的最佳人選。他同意選擇最昂貴和最知名的一個。當我對有這樣支持我的父母感到感激和認可時，他們甚至告訴我，如果沒有什麼結果，我必須拿出我的B計劃，他們也會很好，不要承受壓力。我一直在想，我如何才能真正抓住每一個遞給我的機會，我不想'浪費'任何一個機會，也不想因為他們在我身上花了辛苦賺來的錢而感到內疚。他們正在採取一切可能的措施來見證我的成功，我不想讓他們失望，哪怕是一丁點。<p>我如何確保我所做的一切，以確保我父母的犧牲不會白費，同時也不會因為害怕失敗而24小時保持壓力？任何建議都非常感謝<p>TLDR; 父母冒著他們幾乎所有的風險來最大限度地提高我申請大學的機會，如何成功，不讓他們失望，不被失敗的可能性所困擾。\n"
}