{
  "@type": "NewsArticle",
  "identifier": "2022--06--30--en--askhn--HackerNews--NewsArticle--31938452",
  "url": "https://news.ycombinator.com/item?id=31938452",
  "headline": "Ask HN: Who Is Jamstack Aimed At?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've recently taken on my first project that's fully &quot;Jamstack&quot; [1] and I'm finding it very hard to understand who exactly these statically generated sites builders are aimed at?<p>The project is using Gatsby Cloud and Contentful. The key problems they have encountered are a) build times being painfully slow (+5 minutes per content change) and therefore b) the authoring/publishing experience is really poor as you can't easily see previews. These seem to be common complaints of static site generators (I'm also skipping over the general complexity required to get a website up and running with so many moving parts)<p>In order to tackle this problem, Gatsby offers a rendering feature called &quot;DSG&quot; (Deferred Static Generation) [2]. When enabled, instead of building all of your content up-front (the entire point of a statically generated site), only your core pages are generated at build-time. The rest of your &quot;long tail&quot; pages are only generated when someone first access them. To use this feature, you need to put a server in-front of your static site.<p>What?! It seems that the build times with statically generated sites have gotten so bad that the work-around is to literally go full-circle and re-create a dynamic website. The two big benefits of statically generated sites are apparently performance and server-less infrastructure, yet to deal with the downsides of generating pages up-front you need to introduce ... dynamically generated pages ... via a server.<p>I don't understand who this is for? Any company that requires the touted  performance gains that statically generated sites offer will surely also need quick builds and a good authoring experience? But to get those build times down you have to re-introduce infrastructure and dynamically generated pages?<p>Are there teams out there that are happy with their statically generated sites? Am I going mad?<p>[1] https://jamstack.org/\n[2] https://www.gatsbyjs.com/docs/how-to/rendering-options/using-deferred-static-generation/",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "aosaigh",
    "url": "https://news.ycombinator.com/user?id=aosaigh"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31938452",
  "sameAs": "https://news.ycombinator.com/item?id=31938452",
  "dateCreated": "2022-06-30T20:59:21.433Z",
  "datePublished": "2022-06-30T20:51:18.000Z",
  "dateModified": "2022-06-30T20:59:21.433Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: Jamstack的目标是谁？\n",
  "headline_zh-Hant": "Ask HN: Jamstack的目標是誰？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我最近接手了我的第一个项目，这个项目完全是&quot;Jamstack&quot;[1]，我发现我很难理解这些静态生成的网站建设者到底是针对谁的？<p>该项目使用Gatsby Cloud和Contentful。他们遇到的关键问题是：a) 构建时间慢得令人痛苦（每次内容变化需要5分钟），因此b) 编写/发布体验非常差，因为你无法轻易看到预览。这些似乎是对静态网站生成器的普遍抱怨（我也跳过了让网站启动和运行所需的一般复杂性，因为有这么多移动部件）<p>为了解决这个问题，Gatsby提供了一个名为&quot;DSG&quot;（延迟静态生成）的渲染功能[2]。启用该功能后，不再预先构建所有的内容（静态生成网站的全部要点），而是在构建时只生成你的核心页面。其余的&quot;长尾&quot;页面只在有人第一次访问时生成。要使用这个功能，你需要在你的静态网站前面放一个服务器。<p>什么？似乎静态生成的网站的构建时间已经变得如此糟糕，以至于解决的办法就是绕了一大圈，重新创建一个动态网站。静态生成网站的两大好处显然是性能和无服务器的基础设施，但为了处理预先生成页面的缺点，你需要引入......动态生成的页面......通过服务器。<p>我不明白这是为了谁？任何需要静态生成的网站所提供的吹嘘的性能提升的公司肯定也需要快速构建和良好的编写经验？但为了缩短这些构建时间，你必须重新引入基础设施和动态生成的页面？<p>是否有团队对他们的静态生成网站感到满意？我是不是疯了？<p>[1] https://jamstack.org/\n[2] https://www.gatsbyjs.com/docs/how-to/rendering-options/using-deferred-static-generation/\n",
  "description_zh-Hant": "我最近接手了我的第一個項目，這個項目完全是&quot;Jamstack&quot;[1]，我發現我很難理解這些靜態生成的網站建設者到底是針對誰的？<p>該項目使用Gatsby Cloud和Contentful。他們遇到的關鍵問題是：a) 構建時間慢得令人痛苦（每次內容變化需要5分鐘），因此b) 編寫/發佈體驗非常差，因為你無法輕易看到預覽。這些似乎是對靜態網站生成器的普遍抱怨（我也跳過了讓網站啟動和運行所需的一般複雜性，因為有這麼多移動部件）<p>為了解決這個問題，Gatsby提供了一個名為&quot;DSG&quot;（延遲靜態生成）的渲染功能[2]。啟用該功能後，不再預先構建所有的內容（靜態生成網站的全部要點），而是在構建時只生成你的核心頁面。其餘的&quot;長尾&quot;頁面只在有人第一次訪問時生成。要使用這個功能，你需要在你的靜態網站前面放一個服務器。<p>什麼？似乎靜態生成的網站的構建時間已經變得如此糟糕，以至於解決的辦法就是繞了一大圈，重新創建一個動態網站。靜態生成網站的兩大好處顯然是性能和無服務器的基礎設施，但為了處理預先生成頁面的缺點，你需要引入......動態生成的頁面......通過服務器。<p>我不明白這是為了誰？任何需要靜態生成的網站所提供的吹噓的性能提升的公司肯定也需要快速構建和良好的編寫經驗？但為了縮短這些構建時間，你必須重新引入基礎設施和動態生成的頁面？<p>是否有團隊對他們的靜態生成網站感到滿意？我是不是瘋了？<p>[1] https://jamstack.org/\n[2] https://www.gatsbyjs.com/docs/how-to/rendering-options/using-deferred-static-generation/\n"
}