{
  "@type": "NewsArticle",
  "identifier": "2022--04--25--en--askhn--HackerNews--NewsArticle--31150198",
  "url": "https://news.ycombinator.com/item?id=31150198",
  "headline": "Ask HN: Experiences Finding and Working with Nonprofits?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have a strong need for the work I do to be meaningful. The strongest contributor to that is that it &quot;helps people&quot;, especially people who don't have a lot of money. I have to really believe what I'm making is &quot;good&quot;, from a moral perspective. If I'm working for free, it feels even better. Ideally I'd work for free all the time. (My favorite thing to do is give people money, but I can't find a way to do it full-time ;)<p>FreeCodeCamp used to have a thing where at the end of the course you'd be paired up with a nonprofit and spend a few months working with them.<p>That always sounded great to me, so I was sad they stopped it and wondering if there are any sites like that, where you help nonprofits for free.<p>I actually found many such sites with a web search, so I was wondering if any of you have experience with such platforms, and more broadly advice about (and experiences with) working with nonprofits in general, if there any significant differences there to keep in mind.<p>Worth mentioning that I strongly prefer freelancing, in case that matters.<p>Thanks!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "andai",
    "url": "https://news.ycombinator.com/user?id=andai"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31150198",
  "sameAs": "https://news.ycombinator.com/item?id=31150198",
  "dateCreated": "2022-04-25T02:37:17.105Z",
  "datePublished": "2022-04-25T02:18:57.000Z",
  "dateModified": "2022-04-25T02:37:17.105Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 寻找非营利组织并与之合作的经验？",
  "headline_zh-Hant": "Ask HN: 尋找非營利組織並與之合作的經驗？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我非常需要我所做的工作是有意义的。最有力的贡献者是它能帮助人们，特别是那些没有很多钱的人。我必须真正相信我所做的事情是&quot;好&quot;，从道德的角度来看。如果我是免费工作，感觉就更好了。理想的情况是，我一直都是免费工作。(我最喜欢做的事情是给别人钱，但我找不到全职工作的方法；）<p>FreeCodeCamp曾经有一个活动，在课程结束后，你会和一个非营利组织结成对子，并花几个月的时间与他们一起工作。<p>这对我来说总是听起来很好，所以我很难过他们停止了它，并想知道是否有任何这样的网站，让你免费帮助非营利组织。 <p>实际上，我通过网络搜索发现了很多这样的网站，所以我想知道你们中是否有人对这样的平台有经验，以及更广泛的关于与非营利组织合作的建议（和经验），是否有任何重大的差异需要记住。<p>值得一提的是，我非常喜欢自由职业，如果这很重要。",
  "description_zh-Hant": "我非常需要我所做的工作是有意義的。最有力的貢獻者是它能幫助人們，特別是那些沒有很多錢的人。我必須真正相信我所做的事情是&quot;好&quot;，從道德的角度來看。如果我是免費工作，感覺就更好了。理想的情況是，我一直都是免費工作。(我最喜歡做的事情是給別人錢，但我找不到全職工作的方法；）<p>FreeCodeCamp曾經有一個活動，在課程結束後，你會和一個非營利組織結成對子，並花幾個月的時間與他們一起工作。<p>這對我來說總是聽起來很好，所以我很難過他們停止了它，並想知道是否有任何這樣的網站，讓你免費幫助非營利組織。 <p>實際上，我通過網絡搜索發現了很多這樣的網站，所以我想知道你們中是否有人對這樣的平臺有經驗，以及更廣泛的關於與非營利組織合作的建議（和經驗），是否有任何重大的差異需要記住。<p>值得一提的是，我非常喜歡自由職業，如果這很重要。"
}