{
  "@type": "NewsArticle",
  "identifier": "2022--06--09--en--askhn--HackerNews--NewsArticle--31681221",
  "url": "https://news.ycombinator.com/item?id=31681221",
  "headline": "Ask HN: Google claims impossible to access my email I have password to. Is it?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am bringing this to your attention because, if nothing else, I find it to be an interesting and thought provoking situation, and if any group could realistically do something about these kinds of problems (my case not withstanding), it’s you all.<p>I am trying to access an email from my early twenties for nostalgia and archival purposes, and I know my username and password but the old email I used for recovery is with a now defunct provider.  I attempted to purchase the domain of that provider, but it’s registered to a domain reseller and I offered up to $200 with no response, and even that amount seemed absurd to me.<p>Following all of Google’s docs, I saw there was no avenue via Google to access the account without that recovery email.  There more I thought on it, the more it seems like a policy that fails a smell test of human decency. Here is an exchange I am having on the Google community page:<p>https://support.google.com/accounts/thread/166498610?hl=en<p>Interestingly enough, a prime reason I am trying to access this email is to complete my process of “De-Googling” (if you are interested, I can tell you about this experience; I am near completely degoogled now and have a nice, secure alternative in place)  I want to archive all my Google data to my own servers, then remove the data from Google.   Getting access to these loose ends gives me closure and peace of mind.  I find it scary that a third party can have access to information about me, in this case thousands upon thousands of lines of my writing and exchanges, then simultaneously deny my access — even when I have all the authentication methods required when the initial “contract” of use was established.<p>I think all of us need to take a bit more care when it comes to user data.  These are more than just products and services; these are people’s memories.  People with wants, needs, joys, fears, and a whole range of experiences.  Technology and processes should do their best to offer value while minimizing suffering invoked.  They should augment the human condition, not diminish in.  In a case like mine — which is uncommon but not unprecedented — I entrusted a service believing I would have access to it with a username and password.  I had an understanding ofthe risk profile with that and was okay without 2fa.  The provider changed the contract without my consent and in doing so, has cut away my memories offloaded from my brain to their service.  There is something here that feels really wrong.<p>Sidenote:<p>If this seems complainy or ranty, I apologize to your senses.  I don't  see it that way; if I did, I would not be posting.  If you do feel that way, I'd like to know and have a conversation about it, and I would like to know your opinion on methods to properly talk about these kinds of issues in tech.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "survirtual",
    "url": "https://news.ycombinator.com/user?id=survirtual"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31681221",
  "sameAs": "https://news.ycombinator.com/item?id=31681221",
  "dateCreated": "2022-06-09T14:25:13.159Z",
  "datePublished": "2022-06-09T14:01:17.000Z",
  "dateModified": "2022-06-09T14:25:13.159Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 谷歌声称无法访问我的电子邮件，我有密码。是这样吗？\n",
  "headline_zh-Hant": "Ask HN: 谷歌聲稱無法訪問我的電子郵件，我有密碼。是這樣嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我之所以提请你们注意这个问题，是因为，如果不出意外的话，我觉得这是一个有趣的、发人深省的情况，如果有哪个团体能够切实地对这类问题做些什么（我的情况除外），那就是你们了。<p>我正试图访问我20岁出头时的一个电子邮件，用于怀旧和存档，我知道我的用户名和密码，但我用来恢复的旧电子邮件是在一个现已停业的供应商那里。 我试图购买该供应商的域名，但它被注册在一个域名代理商那里，我提出了高达200美元的报价，但没有得到任何回应，甚至这个数额对我来说也是荒谬的。<p>按照谷歌的所有文件，我看到没有任何渠道可以通过谷歌访问该账户，而没有那个恢复邮件。 我想得越多，就越觉得这是个无法通过人情味测试的政策。以下是我在谷歌社区网页上的交流：<p>https://support.google.com/accounts/thread/166498610?hl=en<p>有趣的是，我试图访问这封电子邮件的一个主要原因是为了完成我的 \"去谷歌化 \"进程（如果你有兴趣，我可以告诉你这个经验；我现在几乎完全去谷歌化了，并且有一个不错的、安全的替代方案），我想把我所有的谷歌数据存档到我自己的服务器，然后从谷歌删除这些数据。  获得对这些松散数据的访问权，使我的心境得到了结束和平静。 我觉得很可怕的是，第三方可以获得关于我的信息，在这种情况下，我的写作和交流有几千行，然后同时拒绝我的访问--即使我有最初建立使用 \"合同 \"时要求的所有认证方法。<p>我认为当涉及到用户数据时，我们所有人都需要更小心一些。 这些不仅仅是产品和服务；这些是人们的记忆。 人们有愿望、有需求、有欢乐、有恐惧，还有一系列的经历。 技术和流程应该尽力提供价值，同时最大限度地减少调用的痛苦。 它们应该增强人类的条件，而不是削弱。 像我这样的情况--虽然不常见，但也不是没有过--我委托了一项服务，相信我可以通过用户名和密码来访问它。 我对这种风险状况有所了解，没有2fa也没关系。 供应商在未经我同意的情况下改变了合同，并在这样做时，将我的记忆从我的大脑中卸载到了他们的服务中。 这里有一些东西让人感觉很不对劲。<p>附注：<p>如果这看起来很抱怨或很奔放，我向你的感觉道歉。 我并不这么认为；如果我这么认为，我就不会发帖了。 如果你确实有这种感觉，我想知道并就其进行对话，我想知道你对在技术领域正确谈论此类问题的方法的看法。\n",
  "description_zh-Hant": "我之所以提請你們注意這個問題，是因為，如果不出意外的話，我覺得這是一個有趣的、發人深省的情況，如果有哪個團體能夠切實地對這類問題做些什麼（我的情況除外），那就是你們了。<p>我正試圖訪問我20歲出頭時的一個電子郵件，用於懷舊和存檔，我知道我的用戶名和密碼，但我用來恢復的舊電子郵件是在一個現已停業的供應商那裡。 我試圖購買該供應商的域名，但它被註冊在一個域名代理商那裡，我提出了高達200美元的報價，但沒有得到任何迴應，甚至這個數額對我來說也是荒謬的。<p>按照谷歌的所有文件，我看到沒有任何渠道可以通過谷歌訪問該賬戶，而沒有那個恢復郵件。 我想得越多，就越覺得這是個無法通過人情味測試的政策。以下是我在谷歌社區網頁上的交流：<p>https://support.google.com/accounts/thread/166498610?hl=en<p>有趣的是，我試圖訪問這封電子郵件的一個主要原因是為了完成我的 \"去谷歌化 \"進程（如果你有興趣，我可以告訴你這個經驗；我現在幾乎完全去谷歌化了，並且有一個不錯的、安全的替代方案），我想把我所有的谷歌數據存檔到我自己的服務器，然後從谷歌刪除這些數據。  獲得對這些鬆散數據的訪問權，使我的心境得到了結束和平靜。 我覺得很可怕的是，第三方可以獲得關於我的信息，在這種情況下，我的寫作和交流有幾千行，然後同時拒絕我的訪問--即使我有最初建立使用 \"合同 \"時要求的所有認證方法。<p>我認為當涉及到用戶數據時，我們所有人都需要更小心一些。 這些不僅僅是產品和服務；這些是人們的記憶。 人們有願望、有需求、有歡樂、有恐懼，還有一系列的經歷。 技術和流程應該盡力提供價值，同時最大限度地減少調用的痛苦。 它們應該增強人類的條件，而不是削弱。 像我這樣的情況--雖然不常見，但也不是沒有過--我委託了一項服務，相信我可以通過用戶名和密碼來訪問它。 我對這種風險狀況有所瞭解，沒有2fa也沒關係。 供應商在未經我同意的情況下改變了合同，並在這樣做時，將我的記憶從我的大腦中卸載到了他們的服務中。 這裡有一些東西讓人感覺很不對勁。<p>附註：<p>如果這看起來很抱怨或很奔放，我向你的感覺道歉。 我並不這麼認為；如果我這麼認為，我就不會發帖了。 如果你確實有這種感覺，我想知道並就其進行對話，我想知道你對在技術領域正確談論此類問題的方法的看法。\n"
}