{
  "@type": "NewsArticle",
  "identifier": "2022--07--09--en--askhn--HackerNews--NewsArticle--32038122",
  "url": "https://news.ycombinator.com/item?id=32038122",
  "headline": "Ask HN: Personal finance blog as monetizable pet project?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am a FAANG tech worker bee (experience as software engineer, tech lead and engineering manager) who is growing significantly tired of the corporate rat race, and the fact that I have really no control over pretty much anything I do all day at work, I am at the whims of corporate politics that make every effort I spend objectively pointless, if it wasn't for the fact that it pays my salary. As such, I am looking to start some sort of pet project to satisfy my craving for ownership.<p>I think over the years I gained a unique perspective when it comes to personal finance, financial independence and passive investments, working in tech, tech compensations, startups and equity, and similar topics (a few snippets of this &quot;wisdom&quot; are available in my other comment down below). I routinely get calls from friends/acquaintances/ex coworkers asking for advice regarding one of these topics.<p>I am trying to understand if it would be worth starting a blog that covers these subjects. The goal would be to eventually monetize this in some way (ads, affiliate, consultations, …) just so that I could consider it worth my time.<p>Do you think this could be a viable strategy, or am I embarking on a sad journey that after thousands of hours spent creating content would leave me with nothing valuable to show for? A brutally honest answer would be highly appreciated, since I haven't started yet.<p>Thanks",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "deanmoriarty",
    "url": "https://news.ycombinator.com/user?id=deanmoriarty"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32038122",
  "sameAs": "https://news.ycombinator.com/item?id=32038122",
  "dateCreated": "2022-07-09T19:21:08.826Z",
  "datePublished": "2022-07-09T18:49:46.000Z",
  "dateModified": "2022-07-09T19:21:08.826Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 个人金融博客作为可盈利的宠物项目？\n",
  "headline_zh-Hant": "Ask HN: 個人金融博客作為可盈利的寵物項目？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我是一个FAANG的技术工人（有软件工程师、技术负责人和工程经理的经验），对公司的老鼠赛跑越来越感到厌倦，而且我真的无法控制我整天在工作中所做的几乎任何事情，我在公司政治的奇想，使我花的每一个努力客观上是没有意义的，如果不是因为它支付我的工资。<p>我认为，多年来，当涉及到个人财务、财务独立和被动投资、在技术领域工作、技术补偿、初创企业和股权以及类似话题时，我获得了独特的视角（这些&quot;智慧&quot;的几个片段可在我下面的另一条评论中找到）。我经常接到朋友/熟人/前同事的电话，询问有关这些话题的建议。<p>我正试图了解是否值得开一个涵盖这些主题的博客。目标是最终以某种方式（广告、联盟、咨询......）实现盈利，这样我就可以认为它值得我花时间。<p>你认为这可能是一个可行的策略，还是说我正在踏上一个悲伤的旅程，在花费数千小时创建内容后，我将没有任何有价值的东西可以展示？请给我一个残酷的、诚实的答案，因为我还没有开始。\n",
  "description_zh-Hant": "我是一個FAANG的技術工人（有軟件工程師、技術負責人和工程經理的經驗），對公司的老鼠賽跑越來越感到厭倦，而且我真的無法控制我整天在工作中所做的幾乎任何事情，我在公司政治的奇想，使我花的每一個努力客觀上是沒有意義的，如果不是因為它支付我的工資。<p>我認為，多年來，當涉及到個人財務、財務獨立和被動投資、在技術領域工作、技術補償、初創企業和股權以及類似話題時，我獲得了獨特的視角（這些&quot;智慧&quot;的幾個片段可在我下面的另一條評論中找到）。我經常接到朋友/熟人/前同事的電話，詢問有關這些話題的建議。<p>我正試圖瞭解是否值得開一個涵蓋這些主題的博客。目標是最終以某種方式（廣告、聯盟、諮詢......）實現盈利，這樣我就可以認為它值得我花時間。<p>你認為這可能是一個可行的策略，還是說我正在踏上一個悲傷的旅程，在花費數千小時創建內容後，我將沒有任何有價值的東西可以展示？請給我一個殘酷的、誠實的答案，因為我還沒有開始。\n"
}