{
  "@type": "NewsArticle",
  "identifier": "2022--07--13--en--askhn--HackerNews--NewsArticle--32079130",
  "url": "https://news.ycombinator.com/item?id=32079130",
  "headline": "Ask HN: Going through a traumatic personal situation and HN is my last resort",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Question<p>I’m sorry if this is the wrong place to ask but I don’t know where else to go. There is no TLDR because the situation is fairly complicated in my opinion.<p>A few months back a family member (not immediate, let us call them X) and I got really close (non romantic), more of a sibling-y relationship from both sides and we had a falling out recently. The falling out was not just one thing but a series of minor things that finally blew up one day and ended in a huge argument and a fight.<p>After said event I told X “I’ve had enough I cannot deal with this the way things are, I don’t think things are gonna be the same as what they were before, the best we can do is let things go, let time heal and after a while see where it goes and let’s live with it.” X agreed.<p>After a few days, X comes back with “I’m not sure what I did wrong, even if I did, is it such a big deal that we can’t bring the old normal back?”<p>I explain her in excruciating detail about what happened, why I can’t be the same as before and whatnot. She nods along, agrees, and decides to leave me alone. Things are okay for a few days and then she again comes with the “Im not sure what I did wrong etc.” and then I explain my point of view again.<p>This cycle has repeated itself about 15 times in the last 40 days or so. And during all this she oscillates between “It’s my mistake” and “I did not do anything”. And I’ve been thoroughly exhausted with explaining the same things over and over again. I brought this up a couple weeks back and she said she regrets her behaviour she will try to forget all this and move on. But last week, she again comes back with “Why can’t we go back to what we had before etc.,” and I lost it.<p>I informed her sister about what happened and asked her to intervene and all she is getting from X is “we were really close how do i suddenly let this go when he was a lot of things to me” (we had a relationship where i taught her stuff, got her books, mentored her in an unofficial capacity, introduced her to nice bands, taught her financial literacy whatnot). The sister is extremely upset seeing X upset and crying a lot over this when X was asked about what was going on.  X’s sister is married to my brother. My brother is upset. X’s sister is upset. X is upset. X has been upset about this for a while now and is not moving on from this. She says she has never been this close to anyone for a long time and this is super hurtful for her. Talking to X about this is out of the question cos I’ve spoken so many times and she refuses to let go which was why this was taken to her sister for a resolution.<p>I feel guilty about all this cos I feel responsible I’ve caused X to be upset about everything while the logical part of my brain goes “this is how she is dealing with the consequences of her actions and you’ve tried all you can there’s nothing else you can do”<p>But the guilt is killing me. I don’t want X to get depressed over this and not move on. I’m also upset this has caused a lot of strain in relationships with my brother and his wife. I'm also worried X will get suicidal or go into a spell of depression. I’m not able to concentrate on anything and my work life is suffering. I’m not sure what I’m trying to ask here but how do i process this situation and get out of it? What would be the best way to get X to understand this and move on?<p>PS: This has been going on for about 45 to 60 days now and does not seem to go away. I’m 35 Male and X is 25 Female if that makes any difference.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "stillblue",
    "url": "https://news.ycombinator.com/user?id=stillblue"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32079130",
  "sameAs": "https://news.ycombinator.com/item?id=32079130",
  "dateCreated": "2022-07-13T05:11:47.095Z",
  "datePublished": "2022-07-13T04:47:57.000Z",
  "dateModified": "2022-07-13T05:11:47.095Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 3
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 经历了一个创伤性的个人情况，HN是我最后的选择。\n",
  "headline_zh-Hant": "Ask HN: 經歷了一個創傷性的個人情況，HN是我最後的選擇。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "问题<p>我很抱歉，如果这是个错误的地方，但我不知道还能去哪里。<p>几个月前，我和一个家庭成员（不是直系亲属，让我们称他们为X）走得非常近（非浪漫），双方更像是兄弟姐妹的关系，最近我们发生了争吵。<p>在上述事件发生后，我告诉X：\"我已经受够了，我不能以这种方式处理事情，我不认为事情会和以前一样，我们能做的最好的事情是让事情过去，让时间愈合，一段时间后看它的发展，让我们与它一起生活。X同意了。<p>过了几天，X回来说：\"我不知道我做错了什么，即使我做错了，我们不能恢复以前的正常状态，有这么大的问题吗？\"<p>我向她详细解释了发生的事情，为什么我不能和以前一样，等等。她点了点头，同意了，并决定不再管我。事情过了几天就好了，然后她又说 \"我不确定我做错了什么\"，然后我再次解释我的观点。而在这期间，她在 \"这是我的错误 \"和 \"我没有做任何事情 \"之间摇摆不定。而我已经被反复解释同样的事情弄得筋疲力尽。我在几周前提出了这个问题，她说她很后悔自己的行为，她会试着忘记这一切，继续前进。但是上个星期，她又来了，说 \"为什么我们不能回到以前的状态等等\"，我失去了理智。<p>我把发生的事情告诉了她的姐姐，并要求她进行干预，而她从X那里得到的是 \"我们真的很亲密，我怎么能突然让这件事过去，他对我有很多好处\"（我们有一段关系，我教她东西，给她买书，以非官方的身份指导她，把她介绍给好乐队，教她金融知识等等）。当X被问及此事时，她的姐姐看到X为此事感到非常不安，并大哭了一场。 X的姐姐嫁给了我哥哥。我哥哥很不高兴。X的姐姐很难过。X很不高兴。X为这件事难过了好一阵子，并没有从这件事中走出来。她说她已经很久没有和别人这么亲近了，这对她来说是极大的伤害。因为我已经说过很多次了，她拒绝放手，这就是为什么要把这件事交给她姐姐解决的原因。<p>我对这一切感到内疚，因为我觉得我有责任让X对一切都感到不安，而我大脑的逻辑部分却说：\"这是她处理自己行为后果的方式，你已经尽力了，你没有别的办法。我不希望X因为这个问题而感到沮丧，不能继续前进。我也很难过，这给我和我哥哥以及他妻子的关系带来了很大的压力。我还担心X会有自杀倾向，或者陷入抑郁症的漩涡。我无法集中精力做任何事情，我的工作生活也受到影响。我不知道我想问什么，但我该如何处理这种情况并摆脱它？怎样才能让X理解这一点并继续前进？<p>PS：这种情况已经持续了大约45到60天，似乎并没有消失。我是35岁的男性，X是25岁的女性，如果这有什么不同的话。\n",
  "description_zh-Hant": "問題<p>我很抱歉，如果這是個錯誤的地方，但我不知道還能去哪裡。<p>幾個月前，我和一個家庭成員（不是直系親屬，讓我們稱他們為X）走得非常近（非浪漫），雙方更像是兄弟姐妹的關係，最近我們發生了爭吵。<p>在上述事件發生後，我告訴X：\"我已經受夠了，我不能以這種方式處理事情，我不認為事情會和以前一樣，我們能做的最好的事情是讓事情過去，讓時間癒合，一段時間後看它的發展，讓我們與它一起生活。X同意了。<p>過了幾天，X回來說：\"我不知道我做錯了什麼，即使我做錯了，我們不能恢復以前的正常狀態，有這麼大的問題嗎？\"<p>我向她詳細解釋了發生的事情，為什麼我不能和以前一樣，等等。她點了點頭，同意了，並決定不再管我。事情過了幾天就好了，然後她又說 \"我不確定我做錯了什麼\"，然後我再次解釋我的觀點。而在這期間，她在 \"這是我的錯誤 \"和 \"我沒有做任何事情 \"之間搖擺不定。而我已經被反覆解釋同樣的事情弄得筋疲力盡。我在幾周前提出了這個問題，她說她很後悔自己的行為，她會試著忘記這一切，繼續前進。但是上個星期，她又來了，說 \"為什麼我們不能回到以前的狀態等等\"，我失去了理智。<p>我把發生的事情告訴了她的姐姐，並要求她進行干預，而她從X那裡得到的是 \"我們真的很親密，我怎麼能突然讓這件事過去，他對我有很多好處\"（我們有一段關係，我教她東西，給她買書，以非官方的身份指導她，把她介紹給好樂隊，教她金融知識等等）。當X被問及此事時，她的姐姐看到X為此事感到非常不安，並大哭了一場。 X的姐姐嫁給了我哥哥。我哥哥很不高興。X的姐姐很難過。X很不高興。X為這件事難過了好一陣子，並沒有從這件事中走出來。她說她已經很久沒有和別人這麼親近了，這對她來說是極大的傷害。因為我已經說過很多次了，她拒絕放手，這就是為什麼要把這件事交給她姐姐解決的原因。<p>我對這一切感到內疚，因為我覺得我有責任讓X對一切都感到不安，而我大腦的邏輯部分卻說：\"這是她處理自己行為後果的方式，你已經盡力了，你沒有別的辦法。我不希望X因為這個問題而感到沮喪，不能繼續前進。我也很難過，這給我和我哥哥以及他妻子的關係帶來了很大的壓力。我還擔心X會有自殺傾向，或者陷入抑鬱症的漩渦。我無法集中精力做任何事情，我的工作生活也受到影響。我不知道我想問什麼，但我該如何處理這種情況並擺脫它？怎樣才能讓X理解這一點並繼續前進？<p>PS：這種情況已經持續了大約45到60天，似乎並沒有消失。我是35歲的男性，X是25歲的女性，如果這有什麼不同的話。\n"
}