{
  "@type": "NewsArticle",
  "identifier": "2022--07--06--en--askhn--HackerNews--NewsArticle--32000922",
  "url": "https://news.ycombinator.com/item?id=32000922",
  "headline": "Ask HN: Should I take a step back in Seniority? (Sen-Mid)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I am currently a Senior Dev at the Eastern Europe branch of a well known (esp here) company and I have around 7 practical years experience in programming (a few more in other IT services).<p>I won't go into much details (colleagues read HN), but my dev stack isn't the best paid, however I am in the process of becoming a Team Lead at the current company.<p>I recently got offered to interview for a senior position at another company where I will learn a much better stack and new technologies.<p>All was well on the interview (from my point), but it seems that they didn't deem me as Senior material yet and want me to join as a mid level (pay is still higher than current, but not that much and is a lot lower than what I wanted).<p>At what point do you think taking a step back in seniority is worth it? Does it actually even matter if the pay is better and I will learn a better stack? However I will likely make TL soon and get the same pay in the following months.<p>I feel a bit cheated by the whole process.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "positionPanic",
    "url": "https://news.ycombinator.com/user?id=positionPanic"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32000922",
  "sameAs": "https://news.ycombinator.com/item?id=32000922",
  "dateCreated": "2022-07-06T14:01:07.262Z",
  "datePublished": "2022-07-06T13:54:32.000Z",
  "dateModified": "2022-07-06T14:01:07.262Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我应该在资历上退一步吗？(Sen-mid)\n",
  "headline_zh-Hant": "Ask HN: 我應該在資歷上退一步嗎？(Sen-mid)\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我目前是一家知名公司（特别是这里）东欧分公司的高级开发人员，我在编程方面有大约7年的实际经验（在其他IT服务方面还有一些经验）。<p>我不会说太多细节（同事们都读过HN），但我的开发栈不是最好的报酬，不过我正在成为当前公司的团队领导。 <p>我最近收到了另一家公司的高级职位的面试通知，在那里我将学到更好的堆栈和新技术。<p>面试一切顺利（从我的角度来看），但他们似乎还不认为我是高级人才，希望我以中级职位加入（薪酬仍然比现在高，但不是那么多，而且比我想要的低很多）。<p>你认为在什么时候退一步资历值得？如果工资更高了，而且我将学到更好的堆栈，这实际上有什么关系吗？然而，我可能很快就会进入TL，并在接下来的几个月里得到同样的报酬。<p>我觉得整个过程有点受骗。\n",
  "description_zh-Hant": "我目前是一家知名公司（特別是這裡）東歐分公司的高級開發人員，我在編程方面有大約7年的實際經驗（在其他IT服務方面還有一些經驗）。<p>我不會說太多細節（同事們都讀過HN），但我的開發棧不是最好的報酬，不過我正在成為當前公司的團隊領導。 <p>我最近收到了另一家公司的高級職位的面試通知，在那裡我將學到更好的堆棧和新技術。<p>面試一切順利（從我的角度來看），但他們似乎還不認為我是高級人才，希望我以中級職位加入（薪酬仍然比現在高，但不是那麼多，而且比我想要的低很多）。<p>你認為在什麼時候退一步資歷值得？如果工資更高了，而且我將學到更好的堆棧，這實際上有什麼關係嗎？然而，我可能很快就會進入TL，並在接下來的幾個月裡得到同樣的報酬。<p>我覺得整個過程有點受騙。\n"
}