{
  "@type": "NewsArticle",
  "identifier": "2022--07--05--en--askhn--HackerNews--NewsArticle--31986901",
  "url": "https://news.ycombinator.com/item?id=31986901",
  "headline": "Ask HN: How to Encourage Information Sharing?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "My client has a deeply ingrained culture of information hoarding and strict job definitions, and it's holding them back from being able to scale their operation. The work isn't difficult or complex but completing it takes forever due to all the hand-offs and errors caused by a lack of up-to-date documentation. I can't grow the team because their culture makes it really difficult for new people to come up to speed.<p>They don't even follow the docs that they have, and they certainly don't update them when they notice errors or omissions.  In some cases, I've witnessed them performing a task that is documented on a Wiki page (last updated: 2016!), but they skip some steps, perform others differently from the doc, and do things not covered in the doc at all.  When I asked why they don't update the docs, they respond with claims of &quot;it's not my doc&quot; or &quot;it's owned by Team X&quot; so they can't change it.<p>They rarely describe the solution for bug fixes in the Jira ticket and instead just declare it fixed and pass it to QA so the knowledge stays with the person that fixed the bug. They've even refused to share their screen during live debugging sessions and instead just loosely describe what they're doing in words.<p>How can I foster a culture of information sharing?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "jkjdowindnaweuh",
    "url": "https://news.ycombinator.com/user?id=jkjdowindnaweuh"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31986901",
  "sameAs": "https://news.ycombinator.com/item?id=31986901",
  "dateCreated": "2022-07-05T11:43:24.693Z",
  "datePublished": "2022-07-05T11:28:50.000Z",
  "dateModified": "2022-07-05T11:43:24.693Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何鼓励信息共享？\n",
  "headline_zh-Hant": "Ask HN: 如何鼓勵信息共享？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的客户有一种根深蒂固的信息囤积和严格的工作定义的文化，这使他们无法扩大他们的业务。工作并不难，也不复杂，但由于缺乏最新的文件，导致所有的交接和错误，完成工作需要很长时间。我无法发展这个团队，因为他们的文化让新人很难上手。<p>他们甚至不遵守他们所拥有的文档，而且当他们发现错误或遗漏时，他们当然不会更新它们。 在某些情况下，我目睹了他们执行一项在Wiki页面上有记录的任务（最后更新时间：2016年！），但他们跳过了一些步骤，以不同于文档的方式执行其他步骤，并做了文档中根本没有涉及的事情。 当我问他们为什么不更新文档时，他们的回答是&quot;这不是我的文档&quot;或者&quot;这是由X团队拥有的&quot;所以他们不能改变它。<p>他们很少在Jira票据中描述错误修复的解决方案，而只是宣布它已被修复并将其传递给QA，因此知识停留在修复错误的人那里。他们甚至拒绝在现场调试过程中分享他们的屏幕，而只是松散地用文字描述他们正在做的事情。<p>我怎样才能培养一种信息共享的文化？\n",
  "description_zh-Hant": "我的客戶有一種根深蒂固的信息囤積和嚴格的工作定義的文化，這使他們無法擴大他們的業務。工作並不難，也不復雜，但由於缺乏最新的文件，導致所有的交接和錯誤，完成工作需要很長時間。我無法發展這個團隊，因為他們的文化讓新人很難上手。<p>他們甚至不遵守他們所擁有的文檔，而且當他們發現錯誤或遺漏時，他們當然不會更新它們。 在某些情況下，我目睹了他們執行一項在Wiki頁面上有記錄的任務（最後更新時間：2016年！），但他們跳過了一些步驟，以不同於文檔的方式執行其他步驟，並做了文檔中根本沒有涉及的事情。 當我問他們為什麼不更新文檔時，他們的回答是&quot;這不是我的文檔&quot;或者&quot;這是由X團隊擁有的&quot;所以他們不能改變它。<p>他們很少在Jira票據中描述錯誤修復的解決方案，而只是宣佈它已被修復並將其傳遞給QA，因此知識停留在修復錯誤的人那裡。他們甚至拒絕在現場調試過程中分享他們的屏幕，而只是鬆散地用文字描述他們正在做的事情。<p>我怎樣才能培養一種信息共享的文化？\n"
}