{
  "@type": "NewsArticle",
  "identifier": "2022--04--15--en--askhn--HackerNews--NewsArticle--31037947",
  "url": "https://news.ycombinator.com/item?id=31037947",
  "headline": "Ask HN: Finally ready to share my personal work, how to manage expectations?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "After several fruitful exchanges here on HN, I think I'm finally ready to start putting some of my personal work out there into the real-world!<p>My original &quot;plan&quot; (ie grand scheme) was to have everything figured out and perfected and then publish it all at once, fireworks and all. Needless to say I no longer think that's a good idea...<p>So with a slow start, I don't expect there to be any audience for probably quite some time, and I'm okay with that (it'll give me time to play around anyway). But then, what else does one do besides regularly posting content? Where does one get quality, honest feedback? With so little feedback, how does one know if the content's any good? And if one upholds to high standards (which I do), how can one present their work to reputable individuals without getting &quot;sympathy&quot; feedback? All of which then makes me wonder: What sets the successful &quot;creators&quot; apart from the rest? Quality? Timing? Luck? Network?<p>Sorry there's a lot of unknowns as I've never done anything like this before (in fact this was probably why I had avoided sharing personal work for so long).<p>So for those of you who have been on this path:<p>What's been your experience? What worked for you and what didn't? How did you manage to get good feedback?<p>Do you know of any good resources (books, articles, etc) that cover this topic?<p>Thanks so much in advance! :)",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "samh748",
    "url": "https://news.ycombinator.com/user?id=samh748"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31037947",
  "sameAs": "https://news.ycombinator.com/item?id=31037947",
  "dateCreated": "2022-04-15T09:10:48.450Z",
  "datePublished": "2022-04-15T08:56:08.000Z",
  "dateModified": "2022-04-15T09:10:48.450Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 终于准备好分享我的个人作品了，如何管理预期？",
  "headline_zh-Hant": "Ask HN: 終於準備好分享我的個人作品了，如何管理預期？",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在HN上进行了几次卓有成效的交流之后，我想我终于准备好将我的一些个人工作放到现实世界中去了！<p>我最初的&quot;计划&quot;（即宏伟的计划）是将所有的东西都想好并完善起来，然后将其一次性发布，烟花和所有。不用说，我不再认为这是一个好主意......<p>因此，由于起步缓慢，我预计可能在相当长的一段时间内不会有任何受众，我对此无所谓（反正我有时间来玩玩）。但是，除了定期发布内容之外，一个人还能做什么？一个人从哪里得到高质量的、诚实的反馈？在如此少的反馈下，一个人如何知道内容是否好？如果一个人坚持高标准（我就是这样做的），他怎么能向有名望的人展示自己的作品而不得到同情的反馈？所有这些都让我想知道。是什么让成功的 \"创作者 \"从其他人中脱颖而出？质量？时机？运气？<p>对不起，我有很多未知数，因为我以前从未做过这样的事情（事实上，这可能是我长期以来避免分享个人作品的原因）。什么对你有用，什么没有？你是如何获得良好的反馈的？<p>你知道有什么好的资源（书籍、文章等）涉及这个话题吗？:)",
  "description_zh-Hant": "在HN上進行了幾次卓有成效的交流之後，我想我終於準備好將我的一些個人工作放到現實世界中去了！<p>我最初的&quot;計劃&quot;（即宏偉的計劃）是將所有的東西都想好並完善起來，然後將其一次性發布，煙花和所有。不用說，我不再認為這是一個好主意......<p>因此，由於起步緩慢，我預計可能在相當長的一段時間內不會有任何受眾，我對此無所謂（反正我有時間來玩玩）。但是，除了定期發佈內容之外，一個人還能做什麼？一個人從哪裡得到高質量的、誠實的反饋？在如此少的反饋下，一個人如何知道內容是否好？如果一個人堅持高標準（我就是這樣做的），他怎麼能向有名望的人展示自己的作品而不得到同情的反饋？所有這些都讓我想知道。是什麼讓成功的 \"創作者 \"從其他人中脫穎而出？質量？時機？運氣？<p>對不起，我有很多未知數，因為我以前從未做過這樣的事情（事實上，這可能是我長期以來避免分享個人作品的原因）。什麼對你有用，什麼沒有？你是如何獲得良好的反饋的？<p>你知道有什麼好的資源（書籍、文章等）涉及這個話題嗎？:)"
}