{
  "@type": "NewsArticle",
  "identifier": "2022--06--12--en--askhn--HackerNews--NewsArticle--31719380",
  "url": "https://news.ycombinator.com/item?id=31719380",
  "headline": "Ask HN: How to make use of Virtual Personal Assistance services?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Yesterday there was an interesting posting about 'Things you're allowed to do': https://news.ycombinator.com/item?id=31705542<p>One point was that you can use personal assistant services.<p>A few weeks ago I actually signed up for virtual personal assistant  (VPA) service because I had a specific problem: I needed to book an appointment through a company that had very long telephone queues, and they were only operating during my work hours were meetings would interfere with me sitting in the phone queue. I tasked an assistant to sit in the phone queue and book an appointment for me.<p>It worked out great! After just a day I got a message back from the VPA that they had booked me at a time when I had availability!<p>It felt like a huge load off my back to just have it done, after having tried several times and not managing to get through the queue before I needed to head for a work meeting.<p>After this, I'm excited about using the VPA to simplify my life even further.<p>However, I'm not sure what I can use it for. It seems really convenient for organizing travel, but I don't have any travel planned.<p>Do people of HN have experience simplifying their lives with virtual personal assistants?<p>What kind of things have you used virtual personal assistants for?<p>Have you tried integrating it in you jobs? I would love to use it for things such as booking meeting rooms at work, etc. But I think secrecy in our company (it's a biotech) would prevent this.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "cvsv",
    "url": "https://news.ycombinator.com/user?id=cvsv"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31719380",
  "sameAs": "https://news.ycombinator.com/item?id=31719380",
  "dateCreated": "2022-06-12T23:56:33.141Z",
  "datePublished": "2022-06-12T23:48:50.000Z",
  "dateModified": "2022-06-12T23:56:33.141Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何利用虚拟个人助理服务？\n",
  "headline_zh-Hant": "Ask HN: 如何利用虛擬個人助理服務？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "昨天有一篇关于 \"允许你做的事情 \"的有趣帖子：https://news.ycombinator.com/item?id=31705542<p>其中一点是，你可以使用个人助理服务。<p>几周前，我实际上注册了虚拟个人助理（VPA）服务，因为我有一个具体的问题：我需要通过一家公司预约，这家公司的电话排队时间很长，而且他们只在我工作时间内营业，开会时会影响我坐在电话排队中。我让一名助理坐在电话队列中，为我预约。<p>效果很好！仅仅一天后，我就收到了一条信息，说我的电话已经打通。仅仅过了一天，我就收到了VPA发来的消息，他们在我有时间的时候为我预约了时间！<p>在我尝试了几次，在我需要去参加工作会议之前无法通过排队之后，我感觉到了巨大的负担。<p>在这之后，我对使用VPA来进一步简化我的生活感到兴奋。<p>HN的人们有使用虚拟个人助理简化生活的经验吗？<p>你们使用虚拟个人助理做了哪些事情？我很想用它来做一些事情，比如在工作中预订会议室等。但我认为我们公司的保密性（这是一家生物技术公司）会阻止这一点。\n",
  "description_zh-Hant": "昨天有一篇關於 \"允許你做的事情 \"的有趣帖子：https://news.ycombinator.com/item?id=31705542<p>其中一點是，你可以使用個人助理服務。<p>幾周前，我實際上註冊了虛擬個人助理（VPA）服務，因為我有一個具體的問題：我需要通過一家公司預約，這家公司的電話排隊時間很長，而且他們只在我工作時間內營業，開會時會影響我坐在電話排隊中。我讓一名助理坐在電話隊列中，為我預約。<p>效果很好！僅僅一天後，我就收到了一條信息，說我的電話已經打通。僅僅過了一天，我就收到了VPA發來的消息，他們在我有時間的時候為我預約了時間！<p>在我嘗試了幾次，在我需要去參加工作會議之前無法通過排隊之後，我感覺到了巨大的負擔。<p>在這之後，我對使用VPA來進一步簡化我的生活感到興奮。<p>HN的人們有使用虛擬個人助理簡化生活的經驗嗎？<p>你們使用虛擬個人助理做了哪些事情？我很想用它來做一些事情，比如在工作中預訂會議室等。但我認為我們公司的保密性（這是一家生物技術公司）會阻止這一點。\n"
}