{
  "@type": "NewsArticle",
  "identifier": "2022--08--09--en--askhn--HackerNews--NewsArticle--32394625",
  "url": "https://news.ycombinator.com/item?id=32394625",
  "headline": "Ask HN: Have you or know someone who has been cured of acrophobia (50 yrs)?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have been having an ongoing fear of heights since childhood, based on what I could explain as some sort of genetic defect (i.e. no accidents, no memories of events associated with heights, etc.). Ever since grammar school, I haven't been able to go hiking with my friends, climb stairs too high, look over a balcony on a higher than 3rd level, look through a wall size window of a building, etc., etc. I could only fly medicated, with my doctor having prescribed Lorazepam, which I take 2-3 at a time, depending on the duration of trip. I tried CBT one time, approx 15 years ago, for approx 8-10 sessions (including hypnosis), and - besides being extremely expensive - led to no positive results.<p>I am now retired, and after a [working] life of missing all the fun and keeping my companion from enjoying such, also, I decided to see if I could attempt a self-healing of sorts. I borrowed a book I found closest to the subject (&quot;Overcoming fear of heights&quot; - Martin Antony, PhD et.al.), but I would still like to ask: has anyone out there fixed on their own such a problem, especially after so many years of &quot;twisted&quot; brain processing of space issues?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Papaia",
    "url": "https://news.ycombinator.com/user?id=Papaia"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32394625",
  "sameAs": "https://news.ycombinator.com/item?id=32394625",
  "dateCreated": "2022-08-09T06:34:19.162Z",
  "datePublished": "2022-08-09T05:53:38.000Z",
  "dateModified": "2022-08-09T06:34:19.162Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你是否或认识的人已经治愈了恐高症（50年）？\n",
  "headline_zh-Hant": "Ask HN: 你是否或認識的人已經治癒了恐高症（50年）？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我从小就一直有恐高症，基于我可以解释为某种遗传缺陷（即没有意外，没有与高处有关的事件记忆，等等）。自从上了文法学校，我就不能和朋友们一起去爬山，不能爬太高的楼梯，不能在高于第三层的阳台上看，不能透过一堵墙大小的建筑窗户看，等等，等等。我只能靠药物飞行，医生给我开了劳拉西泮，我每次吃2-3片，取决于旅行的时间。我曾经尝试过一次CBT，大约15年前，大约8-10次（包括催眠），除了非常昂贵之外，也没有导致任何积极的结果。<p>我现在已经退休了，在[工作]生活中错过了所有的乐趣，让我的同伴也无法享受这种乐趣之后，我决定看看我是否可以尝试某种自我治疗。我借了一本我认为最接近这个主题的书（&quot;克服恐高症&quot;--马丁-安东尼博士等），但我还是想问：有没有人自己解决这样的问题，尤其是在经过这么多年的&quot;扭曲&quot;大脑处理空间问题之后？\n",
  "description_zh-Hant": "我從小就一直有恐高症，基於我可以解釋為某種遺傳缺陷（即沒有意外，沒有與高處有關的事件記憶，等等）。自從上了文法學校，我就不能和朋友們一起去爬山，不能爬太高的樓梯，不能在高於第三層的陽臺上看，不能透過一堵牆大小的建築窗戶看，等等，等等。我只能靠藥物飛行，醫生給我開了勞拉西泮，我每次吃2-3片，取決於旅行的時間。我曾經嘗試過一次CBT，大約15年前，大約8-10次（包括催眠），除了非常昂貴之外，也沒有導致任何積極的結果。<p>我現在已經退休了，在[工作]生活中錯過了所有的樂趣，讓我的同伴也無法享受這種樂趣之後，我決定看看我是否可以嘗試某種自我治療。我借了一本我認為最接近這個主題的書（&quot;克服恐高症&quot;--馬丁-安東尼博士等），但我還是想問：有沒有人自己解決這樣的問題，尤其是在經過這麼多年的&quot;扭曲&quot;大腦處理空間問題之後？\n"
}