{
  "@type": "NewsArticle",
  "identifier": "2022--08--20--en--askhn--HackerNews--NewsArticle--32534550",
  "url": "https://news.ycombinator.com/item?id=32534550",
  "headline": "Ask HN: Is it time for AI to start replacing doctors?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello wizards and apprentices,<p>Most people, regardless of their politics, understand that healthcare, notably in the US, is too often unaffordable and sometimes destructive through financial means.<p>Many doctors, from my observations, function as pen pushers in what seems an administrative bureaucracy, relying as often as not, on remembered-information rather than improvisation or critical thinking. Many of the conditions they treat or medicate are done so in an almost automated manner. In many cases, a nurse would suffice at a much lower cost.<p>Obviously those who sacrifice a decade of their lives to study medicine desire and deserve to be rewarded. The discretion and experience that comes with such an immersive decade is of undeniably great value. However, I am convinced AI could rival a significant portion of what they do, theoretically at a drastically lower cost.<p>We (or some of we) trust AI to pilot vehicles, some of them weighing 80,000 lbs. We (some of we) trust AI with many serious matters; it could be argued that it has already begun replacing professionals at the PhD level, eg psychologists (Fusion Centers, law enforcement, pre-crime, etc). There's social credit and Trust Scores and more. Clearly we (some of we) are willing, if not eager to shirk our burdens and responsibilities onto artificial shoulders. Why not include, at least one, application that might have a clear, unambiguous and tangible benefit to the majority?<p>I think the Hippocratic oath is very amenable in this direction.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "eth0up",
    "url": "https://news.ycombinator.com/user?id=eth0up"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32534550",
  "sameAs": "https://news.ycombinator.com/item?id=32534550",
  "dateCreated": "2022-08-20T19:41:59.535Z",
  "datePublished": "2022-08-20T19:26:52.000Z",
  "dateModified": "2022-08-20T19:41:59.535Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 是时候让人工智能开始取代医生了吗？\n",
  "headline_zh-Hant": "Ask HN: 是時候讓人工智能開始取代醫生了嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大多数人，不管他们的政治立场如何，都明白医疗保健，特别是在美国，往往是负担不起的，有时是通过财政手段来破坏的。<p>根据我的观察，许多医生在似乎是一个行政官僚机构中扮演着推笔者的角色，经常依靠记忆中的信息，而不是即兴创作或批判性思维。他们治疗或用药的许多情况都是以一种几乎自动化的方式完成的。在许多情况下，一个护士就足够了，而且成本要低得多。<p>显然，那些牺牲了十年的生命来学习医学的人渴望并应该得到回报。不可否认的是，这种沉浸式的十年所带来的谨慎和经验具有很大的价值。然而，我相信人工智能可以与他们所做的工作的很大一部分相媲美，理论上来说，成本会大大降低。<p>我们（或我们中的一些人）信任人工智能来驾驶车辆，其中一些车辆重达8万磅。我们（或我们中的一些人）信任人工智能处理许多严肃的事务；可以说，它已经开始取代博士级别的专业人士，例如心理学家（融合中心、执法部门、犯罪前等）。还有社会信用和信任分数等等。显然，我们（我们中的一些人）愿意，甚至渴望将我们的负担和责任推卸到人工的肩上。为什么不包括，至少一个，可能对大多数人有明确的、毫不含糊的和切实的好处的应用呢？<p>我认为希波克拉底誓言在这个方向上是非常合适的。\n",
  "description_zh-Hant": "大多數人，不管他們的政治立場如何，都明白醫療保健，特別是在美國，往往是負擔不起的，有時是通過財政手段來破壞的。<p>根據我的觀察，許多醫生在似乎是一個行政官僚機構中扮演著推筆者的角色，經常依靠記憶中的信息，而不是即興創作或批判性思維。他們治療或用藥的許多情況都是以一種幾乎自動化的方式完成的。在許多情況下，一個護士就足夠了，而且成本要低得多。<p>顯然，那些犧牲了十年的生命來學習醫學的人渴望並應該得到回報。不可否認的是，這種沉浸式的十年所帶來的謹慎和經驗具有很大的價值。然而，我相信人工智能可以與他們所做的工作的很大一部分相媲美，理論上來說，成本會大大降低。<p>我們（或我們中的一些人）信任人工智能來駕駛車輛，其中一些車輛重達8萬磅。我們（或我們中的一些人）信任人工智能處理許多嚴肅的事務；可以說，它已經開始取代博士級別的專業人士，例如心理學家（融合中心、執法部門、犯罪前等）。還有社會信用和信任分數等等。顯然，我們（我們中的一些人）願意，甚至渴望將我們的負擔和責任推卸到人工的肩上。為什麼不包括，至少一個，可能對大多數人有明確的、毫不含糊的和切實的好處的應用呢？<p>我認為希波克拉底誓言在這個方向上是非常合適的。\n"
}