{
  "@type": "NewsArticle",
  "identifier": "2022--08--15--en--askhn--HackerNews--NewsArticle--32475422",
  "url": "https://news.ycombinator.com/item?id=32475422",
  "headline": "Ask HN: Can someone without a degree expect to get a job in tech today? (EU)",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been watching my girlfriend who's trying to get into UX research from a relevant master's degree (still studying,  has a Philosophy background) struggle immensely to find even a student job. At the same time,  I've had no issues getting multiple offers in big tech with little effort.<p>She's very methodical and sometimes impresses me with her insights in solving problems, so I thought she would do well in programming and I introduced her to web development as an idea. She started the Odin project (https://www.theodinproject.com/)  and really loved the process of working on a website, both in terms of design with css and html and also in functionality by learning Javascript. She is also taking 3 master's courses as a guest student related to programming, mobile programming and interaction design this semester. From what I can see, she has the curiosity and intelligence to be a decent developer with some effort from her side.<p>My fear however is that there's a lot of developers coming out of tech schools, bootcamps and comp Sci master's degrees as competition. Can she expect to land any job if she gets a small. portfolio of projects and puts the effort to learn a frontend framework for example? Has anyone been in a similar situation and what would you suggest for tracking down a job that would accept her?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "BazookaMusic",
    "url": "https://news.ycombinator.com/user?id=BazookaMusic"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32475422",
  "sameAs": "https://news.ycombinator.com/item?id=32475422",
  "dateCreated": "2022-08-15T21:25:35.090Z",
  "datePublished": "2022-08-15T21:10:28.000Z",
  "dateModified": "2022-08-15T21:25:35.090Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ],
  "headline_zh-Hans": "Ask HN: 没有学位的人今天能指望在科技界找到工作吗？(欧盟)\n",
  "headline_zh-Hant": "Ask HN: 沒有學位的人今天能指望在科技界找到工作嗎？(歐盟)\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我一直在看着我的女朋友，她想从相关的硕士学位进入用户体验研究领域（仍在学习，有哲学背景），即使是找一份学生工作也非常艰难。与此同时，我却不费吹灰之力就拿到了大科技公司的多个offer。<p>她很有条理，有时会用她解决问题的洞察力来打动我，所以我认为她在编程方面会做得很好，我把网页开发作为一个想法介绍给她。她开始了Odin项目（https://www.theodinproject.com/），她真的很喜欢做网站的过程，无论是用css和html进行设计，还是通过学习Javascript进行功能开发。本学期她还作为客座学生学习了3门与编程、移动编程和交互设计有关的硕士课程。在我看来，她有足够的好奇心和智慧，只要她自己努力，就能成为一个体面的开发者。<p>然而，我担心的是，有很多从技术学校、训练营和计算机科学硕士学位出来的开发者作为竞争对手。如果她得到一个小的项目组合，并努力学习一个前端框架，她能指望找到任何工作吗？有没有人遇到过类似的情况，你有什么建议可以让她找到一份可以接受的工作？\n",
  "description_zh-Hant": "我一直在看著我的女朋友，她想從相關的碩士學位進入用戶體驗研究領域（仍在學習，有哲學背景），即使是找一份學生工作也非常艱難。與此同時，我卻不費吹灰之力就拿到了大科技公司的多個offer。<p>她很有條理，有時會用她解決問題的洞察力來打動我，所以我認為她在編程方面會做得很好，我把網頁開發作為一個想法介紹給她。她開始了Odin項目（https://www.theodinproject.com/），她真的很喜歡做網站的過程，無論是用css和html進行設計，還是通過學習Javascript進行功能開發。本學期她還作為客座學生學習了3門與編程、移動編程和交互設計有關的碩士課程。在我看來，她有足夠的好奇心和智慧，只要她自己努力，就能成為一個體面的開發者。<p>然而，我擔心的是，有很多從技術學校、訓練營和計算機科學碩士學位出來的開發者作為競爭對手。如果她得到一個小的項目組合，並努力學習一個前端框架，她能指望找到任何工作嗎？有沒有人遇到過類似的情況，你有什麼建議可以讓她找到一份可以接受的工作？\n"
}