{
  "@type": "NewsArticle",
  "identifier": "2022--08--18--en--askhn--HackerNews--NewsArticle--32510918",
  "url": "https://news.ycombinator.com/item?id=32510918",
  "headline": "Ask HN: Only person assigned to certain task, and I'm alone and tired",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I've been tasked with creating marketing videos for my B2C corp on YouTube, since<p>- I'm the only one who knows how to make videos<p>- No one else is interested<p>The videos include content like:<p>- How-tos<p>- Comedy sketches<p>- Interviews with biz partners<p>Here are the issues I face:<p>- Alone<p>This assignment placed me in a single-person department (myself only), and I've been churning out videos ever since. However, since there's no one to bounce around ideas with (or get inspired by), I find myself alone in a tedium.<p>Working alone puts me in a creative rut, so I've been asking for new ideas from my colleagues, but they don't contribute. They still enjoy watching my new video whenever it comes out. Their reaction makes me both happy and leeched.<p>- No collaborators when needed<p>Furthermore, I produce comedy sketches at the request of my boss, who likes SNL and thinks funny content going viral will be good PR.<p>But he won't hire actors. He insists on having me find coworkers willing to act in sketches. However, almost no one wants to appear. They even respond in a condemning tone for suggesting that they appear in a video.<p>One time, I asked one of my colleague to appear. I ended up getting yelled up by the person sitting next to her.<p>- Financing on my own<p>Additionally, my boss complains about how producing live-action videos takes time and money. However, it's frankly difficult to make videos without buying a memory card to record footage on camera. I end up spending some of my personal money to get equipments without dealing with complaints.<p>- Cancellation of completed deliverable<p>Worst of all, one of my completed deliverables got cancelled before uploading to YouTube. (Think of it like &quot;Batgirl&quot; with Warner Bros.) After one of my coworkers appeared, she reverted her decision and withdrew her permission after editing was finished. It was a perfectly fine sketch that my friends outside work had fun watching.<p>---<p>I need to produce more videos, but I don't feel inspired anymore. I keep staring at my blank script, resenting that no one is helping me. HNers, what can I do to get out of this rut?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "tiredthrowaway",
    "url": "https://news.ycombinator.com/user?id=tiredthrowaway"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32510918",
  "sameAs": "https://news.ycombinator.com/item?id=32510918",
  "dateCreated": "2022-08-18T15:42:55.576Z",
  "datePublished": "2022-08-18T15:22:16.000Z",
  "dateModified": "2022-08-18T15:42:55.576Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 只有一个人被分配到某些任务，而我是一个人，很累。\n",
  "headline_zh-Hant": "Ask HN: 只有一個人被分配到某些任務，而我是一個人，很累。\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我的任务是为我的B2C公司在YouTube上制作营销视频，因为<p>- 我是唯一一个知道如何制作视频的人<p>- 没有其他人感兴趣<p> 视频包括以下内容：<p>- 如何操作<p>- 喜剧小品<p>- 采访商业伙伴<p> 我面临的问题是：<p>- 孤独<p> 这个任务把我放在一个单人部门（只有我自己），从那以后我就开始制作视频了。然而，由于没有人和我一起讨论想法（或得到灵感），我发现自己一个人陷入了乏味之中。<p>一个人工作让我陷入了创作的困境，所以我一直在向同事们征求新的想法，但他们并没有贡献。每当我的新视频出来的时候，他们仍然喜欢看。他们的反应让我既高兴又泄气。<p>- 需要时没有合作者<p>此外，我应老板的要求制作喜剧小品，他喜欢SNL，认为有趣的内容走红会是很好的公关。<p>但他不愿意雇用演员。他坚持让我找愿意演小品的同事。然而，几乎没有人愿意出场。他们甚至用谴责的语气回应我建议他们出现在视频中。<p>有一次，我要求我的一个同事出现。结果我被坐在她旁边的人骂了一顿。<p>- 独自融资<p>另外，我的老板抱怨说制作真人视频需要时间和金钱。然而，坦率地说，如果不买存储卡在相机上记录画面，就很难制作视频。我最终花了一些个人的钱去买设备，而没有处理抱怨。<p>- 取消已完成的交付品<p>最糟糕的是，我的一个已完成的交付品在上传到YouTube之前被取消了。(想想看，就像华纳兄弟公司的&quot;Batgirl&quot;。）在我的一个同事出现后，她改变了决定，在编辑完成后撤回了她的许可。这是一个完美的草图，我工作以外的朋友们看得很开心。<p>------<p>我需要制作更多的视频，但我已经感觉不到灵感了。我一直盯着我的空白剧本，怨恨没有人帮助我。HNers，我能做些什么来摆脱这种困境？\n",
  "description_zh-Hant": "我的任務是為我的B2C公司在YouTube上製作營銷視頻，因為<p>- 我是唯一一個知道如何製作視頻的人<p>- 沒有其他人感興趣<p> 視頻包括以下內容：<p>- 如何操作<p>- 喜劇小品<p>- 採訪商業夥伴<p> 我面臨的問題是：<p>- 孤獨<p> 這個任務把我放在一個單人部門（只有我自己），從那以後我就開始製作視頻了。然而，由於沒有人和我一起討論想法（或得到靈感），我發現自己一個人陷入了乏味之中。<p>一個人工作讓我陷入了創作的困境，所以我一直在向同事們徵求新的想法，但他們並沒有貢獻。每當我的新視頻出來的時候，他們仍然喜歡看。他們的反應讓我既高興又洩氣。<p>- 需要時沒有合作者<p>此外，我應老闆的要求製作喜劇小品，他喜歡SNL，認為有趣的內容走紅會是很好的公關。<p>但他不願意僱用演員。他堅持讓我找願意演小品的同事。然而，幾乎沒有人願意出場。他們甚至用譴責的語氣回應我建議他們出現在視頻中。<p>有一次，我要求我的一個同事出現。結果我被坐在她旁邊的人罵了一頓。<p>- 獨自融資<p>另外，我的老闆抱怨說製作真人視頻需要時間和金錢。然而，坦率地說，如果不買存儲卡在相機上記錄畫面，就很難製作視頻。我最終花了一些個人的錢去買設備，而沒有處理抱怨。<p>- 取消已完成的交付品<p>最糟糕的是，我的一個已完成的交付品在上傳到YouTube之前被取消了。(想想看，就像華納兄弟公司的&quot;Batgirl&quot;。）在我的一個同事出現後，她改變了決定，在編輯完成後撤回了她的許可。這是一個完美的草圖，我工作以外的朋友們看得很開心。<p>------<p>我需要製作更多的視頻，但我已經感覺不到靈感了。我一直盯著我的空白劇本，怨恨沒有人幫助我。HNers，我能做些什麼來擺脫這種困境？\n"
}