{
  "@type": "NewsArticle",
  "identifier": "2022--08--22--en--askhn--HackerNews--NewsArticle--32556290",
  "url": "https://news.ycombinator.com/item?id=32556290",
  "headline": "Ask HN: Should I tell cofounders/investors to optimize my env before startup?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I keep my Aspiring Founder profile active in the Co-founder Match platform at Startup School and despite having written very low information density stuff in the profile, a few people contacted me regarding co-founding and applying to a batch in another accelerator.<p>My main startup idea is in agritech, but it is malleable and scalable to many adjacent fields as well. In the majority of agritech you may not need to survey what users want, as the majority of users in this field just want better yields.\nApart from making notes, collecting information about the field and conducting some sparse pilot research in the field, I as a founder haven't done much about it for years for various reasons.<p>Currently I need to repair my habitable property in Lithuania and I can basically do 80% of this myself, so won't have time for optimal work on a startup. Any of this property is not suitable for optimal work, so I may need to flip or rent it.\nShould I tell all this stuff to potential co-founders/investors now, or should I suspend my Aspiring Founder profile for some time?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "amts",
    "url": "https://news.ycombinator.com/user?id=amts"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32556290",
  "sameAs": "https://news.ycombinator.com/item?id=32556290",
  "dateCreated": "2022-08-22T19:56:58.361Z",
  "datePublished": "2022-08-22T19:48:26.000Z",
  "dateModified": "2022-08-22T19:56:58.361Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 我是否应该告诉联合创始人/投资人在创业前优化我的环境？\n",
  "headline_zh-Hant": "Ask HN: 我是否應該告訴聯合創始人/投資人在創業前優化我的環境？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在Startup School的Co-founder Match平台上保持着我的Aspiring Founder档案，尽管我在档案中写的东西信息密度很低，但还是有几个人就联合创办和申请另一个加速器的批次与我联系。<p>我的主要创业想法是在农业技术领域，但它是可塑的，也可以扩展到许多邻近领域。在大多数农业技术领域，你可能不需要调查用户的需求，因为这个领域的大多数用户只想获得更好的产量。\n除了做笔记、收集该领域的信息和在该领域进行一些稀疏的试验研究外，我作为创始人多年来由于各种原因没有做过什么。<p>目前我需要修理我在立陶宛的可居住的房产，我基本上可以自己完成80%的工作，所以不会有时间在创业公司上进行优化工作。这处房产中的任何一处都不适合进行优化工作，所以我可能需要将其出售或出租。\n我应该现在就把这些东西告诉潜在的联合创始人/投资人，还是应该把我的有抱负的创始人资料暂停一段时间？\n",
  "description_zh-Hant": "我在Startup School的Co-founder Match平臺上保持著我的Aspiring Founder檔案，儘管我在檔案中寫的東西信息密度很低，但還是有幾個人就聯合創辦和申請另一個加速器的批次與我聯繫。<p>我的主要創業想法是在農業技術領域，但它是可塑的，也可以擴展到許多鄰近領域。在大多數農業技術領域，你可能不需要調查用戶的需求，因為這個領域的大多數用戶只想獲得更好的產量。\n除了做筆記、收集該領域的信息和在該領域進行一些稀疏的試驗研究外，我作為創始人多年來由於各種原因沒有做過什麼。<p>目前我需要修理我在立陶宛的可居住的房產，我基本上可以自己完成80%的工作，所以不會有時間在創業公司上進行優化工作。這處房產中的任何一處都不適合進行優化工作，所以我可能需要將其出售或出租。\n我應該現在就把這些東西告訴潛在的聯合創始人/投資人，還是應該把我的有抱負的創始人資料暫停一段時間？\n"
}