{
  "@type": "NewsArticle",
  "identifier": "2022--08--18--en--askhn--HackerNews--NewsArticle--32512618",
  "url": "https://news.ycombinator.com/item?id=32512618",
  "headline": "Ask HN: How do you operationalize life-advice books you read into your own life?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hey HN gang-<p>I’ve been reading books lately on improving life (e.g. Atomic Habits, the Artists Way), and what I’m finding is that these books offer so much great “do X action every Y time interval / trigger ” advice -and while reading it, I think “wow yes, I definitely ought to do that”. But… Naturally, time passes and if I’m not deliberate about thinking of those great ideas, I tend to forget about them. I had this idea of using a knowledge base tool (eg Notion, but preferably an open source tool like Hugo) to take notes on the book, and to break out all the “do this” into useful checklists for the day. I’ve found that a good (printed!) checklist can boot up a new habit quickly, and in about 2 months, it feels naturally integrated into your life. With some of these business/life advice books - I want to open Linear.app and start making a backlog of stuff to do, hire a product manager from Upwork and have them work with me on actually DOING all these high value activities. Haven’t done that yet, but it feels like it could be effective. Team work makes the dream work, accountability partner, and all that. Back to the books.<p>I would love to approach any new book with Intention &amp; a System (I recall there was a post on HN on “How to read X books at once”, where the author had a great system on how to systematically “extract” knowledge from many books at once, perhaps someone can find it). Usually, when I read a book, I’m take notes, in the margin, etc. But where does that really Go? I’d much prefer to add all the “to-dos” to a document,  group by recommended interval, and get them on a calendar, along with an easy checklist. Ideally, I’d then review my day - nicely formatted into a presidential-briefing-ish “one pager” - it would list off all the important “to-dos” which apply to the day. I can feel confident that the good advice I’m reading is actively being main-lined into my life, should I choose to perform those actions. Analogous to doing a weekly retrospective, making changes, and then adding those “action items” to the team backlog for continuous improvement.<p>I’d love to hear from others who have been down this route, built something like this for their own life.<p>Thank you.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "dv35z",
    "url": "https://news.ycombinator.com/user?id=dv35z"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32512618",
  "sameAs": "https://news.ycombinator.com/item?id=32512618",
  "dateCreated": "2022-08-18T17:50:42.882Z",
  "datePublished": "2022-08-18T17:36:34.000Z",
  "dateModified": "2022-08-18T17:50:42.882Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 你如何将你所读的生活建议类书籍操作到你自己的生活中？\n",
  "headline_zh-Hant": "Ask HN: 你如何將你所讀的生活建議類書籍操作到你自己的生活中？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "最近我一直在阅读关于改善生活的书籍（如《原子习惯》、《艺术家之路》），我发现这些书提供了很多 \"每隔Y时间做X行动/触发 \"的建议，在阅读时，我想 \"哇，是的，我肯定应该这样做\"。但是......自然地，时间过去了，如果我不刻意去想这些伟大的想法，我往往会忘记它们。我有个想法，就是用一个知识库工具（例如Notion，但最好是像Hugo这样的开源工具）来记录书中的内容，并把所有的 \"这样做 \"分解成有用的检查清单。我发现，一个好的（打印出来的）检查表可以快速启动一个新的习惯，在大约两个月后，它就会自然地融入你的生活。有了这些商业/生活建议书，我想打开Linear.app，开始积压要做的事情，从Upwork雇一个产品经理，让他们和我一起实际做所有这些高价值的活动。我还没有这样做，但感觉这可能是有效的。团队工作使梦想得以实现，责任伙伴，以及所有这些。回到书上。<p>我很想带着意图&amp;系统来阅读任何新书（我记得在HN上有一个关于 \"如何一次阅读X本书 \"的帖子，作者有一个很好的系统，说明如何一次从许多书中系统地 \"提取 \"知识，也许有人能找到它）。通常情况下，当我阅读一本书时，我会做笔记，在空白处等。但这究竟是怎么回事呢？我更喜欢把所有的 \"待办事项 \"添加到一个文件中，按建议的时间间隔分组，并把它们放在一个日历上，同时附上一个简单的检查表。理想情况下，我将回顾我的一天--很好的格式化为总统简报式的 \"单页\"--它将列出所有适用于这一天的重要 \"待办事项\"。我可以确信，我所读到的好建议正积极地被纳入我的生活，如果我选择执行这些行动。类似于每周做一次回顾，做出改变，然后将这些 \"行动项目 \"添加到团队的积压项目中，以便持续改进。<p>我很想听听其他走过这条路的人的意见，为自己的生活建立这样的东西。\n",
  "description_zh-Hant": "最近我一直在閱讀關於改善生活的書籍（如《原子習慣》、《藝術家之路》），我發現這些書提供了很多 \"每隔Y時間做X行動/觸發 \"的建議，在閱讀時，我想 \"哇，是的，我肯定應該這樣做\"。但是......自然地，時間過去了，如果我不刻意去想這些偉大的想法，我往往會忘記它們。我有個想法，就是用一個知識庫工具（例如Notion，但最好是像Hugo這樣的開源工具）來記錄書中的內容，並把所有的 \"這樣做 \"分解成有用的檢查清單。我發現，一個好的（打印出來的）檢查表可以快速啟動一個新的習慣，在大約兩個月後，它就會自然地融入你的生活。有了這些商業/生活建議書，我想打開Linear.app，開始積壓要做的事情，從Upwork僱一個產品經理，讓他們和我一起實際做所有這些高價值的活動。我還沒有這樣做，但感覺這可能是有效的。團隊工作使夢想得以實現，責任夥伴，以及所有這些。回到書上。<p>我很想帶著意圖&amp;系統來閱讀任何新書（我記得在HN上有一個關於 \"如何一次閱讀X本書 \"的帖子，作者有一個很好的系統，說明如何一次從許多書中系統地 \"提取 \"知識，也許有人能找到它）。通常情況下，當我閱讀一本書時，我會做筆記，在空白處等。但這究竟是怎麼回事呢？我更喜歡把所有的 \"待辦事項 \"添加到一個文件中，按建議的時間間隔分組，並把它們放在一個日曆上，同時附上一個簡單的檢查表。理想情況下，我將回顧我的一天--很好的格式化為總統簡報式的 \"單頁\"--它將列出所有適用於這一天的重要 \"待辦事項\"。我可以確信，我所讀到的好建議正積極地被納入我的生活，如果我選擇執行這些行動。類似於每週做一次回顧，做出改變，然後將這些 \"行動項目 \"添加到團隊的積壓項目中，以便持續改進。<p>我很想聽聽其他走過這條路的人的意見，為自己的生活建立這樣的東西。\n"
}