{
  "@type": "NewsArticle",
  "identifier": "2022--08--10--en--askhn--HackerNews--NewsArticle--32417767",
  "url": "https://news.ycombinator.com/item?id=32417767",
  "headline": "Ask HN: Personal finance tool / app for envelope budgeting",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi HN,<p>TL;DR I'm busy looking for a new budgeting / personal finance app to do envelope budgeting with and wondering what you use / can recommend.<p>I used to use Banktivity with no avail - it was buggy when it came to envelopes and on top of it didn't handle multiple currencies well either. Next I moved on to MoneyWiz (and is what I'm currently using) and unfortunately I'm finding similar issues. The app is extremely slow (5 → 10s per transfer) and I'm starting to notice more bugs &amp; inconsistencies - currency conversions aren't consistent, deselected accounts' transactions randomly appearing etc.<p>Quite honestly, me an my SO spend more time trying to &quot;have the numbers line up&quot; rather than actually using our budget to our advantage.<p>Why is it so difficult to find a stable and reliable tool - especially in the personal finance sector?<p>In terms of functionality that I'm looking for, I don't think that I'm asking too much: - native envelope budgeting (with envelope convenience features would be even better e.g. transfers, easy distribution of money, calculations ...) - multi currency support (ideally with static currency override) - categories with at least 1 level for organizing - split transactions (across multiple categories) - tags (for a 3rd dimension of reporting) - MacOS (or webapp) + having an iOS app would be ideal - EU bank account sync would be fantastic - Custom reporting - the cherry on the top (for a web app) would be an API for me to tinker with (not required).<p>I've been having a look at YNAB and it looks very promising. It pretty much ticks all my boxes except for tagging and my bank is not supported for syncing.<p>I've also thought of building a spreadsheet myself, but just not convinced it's worth the maintenance &amp; hassle + how easy it will be to implement the above. The idea of an SQLite db has also crossed my mind, but that might be a stretch for my skills.<p>Buckets is next on my list to evaluate (https://www.budgetwithbuckets.com/)",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "niftyJalapeno",
    "url": "https://news.ycombinator.com/user?id=niftyJalapeno"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32417767",
  "sameAs": "https://news.ycombinator.com/item?id=32417767",
  "dateCreated": "2022-08-10T20:27:25.824Z",
  "datePublished": "2022-08-10T20:13:09.000Z",
  "dateModified": "2022-08-10T20:27:25.824Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 用于信封预算的个人财务工具/应用程序\n",
  "headline_zh-Hant": "Ask HN: 用於信封預算的個人財務工具/應用程序\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨，HN，<p>TL;DR 我正忙着寻找一个新的预算/个人财务应用程序来做信封预算，并想知道你使用/可以推荐什么。<p>我曾经使用Banktivity，但无济于事 - 当它来到信封时，它是错误的，在它上面也没有很好地处理多种货币。接下来我转到MoneyWiz（也是我目前使用的），不幸的是我发现了类似的问题。这款应用程序非常慢（每次转账需要5-10秒），而且我开始注意到更多的bug&amp；不一致--货币转换不一致，取消选择的账户交易随机出现等等。<p>说实话，我和我的SO花了更多时间试图让数字一致，而不是真正利用我们的预算为我们服务。 <p>为什么这么难找到一个稳定可靠的工具--尤其是在个人理财领域？<p>就我所寻找的功能而言，我认为我的要求并不过分：--原生信封预算（如果有信封的便利功能就更好了，例如转账、轻松分配资金、计算......）。- 多币种支持（最好有静态货币覆盖）--至少有一个层次的组织类别--分割交易（跨越多个类别）--标签（用于报告的第三个维度）--MacOS（或网络应用程序）+有一个iOS应用程序将是理想的--欧盟银行账户同步将是美妙的--自定义报告--顶部的樱桃（对于网络应用程序）将是一个API供我修补（不是必需的）.<p>我已经看了一下YNAB，它看起来非常有前途。除了标签和我的银行不支持同步外，它几乎满足了我所有的要求。<p>我也想过自己建立一个电子表格，但只是不相信它值得维护和amp;麻烦+实现上述内容有多容易。我也曾想过使用SQLite数据库，但这对我的技能来说可能是一个挑战。<p>Buckets是我要评估的下一个清单（https://www.budgetwithbuckets.com/）。\n",
  "description_zh-Hant": "嗨，HN，<p>TL;DR 我正忙著尋找一個新的預算/個人財務應用程序來做信封預算，並想知道你使用/可以推薦什麼。<p>我曾經使用Banktivity，但無濟於事 - 當它來到信封時，它是錯誤的，在它上面也沒有很好地處理多種貨幣。接下來我轉到MoneyWiz（也是我目前使用的），不幸的是我發現了類似的問題。這款應用程序非常慢（每次轉賬需要5-10秒），而且我開始注意到更多的bug&amp；不一致--貨幣轉換不一致，取消選擇的賬戶交易隨機出現等等。<p>說實話，我和我的SO花了更多時間試圖讓數字一致，而不是真正利用我們的預算為我們服務。 <p>為什麼這麼難找到一個穩定可靠的工具--尤其是在個人理財領域？<p>就我所尋找的功能而言，我認為我的要求並不過分：--原生信封預算（如果有信封的便利功能就更好了，例如轉賬、輕鬆分配資金、計算......）。- 多幣種支持（最好有靜態貨幣覆蓋）--至少有一個層次的組織類別--分割交易（跨越多個類別）--標籤（用於報告的第三個維度）--MacOS（或網絡應用程序）+有一個iOS應用程序將是理想的--歐盟銀行賬戶同步將是美妙的--自定義報告--頂部的櫻桃（對於網絡應用程序）將是一個API供我修補（不是必需的）.<p>我已經看了一下YNAB，它看起來非常有前途。除了標籤和我的銀行不支持同步外，它幾乎滿足了我所有的要求。<p>我也想過自己建立一個電子表格，但只是不相信它值得維護和amp;麻煩+實現上述內容有多容易。我也曾想過使用SQLite數據庫，但這對我的技能來說可能是一個挑戰。<p>Buckets是我要評估的下一個清單（https://www.budgetwithbuckets.com/）。\n"
}