{
  "@type": "NewsArticle",
  "identifier": "2022--08--24--en--askhn--HackerNews--NewsArticle--32586361",
  "url": "https://news.ycombinator.com/item?id=32586361",
  "headline": "Ask HN: How do you and your spouse handle big income differences?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I met my wife about 12 years ago and at the time, we were making about the same salary ~$70k.  Over the years both our salaries went up about the same until we both got to the $100k mark.  About 5 years ago her career has really accelerated and her total comp is 2.5x what I'm making.  On top of her salary, she hit the startup lotto and had a large cash buyout.<p>We had a hard time dealing with this at first, I was jealous and a little bitter, and she was worried that I was taking advantage of the situation.  In the end, we decided that the buyout money would go to retirement and not be touched.  As for out salary, we decided that we would both spend as if we both made my salary, and anything above that, she would put in a rainy day fund for home improvements or traveling etc.  This arrangement kind of worked until it came time to use that rainy day funds and she started feeling that we were spending her money.<p>I've heard of this situation with Lawyers/Doctors where one spouse supported the other while they went to school, but once they started to practice, the income spread was huge.  How have FANG engineers or anyone else with a big income disparity learned to deal with the situation?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "caspercrf",
    "url": "https://news.ycombinator.com/user?id=caspercrf"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32586361",
  "sameAs": "https://news.ycombinator.com/item?id=32586361",
  "dateCreated": "2022-08-24T22:27:03.869Z",
  "datePublished": "2022-08-24T22:02:15.000Z",
  "dateModified": "2022-08-24T22:27:03.869Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 11
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 9
    }
  ],
  "headline_zh-Hans": "Ask HN: 你和你的配偶如何处理巨大的收入差异？\n",
  "headline_zh-Hant": "Ask HN: 你和你的配偶如何處理巨大的收入差異？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我在12年前认识了我的妻子，当时，我们的工资差不多，都是7万美金。 几年来，我们的工资都在增加，直到我们都达到了10万美元的水平。 大约5年前，她的职业生涯真的加速了，她的总薪酬是我的2.5倍。 在她的工资之外，她还中了创业公司的乐透，有一大笔现金买断。<p>一开始我们很难处理这个问题，我很嫉妒，有点痛苦，而她则担心我在利用这种情况。 最后，我们决定，买断的钱将用于退休，不被动用。 至于工资，我们决定，我们两个人的花费就像我们两个人的工资一样，而超过这个数字的部分，她将放入应急基金，用于房屋装修或旅游等。 这种安排一直在起作用，直到到了使用应急基金的时候，她开始觉得我们在花她的钱。<p>我听说过律师/医生的这种情况，在他们上学的时候，一方支持另一方，但一旦他们开始执业，收入差距就很大。 方阵工程师或其他收入差距大的人是如何学会处理这种情况的？\n",
  "description_zh-Hant": "我在12年前認識了我的妻子，當時，我們的工資差不多，都是7萬美金。 幾年來，我們的工資都在增加，直到我們都達到了10萬美元的水平。 大約5年前，她的職業生涯真的加速了，她的總薪酬是我的2.5倍。 在她的工資之外，她還中了創業公司的樂透，有一大筆現金買斷。<p>一開始我們很難處理這個問題，我很嫉妒，有點痛苦，而她則擔心我在利用這種情況。 最後，我們決定，買斷的錢將用於退休，不被動用。 至於工資，我們決定，我們兩個人的花費就像我們兩個人的工資一樣，而超過這個數字的部分，她將放入應急基金，用於房屋裝修或旅遊等。 這種安排一直在起作用，直到到了使用應急基金的時候，她開始覺得我們在花她的錢。<p>我聽說過律師/醫生的這種情況，在他們上學的時候，一方支持另一方，但一旦他們開始執業，收入差距就很大。 方陣工程師或其他收入差距大的人是如何學會處理這種情況的？\n"
}