{
  "@type": "NewsArticle",
  "identifier": "2022--08--16--en--askhn--HackerNews--NewsArticle--32479948",
  "url": "https://news.ycombinator.com/item?id=32479948",
  "headline": "Ask HN: Applying to jobs. How to negotiate a salary for less pay, to min wage?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This probably sounds stupid; let me explain.<p>I live in NJ near NYC. A quick google search tells me that the average SWE salary in NYC is around $132k. Looking at the current &quot;Who is hiring&quot; thread, at a glance, it seems that most salaries range from $75k to $250k+ from just the few that list them.<p>I want to work these same jobs at minimum wage, meaning around $27k.<p>Why? Because I want things to be &quot;calmer.&quot;<p>I want to know that I'll have an easier time applying and getting hired faster than other applicants at my same skill level because I'm willing to work for much less than expected.<p>I want to know that I'll be less likely to be let go during downsizing because I work at less pay than others at the same level. I want to know that I'm more valued at a company because the cost to keep me around is so low that if they have a bad quarter, they think of me last to get rid of.<p>I want management to know that I will not jump ship as soon as someone else offers me higher pay; I love stability and consistency. By asking for lesser pay, I don't want to communicate that I'm going to slack off but that I want to work at a lower salary in exchange for work to be &quot;calmer,&quot; like being able to afford to work my own pace just a little bit. And by working at my own pace,  I'm not trying to phrase getting distracted playing games on the job as working at my pace but that I'm taking some more time to read, take notes, and planning things out more to make the process &quot;calmer.&quot;<p>I know a lot of people who work at a high salary (for example, say $90k, to me already a lot of money, but I know it's not enough to some), who spend most of the day doing &quot;nothing.&quot; Like getting a mouse jiggler to simulate that they're at meetings. Or they spend most of the time watching shows or playing games while doing the occasional ticket (but are the most likely to be let go when the company has a bad quarter or during a recession).<p>If I'm willing to work the same way and things are &quot;calm&quot; enough, why not just go for the extra money? Because I want the guarantees of everything to be &quot;calmer,&quot; and I'm more than happy to forgo any extra pay for more &quot;calmness.&quot;<p>At the onset of applying, I never had the opportunity to phrase this as a competitive advantage, so I'm competing as if I want that higher pay, but I don't.<p>I love the structure and feel of these jobs (I don't want to freelance or anything similar). How can I convey these feelings without causing people to think I'm being silly? Or to even suggest this without causing hiring to think I'm unqualified/have imposter syndrome or whatever?<p>I'm writing this at 3 am and trying to brainstorm better ways to express myself than a weird-sounding email that will probably get ignored saying, &quot;hey, that job you posted, I'll do it for min wage.&quot;",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "ditherblur",
    "url": "https://news.ycombinator.com/user?id=ditherblur"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32479948",
  "sameAs": "https://news.ycombinator.com/item?id=32479948",
  "dateCreated": "2022-08-16T07:21:03.373Z",
  "datePublished": "2022-08-16T06:56:33.000Z",
  "dateModified": "2022-08-16T07:21:03.373Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 申请工作。如何在谈判中减少工资，达到最低工资？\n",
  "headline_zh-Hant": "Ask HN: 申請工作。如何在談判中減少工資，達到最低工資？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这听起来可能很愚蠢；让我解释一下。<p>我住在新泽西州，靠近纽约市。通过谷歌快速搜索，我知道纽约市的SWE平均工资约为13.2万美元。看看目前的&quot;Who is hiring&quot;线程，一目了然，仅从列出的几个人来看，大多数人的工资从7.5万美元到25万美元以上不等。<p>我想以最低工资从事这些相同的工作，也就是2.7万美元左右。<p>为什么？因为我想让事情变得更平静。<p>我想知道，在我相同的技能水平下，我比其他申请者更容易申请和被雇用，因为我愿意以比预期低得多的价格工作。<p>我想知道，在裁员时，我不太可能被解雇，因为我工作的薪水比同级别的其他人低。我想知道我在公司更受重视，因为留住我的成本很低，如果他们有一个糟糕的季度，他们会想到我是最后一个被淘汰的人。<p>我想让管理层知道，我不会因为别人给我更高的薪水就跳槽；我喜欢稳定和一致。通过要求较低的薪酬，我不想传达我将会偷懒，而是我想以较低的薪酬来换取工作上的&quot;平静,&quot;，比如能够负担得起我自己的工作节奏，只是一点点。我所说的按自己的节奏工作，并不是要把在工作中分心玩游戏说成是按自己的节奏工作，而是说我要花更多的时间来阅读、做笔记，并更多地规划事情，使工作过程更加平静。 &quot;<p>我认识很多拿着高薪工作的人（比如说9万美元，对我来说已经是很多钱了，但我知道对有些人来说还不够），他们每天大部分时间都在做&quot;无用功。&quot;比如拿着鼠标抖动来模拟他们在开会。或者他们大部分时间都在看节目或玩游戏，同时偶尔做一些票据（但在公司季度不景气或经济衰退时最有可能被解雇）。<p>如果我愿意以同样的方式工作，而且事情足够&quot;平静&quot;，为什么不直接去争取额外的钱？因为我希望一切的保证都是&quot;平静的，&quot;而且我更乐意为了更多的&quot;平静而放弃任何额外的报酬。<p>在申请之初，我从未有机会将此作为竞争优势来表述，所以我在竞争中似乎想要那更高的报酬，但我并不想要。<p>我喜欢这些工作的结构和感觉（我不想做自由职业者或类似的事情）。我怎样才能在不引起人们认为我很傻的情况下传达这些感觉？<p>我在凌晨三点写下这篇文章，并试图用头脑风暴来表达自己的想法，而不是用一封听起来很奇怪的电子邮件来表达，因为它可能会被忽略，说：&quot;嘿，你发布的那个工作，我愿意为最低工资做。\n",
  "description_zh-Hant": "這聽起來可能很愚蠢；讓我解釋一下。<p>我住在新澤西州，靠近紐約市。通過谷歌快速搜索，我知道紐約市的SWE平均工資約為13.2萬美元。看看目前的&quot;Who is hiring&quot;線程，一目瞭然，僅從列出的幾個人來看，大多數人的工資從7.5萬美元到25萬美元以上不等。<p>我想以最低工資從事這些相同的工作，也就是2.7萬美元左右。<p>為什麼？因為我想讓事情變得更平靜。<p>我想知道，在我相同的技能水平下，我比其他申請者更容易申請和被僱用，因為我願意以比預期低得多的價格工作。<p>我想知道，在裁員時，我不太可能被解僱，因為我工作的薪水比同級別的其他人低。我想知道我在公司更受重視，因為留住我的成本很低，如果他們有一個糟糕的季度，他們會想到我是最後一個被淘汰的人。<p>我想讓管理層知道，我不會因為別人給我更高的薪水就跳槽；我喜歡穩定和一致。通過要求較低的薪酬，我不想傳達我將會偷懶，而是我想以較低的薪酬來換取工作上的&quot;平靜,&quot;，比如能夠負擔得起我自己的工作節奏，只是一點點。我所說的按自己的節奏工作，並不是要把在工作中分心玩遊戲說成是按自己的節奏工作，而是說我要花更多的時間來閱讀、做筆記，並更多地規劃事情，使工作過程更加平靜。 &quot;<p>我認識很多拿著高薪工作的人（比如說9萬美元，對我來說已經是很多錢了，但我知道對有些人來說還不夠），他們每天大部分時間都在做&quot;無用功。&quot;比如拿著鼠標抖動來模擬他們在開會。或者他們大部分時間都在看節目或玩遊戲，同時偶爾做一些票據（但在公司季度不景氣或經濟衰退時最有可能被解僱）。<p>如果我願意以同樣的方式工作，而且事情足夠&quot;平靜&quot;，為什麼不直接去爭取額外的錢？因為我希望一切的保證都是&quot;平靜的，&quot;而且我更樂意為了更多的&quot;平靜而放棄任何額外的報酬。<p>在申請之初，我從未有機會將此作為競爭優勢來表述，所以我在競爭中似乎想要那更高的報酬，但我並不想要。<p>我喜歡這些工作的結構和感覺（我不想做自由職業者或類似的事情）。我怎樣才能在不引起人們認為我很傻的情況下傳達這些感覺？<p>我在凌晨三點寫下這篇文章，並試圖用頭腦風暴來表達自己的想法，而不是用一封聽起來很奇怪的電子郵件來表達，因為它可能會被忽略，說：&quot;嘿，你發佈的那個工作，我願意為最低工資做。\n"
}