{
  "@type": "NewsArticle",
  "identifier": "2022--08--24--en--askhn--HackerNews--NewsArticle--32579825",
  "url": "https://news.ycombinator.com/item?id=32579825",
  "headline": "Ask HN: Amazon locked my account and doesn't accept my bank statement",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I live in the Philippines and I tried to buy a 65&quot; TV. This is actually my second purchase on the same card. I have never asked for a refund nor used gift cards. They locked my account asking for a billing statement. I used my debit card so I sent them a bank statement (has my name, address, account number), + picture of my debit card with the bank account number. They didn't accept it and they didn't explain the reason properly. I emailed jeff@amazon and address-verification@amazon.com with the documents but they haven't replied since 13 days ago. I already bought the TV from somewhere else, but I really want to get access to my account since I use Audible a lot. What are some last resorts I should do? Is it worth calling them?<p>Response from Amazon:<p>Hello,<p>Thank you for your response. We have reviewed the information you provided but we were unable to verify ownership of your visa payment ending in **** because .. Your account is still temporarily on hold.<p>You can resolve the issue by signing in to your Amazon US store account again and following the on-screen instructions.<p>When uploading a document to verify ownership of a payment method, be sure that the name, address, payment type, and relevant transaction information are clearly visible. For your security, only display the final 4 digits of the payment method number.<p>Please share your information promptly so that we can verify the payment and restore full access to your account as soon as possible.<p>Account Specialist\nAmazon.com\nhttps://www.amazon.com\n================",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "randomrubydev",
    "url": "https://news.ycombinator.com/user?id=randomrubydev"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32579825",
  "sameAs": "https://news.ycombinator.com/item?id=32579825",
  "dateCreated": "2022-08-24T14:27:26.845Z",
  "datePublished": "2022-08-24T14:22:27.000Z",
  "dateModified": "2022-08-24T14:27:26.845Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 亚马逊锁定我的账户，不接受我的银行账单\n",
  "headline_zh-Hant": "Ask HN: 亞馬遜鎖定我的賬戶，不接受我的銀行賬單\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我住在菲律宾，我试图购买一台65&quot; 电视。这实际上是我用同一张卡第二次购买。我从来没有要求过退款，也没有使用过礼品卡。他们锁定了我的账户，要求提供账单。我使用了我的借记卡，所以我给他们发了一份银行对账单（有我的名字、地址、账号），+带有银行账号的借记卡照片。他们不接受，也没有正确解释原因。我给Jeff@amazon和address-verification@amazon.com，并附上文件，但他们从13天前就没有回复。我已经从别的地方买了电视，但我真的想获得我的账户，因为我经常使用Audible。我应该做哪些最后的努力？值得给他们打电话吗？<p>亚马逊的答复：<p>你好，<p>谢谢你的答复。我们已经审查了您提供的信息，但我们无法验证您的签证付款的所有权，结束于****，因为......您的账户仍然被暂时搁置。<p>您可以通过再次登录您的亚马逊美国商店账户并按照屏幕上的指示解决这个问题。<p>当上传文件以验证付款方式的所有权时，请确保姓名、地址、付款类型和相关交易信息清晰可见。为了您的安全，只显示支付方式号码的最后4位数字。<p>请及时分享您的信息，以便我们能够核实付款，并尽快恢复对您账户的完全访问。<p>账户专家\n亚马逊网站\nhttps://www.amazon.com\n================\n",
  "description_zh-Hant": "我住在菲律賓，我試圖購買一臺65&quot; 電視。這實際上是我用同一張卡第二次購買。我從來沒有要求過退款，也沒有使用過禮品卡。他們鎖定了我的賬戶，要求提供賬單。我使用了我的借記卡，所以我給他們發了一份銀行對賬單（有我的名字、地址、賬號），+帶有銀行賬號的借記卡照片。他們不接受，也沒有正確解釋原因。我給Jeff@amazon和address-verification@amazon.com，並附上文件，但他們從13天前就沒有回覆。我已經從別的地方買了電視，但我真的想獲得我的賬戶，因為我經常使用Audible。我應該做哪些最後的努力？值得給他們打電話嗎？<p>亞馬遜的答覆：<p>你好，<p>謝謝你的答覆。我們已經審查了您提供的信息，但我們無法驗證您的簽證付款的所有權，結束於****，因為......您的賬戶仍然被暫時擱置。<p>您可以通過再次登錄您的亞馬遜美國商店賬戶並按照屏幕上的指示解決這個問題。<p>當上傳文件以驗證付款方式的所有權時，請確保姓名、地址、付款類型和相關交易信息清晰可見。為了您的安全，只顯示支付方式號碼的最後4位數字。<p>請及時分享您的信息，以便我們能夠核實付款，並儘快恢復對您賬戶的完全訪問。<p>賬戶專家\n亞馬遜網站\nhttps://www.amazon.com\n================\n"
}