{
  "@type": "NewsArticle",
  "identifier": "2022--08--19--en--askhn--HackerNews--NewsArticle--32522092",
  "url": "https://news.ycombinator.com/item?id=32522092",
  "headline": "Ask HN: Small solar generator that is also a double-conversion UPS?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I have given up asking on Amazon because nobody knows what I am talking about.  I am looking for a small solar generator that powers devices using the inverter 100% of the time and never ever passes through power from the commercial AC charger.  When the batteries and input power are unable to power the inverter, it turns off.  When power is restored either from commercial AC power or the batteries or solar, the inverter turns back on.  At no point is commercial AC power to ever touch my devices.<p>Use case:  I want to replace my expensive vertiv liebert gxt4 double-conversion UPS with a Solar Generator for my network gear, having its own dedicated expansion batteries and dedicated solar panels.<p>It seems none of the Solar Generator vendors cover this topic.  The only other option I can see is to get one of the dedicated pure sinewave inverters, separate batteries and charge controller but I was hoping to keep the equipment sprawl in the network racks in my home to a minimum.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "LinuxBender",
    "url": "https://news.ycombinator.com/user?id=LinuxBender"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32522092",
  "sameAs": "https://news.ycombinator.com/item?id=32522092",
  "dateCreated": "2022-08-19T15:31:21.511Z",
  "datePublished": "2022-08-19T15:21:00.000Z",
  "dateModified": "2022-08-19T15:31:21.511Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 小型太阳能发电机，同时也是一个双转换UPS？\n",
  "headline_zh-Hant": "Ask HN: 小型太陽能發電機，同時也是一個雙轉換UPS？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我已经放弃了在亚马逊上询问，因为没有人知道我在说什么。 我正在寻找一种小型太阳能发电机，它可以100%地使用逆变器为设备供电，而且永远不会通过商业交流充电器的电源。 当电池和输入电源无法为逆变器供电时，它就会关闭。 当商业交流电、电池或太阳能恢复供电时，逆变器重新开启。 在任何时候，商业交流电都不会接触到我的设备。<p>使用情况。 我想用太阳能发电机取代我昂贵的vertiv liebert gxt4双转换UPS，用于我的网络设备，拥有自己的专用扩展电池和专用太阳能电池板。 我看到的唯一的其他选择是得到一个专用的纯正弦波逆变器，独立的电池和充电控制器，但我希望把家里的网络机架上的设备扩展到最小。\n",
  "description_zh-Hant": "我已經放棄了在亞馬遜上詢問，因為沒有人知道我在說什麼。 我正在尋找一種小型太陽能發電機，它可以100%地使用逆變器為設備供電，而且永遠不會通過商業交流充電器的電源。 當電池和輸入電源無法為逆變器供電時，它就會關閉。 當商業交流電、電池或太陽能恢復供電時，逆變器重新開啟。 在任何時候，商業交流電都不會接觸到我的設備。<p>使用情況。 我想用太陽能發電機取代我昂貴的vertiv liebert gxt4雙轉換UPS，用於我的網絡設備，擁有自己的專用擴展電池和專用太陽能電池板。 我看到的唯一的其他選擇是得到一個專用的純正弦波逆變器，獨立的電池和充電控制器，但我希望把家裡的網絡機架上的設備擴展到最小。\n"
}