{
  "@type": "NewsArticle",
  "identifier": "2022--08--09--en--askhn--HackerNews--NewsArticle--32404199",
  "url": "https://news.ycombinator.com/item?id=32404199",
  "headline": "Ask HN: How hard would it be to move from Data Engineer to Software Engineer?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi all, first time poster.<p>Recently, about two months ago, I graduated from university with a CS degree. Like many others, it has been hard to find roles as a fresh college grad as a software engineer.<p>I was able to land an offer as a data engineer. At first I was very excited and thought this was a great opportunity, as it is at a well recognized medium sized company that you've probably heard of (not faang).<p>However, I have been working here for a couple months now, and it is not what I expected. I love to code, and the amount of programming in data engineering is not that much at all. It is mostly working with data tooling, SQL, and creating scripts/configuration files to glue things together with Python.<p>Right now I want to begin my plan to jump ship to SWE in the near future. I plan on practicing leetcode, contributing to open source, and developing some personal projects.<p>How hard would it be to land a software engineering role in the near future if I stay at this data engineering role for 6-12 months, given the current job climate and that it would be the only professional experience that I would have after graduation.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "anxiousnewgrad",
    "url": "https://news.ycombinator.com/user?id=anxiousnewgrad"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32404199",
  "sameAs": "https://news.ycombinator.com/item?id=32404199",
  "dateCreated": "2022-08-09T20:59:40.662Z",
  "datePublished": "2022-08-09T20:58:07.000Z",
  "dateModified": "2022-08-09T20:59:40.662Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 从数据工程师转到软件工程师有多难？\n",
  "headline_zh-Hant": "Ask HN: 從數據工程師轉到軟件工程師有多難？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，第一次发帖。<p>最近，大约两个月前，我从大学毕业，拥有CS学位。像其他许多人一样，作为一个刚毕业的大学生，很难找到软件工程师的职位。<p>我找到了一个数据工程师的职位。起初我非常兴奋，认为这是一个很好的机会，因为它是在一个公认的中型公司，你可能听说过（不是faang）。<p>然而，我已经在这里工作了几个月，它并不是我所期望的那样。我喜欢编程，而数据工程的编程量根本就不多。它主要是与数据工具、SQL和创建脚本/配置文件，用Python把东西粘在一起。<p>现在我想开始我的计划，在不久的将来跳槽到SWE。我计划练习leetcode，为开源做出贡献，并开发一些个人项目。<p>考虑到目前的就业环境，以及这将是我毕业后唯一的专业经验，如果我在这个数据工程岗位上呆上6-12个月，那么在不久的将来找到一个软件工程的角色会有多难。\n",
  "description_zh-Hant": "大家好，第一次發帖。<p>最近，大約兩個月前，我從大學畢業，擁有CS學位。像其他許多人一樣，作為一個剛畢業的大學生，很難找到軟件工程師的職位。<p>我找到了一個數據工程師的職位。起初我非常興奮，認為這是一個很好的機會，因為它是在一個公認的中型公司，你可能聽說過（不是faang）。<p>然而，我已經在這裡工作了幾個月，它並不是我所期望的那樣。我喜歡編程，而數據工程的編程量根本就不多。它主要是與數據工具、SQL和創建腳本/配置文件，用Python把東西粘在一起。<p>現在我想開始我的計劃，在不久的將來跳槽到SWE。我計劃練習leetcode，為開源做出貢獻，並開發一些個人項目。<p>考慮到目前的就業環境，以及這將是我畢業後唯一的專業經驗，如果我在這個數據工程崗位上呆上6-12個月，那麼在不久的將來找到一個軟件工程的角色會有多難。\n"
}