{
  "@type": "NewsArticle",
  "identifier": "2022--08--11--en--askhn--HackerNews--NewsArticle--32431133",
  "url": "https://news.ycombinator.com/item?id=32431133",
  "headline": "Ask HN: Would a service to ask proven founders reg. question async be valuable?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "TLDR:  I just wrote a buddy of mine who successfully sold his last company for 100+ ML for some advice on my start-up.  He smartly suggested that I could record a Loom video and send it over for him to respond async.  Ironically, this sparked the idea of, &quot;wow, I'd love to have a two of three proven founders who I could report back to regularly for their guidance.&quot;<p>So I'm asking HN. . . do you know of any services like this or would you find this valuable?  I could imagine people asking things like, how should I start a drip email campaign, what do you think of this onboarding strategy, a friend's dad wants to invest in my start-up, should I pivot. . . the thousands of various questions I think we all have.<p>I'd love to hear what people think who consider themselves successful and if they would be open to giving such advice async, and what people think who would like such advice.  Last thought, I pay $199 per month for a nutritionist to help me lose weight and she follows my meal tracking. . . I see this as sort of similar.  She can give me some advice on edge cases, or just boost my spirits when I feel like I should not have had those two margaritas during the Sunday brunch.  It would be nice to have someone like that in business.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "kiddz",
    "url": "https://news.ycombinator.com/user?id=kiddz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32431133",
  "sameAs": "https://news.ycombinator.com/item?id=32431133",
  "dateCreated": "2022-08-11T20:27:02.398Z",
  "datePublished": "2022-08-11T20:13:00.000Z",
  "dateModified": "2022-08-11T20:27:02.398Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 一个向已证实的创始人提出注册问题的服务是否有价值？\n",
  "headline_zh-Hant": "Ask HN: 一個向已證實的創始人提出註冊問題的服務是否有價值？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "TLDR：我刚刚给我的一个哥们写信，他成功地将他的上一家公司以100多美元的价格卖出，为我的创业提供一些建议。 他很聪明地建议我可以录制一个Loom视频，然后发过去让他异步回复。 讽刺的是，这引发了我的想法：&quot;哇，我很想有两个或三个经过验证的创始人，我可以定期向他们汇报，寻求他们的指导。......你知道有这样的服务吗，或者你会觉得这很有价值？ 我可以想象人们会问这样的问题：我应该如何开始一个滴灌式的电子邮件活动，你认为这个入职策略怎么样，一个朋友的父亲想投资我的创业公司，我是否应该调整。......数以千计的各种问题，我想我们都有。<p>我很想听听那些认为自己很成功的人的想法，以及他们是否愿意以异步方式提供这样的建议，还有那些希望得到这样建议的人的想法。 最后一个想法，我每月支付199美元给一个营养师帮助我减肥，她跟随我的膳食追踪。. . 我认为这有点类似。 她可以在边缘情况下给我一些建议，或者当我觉得我不应该在周日的早午餐上喝那两杯玛格丽特时，她可以给我打气。 如果在生意上有这样的人就好了。\n",
  "description_zh-Hant": "TLDR：我剛剛給我的一個哥們寫信，他成功地將他的上一家公司以100多美元的價格賣出，為我的創業提供一些建議。 他很聰明地建議我可以錄製一個Loom視頻，然後發過去讓他異步回覆。 諷刺的是，這引發了我的想法：&quot;哇，我很想有兩個或三個經過驗證的創始人，我可以定期向他們彙報，尋求他們的指導。......你知道有這樣的服務嗎，或者你會覺得這很有價值？ 我可以想象人們會問這樣的問題：我應該如何開始一個滴灌式的電子郵件活動，你認為這個入職策略怎麼樣，一個朋友的父親想投資我的創業公司，我是否應該調整。......數以千計的各種問題，我想我們都有。<p>我很想聽聽那些認為自己很成功的人的想法，以及他們是否願意以異步方式提供這樣的建議，還有那些希望得到這樣建議的人的想法。 最後一個想法，我每月支付199美元給一個營養師幫助我減肥，她跟隨我的膳食追蹤。. . 我認為這有點類似。 她可以在邊緣情況下給我一些建議，或者當我覺得我不應該在週日的早午餐上喝那兩杯瑪格麗特時，她可以給我打氣。 如果在生意上有這樣的人就好了。\n"
}