{
  "@type": "NewsArticle",
  "identifier": "2022--08--19--en--askhn--HackerNews--NewsArticle--32520151",
  "url": "https://news.ycombinator.com/item?id=32520151",
  "headline": "Ask HN: American digital nomad? What state is your LLC in?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "This is a big open-ended question for Americans who are permanent digital nomads (or who choose not to have a permanent address in the US).<p>There are many choices to make, and the roadmap is unclear.  Searching the web predictably turns up a lot of SEO-game-quality results, so it's difficult to know what is good advice.<p>For those who have experienced this, please share what you are doing or have learned.<p>Mailing Address<p>There are virtual postal mail services which can be used as a &quot;permanent&quot; mailing address.  (A USPS mailbox cannot, because they require two limited forms of ID; for those of us who do not/no longer have a US drivers license, our only accepted ID is a passport.)<p>Business Formation<p>LLC seems to be the wisest choice for those who do contract and consulting work, particularly for US clients.  There are many states which seem to offer attractive benefits as an LLC location, such as Wyoming, Delaware, Nevada, and Texas.  I list them in that order because from my reading that is the best order, but perhaps you have more experience and can share?<p>Taxes<p>One of the joys if being an American is that we have to file taxes for the US regardless of where we are or where we are earning.  There is no opt-out short of giving up citizenship (which obviously requires having another citizenship/passport in another country).  In my case, having Dutch residence, I have to file and pay in Netherlands and also file in US.  (There's no double taxation, so paying more taxes in NL means I have zero taxes due for US... but I still have to file; that will never go away.)<p>How do you manage this?  The temptation is to only have one residence - US (virtual mail address), then stay in other countries only as allowed by visa limits.  For Schengen, that's 180 days per year -- enough if you're a full time nomad.<p>Banking<p>What bank(s) do you use?  Wise (formerly Transferwise) may be a viable option for receiving money from clients in the US and elsewhere.  HSBC has been suggested, but the details of their account setup requirements seem not to apply.<p>Experiential advice on any of these topics is highly appreciated!",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "z9znz",
    "url": "https://news.ycombinator.com/user?id=z9znz"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32520151",
  "sameAs": "https://news.ycombinator.com/item?id=32520151",
  "dateCreated": "2022-08-19T12:49:53.229Z",
  "datePublished": "2022-08-19T12:29:37.000Z",
  "dateModified": "2022-08-19T12:49:53.229Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 美国数字游民？你的有限责任公司在哪个州？\n",
  "headline_zh-Hant": "Ask HN: 美國數字遊民？你的有限責任公司在哪個州？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "对于那些长期从事数字游牧的美国人（或选择不在美国拥有永久地址的人）来说，这是一个很大的开放式问题。<p>有很多选择要做，而且路线图也不清楚。 在网上搜索可以预见的是，会出现很多SEO游戏质量的结果，所以很难知道什么是好的建议。<p>对于那些有经验的人，请分享你正在做的或学到的东西。<p>邮寄地址<p>有一些虚拟邮政服务，可以作为&quot;永久&quot;邮寄地址。 (美国邮政信箱不行，因为它们需要两种有限的身份证明；对于我们这些没有/不再有美国驾照的人来说，我们唯一接受的身份证明是护照。)<p>企业成立<p>对于从事合同和咨询工作的人来说，LLC似乎是最明智的选择，特别是为美国客户。 有许多州似乎提供了作为有限责任公司所在地的诱人优势，如怀俄明州、特拉华州、内华达州和德克萨斯州。 我按这个顺序列出，因为从我的阅读来看，这是最好的顺序，但也许你有更多的经验，可以分享一下。<p>税收<p>如果是美国人，其中一个乐趣是，无论我们在哪里或在哪里挣钱，我们都必须为美国报税。 除了放弃公民身份之外，没有其他选择（这显然需要在另一个国家拥有另一个公民身份/护照）。 就我而言，我有荷兰居留权，我必须在荷兰申报和支付，也必须在美国申报。 (没有双重征税，所以在荷兰缴纳更多的税意味着我在美国的税款为零......但我仍然必须申报；这一点永远不会消失。 诱惑是只拥有一个住所--美国（虚拟邮件地址），然后只在签证限制允许的情况下在其他国家停留。 对于申根国家来说，每年有180天--如果你是一个全职的游牧者，这已经足够了。<p>银行<p>你使用什么银行？ Wise（前身为Transferwise）可能是一个可行的选择，可以从美国和其他地方的客户那里接收资金。 有人建议汇丰银行，但他们的账户设置要求的细节似乎并不适用。<p>非常感谢对这些主题的经验性建议！</p> <p>你是如何做到的？\n",
  "description_zh-Hant": "對於那些長期從事數字遊牧的美國人（或選擇不在美國擁有永久地址的人）來說，這是一個很大的開放式問題。<p>有很多選擇要做，而且路線圖也不清楚。 在網上搜索可以預見的是，會出現很多SEO遊戲質量的結果，所以很難知道什麼是好的建議。<p>對於那些有經驗的人，請分享你正在做的或學到的東西。<p>郵寄地址<p>有一些虛擬郵政服務，可以作為&quot;永久&quot;郵寄地址。 (美國郵政信箱不行，因為它們需要兩種有限的身份證明；對於我們這些沒有/不再有美國駕照的人來說，我們唯一接受的身份證明是護照。)<p>企業成立<p>對於從事合同和諮詢工作的人來說，LLC似乎是最明智的選擇，特別是為美國客戶。 有許多州似乎提供了作為有限責任公司所在地的誘人優勢，如懷俄明州、特拉華州、內華達州和德克薩斯州。 我按這個順序列出，因為從我的閱讀來看，這是最好的順序，但也許你有更多的經驗，可以分享一下。<p>稅收<p>如果是美國人，其中一個樂趣是，無論我們在哪裡或在哪裡掙錢，我們都必須為美國報稅。 除了放棄公民身份之外，沒有其他選擇（這顯然需要在另一個國家擁有另一個公民身份/護照）。 就我而言，我有荷蘭居留權，我必須在荷蘭申報和支付，也必須在美國申報。 (沒有雙重徵稅，所以在荷蘭繳納更多的稅意味著我在美國的稅款為零......但我仍然必須申報；這一點永遠不會消失。 誘惑是隻擁有一個住所--美國（虛擬郵件地址），然後只在簽證限制允許的情況下在其他國家停留。 對於申根國家來說，每年有180天--如果你是一個全職的遊牧者，這已經足夠了。<p>銀行<p>你使用什麼銀行？ Wise（前身為Transferwise）可能是一個可行的選擇，可以從美國和其他地方的客戶那裡接收資金。 有人建議匯豐銀行，但他們的賬戶設置要求的細節似乎並不適用。<p>非常感謝對這些主題的經驗性建議！</p> <p>你是如何做到的？\n"
}