{
  "@type": "NewsArticle",
  "identifier": "2022--08--09--en--askhn--HackerNews--NewsArticle--32404961",
  "url": "https://news.ycombinator.com/item?id=32404961",
  "headline": "Ask HN: How to deal with potential discrimination when applying for job",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hello,<p>I'm a developer with 14+ years of experience. Im male, white, heterosexual and I have my photo in my CV.<p>Couple months ago I found a great job offer. I check all the required boxes, most of the &quot;nice to haves&quot;.\nI applied, 24 days later i received canned response about &quot;not moving forward&quot;. I didnt make anything out of it.\nCouple months passed, I see the offer is still up, accepting applicants.<p>I decided to check out the person who rejected me on linkedin and found that its not a white guy with &quot;Diversity and Inclusion&quot; in his title, and &quot;Diversity and inclusion is one of my foundational pillars, and I'm driven to introduce more diversity to the tech world.&quot;<p>Without going into too much detail, I suspect my rejection might be caused by &quot;diversity and inclusion&quot; part of his title, not the &quot;Technical Recruiter&quot; part.<p>I have pretty good record of getting invited to all 2nd+ stages of recruitements even if my experience does not fit as perfect as this time, hence my surprise and investigation.<p>Any ideas how could i approach the subject to be at least evaluated when it comes to culture fit, technical abilities, teamwork, by people who are competent and will potentially work with me, instead of resume shuffler?<p>Write to a senior recruiter on linkedin and ask if he could evaluate my CV personally?\nGive up?\nForge my CV to include non-white photo (or remove it altogether) and pretend that my camera is broken until i get past him?\nIs there any chance to get past this filter?<p>I would rather not start any relationship with a lie. Having said that, desperate times...<p>I really like the company, product (ive used it in the past), offer is very suitable for me, so i wouldnt want to pass it lightly.<p>Any advice appreciated. Thank you very much.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "twohaibei",
    "url": "https://news.ycombinator.com/user?id=twohaibei"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32404961",
  "sameAs": "https://news.ycombinator.com/item?id=32404961",
  "dateCreated": "2022-08-09T22:26:35.730Z",
  "datePublished": "2022-08-09T22:01:04.000Z",
  "dateModified": "2022-08-09T22:26:35.730Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 5
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何处理申请工作时的潜在歧视问题\n",
  "headline_zh-Hant": "Ask HN: 如何處理申請工作時的潛在歧視問題\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，<p>我是一个有14年以上经验的开发人员。我是男性，白人，异性恋，我的简历里有我的照片。<p>几个月前，我发现了一个很好的工作机会。我勾选了所有需要的选项，以及大部分的 \"不错 \"选项。\n我申请了，24天后，我收到了关于 \"不继续前进 \"的罐头答复。我没有从中得到任何好处。\n<p>我决定在Linkedin上查一下那个拒绝我的人，发现他不是一个头衔中带有&quot;多样性和包容性&quot;的白人，而且&quot;多样性和包容性是我的基本支柱之一，我有动力将更多的多样性引入技术世界。 &quot;<p>不用说得太详细，我怀疑我被拒绝的原因可能是他头衔中的&quot;多样性和包容性&quot;部分，而不是&quot;技术招聘人员&quot;部分。 <p>我有很好的记录，即使我的经验不像这次那样完美，也会被邀请参加所有第二阶段以上的招聘，因此我感到惊讶和调查。<p>有什么想法可以让我接近这个主题，至少在涉及到文化适应性、技术能力、团队合作时被评估，由那些有能力并可能与我合作的人，而不是简历洗牌者？<p>写给Linkedin上的高级招聘人员，问他是否可以亲自评估我的简历？\n放弃吗？\n伪造我的简历，包括非白色的照片（或完全删除），并假装我的相机坏了，直到我通过他？\n有没有机会通过这个过滤器？<p>我不希望以谎言开始任何关系。<p>我真的很喜欢这家公司，产品（我过去也用过），报价很适合我，所以我不想轻易放弃它。非常感谢您。\n",
  "description_zh-Hant": "你好，<p>我是一個有14年以上經驗的開發人員。我是男性，白人，異性戀，我的簡歷裡有我的照片。<p>幾個月前，我發現了一個很好的工作機會。我勾選了所有需要的選項，以及大部分的 \"不錯 \"選項。\n我申請了，24天后，我收到了關於 \"不繼續前進 \"的罐頭答覆。我沒有從中得到任何好處。\n<p>我決定在Linkedin上查一下那個拒絕我的人，發現他不是一個頭銜中帶有&quot;多樣性和包容性&quot;的白人，而且&quot;多樣性和包容性是我的基本支柱之一，我有動力將更多的多樣性引入技術世界。 &quot;<p>不用說得太詳細，我懷疑我被拒絕的原因可能是他頭銜中的&quot;多樣性和包容性&quot;部分，而不是&quot;技術招聘人員&quot;部分。 <p>我有很好的記錄，即使我的經驗不像這次那樣完美，也會被邀請參加所有第二階段以上的招聘，因此我感到驚訝和調查。<p>有什麼想法可以讓我接近這個主題，至少在涉及到文化適應性、技術能力、團隊合作時被評估，由那些有能力並可能與我合作的人，而不是簡歷洗牌者？<p>寫給Linkedin上的高級招聘人員，問他是否可以親自評估我的簡歷？\n放棄嗎？\n偽造我的簡歷，包括非白色的照片（或完全刪除），並假裝我的相機壞了，直到我通過他？\n有沒有機會通過這個過濾器？<p>我不希望以謊言開始任何關係。<p>我真的很喜歡這家公司，產品（我過去也用過），報價很適合我，所以我不想輕易放棄它。非常感謝您。\n"
}