{
  "@type": "NewsArticle",
  "identifier": "2022--08--17--en--askhn--HackerNews--NewsArticle--32493174",
  "url": "https://news.ycombinator.com/item?id=32493174",
  "headline": "Ask HN: Startup idea – disconnected, physical space charged by hour",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi, first time posting here.  I'd appreciate any feedback.  I've been considering this startup idea for couple years now.  The idea is an internet-free and screen-free space that allows the user to do &quot;deep work&quot;, read, deliberate, or just do nothing.<p>It's essentially a hotel room, but only bookable for one person, for a few hours only.  There is no internet provided, and cellular signal is blocked.  Alternatively (if blocking cellular signal is infeasible), users are asked to turn over their devices at the counter or have the devices &quot;locked&quot; in a &quot;faraday box&quot; for the stay duration.  In the room, distraction and stimulation is kept to the minimum.  No screens or ads allowed in the room; and the view from the window would be calming and non-stimulating.<p>The idea is borne out of my exhaustion of living in a hyperdense Asia city, where I am always surrounded by sensory pollutions such as advertisements, city noises, as well as constant phone notifications.  I am also the victim of my own internet addictions.<p>To stay focus, I've tried to work in coffee shops.  Although I'm generally productive in coffees shops, I often find I couldn't really fully relax or &quot;be myself&quot; in a public space.  I tried &quot;staycation&quot; in a real hotel, but the check-in is complicated, the cost is high, and the room is designed more toward leisure and entertainment.  It usually lacks a good desk, a good chair; and the high-speed internet is too enticing.<p>Specifically, the space is provided to those who would block out hours from their calendar for &quot;reading&quot; or &quot;writing&quot; but constantly fail to protect that commitment.  More broadly, my intuition is that &quot;traveling&quot; to a dedicated offline zone once in a while may be as beneficial as traveling to a different country.<p>I realize the idea is rather unrefined, and not very &quot;tech.&quot;  But I'd love to know HN community's thoughts on it.  Thanks.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "chouchinhua",
    "url": "https://news.ycombinator.com/user?id=chouchinhua"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32493174",
  "sameAs": "https://news.ycombinator.com/item?id=32493174",
  "dateCreated": "2022-08-17T07:26:42.302Z",
  "datePublished": "2022-08-17T07:04:51.000Z",
  "dateModified": "2022-08-17T07:26:42.302Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 10
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 4
    }
  ],
  "headline_zh-Hans": "Ask HN: 初创企业的想法--断开连接，物理空间按小时收费\n",
  "headline_zh-Hant": "Ask HN: 初創企業的想法--斷開連接，物理空間按小時收費\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "你好，第一次在这里发帖。 我希望得到任何反馈。 我考虑这个创业的想法已经有好几年了。 这个想法是一个无网络和无屏幕的空间，允许用户做&quot;深入的工作&quot;，阅读，审议，或只是什么都不做。<p>它本质上是一个酒店房间，但只为一个人预订，只为几个小时。 这里不提供互联网，而且手机信号被屏蔽。 或者（如果屏蔽手机信号不可行），用户被要求在柜台上交出他们的设备，或者在逗留期间将设备锁在一个 \"法拉第箱 \"里。 在房间里，分心和刺激要保持在最低限度。 房间里不允许有任何屏幕或广告；窗外的景色将是平静和非刺激性的。<p>这个想法源于我生活在一个超密集的亚洲城市的疲惫，在那里我总是被广告、城市噪音以及不断的电话通知等感官污染所包围。 我也是我自己网络成瘾的受害者。<p>为了保持专注，我尝试在咖啡馆工作。 虽然我在咖啡馆里一般都很有成就感，但我经常发现在公共空间里，我无法真正完全放松或做自己。 我试过在真正的酒店里度假，但入住手续复杂，费用高，而且房间的设计更倾向于休闲和娱乐。 <p>具体来说，这个空间是提供给那些会从他们的日历中划出几个小时用于&quot;阅读&quot;或&quot;写作&quot;，但经常无法保护这一承诺的人。 更广泛地说，我的直觉是，偶尔到一个专门的离线区域旅行，可能就像到不同的国家旅行一样有益。<p>我意识到这个想法相当不成熟，而且不是很 \"科技\"，但我很想知道HN社区对此的看法。 谢谢。\n",
  "description_zh-Hant": "你好，第一次在這裡發帖。 我希望得到任何反饋。 我考慮這個創業的想法已經有好幾年了。 這個想法是一個無網絡和無屏幕的空間，允許用戶做&quot;深入的工作&quot;，閱讀，審議，或只是什麼都不做。<p>它本質上是一個酒店房間，但只為一個人預訂，只為幾個小時。 這裡不提供互聯網，而且手機信號被屏蔽。 或者（如果屏蔽手機信號不可行），用戶被要求在櫃檯上交出他們的設備，或者在逗留期間將設備鎖在一個 \"法拉第箱 \"裡。 在房間裡，分心和刺激要保持在最低限度。 房間裡不允許有任何屏幕或廣告；窗外的景色將是平靜和非刺激性的。<p>這個想法源於我生活在一個超密集的亞洲城市的疲憊，在那裡我總是被廣告、城市噪音以及不斷的電話通知等感官汙染所包圍。 我也是我自己網絡成癮的受害者。<p>為了保持專注，我嘗試在咖啡館工作。 雖然我在咖啡館裡一般都很有成就感，但我經常發現在公共空間裡，我無法真正完全放鬆或做自己。 我試過在真正的酒店裡度假，但入住手續複雜，費用高，而且房間的設計更傾向於休閒和娛樂。 <p>具體來說，這個空間是提供給那些會從他們的日曆中劃出幾個小時用於&quot;閱讀&quot;或&quot;寫作&quot;，但經常無法保護這一承諾的人。 更廣泛地說，我的直覺是，偶爾到一個專門的離線區域旅行，可能就像到不同的國家旅行一樣有益。<p>我意識到這個想法相當不成熟，而且不是很 \"科技\"，但我很想知道HN社區對此的看法。 謝謝。\n"
}