{
  "@type": "NewsArticle",
  "identifier": "2022--08--11--en--askhn--HackerNews--NewsArticle--32432555",
  "url": "https://news.ycombinator.com/item?id=32432555",
  "headline": "Ask HN: Having a good career without meaningful work relationships?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Trying to build relationships at work stresses me out. But also, I don't want my career to stay bad from the lack of good work relationships. I don't want to be stressed, neither in the short run or in the long run.<p>I treat interactions with people at work as being very &quot;in the moment&quot; just doing the minimum to realize the goals of our work and the company. I don't invest time to build relationships at work beyond that. With my group of friends, I don't see them at work. I don't have many friends but with those that do, I still care about. Far less stressful compared to building genuine relationships at work.<p>But I treat every work interaction as transactional. Might be something to do with the workplace setting and money being involved in it. I don't get how transactional behavior in professional settings became taboo when money is at the center of most of it anyways.<p>My life shouldn't revolve around work or the people in them, but I do still want it to be stable enough in order to financially support my life outside of work. Can I have it both? In other words, low-investment, high stability work, in tech. Maybe that's a unicorn job in tech, I don't know.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "djellybeans",
    "url": "https://news.ycombinator.com/user?id=djellybeans"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32432555",
  "sameAs": "https://news.ycombinator.com/item?id=32432555",
  "dateCreated": "2022-08-11T22:26:10.106Z",
  "datePublished": "2022-08-11T22:24:16.000Z",
  "dateModified": "2022-08-11T22:26:10.106Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 有好的事业，却没有有意义的工作关系？\n",
  "headline_zh-Hant": "Ask HN: 有好的事業，卻沒有有意義的工作關係？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "试图在工作中建立关系让我感到压力很大。但是，我也不希望我的职业生涯因为缺乏良好的工作关系而一直糟糕下去。我不想有压力，无论是短期还是长期。<p>我把工作中与人的互动视为非常&quot;当下&quot;只是做最低限度的工作来实现我们工作和公司的目标。除此以外，我不会在工作中投入时间来建立关系。对于我的那群朋友，我在工作中不会见到他们。我的朋友不多，但对那些朋友，我还是很关心的。与在工作中建立真正的关系相比，压力要小得多。<p>但我把每一次工作互动都当作交易。这可能与工作场所的环境和金钱的关系有关。我不明白，当金钱成为大部分工作的中心时，职业环境中的交易行为怎么会成为禁忌。<p>我的生活不应该围绕工作或其中的人，但我仍然希望它足够稳定，以便在经济上支持我工作以外的生活。我可以两者兼得吗？换句话说，低投资、高稳定的工作，在技术领域。也许这就是科技界的独角兽工作，我不知道。\n",
  "description_zh-Hant": "試圖在工作中建立關係讓我感到壓力很大。但是，我也不希望我的職業生涯因為缺乏良好的工作關係而一直糟糕下去。我不想有壓力，無論是短期還是長期。<p>我把工作中與人的互動視為非常&quot;當下&quot;只是做最低限度的工作來實現我們工作和公司的目標。除此以外，我不會在工作中投入時間來建立關係。對於我的那群朋友，我在工作中不會見到他們。我的朋友不多，但對那些朋友，我還是很關心的。與在工作中建立真正的關係相比，壓力要小得多。<p>但我把每一次工作互動都當作交易。這可能與工作場所的環境和金錢的關係有關。我不明白，當金錢成為大部分工作的中心時，職業環境中的交易行為怎麼會成為禁忌。<p>我的生活不應該圍繞工作或其中的人，但我仍然希望它足夠穩定，以便在經濟上支持我工作以外的生活。我可以兩者兼得嗎？換句話說，低投資、高穩定的工作，在技術領域。也許這就是科技界的獨角獸工作，我不知道。\n"
}