{
  "@type": "NewsArticle",
  "identifier": "2022--08--25--en--askhn--HackerNews--NewsArticle--32588326",
  "url": "https://news.ycombinator.com/item?id=32588326",
  "headline": "Ask HN: What happened to the law that would prevent social platforms censorship?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Every few months someone I watch/follow/listen to disappears from internet. It seems if someone is even slightly controversial they are wiped out off internet in due time. People don't even care about freedom of speech, sites collectively have started to disable comments. It used to be we would learn how important freedom of speech is through people like Voltaire, George Orwell, and so on. And how it formed the basis of our govt and how it has shaped our society and systems, often always for the better. Yet it feels right now people don't really care about principles and more interested in subduing the other side on all mediums. Almost feels like society as deteriorated a bit, concept of free speech is leaving fabric of society altogether. On campuses, on tvs, on social platforms. Whenever someone gets banned, it's welcomed. It's now known as cancel culture which celebrates censorship, just with different cover up term. Almost scary how irrelevant this principle is becoming.<p>Right now companies are shielded from liabilities of user generated content, but they also engage in selective editing. The new law was saying that a platform is either just a host of user generated content or an editor in which case responsible for the content, it can't claim to be a host and then edit selectively.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "techsin101",
    "url": "https://news.ycombinator.com/user?id=techsin101"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32588326",
  "sameAs": "https://news.ycombinator.com/item?id=32588326",
  "dateCreated": "2022-08-25T02:39:48.766Z",
  "datePublished": "2022-08-25T01:39:01.000Z",
  "dateModified": "2022-08-25T02:39:48.766Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 防止社交平台审查的法律发生了什么？\n",
  "headline_zh-Hant": "Ask HN: 防止社交平臺審查的法律發生了什麼？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "每隔几个月，就有一个我看/关注/听的人从互联网上消失了。似乎只要有人稍有争议，他们就会在适当的时候被从互联网上抹去。人们甚至不关心言论自由，网站已经集体开始禁止评论了。过去，我们会通过伏尔泰、乔治-奥威尔等人了解到言论自由是多么重要。以及它是如何形成我们政府的基础，以及它是如何塑造我们的社会和制度的，往往总是为了更好。然而，现在感觉人们并不真正关心原则，而对在所有媒体上制服另一方更感兴趣。几乎感觉到社会有点恶化了，言论自由的概念完全离开了社会的结构。在校园里，在电视上，在社交平台上。每当有人被禁言，就会受到欢迎。现在被称为取消文化，庆祝审查制度，只是用不同的掩饰词。<p>现在，公司被免除了用户生成内容的责任，但他们也在进行选择性的编辑。新的法律是说，一个平台要么只是用户生成内容的主机，要么是对内容负责的编辑，它不能声称自己是主机，然后有选择地编辑。\n",
  "description_zh-Hant": "每隔幾個月，就有一個我看/關注/聽的人從互聯網上消失了。似乎只要有人稍有爭議，他們就會在適當的時候被從互聯網上抹去。人們甚至不關心言論自由，網站已經集體開始禁止評論了。過去，我們會通過伏爾泰、喬治-奧威爾等人瞭解到言論自由是多麼重要。以及它是如何形成我們政府的基礎，以及它是如何塑造我們的社會和制度的，往往總是為了更好。然而，現在感覺人們並不真正關心原則，而對在所有媒體上制服另一方更感興趣。幾乎感覺到社會有點惡化了，言論自由的概念完全離開了社會的結構。在校園裡，在電視上，在社交平臺上。每當有人被禁言，就會受到歡迎。現在被稱為取消文化，慶祝審查制度，只是用不同的掩飾詞。<p>現在，公司被免除了用戶生成內容的責任，但他們也在進行選擇性的編輯。新的法律是說，一個平臺要麼只是用戶生成內容的主機，要麼是對內容負責的編輯，它不能聲稱自己是主機，然後有選擇地編輯。\n"
}