{
  "@type": "NewsArticle",
  "identifier": "2022--08--18--en--askhn--HackerNews--NewsArticle--32509659",
  "url": "https://news.ycombinator.com/item?id=32509659",
  "headline": "Ask HN: Is the tech industry out of ideas?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Potentially inflammatory question, but I'm asking with sincere curiosity. It feels to me that the transformative era of tech is over, and we are now in &quot;maintenance mode,&quot; for lack of a better term. The '80s and '90s revolutionized computing, and the web matured into a real platform during the '00s and '10s. The big players grew from one- or two-person projects in literal or proverbial garages into firmly established global juggernauts. (In some cases this began in the '70s.) Whole industries—publishing, entertainment, transportation, retail, communication—were fundamentally changed, and whole new ways of connecting people were developed. New ideas and technologies were sprouting up everywhere, and they were exciting and solved obvious problems. It wasn't all roses of course, and there's much discussion to be had on the externalities, but it was undeniably revolutionary.<p>Now it seems, to me at least, that the party is more or less over. I'm wondering if anyone else feels this way or if I've simply become jaded and cynical. (I am prone to jadedness and cynicism so this is entirely possible.) Things like &quot;the metaverse&quot; and the bizarrely-named &quot;web3&quot; feel like desperate attempts to keep finding the next big thing in a field that has simply run out of big things to find. I can't identify a single small company working on something that feels like it'll be huge—the next Google, Netflix, or what have you. The spirit of the early days seems impossible to find now.<p>This is just my personal experience. I would love to hear both from people who feel this way and from people who disagree.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "_moof",
    "url": "https://news.ycombinator.com/user?id=_moof"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32509659",
  "sameAs": "https://news.ycombinator.com/item?id=32509659",
  "dateCreated": "2022-08-18T14:29:10.929Z",
  "datePublished": "2022-08-18T13:57:20.000Z",
  "dateModified": "2022-08-18T14:29:10.929Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 科技行业是否已经没有想法了？\n",
  "headline_zh-Hant": "Ask HN: 科技行業是否已經沒有想法了？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "这可能是一个煽动性的问题，但我是带着真诚的好奇心问的。在我看来，科技的变革时代已经结束，我们现在处于&quot;维护模式&quot;，因为缺乏一个更好的术语。80年代和90年代彻底改变了计算机，而网络在00年代和10年代成熟为一个真正的平台。大公司从字面上或谚语中的一两个人的项目成长为稳固的全球巨头。(整个行业--出版、娱乐、运输、零售、通信--都发生了根本性的变化，并且开发了连接人们的全新方式。新的想法和技术如雨后春笋般涌现，它们令人兴奋，解决了明显的问题。当然，这并不是所有的玫瑰花，还有很多关于外部因素的讨论，但不可否认的是，这是一场革命。<p>现在，至少在我看来，这场聚会或多或少已经结束。我想知道是否有其他人有这样的感觉，或者我只是变得迟钝和愤世嫉俗。(我很容易感到厌倦和愤世嫉俗，所以这完全是有可能的。)像 \"元宇宙\"(metaverse)和名字怪异的 \"web3\"(web3)这样的东西，感觉像是在一个已经没有大东西可找的领域里，不顾一切地试图继续寻找下一个大东西。我不能确定有哪家小公司正在研究一些感觉会很巨大的东西--下一个谷歌、Netflix，或者其他什么。早期的精神现在似乎无法找到。<p>这只是我的个人经验。我很想听听有这种感觉的人和有不同意见的人的意见。\n",
  "description_zh-Hant": "這可能是一個煽動性的問題，但我是帶著真誠的好奇心問的。在我看來，科技的變革時代已經結束，我們現在處於&quot;維護模式&quot;，因為缺乏一個更好的術語。80年代和90年代徹底改變了計算機，而網絡在00年代和10年代成熟為一個真正的平臺。大公司從字面上或諺語中的一兩個人的項目成長為穩固的全球巨頭。(整個行業--出版、娛樂、運輸、零售、通信--都發生了根本性的變化，並且開發了連接人們的全新方式。新的想法和技術如雨後春筍般湧現，它們令人興奮，解決了明顯的問題。當然，這並不是所有的玫瑰花，還有很多關於外部因素的討論，但不可否認的是，這是一場革命。<p>現在，至少在我看來，這場聚會或多或少已經結束。我想知道是否有其他人有這樣的感覺，或者我只是變得遲鈍和憤世嫉俗。(我很容易感到厭倦和憤世嫉俗，所以這完全是有可能的。)像 \"元宇宙\"(metaverse)和名字怪異的 \"web3\"(web3)這樣的東西，感覺像是在一個已經沒有大東西可找的領域裡，不顧一切地試圖繼續尋找下一個大東西。我不能確定有哪家小公司正在研究一些感覺會很巨大的東西--下一個谷歌、Netflix，或者其他什麼。早期的精神現在似乎無法找到。<p>這只是我的個人經驗。我很想聽聽有這種感覺的人和有不同意見的人的意見。\n"
}