{
  "@type": "NewsArticle",
  "identifier": "2022--08--22--en--askhn--HackerNews--NewsArticle--32557598",
  "url": "https://news.ycombinator.com/item?id=32557598",
  "headline": "Ask HN: Do I Have ADHD?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I can't focus on things unless i've a very strong interest in it. However, it used to be I was curious about many things so it would work out. For example, I took a break from schooling when I was 11-12 and I was able to master math, science, and coding. I'd read an entire book in one go, spend days on one math problem, Debug code for 5+ days.<p>But I essentially had no internet access, then I got the internet and came competitive gaming, seeking public reward came to be the norm for me, yahoo answers, then youtube, then multiple tabs in chrome... now i can't even watch videos longer than 2 minutes, i cant read comments longer than 2 sentences, i actually hate talking in full sentences.. instead just feel inclined to use acronyms: lol, wdu?, sus, ngl, g, cap, gl... I find myself trying to come up with funny comments for reddit all day (sad actually), obsessively updating news sites for no reason...I have 80+ tabs open any time, (all todo readings)<p>I struggle to code for day job.<p>Obviously social media is a big culprit, my question is something wrong with me in addition to that? I still can focus on things that I've innate interest in (got fascinated with video editing and taught myself after effects after obsessively learning from all resources)<p>I found writing physically on a notebook kinda helped me, also going on long drives 4+ hours and reading a book (one time i knew i was gonna go so found a book i could read and didn't wanna use mobile data, ended up reading half the book and came back home and read the rest... huge accomplishment for me to read the whole book)<p>on good sleep days im better<p>now that i think about it i always had this side to me, rewards didn't motivate me, punishment didn't matter. good grades, more money, reputation... led to some temporary motivation, only thing that motivated me was if it was intellectually interesting if not i knew i should do it but just couldn't bring inner me to accept the compromise.<p>so what do you do, or i should do?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "techsin101",
    "url": "https://news.ycombinator.com/user?id=techsin101"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32557598",
  "sameAs": "https://news.ycombinator.com/item?id=32557598",
  "dateCreated": "2022-08-22T21:44:50.195Z",
  "datePublished": "2022-08-22T21:34:33.000Z",
  "dateModified": "2022-08-22T21:44:50.195Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 2
    }
  ],
  "headline_zh-Hans": "Ask HN: 我有多动症吗？\n",
  "headline_zh-Hant": "Ask HN: 我有多動症嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "除非我对事物有非常强烈的兴趣，否则我无法专注于它。然而，以前我对很多事情都很好奇，所以会有效果。例如，我在11-12岁时休学，我能够掌握数学、科学和编码。我可以一口气读完一整本书，花几天时间研究一个数学问题，调试代码5天以上。<p>但我基本上没有上网，后来我有了互联网，就有了竞技游戏，寻求公共奖励成为我的常态，雅虎答案，然后是youtube，然后是chrome的多个标签......现在我甚至不能看超过2分钟的视频，我不能阅读超过2句话的评论，我实际上讨厌用完整的句子说话，而只是觉得倾向于使用缩写：lol，wdu? sus, ngl, g, cap, gl... 我发现自己整天都在为reddit想一些有趣的评论（其实很可悲），毫无理由地沉迷于更新新闻网站......我随时都有80多个标签打开，（都是待办事项的阅读）<p>我为白天的工作努力编码。<p>显然，社交媒体是一个很大的罪魁祸首，我的问题是，除了这些之外，我还有什么不对吗？我仍然可以专注于我天生感兴趣的事情（我迷上了视频编辑，并在痴迷地从所有资源中学习后自学了after effects）<p>我发现在笔记本上书写实物对我有点帮助，还有在长达4个多小时的长途驾驶中阅读一本书（有一次我知道我要去，所以找到一本我可以阅读的书，不想使用移动数据，最后读了一半的书，回到家又读了剩下的。对我来说，读完整本书是一个巨大的成就。<p>在睡眠好的日子里，我的情况会好一些<p>现在我想起来了，我总是有这样的一面，奖励不能激励我，惩罚也不重要。好成绩、更多的钱、名誉......会带来一些暂时的激励，唯一能激励我的是如果它在智力上有趣，如果不是，我知道我应该做，但就是不能让我内心接受妥协。\n",
  "description_zh-Hant": "除非我對事物有非常強烈的興趣，否則我無法專注於它。然而，以前我對很多事情都很好奇，所以會有效果。例如，我在11-12歲時休學，我能夠掌握數學、科學和編碼。我可以一口氣讀完一整本書，花幾天時間研究一個數學問題，調試代碼5天以上。<p>但我基本上沒有上網，後來我有了互聯網，就有了競技遊戲，尋求公共獎勵成為我的常態，雅虎答案，然後是youtube，然後是chrome的多個標籤......現在我甚至不能看超過2分鐘的視頻，我不能閱讀超過2句話的評論，我實際上討厭用完整的句子說話，而只是覺得傾向於使用縮寫：lol，wdu? sus, ngl, g, cap, gl... 我發現自己整天都在為reddit想一些有趣的評論（其實很可悲），毫無理由地沉迷於更新新聞網站......我隨時都有80多個標籤打開，（都是待辦事項的閱讀）<p>我為白天的工作努力編碼。<p>顯然，社交媒體是一個很大的罪魁禍首，我的問題是，除了這些之外，我還有什麼不對嗎？我仍然可以專注於我天生感興趣的事情（我迷上了視頻編輯，並在痴迷地從所有資源中學習後自學了after effects）<p>我發現在筆記本上書寫實物對我有點幫助，還有在長達4個多小時的長途駕駛中閱讀一本書（有一次我知道我要去，所以找到一本我可以閱讀的書，不想使用移動數據，最後讀了一半的書，回到家又讀了剩下的。對我來說，讀完整本書是一個巨大的成就。<p>在睡眠好的日子裡，我的情況會好一些<p>現在我想起來了，我總是有這樣的一面，獎勵不能激勵我，懲罰也不重要。好成績、更多的錢、名譽......會帶來一些暫時的激勵，唯一能激勵我的是如果它在智力上有趣，如果不是，我知道我應該做，但就是不能讓我內心接受妥協。\n"
}