{
  "@type": "NewsArticle",
  "identifier": "2022--08--16--en--askhn--HackerNews--NewsArticle--32480927",
  "url": "https://news.ycombinator.com/item?id=32480927",
  "headline": "Ask HN: Finding relevant jobs / remote jobs",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi everyone,<p>Long time lurker first time poster from India. I've been a software engineer for about a decade with experience across the .NET stack, JS, Angular, React, SQL / NoSQL databases, the works!<p>I recently got three professional level Azure Certs too. I've been unemployed for a while now due to personal circumstances and have been trying to get into the job market recently and I've run into problems I do not know how to handle.<p>1) The Pay structure is based on either what you've already been paid at your previous employer (which is mostly underpaid) or tied to years of Experience(Glass ceiling on how much you make)<p>2) The places where you do get slightly paid more have leetcode style interviews and too many applications and always nodejs / react typical web dev jobs.<p>3) I do not wanna relocate from my suburban neighborhood to a metropolitan city at all. The pollution, commute, congestion etc., have taken a toll on me.<p>4) The remote jobs here are turning into Hybrid and it is hard to find truly remote jobs anymore.<p>5) I'd like to find a truly international remote job but most listings say Remote(US only / Europe Only) or something similar.<p>6) I am not an expert in any one single tech i.e I'm the guy that gets the job done and have to wear many hats based on what the situation calls for.<p>How do I go about finding these internationally remote jobs? How do I prepare for these interviews? Where do I even start? I'm so confused and lost and my savings are running out. I'm sorry if this is the wrong place to post.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "timmyboop",
    "url": "https://news.ycombinator.com/user?id=timmyboop"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32480927",
  "sameAs": "https://news.ycombinator.com/item?id=32480927",
  "dateCreated": "2022-08-16T09:55:58.746Z",
  "datePublished": "2022-08-16T09:53:49.000Z",
  "dateModified": "2022-08-16T09:55:58.746Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 寻找相关工作/远程工作\n",
  "headline_zh-Hant": "Ask HN: 尋找相關工作/遠程工作\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "大家好，<p>长期潜伏的人第一次发帖，来自印度。我是一名软件工程师，在.NET堆栈、JS、Angular、React、SQL/NoSQL数据库等方面都有经验！<p>我最近也拿到了三个专业级Azure证书。由于个人情况，我已经失业了一段时间，最近一直在尝试进入就业市场，我遇到了不知道如何处理的问题。 <p>1）薪酬结构要么是基于你在前雇主那里已经得到的报酬（大部分是低报酬），要么是与经验年限挂钩（你赚多少钱的玻璃天花板）。<p>2）你确实能得到稍多报酬的地方有leetcode风格的面试和太多的申请，而且总是nodejs / react典型的web开发工作。<p>3）我根本不想从我的郊区搬迁到大都市。污染、通勤、拥堵等等。<p>4）这里的远程工作正在变成Hybrid，很难再找到真正的远程工作。<p>5）我想找到一份真正的国际远程工作，但大多数列表上都写着远程（仅限美国/欧洲）或类似的内容。<p>6）我不是任何一项技术的专家，即我是完成工作的人，必须根据情况的需要戴上许多帽子。我如何为这些面试做准备？我甚至该从哪里开始？我很困惑，很迷茫，我的积蓄也快用完了。如果这是个错误的地方，我很抱歉。\n",
  "description_zh-Hant": "大家好，<p>長期潛伏的人第一次發帖，來自印度。我是一名軟件工程師，在.NET堆棧、JS、Angular、React、SQL/NoSQL數據庫等方面都有經驗！<p>我最近也拿到了三個專業級Azure證書。由於個人情況，我已經失業了一段時間，最近一直在嘗試進入就業市場，我遇到了不知道如何處理的問題。 <p>1）薪酬結構要麼是基於你在前僱主那裡已經得到的報酬（大部分是低報酬），要麼是與經驗年限掛鉤（你賺多少錢的玻璃天花板）。<p>2）你確實能得到稍多報酬的地方有leetcode風格的面試和太多的申請，而且總是nodejs / react典型的web開發工作。<p>3）我根本不想從我的郊區搬遷到大都市。汙染、通勤、擁堵等等。<p>4）這裡的遠程工作正在變成Hybrid，很難再找到真正的遠程工作。<p>5）我想找到一份真正的國際遠程工作，但大多數列表上都寫著遠程（僅限美國/歐洲）或類似的內容。<p>6）我不是任何一項技術的專家，即我是完成工作的人，必須根據情況的需要戴上許多帽子。我如何為這些面試做準備？我甚至該從哪裡開始？我很困惑，很迷茫，我的積蓄也快用完了。如果這是個錯誤的地方，我很抱歉。\n"
}