{
  "@type": "NewsArticle",
  "identifier": "2022--08--22--en--askhn--HackerNews--NewsArticle--32548835",
  "url": "https://news.ycombinator.com/item?id=32548835",
  "headline": "Ask HN: Is AI goal to make most people dumb/the same?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Over the last decade I’ve noticed that people are preferring to learn from videos and podcasts instead of reading books or actually doing the foundational work. It’s becoming even more apparent each year that we get interns. Many have weak foundational knowledge and these are folks from top 20 colleges. They also don’t want to get advice from anyone, preferring to google their way through everything taking the first solution the results give without taking the effort to understand the why or how. Even people my age or older seem to be getting slower and repeat the same talking points or bike shedding topics that were trending.<p>Just ten years ago the people I would meet would have so many different things they’re into even if they’re in the same broader work or hobby group. Like we could all be into roasting coffee, and then we all have our unique individual interests.<p>Now people just discuss the stuff that’s trending on social media or other tools that aggregate data. They disregard the advice or inputs of people around them, preferring to get an answer from the collective recommendations. It seems to make people act and behave kind of the same, and honestly it’s kind of scary.",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "moomoo11",
    "url": "https://news.ycombinator.com/user?id=moomoo11"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32548835",
  "sameAs": "https://news.ycombinator.com/item?id=32548835",
  "dateCreated": "2022-08-22T09:00:32.519Z",
  "datePublished": "2022-08-22T08:36:53.000Z",
  "dateModified": "2022-08-22T09:00:32.519Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 人工智能的目标是使大多数人变得愚蠢/相同吗？\n",
  "headline_zh-Hant": "Ask HN: 人工智能的目標是使大多數人變得愚蠢/相同嗎？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "在过去十年中，我注意到人们更喜欢从视频和播客中学习，而不是阅读书籍或实际做基础工作。我们每年得到的实习生都变得更加明显。许多人的基础知识薄弱，而这些人来自前20名的大学。他们也不愿意听取任何人的建议，宁愿用谷歌来解决所有的问题，也不愿意花精力去了解为什么或如何解决。<p>十年前，我遇到的人有很多不同的东西，即使他们在同一个更广泛的工作或爱好小组中。<p>现在，人们只是在讨论社交媒体或其他聚合数据的工具上流行的东西。他们无视周围人的建议或投入，宁愿从集体建议中获得答案。这似乎使人们的行为和举止有点相同，说实话，这有点可怕。\n",
  "description_zh-Hant": "在過去十年中，我注意到人們更喜歡從視頻和播客中學習，而不是閱讀書籍或實際做基礎工作。我們每年得到的實習生都變得更加明顯。許多人的基礎知識薄弱，而這些人來自前20名的大學。他們也不願意聽取任何人的建議，寧願用谷歌來解決所有的問題，也不願意花精力去了解為什麼或如何解決。<p>十年前，我遇到的人有很多不同的東西，即使他們在同一個更廣泛的工作或愛好小組中。<p>現在，人們只是在討論社交媒體或其他聚合數據的工具上流行的東西。他們無視周圍人的建議或投入，寧願從集體建議中獲得答案。這似乎使人們的行為和舉止有點相同，說實話，這有點可怕。\n"
}