{
  "@type": "NewsArticle",
  "identifier": "2022--08--14--en--askhn--HackerNews--NewsArticle--32458754",
  "url": "https://news.ycombinator.com/item?id=32458754",
  "headline": "Ask HN: Why is Valve/Steam OK with smurfs & cheaters in DOTA2?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Hi<p>Sort of an angry post...<p>Occasionally I still play a game of DOTA2. I usually play like 1-2 games per week solo and occasionally I will play a game where someone will invite me in a group.\nThe latter is especially problematic as the chances that another team will have a high MMR smurf or a cheater-scripter (with previous VAC ban) are quite high.<p>For those that are not familiar with the terms:\n1. MMR - match making rank- points based of which teams are set up. It shouldn't guarantee an equal match and if you win you get rewarded some<p>2. smurf - a payer account of lower level which is being used by a high level player, often in order to win and &quot;boost&quot; other people in the team<p>3. cheater-scripter - players using scripts to automate certain actions in the game on heroes where quick combos<p>4. VAC - valve anticheat system - currently it functions in a way where a user can report another user and that segment of the game will get judged by other players.<p>So obviously the thing to do have a good banning system, but unfortunately that is not working. Anyone who has played a MOBA or any other game where you are penalized if you leave and active match, will know how annoying this is. \nIt is especially annoying when it is obvious very early on that another team has a smurf. Recognizing smurf is very easy as smurfsusually play the &quot;mid&quot; position which in dota/lol/moba is usually the most impactful, with a hero that can disproportionately influence the game if played well.<p>So recognizing that it will never work perfectly, I would like the following filter options when matchmaking:\n1) Filter out players who do not own more that 2 games &amp; whose account is lower than lvl 3 (steam based metric)\n2) Filter out players who have had a VAC (anticheat system) in the past 2 years from DOTA or any other game\n3) Filter out players who have had a unusual (&quot;p&lt;0.05&quot;) increase in winning\n4) Filter out with people who keep playing in parties with people who fit criteria 3)<p>Some of my other, not well thought out ideas:\n1) Proof of stake of some kind (player and &quot;validator&quot; of report) - or just implementation of high enough stake, money in terms of MMR, ban time of MMR in order to discourage cheating \n2) Steam/Dota reputation designation - based on years of account, time played, reports for misconduct, reports for behavior, people would get badges allowing them to judge directly if someone is cheating or not, or being a smurf\n3) Something else...<p>My only conclusion why Valve/Steam isn't doing anything is that the revenue that smurfs and cheaters bring is high enough to justify not doing anything. If that is true, then would there be an interest for an alternative payed(!) matchmaking system with stricter rules (?).<p>Last question: Why do you think cheating is on the rise? Is it because of the streaming?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Kosirich",
    "url": "https://news.ycombinator.com/user?id=Kosirich"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32458754",
  "sameAs": "https://news.ycombinator.com/item?id=32458754",
  "dateCreated": "2022-08-14T12:43:49.404Z",
  "datePublished": "2022-08-14T12:37:32.000Z",
  "dateModified": "2022-08-14T12:43:49.404Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 为什么Valve/Steam对DOTA2中的蓝精灵和作弊者没有意见？\n",
  "headline_zh-Hant": "Ask HN: 為什麼Valve/Steam對DOTA2中的藍精靈和作弊者沒有意見？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "嗨<p>有点愤怒的帖子......<p>偶尔我还是会玩一局DOTA2。我通常每周会玩1-2场单人游戏，偶尔也会玩有人邀请我组队的游戏。\n后者特别有问题，因为另一个团队有一个高MMR的精灵或一个作弊者--脚本家（以前有VAC禁令）的机会相当高。<p>对于那些不熟悉术语的人来说。\n1. MMR--比赛等级--基于哪支球队设置的点数。它不应该保证平等的比赛，如果你赢了，你会得到一些奖励<p>2.smurf - 一个较低级别的付费账户，被高水平的玩家使用，通常是为了赢得和&quot;提升&quot;团队中的其他人<p>3.cheater-scripter - 玩家使用脚本来自动在游戏中的英雄的某些动作，快速连击<p>4。VAC--阀门防卫系统--目前它的功能是，一个用户可以报告另一个用户，该段游戏将得到其他玩家的评判。<p>因此，显然要做的事情是有一个好的禁制系统，但不幸的是，这并没有发挥作用。任何玩过MOBA或其他游戏的人都会知道，如果你离开了正在进行的比赛，你会受到惩罚，这是多么令人讨厌的事情。\n尤其是当另一队有蓝精灵的时候，很明显，这就更令人讨厌了。识别蓝精灵是非常容易的，因为蓝精灵通常是在dota/lol/moba中的&quot;mid&quot;位置，这通常是最有影响力的，如果发挥得好，一个英雄可以不成比例地影响比赛。<p>因此，认识到它永远不会完美，我希望在匹配时能有以下过滤选项。\n1）过滤掉那些不拥有2个以上游戏&amp的玩家；其账户低于lvl 3的玩家（基于steam的衡量标准）\n2）过滤掉过去两年在DOTA或任何其他游戏中有过VAC（防卫系统）的玩家。\n3) 筛选出那些在获胜方面有不寻常的（&quot;p&lt;0.05&quot;）增长的玩家。\n4）过滤掉那些一直和符合标准的人一起玩的人，3）<p>我的一些其他的，没有经过深思熟虑的想法。\n1) 某种形式的赌注证明（玩家和报告的验证者）--或者只是实施足够高的赌注，以MMR为单位的钱，以MMR为单位的禁赛时间，以阻止作弊行为。\n2）Steam/Dota声誉称号--基于账户年限、游戏时间、不当行为报告、行为报告，人们将获得徽章，允许他们直接判断某人是否作弊，或是否是一个精灵。\n3) 其他......<p>我唯一的结论是，为什么Valve/Steam不做任何事情，因为蓝精灵和作弊者带来的收入高到足以证明不做任何事情。如果这是真的，那么是否有兴趣建立一个具有更严格规则的替代性付费（！）匹配系统（？你认为为什么作弊现象在增加？是不是因为流媒体的存在？\n",
  "description_zh-Hant": "嗨<p>有點憤怒的帖子......<p>偶爾我還是會玩一局DOTA2。我通常每週會玩1-2場單人遊戲，偶爾也會玩有人邀請我組隊的遊戲。\n後者特別有問題，因為另一個團隊有一個高MMR的精靈或一個作弊者--腳本家（以前有VAC禁令）的機會相當高。<p>對於那些不熟悉術語的人來說。\n1. MMR--比賽等級--基於哪支球隊設置的點數。它不應該保證平等的比賽，如果你贏了，你會得到一些獎勵<p>2.smurf - 一個較低級別的付費賬戶，被高水平的玩家使用，通常是為了贏得和&quot;提升&quot;團隊中的其他人<p>3.cheater-scripter - 玩家使用腳本來自動在遊戲中的英雄的某些動作，快速連擊<p>4。VAC--閥門防衛系統--目前它的功能是，一個用戶可以報告另一個用戶，該段遊戲將得到其他玩家的評判。<p>因此，顯然要做的事情是有一個好的禁制系統，但不幸的是，這並沒有發揮作用。任何玩過MOBA或其他遊戲的人都會知道，如果你離開了正在進行的比賽，你會受到懲罰，這是多麼令人討厭的事情。\n尤其是當另一隊有藍精靈的時候，很明顯，這就更令人討厭了。識別藍精靈是非常容易的，因為藍精靈通常是在dota/lol/moba中的&quot;mid&quot;位置，這通常是最有影響力的，如果發揮得好，一個英雄可以不成比例地影響比賽。<p>因此，認識到它永遠不會完美，我希望在匹配時能有以下過濾選項。\n1）過濾掉那些不擁有2個以上游戲&amp的玩家；其賬戶低於lvl 3的玩家（基於steam的衡量標準）\n2）過濾掉過去兩年在DOTA或任何其他遊戲中有過VAC（防衛系統）的玩家。\n3) 篩選出那些在獲勝方面有不尋常的（&quot;p&lt;0.05&quot;）增長的玩家。\n4）過濾掉那些一直和符合標準的人一起玩的人，3）<p>我的一些其他的，沒有經過深思熟慮的想法。\n1) 某種形式的賭注證明（玩家和報告的驗證者）--或者只是實施足夠高的賭注，以MMR為單位的錢，以MMR為單位的禁賽時間，以阻止作弊行為。\n2）Steam/Dota聲譽稱號--基於賬戶年限、遊戲時間、不當行為報告、行為報告，人們將獲得徽章，允許他們直接判斷某人是否作弊，或是否是一個精靈。\n3) 其他......<p>我唯一的結論是，為什麼Valve/Steam不做任何事情，因為藍精靈和作弊者帶來的收入高到足以證明不做任何事情。如果這是真的，那麼是否有興趣建立一個具有更嚴格規則的替代性付費（！）匹配系統（？你認為為什麼作弊現象在增加？是不是因為流媒體的存在？\n"
}