{
  "@type": "NewsArticle",
  "identifier": "2022--08--11--en--askhn--HackerNews--NewsArticle--32427761",
  "url": "https://news.ycombinator.com/item?id=32427761",
  "headline": "Ask HN: When did corporate America become so flaky?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "HI HN!<p>TL:DR - When did poor communication etiquette become normalized in American corporate culture?<p>I re-entered the job market several months ago after not needing to touch my resume since 2008 (see last submission) and my experience has been nothing short of brutally sobering.  My age (40s) and experience (20+ years in IT) was definitely helpful in keeping me resilient through the process, and I'm extremely fortunate to have landed a senior IT leadership role that I love.<p>BUT I have come away from this entire ordeal a touch jaded and syndical towards much corporate America and how people are treated within the job search process (almost all other job seekers I spoke to had very similar experiences) . These are several key takeaways from my job hunt that I wanted to get some feedback/input from the HN community on potentially why this is happening and why it seems to be so prevalent across so many companies today:<p>1. Of the 13 staff-level (not recruiters) virtual interviews I had where no job offer was given, 9 of them that moved onto second interviews, 4 to third, I only received follow-up &quot;dear john&quot; communication from 2 of them.  Ironically these were both from first-round interview companies.  Is it normal practice to ghost applicants at the staff-level interview process?  In brutal self reflection I even recorded several of the interviews and shared them with friends in senior leadership positions to ask for coaching advice and the feedback was overwhelmingly positive.<p>2. Communications, especially logistical planning for interviews, was at times borderline comical.  This is not hyperbole when I say that more often than not I would need to write follow-up emails after an email communication would go unresponded to for over a week, sometimes longer, sometimes not at all.<p>3. I have, as of today, well over 30 ATL optimized applications still sitting in &quot;applications purgatory&quot; with many large fortune 500 companies.  Most of these applications are from 3-4 months ago.  The fact that these companies have no automated purge/rejection process seems bizarre to me.<p>Help me out HN.  How does your company handle communication etiquette?  Am I out of touch to be expecting email replies to relevant, time sensitive information within days, not weeks?  Why is ghosting tolerated, or is it normal now and I'm just expecting too much from this new generation?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "geeky4qwerty",
    "url": "https://news.ycombinator.com/user?id=geeky4qwerty"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32427761",
  "sameAs": "https://news.ycombinator.com/item?id=32427761",
  "dateCreated": "2022-08-11T16:35:27.491Z",
  "datePublished": "2022-08-11T16:03:11.000Z",
  "dateModified": "2022-08-11T16:35:27.491Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 4
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 3
    }
  ],
  "headline_zh-Hans": "Ask HN: 美国企业何时变得如此轻率？\n",
  "headline_zh-Hant": "Ask HN: 美國企業何時變得如此輕率？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "HI HN！<p>直译：DR--在美国的企业文化中，不良的沟通礼仪何时变得正常了？<p>我在几个月前重新进入了就业市场，因为我从2008年起就不需要再碰我的简历了（见最后一次提交），我的经历不禁让人清醒。 我的年龄（40多岁）和经验（在IT行业工作了20多年）绝对有助于我在这个过程中保持弹性，而且我非常幸运地找到了一个我喜欢的高级IT领导职位。<p>但是，我从这整个磨难中走出来，对美国的许多企业和人们在求职过程中的待遇感到厌烦和同情（几乎所有与我交谈的其他求职者都有非常相似的经历）。这是我找工作的几个主要收获，我想从HN社区得到一些反馈/意见，为什么会发生这种情况，为什么今天在这么多公司中似乎是如此普遍：<p>1. 在我进行的13个没有给出工作机会的员工级（非招聘人员）虚拟面试中，有9个进入了第二次面试，4个进入了第三次面试，我只收到了其中2个的后续&quot;亲爱的约翰&quot;通信。 具有讽刺意味的是，这两个公司都是第一轮面试的公司。 在员工层面的面试过程中，对申请者进行幽灵式管理是正常的做法吗？ 在残酷的自我反思中，我甚至录下了几场面试，并与担任高级领导职务的朋友分享，以征求辅导建议，反馈是压倒性的积极。 <p>2.沟通，尤其是面试的后勤计划，有时是近乎滑稽的。 这并不是夸张，我说我经常需要写后续的电子邮件，因为一个电子邮件的沟通会超过一个星期没有回复，有时更长，有时根本没有回复。 <p>3.截至今天，我有超过30个ATL优化的应用程序仍然在许多大型财富500强公司的应用程序炼狱中。 这些应用中的大多数是3-4个月前的。 这些公司没有自动清除/拒绝程序的事实在我看来是很奇怪的。 你的公司是如何处理沟通礼节的？ 我是在几天内，而不是几周内，期待着对相关的、时间敏感的信息进行电子邮件回复吗？ 为什么可以容忍鬼魂，还是现在很正常，我只是对这一代新人期望太高？\n",
  "description_zh-Hant": "HI HN！<p>直譯：DR--在美國的企業文化中，不良的溝通禮儀何時變得正常了？<p>我在幾個月前重新進入了就業市場，因為我從2008年起就不需要再碰我的簡歷了（見最後一次提交），我的經歷不禁讓人清醒。 我的年齡（40多歲）和經驗（在IT行業工作了20多年）絕對有助於我在這個過程中保持彈性，而且我非常幸運地找到了一個我喜歡的高級IT領導職位。<p>但是，我從這整個磨難中走出來，對美國的許多企業和人們在求職過程中的待遇感到厭煩和同情（幾乎所有與我交談的其他求職者都有非常相似的經歷）。這是我找工作的幾個主要收穫，我想從HN社區得到一些反饋/意見，為什麼會發生這種情況，為什麼今天在這麼多公司中似乎是如此普遍：<p>1. 在我進行的13個沒有給出工作機會的員工級（非招聘人員）虛擬面試中，有9個進入了第二次面試，4個進入了第三次面試，我只收到了其中2個的後續&quot;親愛的約翰&quot;通信。 具有諷刺意味的是，這兩個公司都是第一輪面試的公司。 在員工層面的面試過程中，對申請者進行幽靈式管理是正常的做法嗎？ 在殘酷的自我反思中，我甚至錄下了幾場面試，並與擔任高級領導職務的朋友分享，以徵求輔導建議，反饋是壓倒性的積極。 <p>2.溝通，尤其是面試的後勤計劃，有時是近乎滑稽的。 這並不是誇張，我說我經常需要寫後續的電子郵件，因為一個電子郵件的溝通會超過一個星期沒有回覆，有時更長，有時根本沒有回覆。 <p>3.截至今天，我有超過30個ATL優化的應用程序仍然在許多大型財富500強公司的應用程序煉獄中。 這些應用中的大多數是3-4個月前的。 這些公司沒有自動清除/拒絕程序的事實在我看來是很奇怪的。 你的公司是如何處理溝通禮節的？ 我是在幾天內，而不是幾周內，期待著對相關的、時間敏感的信息進行電子郵件回覆嗎？ 為什麼可以容忍鬼魂，還是現在很正常，我只是對這一代新人期望太高？\n"
}