{
  "@type": "NewsArticle",
  "identifier": "2022--08--15--en--askhn--HackerNews--NewsArticle--32465372",
  "url": "https://news.ycombinator.com/item?id=32465372",
  "headline": "Ask HN: How to find a small town to relocate for remote work?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Curious to hear the community’s perspective on where our next move should be.<p>I’m an engineering manager at a fully remote US company with long-term plans to stay (and even if not, no desire to return to the office regularly). I don’t drive but like to walk to the supermarket and restaurants. My wife doesn’t like living in a big city, so we’re in the burbs within walking distance of a little “downtown” area.<p>It’s a bit of an unhappy medium because the homes we want still cost $1M, yet it’s a long and limited walk. Plus we’re ready for something new. We’d likely both be happier in a town, living just off some Main Street with 20 or so shops. The city is great but honestly I don’t need more than a good diner, a supermarket, and a friendly bar. Nice to haves are a pleasant climate (not too cold), an airport within an hour or so, and decent public schools.<p>I’m asking here because I hear so much about NYC/SF tech workers being set loose by remote work and leaving. I’ve experienced this with colleagues relocating to SC, Lancaster PA, small towns in Maryland… etc.<p>Any ideas on whether this mid-sized town dream exists, ideas for cities, and/or how we’d go about finding it?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "Townley",
    "url": "https://news.ycombinator.com/user?id=Townley"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32465372",
  "sameAs": "https://news.ycombinator.com/item?id=32465372",
  "dateCreated": "2022-08-15T04:09:26.526Z",
  "datePublished": "2022-08-15T02:57:34.000Z",
  "dateModified": "2022-08-15T04:09:26.526Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 38
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 53
    }
  ],
  "headline_zh-Hans": "Ask HN: 如何找到一个小城镇来迁移远程工作？\n",
  "headline_zh-Hant": "Ask HN: 如何找到一個小城鎮來遷移遠程工作？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我很想听听社区对我们下一步行动的看法。<p>我是一家完全偏远的美国公司的工程经理，有长期留下来的计划（即使没有，也不想经常回办公室）。我不开车，但喜欢步行去超市和餐馆。我的妻子不喜欢住在大城市，所以我们在郊区的一个小 \"市中心 \"的步行距离内。<p>这是一个有点不快乐的媒介，因为我们想要的房子仍然要100万美元，但这是一个漫长而有限的步行。另外，我们已经准备好了新的东西。我们可能会在一个小镇上住得更开心，就住在有20多个商店的主街上。城市是伟大的，但说实话，我不需要更多的东西，只需要一个好的餐厅，一个超市，和一个友好的酒吧。最好的条件是气候宜人（不要太冷），一个小时左右的机场，以及体面的公立学校。<p>我在这里问，因为我听到了很多关于纽约市/旧金山的科技工作者因远程工作而离开。我有过这样的经历，我的同事搬到了南卡罗来纳州、宾夕法尼亚州的兰开斯特、马里兰州的小镇......等等。<p>对于这种中型城市的梦想是否存在，对于城市的想法，以及/或者我们如何去寻找它，有什么想法吗？\n",
  "description_zh-Hant": "我很想聽聽社區對我們下一步行動的看法。<p>我是一家完全偏遠的美國公司的工程經理，有長期留下來的計劃（即使沒有，也不想經常回辦公室）。我不開車，但喜歡步行去超市和餐館。我的妻子不喜歡住在大城市，所以我們在郊區的一個小 \"市中心 \"的步行距離內。<p>這是一個有點不快樂的媒介，因為我們想要的房子仍然要100萬美元，但這是一個漫長而有限的步行。另外，我們已經準備好了新的東西。我們可能會在一個小鎮上住得更開心，就住在有20多個商店的主街上。城市是偉大的，但說實話，我不需要更多的東西，只需要一個好的餐廳，一個超市，和一個友好的酒吧。最好的條件是氣候宜人（不要太冷），一個小時左右的機場，以及體面的公立學校。<p>我在這裡問，因為我聽到了很多關於紐約市/舊金山的科技工作者因遠程工作而離開。我有過這樣的經歷，我的同事搬到了南卡羅來納州、賓夕法尼亞州的蘭開斯特、馬里蘭州的小鎮......等等。<p>對於這種中型城市的夢想是否存在，對於城市的想法，以及/或者我們如何去尋找它，有什麼想法嗎？\n"
}