{
  "@type": "NewsArticle",
  "identifier": "2022--08--11--en--askhn--HackerNews--NewsArticle--32430770",
  "url": "https://news.ycombinator.com/item?id=32430770",
  "headline": "Ask HN: Anyone else disillusioned from working in tech",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I got my Bachelor's in Computer Science but noticed  pretty early on that I wasn't enjoying it very much. After finishing I started another BSc in a different field with the intention of going into research, as I saw it as a more fulfilling albeit stressful, low paid alternative to working for &quot;industry&quot;. I was close to starting my masters but likely won't because I just don't have the energy for it. Plus  I live in a big European capital (with a lot of tech jobs) that I love from the bottom of my heart, and I would like to stay here. But all the computer science jobs just seem so dull and pointless. It seems like you either work for a startup that will eventually be bought by a competitor and all the work that went into it is moot, for a big bank or corporate, or some small company building CRUD apps for other faceless corporations.<p>What am I missing? I get work is supposed to be work, but aren't there more options I missed so far? I enjoy web scraping a lot and have used it to solve a bunch of real world problems my (ex) girlfriend or I had. I could conceivably work as a freelancer but I really want to work on something as part of a team. I recently came across the &quot;developer relations&quot; role, i.e. representing the company at conferences and online, recording demos, writing technical blog posts etc.. it seems perfect for me, but I would assume they are looking for people who have a few years of experience already so they know what they're talking about?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "mahathu",
    "url": "https://news.ycombinator.com/user?id=mahathu"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32430770",
  "sameAs": "https://news.ycombinator.com/item?id=32430770",
  "dateCreated": "2022-08-11T19:43:49.358Z",
  "datePublished": "2022-08-11T19:41:19.000Z",
  "dateModified": "2022-08-11T19:43:49.358Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 1
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ],
  "headline_zh-Hans": "Ask HN: 有没有人因为在技术领域工作而幻想破灭？\n",
  "headline_zh-Hant": "Ask HN: 有沒有人因為在技術領域工作而幻想破滅？\n",
  "@context": [
    "https://schema.org",
    {
      "@vocab": "http://schema.org/",
      "@language": "en",
      "headline_zh-Hans": {
        "@id": "headline",
        "@language": "zh-Hans"
      },
      "headline_zh-Hant": {
        "@id": "headline",
        "@language": "zh-Hant"
      },
      "@version": 1.1,
      "description_zh-Hans": {
        "@id": "description",
        "@language": "zh-Hans"
      },
      "description_zh-Hant": {
        "@id": "description",
        "@language": "zh-Hant"
      }
    }
  ],
  "description_zh-Hans": "我获得了计算机科学的学士学位，但我很早就注意到我并不太喜欢这个专业。完成学业后，我又开始了另一个不同领域的学士学位，打算进入研究领域，因为我认为这是一个更充实的选择，尽管压力很大，但比起为工业界工作的低工资。我差点就开始读硕士了，但很可能不会，因为我没有精力去做。另外，我住在一个欧洲大都市（有很多科技工作），我从心底里喜欢这里，我想留在这里。但所有的计算机科学工作似乎都很枯燥，毫无意义。看起来你要么在一家最终会被竞争对手收购的初创公司工作，而所有的工作都是没有意义的，要么在一家大银行或企业工作，要么在一些为其他不知名的企业建立CRUD应用程序的小公司工作。我知道工作就应该是工作，但到目前为止，我难道没有错过更多的选择吗？我非常喜欢网络刮削，并且用它来解决我和我的（前）女友的一堆现实问题。可以想象，我可以作为一个自由职业者工作，但我真的想作为团队的一部分来工作。我最近看到了&quot;开发者关系&quot;的角色，即在会议和网上代表公司，记录演示，撰写技术博客文章等。这似乎非常适合我，但我认为他们正在寻找已经有几年经验的人，所以他们知道他们在说什么？\n",
  "description_zh-Hant": "我獲得了計算機科學的學士學位，但我很早就注意到我並不太喜歡這個專業。完成學業後，我又開始了另一個不同領域的學士學位，打算進入研究領域，因為我認為這是一個更充實的選擇，儘管壓力很大，但比起為工業界工作的低工資。我差點就開始讀碩士了，但很可能不會，因為我沒有精力去做。另外，我住在一個歐洲大都市（有很多科技工作），我從心底裡喜歡這裡，我想留在這裡。但所有的計算機科學工作似乎都很枯燥，毫無意義。看起來你要麼在一家最終會被競爭對手收購的初創公司工作，而所有的工作都是沒有意義的，要麼在一家大銀行或企業工作，要麼在一些為其他不知名的企業建立CRUD應用程序的小公司工作。我知道工作就應該是工作，但到目前為止，我難道沒有錯過更多的選擇嗎？我非常喜歡網絡刮削，並且用它來解決我和我的（前）女友的一堆現實問題。可以想象，我可以作為一個自由職業者工作，但我真的想作為團隊的一部分來工作。我最近看到了&quot;開發者關係&quot;的角色，即在會議和網上代表公司，記錄演示，撰寫技術博客文章等。這似乎非常適合我，但我認為他們正在尋找已經有幾年經驗的人，所以他們知道他們在說什麼？\n"
}