{
  "@type": "NewsArticle",
  "identifier": "2022--08--26--en--myfeed--HackerNews--NewsArticle--32611882",
  "url": "https://news.ycombinator.com/item?id=32611882",
  "headline": "What can I do if I don't like web development?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "Note: I can't do university because I lack money. Please don't start saying only &quot;don't do web development&quot; or &quot;university make you&quot;. TL:DR; at the end.<p>Schools in Italy are a disaster, they use bad practices -- I am obsessed with best practices -- and languages that I don't like PHP (widely used in Italy), for the language design, crap salary and less jobs. So in my free time I try to learn to be a full stack developer (they -- the school -- learn you to become this) and the most part I hate is the front-end one, nothing wrong with HTML, CSS is easy but hard to master with it; and I lose interest in the back-end part, web frameworks, React, Ember, Vue [...], I know they made the work more easier, it's not for me. What I like? I like developing, working with Software, Deep Learning / ML, AI, Game Dev, Low Level Things, I use Linux, I like do things with Computers, Reverse engineering, break things and understand why, fix it; Cybersecurity, Ethical Hacking, working with servers, network, sysadmin, use enterprise equipment and software (Java is popular on this), embedded, Simulation / modeling (I have difficult in math), really interesting stuff. I'm asking some keyword in what can I start to learn at what I like and have a good life balance with money.<p>TL:DR: I can't do university and I don't like web development, instead I like working with computers, software, low level things.<p>FAQ:<p>So what’s stopping you from doing what you rather be doing? If you’re not in university, then you’re pretty much free to learn whatever is that you want to do.<p>Resource limitations. I have a Computer that has a Intel Celereon J4105, Integrated Graphics with 8GB Ram DDR4, so Major of things I like, I can't do them. As far I know, be a Game Dev sucks since (what I read) is a underpaid job, also gaming lately follow a single business model, and I don't like it. I am planning in a new PC but is suspended cause there is a lack of funds. So doing deep learning, Machine Learning, things that require (I THINK) newer hardware I can't do them.<p>Try Cybersecurity/Ethical hacking, your knowledge of Linux gives you a bit of a head start.\nCybersecurity / Ethical hacking always interested me, I also bought Hacking, 2nd Edition, The Art of Exploitation and do something with that, but I stop thinking, &quot;I am losing time?&quot; or whatever. That's why I started to learn a full stuck developer, but now, I don't like it. Should I continue?",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "cdparanoia",
    "url": "https://news.ycombinator.com/user?id=cdparanoia"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=32611882",
  "sameAs": "https://news.ycombinator.com/item?id=32611882",
  "dateCreated": "2022-08-26T20:47:01.639Z",
  "datePublished": "2022-08-26T19:43:40.000Z",
  "dateModified": "2022-08-26T20:47:01.639Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 0
    }
  ]
}