{
  "@type": "NewsArticle",
  "identifier": "2022--04--29--en--myfeed--HackerNews--NewsArticle--31202033",
  "url": "https://news.ycombinator.com/item?id=31202033",
  "headline": "I deleted YouTube App because of YouTube shots",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "My Background:\nI have been using YouTube since 2008. I am not a content creator, but I still post random videos once in a while. But I can say I am a heavy consumer of YouTube, and it really made a great contribution to my career goals. I am currently a Software Engineer and achieving almost all my goals, all thanks to Google, Stack Overflow, and YouTube. I use YouTube for all kinds of purposes like learning, entertainment, etc.<p>The problem with YouTube:\nIn recent years, the mobile app has been flooded with shorts (Short Videos), and they try all the ways to pull us into the rabbit hole and waste our precious time just to compete with other players. Honestly, I am not strong enough to fight against their algorithm and couldn't stay away from shorts. I think the situation is the same for most YouTube users.<p>Believe your users:\nI believe most of its users are there for quality and not for quantity, like Reels and TikTok. Also, YouTube removed the dislike button, and it made it hard for the consumers to find quality content. So I don't understand why YouTube is finding ways to make it harder to find quality content. Is it in the wrong hands?<p>YouTube has to trust its users and probably create a separate app like for &quot;YouTube Shorts&quot; to pull the users who are into short video stuff. Or at least give users an option to disable shorts in the YouTube app. Until that happens, I am not going to keep the YouTube app on my phone. However, I will still continue to use YouTube on my computer web browser, but consumption will be way lower as I don't carry my laptop with me all the time. I hope YouTube will listen and make the changes soon before someone else comes up with another &quot;Truth Tube&quot;",
  "keywords": [],
  "author": {
    "@type": "Person",
    "name": "saikiran91",
    "url": "https://news.ycombinator.com/user?id=saikiran91"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31202033",
  "sameAs": "https://news.ycombinator.com/item?id=31202033",
  "dateCreated": "2022-04-29T09:11:01.147Z",
  "datePublished": "2022-04-29T06:24:31.000Z",
  "dateModified": "2022-04-29T09:11:01.147Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 2
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 1
    }
  ]
}