{
  "@type": "NewsArticle",
  "identifier": "2022--05--07--en--askhn--HackerNews--NewsArticle--31291267",
  "url": "https://news.ycombinator.com/item?id=31291267",
  "headline": "Time for a Career Change?",
  "publisher": {
    "@type": "Organization",
    "name": "HackerNews",
    "url": "https://news.ycombinator.com",
    "logo": "https://hn.buzzing.cc/avatar.png"
  },
  "description": "I worked for Google for a few years and hated every day of it: lots of proto shuffling and bureaucracy and very few interesting problems to work on. I'm now at a different company, but I'm honestly feeling very burned out here too. I have a lot of meetings due to being in a fairly senior IC role, but I'm an introvert and feel very ineffective.<p>I've also become painfully aware over the years how many aspects of development are tedious and uninteresting. Things like wrangling dev environments, writing tests, debugging issues in prod, hunting through docs, and chasing down teams to figure out how a large system fits together (especially if the system is boring). A lot of engineering work is plumbing together different systems, and having more experience doesn't make this work any easier or faster.<p>I used to really enjoy programming, but that's because I would choose to work on solving problems I found interesting. I've always appreciated elegant systems (ideas like lambda calculus, Unix's files, programs, and pipes, LISP, Haskell, etc.), but most of the systems I work on are the exact opposite: large and boring. I also really dislike corporate culture: trying to maneuver politically, show off in meetings, etc. I'm starting to wonder if being a software engineer is really the right choice for me. Any thoughts?",
  "keywords": [
    "Ask HN"
  ],
  "genre": "Ask HN",
  "author": {
    "@type": "Person",
    "name": "throwaway234691",
    "url": "https://news.ycombinator.com/user?id=throwaway234691"
  },
  "discussionUrl": "https://news.ycombinator.com/item?id=31291267",
  "sameAs": "https://news.ycombinator.com/item?id=31291267",
  "dateCreated": "2022-05-07T22:12:23.164Z",
  "datePublished": "2022-05-07T01:09:43.000Z",
  "dateModified": "2022-05-07T22:12:23.164Z",
  "interactionStatistic": [
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "LikeAction"
      },
      "userInteractionCount": 39
    },
    {
      "@type": "InteractionCounter",
      "interactionType": {
        "@type": "CommentAction"
      },
      "userInteractionCount": 35
    }
  ]
}